{
  "sources": [
    {
      "title": "ACM Queue - All Queue Content",
      "feedUrl": "https://queue.acm.org/rss/feeds/queuecontent.xml",
      "siteUrl": "http://queue.acm.org/Curmudgeon",
      "articles": [
        {
          "id": "3687999",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3687999",
          "publishedOn": "2024-09-11T14:28:32.000Z",
          "wordCount": null,
          "title": "Assessing IT Project Success: Perception vs. Reality",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "3689949",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3689949",
          "publishedOn": "2024-09-10T16:13:51.000Z",
          "wordCount": null,
          "title": "Confidential Computing Proofs",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "3688007",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3688007",
          "publishedOn": "2024-09-09T10:24:54.000Z",
          "wordCount": null,
          "title": "GPTs and Hallucination",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Arjun Sreedharan",
      "feedUrl": "https://arjunsreedharan.org/rss",
      "siteUrl": "https://arjunsreedharan.org/",
      "articles": []
    },
    {
      "title": "공간주의",
      "feedUrl": "https://attention2.space/feed/",
      "siteUrl": "https://attention2.space",
      "articles": []
    },
    {
      "title": "The Clean Code Blog",
      "feedUrl": "https://blog.cleancoder.com/atom.xml",
      "siteUrl": "http://blog.cleancoder.com/atom.xml",
      "articles": []
    },
    {
      "title": "C++ Stories",
      "feedUrl": "https://www.cppstories.com/index.xml",
      "siteUrl": "https://www.cppstories.com/",
      "articles": []
    },
    {
      "title": "Sticky Bits – Powered by Feabhas",
      "feedUrl": "https://blog.feabhas.com/feed/",
      "siteUrl": "https://blog.feabhas.com/",
      "articles": []
    },
    {
      "title": "The LLVM Project Blog",
      "feedUrl": "https://blog.llvm.org/index.xml",
      "siteUrl": "https://blog.llvm.org/",
      "articles": [
        {
          "id": "https://blog.llvm.org/posts/2024-08-29-gsoc-opencl-c-support-for-clangir/",
          "author": null,
          "description": "Hello everyone! I’m 7mile. My GSoC project this summer is Compile GPU kernels using ClangIR. It’s been an exciting journey in compiler development, and I’m thrilled to share the progress and insights gained along the way here.\nBackground\nThe ClangIR project aims to establish a new IR for Clang, built on top of MLIR. As part of the ongoing effort to support heterogeneous programming models, this project focuses on integrating OpenCL C language support into ClangIR. The ultimate goal is to enable the compilation of GPU kernels written in OpenCL C into LLVM IR targeting the SPIR-V architecture, laying the groundwork for future enhancements in SYCL and CUDA support.\nWhat We Did\nOur work involved several key areas:\n\nAddress Space Support: One of the fundamental tasks was teaching ClangIR to han…",
          "link": "https://blog.llvm.org/posts/2024-08-29-gsoc-opencl-c-support-for-clangir/",
          "publishedOn": "2024-09-09T00:00:00.000Z",
          "wordCount": null,
          "title": "GSoC 2024: Compile GPU kernels using ClangIR",
          "imageUrl": null
        },
        {
          "id": "https://blog.llvm.org/posts/2024-08-31-half-precision-in-llvm-libc/",
          "author": null,
          "description": "C23 defines new floating-point types, such as _Float16, which corresponds tothe binary16 format from IEEE Std 754, also known as “half-precision,” or FP16.C23 also defines new variants of the C standard library’s math functionsaccordingly, such as fabsf16 to get the absolute value of a _Float16.\nThe “Half-precision in LLVM libc” Google Summer of Code 2024 project aimed toimplement these new _Float16 math functions in LLVM libc, making it the firstknown C standard library implementation to implement these C23 functions.\nWe split math functions into two categories: basic operations and higher mathfunctions. The current implementation status of math functions in LLVM libc canbe viewed at https://libc.llvm.org/math/index.html#implementation-status.\nThe exact goals of this project were to:\n\nSet…",
          "link": "https://blog.llvm.org/posts/2024-08-31-half-precision-in-llvm-libc/",
          "publishedOn": "2024-08-31T00:00:00.000Z",
          "wordCount": null,
          "title": "GSoC 2024: Half-precision in LLVM libc",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Embedded in Academia",
      "feedUrl": "https://blog.regehr.org/feed",
      "siteUrl": "https://blog.regehr.org",
      "articles": [
        {
          "id": "https://blog.regehr.org/?p=2124",
          "author": "regehr",
          "description": "[This piece is co-authored with Vsevolod Livinskii.] Formal verification isn’t some sort of magic pixie dust that we sprinkle over a computer system to make it better. Real formal verification involves a lot of the same kind of difficult, nasty, grungy engineering work that any other systems-level job involves. Furthermore, the verification tools themselves are […]",
          "link": "https://blog.regehr.org/archives/2124",
          "publishedOn": "2024-09-04T18:29:03.000Z",
          "wordCount": null,
          "title": "Looking for Missed Alarm Bugs in a Formal Verification Tool",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Siemens Blog Network",
      "feedUrl": "https://blogs.sw.siemens.com/feed/",
      "siteUrl": "https://blogs.sw.siemens.com",
      "articles": [
        {
          "id": "https://blogs.sw.siemens.com/?p=636",
          "author": "Bianca Ward",
          "description": "Embracing Digital Innovation for Enhanced Sustainability In a recent interview on “Manufacturing Sustainability: Twenty Minute Talks,” Dr. Wolfgang Schlögl, Vice…",
          "link": "https://blogs.sw.siemens.com/sustainable-manufacturing-insights-from-an-interview-with-dr-wolfgang-schlogl/",
          "publishedOn": "2024-08-29T12:15:24.000Z",
          "wordCount": null,
          "title": "Sustainable Manufacturing: Insights from an Interview with Dr. Wolfgang Schlögl",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Embedded Software Insights | Latest Embedded Technology News",
      "feedUrl": "https://www.bluefruit.co.uk/blog/feed",
      "siteUrl": "https://bluefruit.co.uk/blog/",
      "articles": [
        {
          "id": "https://bluefruit.co.uk/?p=14079",
          "author": "Tristan Jago",
          "description": "The space industry is among the most innovative in the world. Propelled by communications, exploration, and R&D possibilities, it is estimated […]\nThe post 5 ways aerospace product development solves real-time challenges in space appeared first on Bluefruit Software.",
          "link": "https://bluefruit.co.uk/quality/aerospace-product-development-challenges/",
          "publishedOn": "2024-01-04T15:14:19.000Z",
          "wordCount": 2411,
          "title": "5 ways aerospace product development solves real-time challenges in space",
          "imageUrl": "https://bluefruit.co.uk/content/uploads/2024/01/Space-design-thumb.jpg"
        }
      ]
    },
    {
      "title": "Bartosz Ciechanowski",
      "feedUrl": "https://ciechanow.ski/atom.xml",
      "siteUrl": "https://ciechanow.ski/",
      "articles": []
    },
    {
      "title": "Architectures and Processors blog",
      "feedUrl": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog/rss",
      "siteUrl": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog",
      "articles": []
    },
    {
      "title": "CPUU의 Daydreamin&#039;",
      "feedUrl": "https://cpuu.postype.com/rss",
      "siteUrl": "https://www.postype.com/@cpuu",
      "articles": []
    },
    {
      "title": null,
      "feedUrl": "https://danluu.com/atom.xml",
      "siteUrl": "https://danluu.com/atom/index.xml",
      "articles": []
    },
    {
      "title": "Dave Cheney",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "Red Hat Developer",
      "feedUrl": "https://developers.redhat.com/blog/feed",
      "siteUrl": "https://developers.redhat.com/",
      "articles": [
        {
          "id": "e5ea1701-b483-4b22-aa57-6027cb4e9dce",
          "author": "DJ Delorie",
          "description": "Probably the second most important asset to have when using a software library (the first being the library itself, of course) is documentation for how to use that library. In Ye Olde Days, the stature of a computing department would be indicated by how big their \"wall of manuals\" was. \nI was going to insert a photo of such a wall here, but \"picture of thing that existed before the Internet\" is hard to find on the Internet. Here's a photo of a cute kitten instead, because finding those on the internet is easy (Figure 1).\n\n\n\n  \n        \n\n\n\n  \n\nFigure 1: Not a wall of manuals. Kitten photo courtesy of https://pixabay.com/photos/european-shorthair-cat-kitten-young-8107433/ and used in accordance with their license.\n\nUnfortunately, another thing that's easy to find on the Internet is misinform…",
          "link": "https://developers.redhat.com/articles/2024/09/13/state-documentation-gnu-c-library-and-kernel",
          "publishedOn": "2024-09-13T07:00:00.000Z",
          "wordCount": null,
          "title": "The state of documentation for the GNU C library and kernel",
          "imageUrl": null
        },
        {
          "id": "b68b6697-798d-4c21-8f88-dda5406f3bff",
          "author": "Romain Pelisse",
          "description": "The release of Red Hat JBoss Enterprise Application Platform (JBoss EAP) 8 brought an important change on how the server is kept up to date. In essence, in the previous major version of the Java application server, updates were provided as a series of modifications that were applied by a capability embedded into the server itself. \nNow, in JBoss EAP version 8, updates are performed  by a separate dedicated tool: the JBoss Installation Manager. Of course, this has an impact on how to manage the automation around JBoss EAP and especially how to handle upgrading, using Red Hat Ansible Automation Platform, from version 7 to 8.\nA bit of context first\nBefore we begin, let’s define what update, upgrade, and change of version refers to in the context of this article.\nUpdates\nAn update to an existi…",
          "link": "https://developers.redhat.com/articles/2024/09/12/automate-jboss-eap-updates-upgrades",
          "publishedOn": "2024-09-12T07:00:00.000Z",
          "wordCount": null,
          "title": "Automating JBoss EAP: Update and upgrade for versions 7 & 8",
          "imageUrl": null
        },
        {
          "id": "b3920641-ada3-4e31-a233-d8ad52d1c89d",
          "author": "Leonardo Araujo",
          "description": "In this article, we will cover how to install and configure the Postgres Exporter, which is responsible for collecting data and usage statistics for PostgreSQL. This article is intended for sysadmins or database administrators who need to monitor PostgreSQL and identify areas for performance or availability improvement.\nThis example uses the following versions:\n\nRed Hat Ansible Automation Platform v4.5.7\nPostgreSQL Server 13.14-1\nRed Hat Enterprise Linux 9.4\nPrometheus v2.53\nGrafana v11.1.0\nPostgres Exporter v0.15.0\n\n\n\nNote\n\nInstallation of the Ansible Automation Platform and PostgreSQL will not be covered in this article.\n\n\nAbout the example\n\nWe will use two servers: the first server will be the Ansible Automation Platform with an \"all-in-one\" installation, and the second will be our moni…",
          "link": "https://developers.redhat.com/articles/2024/09/12/monitor-ansible-automation-platform-database-using-prometheus-and-grafana",
          "publishedOn": "2024-09-12T07:00:00.000Z",
          "wordCount": null,
          "title": "Monitor an Ansible Automation Platform database using Prometheus and Grafana",
          "imageUrl": null
        },
        {
          "id": "ef898c1a-2fd1-476a-b37e-fd78bc48b063",
          "author": "Greg Pack",
          "description": "The Cloud Native Computing Foundation (CNCF) has announced that Kuadrant has been accepted as a CNCF sandbox project as of June 19, 2024. Kuadrant is an open source project that enables platform engineers and application developers to easily connect, secure, and protect their services and infrastructure across multiple clusters.\nKuadrant's powerful solutions for TLS, DNS, application authentication and authorization, and rate limiting have enabled it to reach this significant milestone, marking its entry into the CNCF ecosystem and setting the stage for its continued growth and development within the cloud-native community. Read on to learn more about the project and what's in store for the future.\nKuadrant: From concept to CNCF\nThe Kuadrant project began in early 2020 as an experiment to …",
          "link": "https://developers.redhat.com/articles/2024/09/11/kuadrant-joins-cncf-sandbox-project",
          "publishedOn": "2024-09-11T07:00:00.000Z",
          "wordCount": null,
          "title": "Kuadrant joins CNCF as a sandbox project",
          "imageUrl": null
        },
        {
          "id": "7d904499-10f8-43a3-a612-5cbe589d56a6",
          "author": "Roger Lopez",
          "description": "Efficient and reliable deployment processes are essential for maintaining a competitive edge and operational excellence. At Red Hat, we've embraced innovative tools to enhance our deployment workflows, particularly for edge computing environments. \nLeveraging the components of our Red Hat Ansible Automation Platform, including Ansible Lightspeed with IBM watsonx Code Assistant and Event-Driven Ansible, we streamlined the deployment of our Cool Stuff Store's new kiosks located in Dublin and Johannesburg. \nWe also explored how this approach integrates seamlessly into the broader Red Hat DevOps platform, showcasing the synergy between various tools and processes.\nExpanding the Cool Stuff Store to the edge\nAs the Cool Stuff Store expands, the need to deploy new kiosks at edge locations like Du…",
          "link": "https://developers.redhat.com/articles/2024/09/11/streamline-edge-deployments-red-hat-ansible-automation-platform",
          "publishedOn": "2024-09-11T07:00:00.000Z",
          "wordCount": null,
          "title": "Streamline edge deployments with Red Hat Ansible Automation Platform",
          "imageUrl": null
        },
        {
          "id": "a7a66d28-1eb1-4c70-b0a1-8c90ee799dc0",
          "author": "Evan Shortiss, Cedric Clyburn",
          "description": "The world of artificial intelligence and machine learning is evolving rapidly, and with it, the tools developers use to create AI-powered applications. We're excited to announce a significant enhancement to Podman AI Lab that will improve developer experience: GPU acceleration. \nGPU acceleration, available in Podman Desktop 1.12 and later, allows developers to harness the power of their local GPU for AI workloads that are deployed in containers, bringing new speed and efficiency to AI development on the desktop.\nTo read about all the other features that were delivered in the Podman 1.12 release, visit the Podman Desktop 1.12 announcement blog post.\nGet started with GPU support for Podman AI Lab\nGPU accelerated inference can provide significant performance improvements when working with lar…",
          "link": "https://developers.redhat.com/articles/2024/09/10/gpu-support-podman-ai-lab",
          "publishedOn": "2024-09-10T07:00:00.000Z",
          "wordCount": null,
          "title": "Introducing GPU support for Podman AI Lab",
          "imageUrl": null
        },
        {
          "id": "b7024a40-056a-4905-a19b-fa11b1bca310",
          "author": "Sanjay Rao, Stefan Hajnoczi",
          "description": "This is the second article in a series about IOThread Virtqueue Mapping, this time looking at performance in bigger workloads. Check out the first article Scaling virtio-blk disk I/O with IOThread Virtqueue Mapping for an overview of IOThread Virtqueue Mapping and how to configure it.\nAbout IOThread Virtqueue Mapping\nDatabases are sensitive to disk I/O performance. The IOThread Virtqueue Mapping feature introduced in the QEMU virtual machine monitor in Red Hat Enterprise Linux (RHEL) 9.4 is designed to improve disk I/O performance for workloads that submit I/O from many vCPUs. In this article, we will look at how the IOThread Virtqueue Mapping feature can boost performance for database workloads running in QEMU/KVM guests.\nWhile RHEL guests have supported multi-queue virtio-blk devices for…",
          "link": "https://developers.redhat.com/articles/2024/09/10/virtualized-database-io-performance-improvements-rhel-94",
          "publishedOn": "2024-09-10T07:00:00.000Z",
          "wordCount": null,
          "title": "Virtualized database I/O performance improvements in RHEL 9.4",
          "imageUrl": null
        },
        {
          "id": "c8dfd9ec-dd2e-4f64-bc4d-b9525c81d763",
          "author": "Florian Weimer",
          "description": "Over the years, the GNU C library (glibc) has collected library of helper functions in its upstream source tree, for writing in-tree glibc tests that run as part of its test suite. Like the test suite itself, this part of glibc is not installed, and is not available for general application development. This means that test development usually has to happen within the glibc source tree, which poses some challenges. However, there is an alternative, the glibc-support repository, which allows out-of-tree development of glibc test cases. Often, this simplifies development of test cases (particularly debugging), allows quicker iteration, and more efficient test case creation. Test cases produced this way can be integrated easily into the upstream test suite.\nWhat is available in the glibc suppo…",
          "link": "https://developers.redhat.com/articles/2024/09/09/glibc-test-development-support-repository",
          "publishedOn": "2024-09-09T07:00:00.000Z",
          "wordCount": null,
          "title": "Accelerate glibc test development with the glibc-support repository",
          "imageUrl": null
        },
        {
          "id": "2c0805f1-dc2c-48ce-a89e-8bd7888eaaea",
          "author": "Javier Cano Cano",
          "description": "Creating virtual machines (VMs) from golden images is a common practice. It minimizes the deployment time for new VMs, and it provides a familiar environment for the VM's owner. The admin gets an automated and consistent way to create golden images that can encapsulate all environment requirements, reducing the manual work and frictions, leading to a more secure environment. This article will show how to utilize the Red Hat OpenShift Virtualization Windows UEFI installer pipeline to prepare a golden image of Windows 11 in an automated, repeatable and deterministic manner.\nThe pipeline downloads the official Windows ISO from Microsoft download website, modifies it to enable an unattended installation, triggers the installation of Windows operating systems, installs the guest agent and the d…",
          "link": "https://developers.redhat.com/articles/2024/09/09/create-windows-golden-image-openshift-virtualization",
          "publishedOn": "2024-09-09T07:00:00.000Z",
          "wordCount": null,
          "title": "Create a Windows golden image for OpenShift Virtualization",
          "imageUrl": null
        },
        {
          "id": "fe32a381-802e-4a34-be19-a0b44dd6f57b",
          "author": "Ian Lawson",
          "description": "This article offers a quick overview of various Red Hat technologies that you can use to provide a composite solution for the inner and outer loops of the DevSecOps cycle. First, I'll introduce the concepts of the inner and outer loop in simple English, and then explain the use of specific products for realization of the platform engineer’s tasks within this cycle.\nFrom DevOps to platform engineering\nSince people started writing software, there has always been a divide between those who create and those who maintain. In the old days (and I’m old, so bear with me), teams were small and the job of maintaining the software in \"production\" was often part of the developer’s role. However, as software solutions truly took off, the scale became too large for the devs, and the sys admins who were …",
          "link": "https://developers.redhat.com/articles/2024/09/05/platform-engineers-role-devsecops-inner-and-outer-loops",
          "publishedOn": "2024-09-05T13:30:00.000Z",
          "wordCount": null,
          "title": "The platform engineer's role in the DevSecOps inner and outer loops",
          "imageUrl": null
        },
        {
          "id": "256ce03a-985e-46d2-8764-912492ff4bf6",
          "author": "Jose Gomez-Selles",
          "description": "This article covers new features in the latest release of both the Red Hat build of OpenTelemetry and Red Hat OpenShift distributed tracing.\nFirst of all, apart from all the features shared below, let’s start by sharing that both releases come with support for certificate rotation. By automatically reloading the new certificates, the process of certificate renewal is made transparent to users in Tempo and OpenTelemetry pods.\nWhat’s new in OpenTelemetry?\nThe Red Hat build of OpenTelemetry 3.3 is based on the open source OpenTelemetry operator release 0.107.0.\nAs usual, there’s a lot going on in the OpenTelemetry space, and this release continues expanding the capabilities of this observability component. Let’s start with something that we believe will help users in their application observa…",
          "link": "https://developers.redhat.com/articles/2024/09/05/red-hat-build-opentelemetry-and-openshift-distributed-tracing-33-new-features",
          "publishedOn": "2024-09-05T07:00:00.000Z",
          "wordCount": null,
          "title": "Red Hat build of OpenTelemetry and OpenShift distributed tracing 3.3: New features for developers",
          "imageUrl": null
        },
        {
          "id": "f6295aab-7da1-4bbe-9848-6234dcb3adef",
          "author": "Stefan Hajnoczi",
          "description": "This article covers the IOThread Virtqueue Mapping feature for Kernel-based virtual machine (KVM) guests that was introduced in Red Hat Enterprise Linux (RHEL) 9.4.\nThe problem\nModern storage evolved to keep pace with growing numbers of CPUs by providing multiple queues through which I/O requests can be submitted. This allows CPUs to submit I/O requests and handle completion interrupts locally. The result is good performance and scalability on machines with many CPUs.\nAlthough virtio-blk devices in KVM guests have multiple queues by default, they do not take advantage of multi-queue on the host. I/O requests from all queues are processed in a single thread on the host for guests with the <driver io=native …> libvirt domain XML setting. This single thread can become a bottleneck for I/O bou…",
          "link": "https://developers.redhat.com/articles/2024/09/05/scaling-virtio-blk-disk-io-iothread-virtqueue-mapping",
          "publishedOn": "2024-09-05T07:00:00.000Z",
          "wordCount": null,
          "title": "Scaling virtio-blk disk I/O with IOThread Virtqueue Mapping",
          "imageUrl": null
        },
        {
          "id": "696e9c50-a7dc-4714-860f-bc81f3c073ba",
          "author": "Diana Sari",
          "description": "Stable Diffusion is an AI model to generate images from text description. It uses a diffusion process to iteratively de-noise random Gaussian noise into coherent images. This is a simple tutorial for creating images using Stable Diffusion model using Red Hat OpenShift AI (RHOAI) (formerly Red Hat OpenShift Data Science), which is our OpenShift platform for AI/ML projects lifecycle management, running on a Red Hat OpenShift Services on AWS (ROSA) cluster, which is our managed service OpenShift platform on AWS, with NVIDIA GPU enabled. \nWhat you'll be doing\nOnce we logged in to the cluster as cluster admin, we will first set up the GPU environment by first creating the machine pools and installing Node Feature Discovery (NFD) operator, which will detect hardware and system configuration of t…",
          "link": "https://developers.redhat.com/articles/2024/09/04/use-stable-diffusion-create-images-red-hat-openshift-ai-rosa-cluster-gpu",
          "publishedOn": "2024-09-04T07:00:00.000Z",
          "wordCount": null,
          "title": "Use Stable Diffusion to create images on Red Hat OpenShift AI on a ROSA cluster with GPU enabled",
          "imageUrl": null
        },
        {
          "id": "de8308a2-6a8d-4ca6-896e-f4daca6746de",
          "author": "Jenifer Abrams",
          "description": "Scale testing is critical for understanding how a cluster will hold up under production load. Generally, you may want to scale test to reach a certain max density as the end goal, but it is often also useful to scale up from smaller batch sizes to observe how performance may change as the overall cluster becomes more loaded. Those of us that work in the area of performance analysis know there are many ways to measure a workload and standardizing on a tool can help provide more comparable results across different configurations and environments. \nThis article will take users through the process of using the Red Hat performance and scale team’s workload tool called kube-burner (which has been accepted as a CNCF sandbox project) to test deployments at scale. While you can learn more about all…",
          "link": "https://developers.redhat.com/articles/2024/09/04/use-kube-burner-measure-red-hat-openshift-vm-and-storage-deployment-scale",
          "publishedOn": "2024-09-04T07:00:00.000Z",
          "wordCount": null,
          "title": "Use kube-burner to measure Red Hat OpenShift VM and storage deployment at scale",
          "imageUrl": null
        },
        {
          "id": "0c947ac2-2974-4757-8c11-0a132f4873d1",
          "author": "David Kwon",
          "description": "The Web Terminal Operator is a useful tool that provides users with a shell environment from the Red Hat OpenShift web console. Within the shell environment, preinstalled tools such as oc and kubectl help you manage your OpenShift resources without leaving the web console. Figure 1 shows an instance of the web terminal.\n\n\n\n  \n        \n\n\n\n        Figure 1. A web terminal instance open in the OpenShift web console\n  \n\nFigure 1: A web terminal instance open in the OpenShift web console.\n\nIn this introductory article, we will go through noteworthy nuances within the web terminal lifecycle, as well as how to further customize your web terminal to your liking using the built-in wtoctl tool.\nThis article is an overview of the web terminal from a user’s perspective. For an article introducing the …",
          "link": "https://developers.redhat.com/articles/2024/09/02/explore-full-capabilities-web-terminal-operator",
          "publishedOn": "2024-09-02T07:00:00.000Z",
          "wordCount": null,
          "title": "Explore the full capabilities of the Web Terminal Operator",
          "imageUrl": null
        },
        {
          "id": "0c947ac2-2974-4757-8c11-0a132f4873d1",
          "author": "David Kwon",
          "description": "The Web Terminal Operator is a useful tool that provides users with a shell environment from the Red Hat OpenShift web console. Within the shell environment, preinstalled tools such as oc and kubectl help you manage your OpenShift resources without leaving the web console. Figure 1 shows an instance of the web terminal.\n\n\n\n  \n        \n\n\n\n        Figure 1. A web terminal instance open in the OpenShift web console\n  \n\nFigure 1: A web terminal instance open in the OpenShift web console.\n\nIn this introductory article, we will go through noteworthy nuances within the web terminal lifecycle, as well as how to further customize your web terminal to your liking using the built-in wtoctl tool.\nThis article is an overview of the web terminal from a user’s perspective. For an article introducing the …",
          "link": "https://developers.redhat.com/articles/2024/09/02/exploring-full-capabilities-web-terminal-operator",
          "publishedOn": "2024-09-02T07:00:00.000Z",
          "wordCount": null,
          "title": "Exploring the full capabilities of the Web Terminal Operator",
          "imageUrl": null
        },
        {
          "id": "9ccfea22-e25a-4852-8efe-4ad895f5ca42",
          "author": "Tarcisio Oliveira",
          "description": "According to the Britannica dictionary, ethics is an area of study that deals with ideas about what is good and bad behavior. It is a branch of philosophy dealing with what is morally right or wrong, which is then applied to various areas of knowledge, such as engineering. Ethics supports pillars such as integrity, responsibility, objectivity, fairness, confidentiality, honesty, and veracity.\nAs intelligent systems exert increasing influence over critical decisions across multiple domains, the need for transparency and fairness is paramount. The application of ethical principles to artificial intelligence (AI) becomes essential, as it protects against discrimination and guarantees the explainability of decisions, thus promoting the construction of a more inclusive, reliable, and socially r…",
          "link": "https://developers.redhat.com/articles/2024/08/30/responsible-and-explainable-ai",
          "publishedOn": "2024-08-30T07:00:00.000Z",
          "wordCount": null,
          "title": "Responsible and Explainable AI",
          "imageUrl": null
        },
        {
          "id": "37090af1-57e2-46a6-baaa-e3a67a66c6b4",
          "author": "Kenny Ge",
          "description": "This is the final installment of our 4-part series on GPU programming. Catch up on the previous articles:\n\nWhat is GPU programming\n\nYour first GPU algorithm: Scan/prefix sum\n\nYour second GPU algorithm: Quicksort\n\nWith those topics covered, we can now move on to the subject of this article: how to choose a GPU framework/library.\nHow to choose a GPU framework\nGenerally, when you’re benchmarking some GPU code, you want to make sure to do the following:\n\nRun the algorithm more than once, and get the median/quartiles, or mean/stdev of each of the running times.\nSynchronize your CUDA kernels, to make sure the program has fully finished executing—by default CUDA will launch kernels asynchronously (in the background) so that the host can continue processing things.\nClear the L2 cache, usually by r…",
          "link": "https://developers.redhat.com/articles/2024/08/29/gpu-benchmarking-and-how-choose-gpu-framework",
          "publishedOn": "2024-08-29T07:00:00.000Z",
          "wordCount": null,
          "title": "GPU benchmarking and how to choose a GPU framework",
          "imageUrl": null
        },
        {
          "id": "5eeffc5a-0755-4fc2-b5cc-d4f8d49e5489",
          "author": "Marcelo Daniel Sales",
          "description": "The idea for writing this article came about after a conversation with colleagues in the architect community reporting the difficulty of implementing a distributed transaction solution. The complaints were basically due to the complexity of implementing all the components necessary to deal with standards such as Saga, for example.\nIt is important to note that it is not the purpose of this article to make a comparison between distributed transaction handling models, especially the Saga pattern. Likewise, this article should not be taken as a criticism of the Saga pattern or the non-recommendation of its adoption. \nMy father was an excellent auto mechanic, and one of the things he taught us was that \"to deal with every screw there is an appropriate tool.\" To paraphrase a more famous saying t…",
          "link": "https://developers.redhat.com/articles/2024/08/29/distributed-transactions-jakarta-ee-10-and-wildfly",
          "publishedOn": "2024-08-29T07:00:00.000Z",
          "wordCount": null,
          "title": "Distributed transactions with Jakarta EE 10 and WildFly",
          "imageUrl": null
        },
        {
          "id": "1693156d-7bfa-4f89-842c-6e590b116261",
          "author": "Leonardo Araujo",
          "description": "In this article, I will demonstrate how to monitor Red Hat Ansible Automation Platform running on premises using Prometheus, node_exporter, and Grafana.\n\nThis tutorial uses the following versions:\n\nRed Hat Enterprise Linux 9.4\nPrometheus 2.53\nNode Exporter 1.8.1\nGrafana 11.1.0\nRed Hat Ansible Automation Platform v4.5.7\n\nProcedure\nFollow these steps to install and configure Prometheus, Node Exporter and Grafana, which will be the stack used to monitor our Ansible Automation Platform.\nLet's start by installing and configuring Prometheus.\nPrometheus\nLet's download the most updated version of Prometheus:\n\ncurl -LO https://github.com/prometheus/prometheus/releases/download/v2.53.0/prometheus-2.53.0.linux-amd64.tar.gz\n\nHere we will unzip and rename our directory for ease of use:\n\ntar -xvf promet…",
          "link": "https://developers.redhat.com/articles/2024/08/28/monitoring-ansible-automation-platform-using-prometheus-node-exporter-and",
          "publishedOn": "2024-08-28T07:00:00.000Z",
          "wordCount": null,
          "title": "Monitoring Ansible Automation Platform using Prometheus, Node Exporter, and Grafana",
          "imageUrl": null
        },
        {
          "id": "7add97cb-07f7-4578-bce6-fb3a2a3b4a50",
          "author": "Dylan Orzel",
          "description": "In this article we'll explore how to make use of the built-in build capabilities available in Red Hat OpenShift 4 in a multi-arch compute environment, and how to make use of nodeSelectors to schedule builds on nodes of the architecture of our choosing. \nIn OpenShift, we can make use of the built-in Build, BuildConfig, and Build Strategies (Understanding Image Builds, Understanding BuildConfigs) objects to build container images on cluster nodes.\nIn a multi-arch compute cluster we can target nodes of a specific architecture with these build objects, and collect these architecture-specific container images into manifest lists of built images that can run anywhere in the cluster. These capabilities can lead to cost savings by enabling workloads to run on more cost-effective CPUs, as well as p…",
          "link": "https://developers.redhat.com/articles/2024/08/27/building-multi-architecture-container-images-openshift-container-platform",
          "publishedOn": "2024-08-27T07:00:00.000Z",
          "wordCount": null,
          "title": "Building multi-architecture container images on OpenShift Container Platform clusters",
          "imageUrl": null
        },
        {
          "id": "46002878-1316-4b3d-b780-2ef219d3e29e",
          "author": "Michael Dawson, Costas Papastathis",
          "description": "With the growth in the use of containers, the need to bundle your application into a container has never been stronger. Many Red Hat customers will be familiar with Source-to-Image (S2I) as an easy way to build container images from application source code. While S2I is a convenient way to build images on Red Hat OpenShift, Red Hat works to support our customers when using a variety of approaches, and we’ve recently seen an increasing interest in building applications using Cloud Native Computing Foundation (CNCF) Buildpacks.  \nThis is the second in a 5-part series of articles on building your applications with CNCF Buildpacks and Red Hat Universal Base Image (UBI). The series will include:\n\nBuilding applications with Paketo Buildpacks and Red Hat UBI container images \nRunning applications…",
          "link": "https://developers.redhat.com/articles/2024/08/26/running-applications-paketo-buildpacks-and-red-hat-ubi-container-images",
          "publishedOn": "2024-08-26T07:00:00.000Z",
          "wordCount": null,
          "title": "Running applications with Paketo Buildpacks and Red Hat UBI container images in OpenShift",
          "imageUrl": null
        },
        {
          "id": "9238ff3b-7314-45b2-9436-902d19ef618a",
          "author": "Kenny Ge",
          "description": "Using the algorithm for prefix sum/scan, covered in the previous module, we’re going to now write an algorithm for quicksort.\nThis is part 3 of a 4-part series. Catch up on the previous articles:\n\nWhat is GPU programming\n\nYour first GPU algorithm: Scan/prefix sum\n\nThe quicksort algorithm\nThe reason we’re doing quicksort, rather than something like merge sort, is that it’s very easy to parallelize– once you partition the array, each partition can be sorted completely independently. Plus, it is efficient in the average case, especially if you use randomness to select your pivot. \nRecall that the pseudocode for quicksort is as follows:\ndef quicksort(array, BLOCK_SIZE):\n\tp = randomly select pivot from array\n\tlet below_arr = global, reused array that stores the number of items in each block les…",
          "link": "https://developers.redhat.com/articles/2024/08/22/write-gpu-algorithm-quicksort",
          "publishedOn": "2024-08-22T07:00:00.000Z",
          "wordCount": null,
          "title": "Your second GPU algorithm: Quicksort",
          "imageUrl": null
        },
        {
          "id": "e8daa423-226f-44f0-947e-74711bd17892",
          "author": "Benjamin Schmeling, Andrea Peruffo",
          "description": "Operators are the standard way to package software and to automate day 1 and 2 operations for applications running on Red Hat OpenShift. Even the platform itself is based on cluster operators that encapsulate a single aspect of the OpenShift platform (e.g., how to deploy and update the DNS, API server, etc.), database or the internal registry. There is also a huge ecosystem of third party providers that are delivering their software via an operator. \nThe general idea behind the concept of operators is to automate installation, updates, backups, configuration, and many other operational tasks that are specific to the application the operator is managing. A concept that will also be useful for managing your own applications on the OpenShift platform. But how to start writing your own operato…",
          "link": "https://developers.redhat.com/articles/2024/08/21/design-kubernetes-operator-rest-resources",
          "publishedOn": "2024-08-22T07:00:00.000Z",
          "wordCount": null,
          "title": "Designing K8s operators for managing REST resources",
          "imageUrl": null
        },
        {
          "id": "788ec1d5-4de5-422f-ad23-e7ff2de65d40",
          "author": "Matthew Arnold",
          "description": "If you are planning a move to Red Hat OpenShift Virtualization, you may have a list of features that need to be checked to demonstrate similar capabilities to more established virtualization platforms. This article will guide you through one such feature: backing up and restoring virtual machines. There are several partner products that can simplify this operation, but these steps show a quick way to get started directly with the OpenShift APIs for Data Protection, provided by Red Hat.\nPreparation\nThese instructions assume you have administrative access to an OpenShift cluster. On this cluster, install and configure the following three Operators:\n\nRed Hat OpenShift Virtualization: Refer to these instructions to install OpenShift Virtualization and create a HyperConverged Operator instance.…",
          "link": "https://developers.redhat.com/articles/2024/08/21/how-back-and-restore-virtual-machines-openshift",
          "publishedOn": "2024-08-21T07:00:00.000Z",
          "wordCount": 4787,
          "title": "How to back up and restore virtual machines with OpenShift",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/Secure_Coding_B_A.png?itok=8NSmwUJu"
        },
        {
          "id": "2479ff32-6704-4cce-b2a3-dcf6156297f2",
          "author": "Ian Tewksbury",
          "description": "The Operator Framework was paradigm shifting for managing infrastructure and providing services to users on Kubernetes by introducing a methodology for capturing a human operator's knowledge as a Kubernetes-native application, an Operator. The Operator Lifecycle Manager (OLM) brought systematic installation, removal, and update management for Operators. In parallel, the rise and recognition of the power and need for Git-based operations (GitOps) has brought much needed consistent, repeatable, and scalable management of not only Kubernetes and its surrounding ecosystem, but the management of the entire platform as a software product with full software development lifecycle (SLDC) for all the reasons end user applications have been refining their SDLC for all these years.\nChallenge\nOLM only …",
          "link": "https://developers.redhat.com/articles/2024/08/20/git-based-operations-gitops-operators-managed-operator-lifecycle-manager-olm",
          "publishedOn": "2024-08-20T07:00:00.000Z",
          "wordCount": null,
          "title": "Git-based operations (GitOps) for Operators managed by Operator Lifecycle Manager (OLM)",
          "imageUrl": null
        },
        {
          "id": "c0c9fef6-8188-4523-8358-9b7e538f965e",
          "author": "Vivian Chinoda",
          "description": "Red Hat OpenShift Local is a development environment where Red Hat OpenShift applications run on a local machine, and it provides a sandbox environment for developers to build, test, and iterate on applications without requiring access to a full-scale cloud infrastructure. And it’s just been made better with the addition of Red Hat OpenShift Lightspeed!\nRed Hat OpenShift Lightspeed is a generative AI virtual chat assistant that exists to improve productivity and accessibility for OpenShift users of all skill levels, from novices to experts. \nOpenShift Lightspeed on OpenShift Local\nOpenShift Lightspeed is easy to access since it’s integrated directly into the OpenShift web console. Furthermore, it allows you to bring your own large language models (LLMs) through the following supported prov…",
          "link": "https://developers.redhat.com/articles/2024/08/19/supercharge-your-red-hat-openshift-local-environment-red-hat-openshift",
          "publishedOn": "2024-08-19T07:00:00.000Z",
          "wordCount": null,
          "title": "Supercharge your Red Hat OpenShift local environment with Red Hat OpenShift Lightspeed",
          "imageUrl": null
        },
        {
          "id": "da421abc-57e1-408a-a5c6-c622cb5ef954",
          "author": "Leonardo Araujo",
          "description": "This article will teach you how to install and configure the Grafana Operator and integrate it with the openshift-monitoring stack using user-workload-monitoring. At the end of the article, we will import a dashboard with general metrics about Red Hat OpenShift Virtualization, which will give us an overview of the amount of resources in use, virtual machines (VMs) created, and their consumption.\nIn this article we use the following versions:\n\nRed Hat OpenShift v4.13.4\nRed Hat OpenShift Virtualization Operator v4.13.7\nGrafana Operator v5.6.0\n\nPrerequisites\n\nUser with the cluster-admin cluster role.\nGrafana Operator.\nUser-Defined Projects enabled.\n\nEnable user-defined projects\n\nExecute this command to add enableUserWorkload: true under data/config.yaml:\noc -n openshift-monitoring patch confi…",
          "link": "https://developers.redhat.com/articles/2024/08/19/monitoring-openshift-virtualization-using-user-defined-projects-and-grafana",
          "publishedOn": "2024-08-19T07:00:00.000Z",
          "wordCount": null,
          "title": "Monitoring OpenShift Virtualization using user-defined projects and Grafana",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "edykim.com 블로그 RSS 피드",
      "feedUrl": "https://edykim.com/ko/feed.xml",
      "siteUrl": "https://edykim.com/",
      "articles": []
    },
    {
      "title": "Eli Bendersky's website",
      "feedUrl": "https://eli.thegreenplace.net/feeds/all.atom.xml",
      "siteUrl": "https://eli.thegreenplace.net/",
      "articles": [
        {
          "id": "https://eli.thegreenplace.net/2024/notes-on-running-go-in-the-browser-with-webassembly/",
          "author": null,
          "description": "<p>Recently I've had to compile Go to WebAssembly to run in the browser in a couple\nof small projects (<a class=\"reference external\" href=\"https://eliben.github.io/go-sudoku/\">#1</a>,\n<a class=\"reference external\" href=\"https://eliben.github.io/go-sentencepiece/\">#2</a>), and in general spent some\ntime <a class=\"reference external\" href=\"https://eli.thegreenplace.net/tag/webassembly\">looking at WebAssembly</a>.\nI find WebAssembly to be an exciting technology, both for the web and for\nother uses (e.g. with WASI …</p>",
          "link": "https://eli.thegreenplace.net/2024/notes-on-running-go-in-the-browser-with-webassembly/",
          "publishedOn": "2024-09-14T13:05:00.000Z",
          "wordCount": null,
          "title": "Notes on running Go in the browser with WebAssembly",
          "imageUrl": null
        },
        {
          "id": "https://eli.thegreenplace.net/2024/notes-on-the-euler-formula/",
          "author": null,
          "description": "<p>The Euler formula states that for any real <em>x</em>:</p>\n<object class=\"align-center\" data=\"https://eli.thegreenplace.net/images/math/e41e42437950b87591a40b19d5bd68d01bd7786b.svg\" style=\"height: 22px;\" type=\"image/svg+xml\">\\[e^{ix}=cos(x)+i sin(x)\\]</object>\n<p>Where <em>i</em> is the imaginary unit. This formula is extremely important in many\nbranches of mathematics and engineering, but at first glance it's puzzling. What\ndoes a complex exponent even mean, and how can …</p>",
          "link": "https://eli.thegreenplace.net/2024/notes-on-the-euler-formula/",
          "publishedOn": "2024-09-07T12:44:00.000Z",
          "wordCount": null,
          "title": "Notes on the Euler formula",
          "imageUrl": null
        },
        {
          "id": "https://eli.thegreenplace.net/2024/sentencepiece-bpe-tokenizer-in-go/",
          "author": null,
          "description": "<p>Earlier this year I wrote a <a class=\"reference external\" href=\"https://eli.thegreenplace.net/2024/tokens-for-llms-byte-pair-encoding-in-go/\">post about implementing BPE tokenization in Go</a>,\nwhich made it possible to reproduce OpenAI's tokenizer.</p>\n<p>Today I want to mention a new project I've been hacking on recently:\n<a class=\"reference external\" href=\"https://github.com/eliben/go-sentencepiece\">go-sentencepiece</a>\n- a pure Go implementation of the <a class=\"reference external\" href=\"https://github.com/google/sentencepiece\">SentencePiece</a> tokenizer\nthat's used for Google AI's models like …</p>",
          "link": "https://eli.thegreenplace.net/2024/sentencepiece-bpe-tokenizer-in-go/",
          "publishedOn": "2024-08-23T17:35:00.000Z",
          "wordCount": null,
          "title": "SentencePiece BPE Tokenizer in Go",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Embedded Artistry",
      "feedUrl": "https://embeddedartistry.com/feed/",
      "siteUrl": "https://embeddedartistry.com/",
      "articles": []
    },
    {
      "title": "Embedded",
      "feedUrl": "https://www.embedded.com/feed/",
      "siteUrl": "https://www.embedded.com/",
      "articles": [
        {
          "id": "https://www.embedded.com/?p=4491002",
          "author": "Stephen Evanczuk",
          "description": "In the last several posts, we’ve started to explore Embedded Rust. You’ve seen that the Cortex-M QuickStart Template is a great place to start. A generic template, though, isn’t going to help you blink an LED on your target development board. In today’s post, we will look closer at the Cortex-M QuickStart template and how […]\nThe post Embedded Rust: Adding support for your target microcontroller appeared first on Embedded.",
          "link": "https://www.embedded.com/embedded-rust-adding-support-for-your-target-microcontroller/",
          "publishedOn": "2024-09-13T14:14:00.000Z",
          "wordCount": null,
          "title": "Embedded Rust: Adding support for your target microcontroller",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4491068",
          "author": "Maurizio Di Paolo Emilio",
          "description": "Artificial Intelligence (AI) has revolutionized many industries, enabling applications that seemed unlikely just a few years ago. At the same time, the exponential growth of data and the need for real-time responses have led to the emergence of a new paradigm: edge AI. This type of technology is essential for the implementation of distributed systems, […]\nThe post Edge AI: The Future of Artificial Intelligence in embedded systems appeared first on Embedded.",
          "link": "https://www.embedded.com/edge-ai-the-future-of-artificial-intelligence-in-embedded-systems/",
          "publishedOn": "2024-09-13T13:05:09.000Z",
          "wordCount": null,
          "title": "Edge AI: The Future of Artificial Intelligence in embedded systems",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4491059",
          "author": "Maurizio Di Paolo Emilio",
          "description": "The Functional Safety certification has been granted to Microchip Technology by TÜV Rheinland®, an autonomous third-party testing and certification body. Microchip’s Libero® SoC Design Suite 2023.2 SP1 enables hardware and system developers of safety-critical automotive and industrial applications to accelerate their attainment of compliance with IEC 61508 SIL 3 and ISO 26262 ASIL D standards. […]\nThe post Microchip Receives Functional Safety Certification for its PolarFire FPGAs appeared first on Embedded.",
          "link": "https://www.embedded.com/microchip-receives-functional-safety-certification-for-its-polarfire-fpgas/",
          "publishedOn": "2024-09-13T08:00:00.000Z",
          "wordCount": null,
          "title": "Microchip Receives Functional Safety Certification for its PolarFire FPGAs",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490950",
          "author": "Maurizio Di Paolo Emilio",
          "description": "Bluetooth® Core Specification v5.1 is a significant advancement in the evolution of Bluetooth technology, particularly for its direction-finding capabilities. This feature enhances the precision of location services, which is crucial for applications like indoor navigation and asset tracking. Bluetooth direction finding is a cutting-edge technology that enhances location services in various devices. Two methods can […]\nThe post Enhancing Indoor Location Services with Innovative Bluetooth® Core Specification v5.1 Angle of Arrival (AoA) appeared first on Embedded.",
          "link": "https://www.embedded.com/enhancing-indoor-location-services-with-innovative-bluetooth-core-specification-v5-1-angle-of-arrival-aoa/",
          "publishedOn": "2024-09-12T08:20:00.000Z",
          "wordCount": null,
          "title": "Enhancing Indoor Location Services with Innovative Bluetooth® Core Specification v5.1 Angle of Arrival (AoA)",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490978",
          "author": "Stefano Lovati",
          "description": "Wire bonding is widely used in electronic devices, the semiconductor industry, and microelectronics. It enables interconnections between the die and other electronic components in an integrated circuit (IC), such as transistors and resistors. Wire bonding establishes an electrical connection between a chip’s bond pad and a corresponding pad on the package substrate or another chip. […]\nThe post Breaking New Ground in Wire Bond Inspection with Capacitive Test Methods appeared first on Embedded.",
          "link": "https://www.embedded.com/breaking-new-ground-in-wire-bond-inspection-with-capacitive-test-methods/",
          "publishedOn": "2024-09-11T20:49:16.000Z",
          "wordCount": null,
          "title": "Breaking New Ground in Wire Bond Inspection with Capacitive Test Methods",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4491050",
          "author": "Maurizio Di Paolo Emilio",
          "description": "NXP has launched the Trimension SR250, a pioneering single-chip solution that integrates short-range ultra-wideband (UWB) radar and secure UWB ranging with on-chip processing. This technology aims to enhance autonomous industrial and IoT applications, providing new functionalities for smart homes and industrial settings. The built-in radar processing capabilities help lower power consumption, boosting overall efficiency. Additionally, […]\nThe post Innovative IoT Solutions: NXP’s Trimension SR250 Combines UWB Radar and Secure Ranging appeared first on Embedded.",
          "link": "https://www.embedded.com/innovative-iot-solutions-nxps-trimension-sr250-combines-uwb-radar-and-secure-ranging/",
          "publishedOn": "2024-09-11T14:41:00.000Z",
          "wordCount": null,
          "title": "Innovative IoT Solutions: NXP’s Trimension SR250 Combines UWB Radar and Secure Ranging",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4491031",
          "author": "Maurizio Di Paolo Emilio",
          "description": "Lauterbach‘s TRACE32® development tools now provide support for Renesas’s primary 32-bit RISC-V® general-purpose Microcontroller family, designed for cost-conscious and energy-efficient embedded applications. In addition to providing read and write access to the internal flash memory of the RISC-V processor core, TRACE32® tools support also offers debugging capabilities. The recently introduced R9A02G021 microcontroller (MCU) incorporates a […]\nThe post Lauterbach adds debug and trace support for Renesas 32-bit-RISC-V microcontrollers appeared first on Embedded.",
          "link": "https://www.embedded.com/lauterbach-adds-debug-and-trace-support-for-renesas-32-bit-risc-v-microcontrollers/",
          "publishedOn": "2024-09-11T08:05:00.000Z",
          "wordCount": null,
          "title": "Lauterbach adds debug and trace support for Renesas 32-bit-RISC-V microcontrollers",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4491027",
          "author": "Maurizio Di Paolo Emilio",
          "description": "u-blox, a leading worldwide supplier of advanced positioning and wireless communication technologies and services, has presented the ANN-MB2 external GNSS antenna designed for extensive coverage and high-precision applications across several constellations. Specialized for the u-blox high-precision GNSS technology, ANN-MB2 is highly suitable for industrial automation, surveying, autonomous vehicles, mobile robots, and other applications that need […]\nThe post u-blox unveils a new all-band GNSS antenna for high-precision applications appeared first on Embedded.",
          "link": "https://www.embedded.com/u-blox-unveils-a-new-all-band-gnss-antenna-for-high-precision-applications/",
          "publishedOn": "2024-09-11T08:00:00.000Z",
          "wordCount": null,
          "title": "u-blox unveils a new all-band GNSS antenna for high-precision applications",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4491019",
          "author": "Maurizio Di Paolo Emilio",
          "description": "The integration of the UDE Universal Debug Engine from PLS Programmierbare Logik & Systeme into T1.timing has been successfully implemented by GLIWA. This functionality allows the customer to examine, verify, and enhance the timing characteristics of electronic control units (ECUs) using timing data obtained directly from actual hardware. GLIWA T1.timing provides a comprehensive selection of […]\nThe post PLS and GLIWA announce the integration of the UDE Universal Debug Engine into GLIWA T1.timing appeared first on Embedded.",
          "link": "https://www.embedded.com/pls-and-gliwa-announce-the-integration-of-the-ude-universal-debug-engine-into-gliwa-t1-timing/",
          "publishedOn": "2024-09-10T19:00:00.000Z",
          "wordCount": null,
          "title": "PLS and GLIWA announce the integration of the UDE Universal Debug Engine into GLIWA T1.timing",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490919",
          "author": "Stefano Lovati",
          "description": "Menlo Micro has positioned itself as a key player in the evolving microelectronics landscape, particularly by developing the ideal switch technology. This innovation stands at the core of Menlo Micro’s efforts to influence electronic systems across various sectors, including telecommunications, industrial automation, and defense. The ideal switch is a product of extensive research and development, […]\nThe post A new standard in microelectronics for defense applications with Menlo Micro’s ideal switch appeared first on Embedded.",
          "link": "https://www.embedded.com/a-new-standard-in-microelectronics-for-defense-applications-with-menlo-micros-ideal-switch/",
          "publishedOn": "2024-09-10T08:25:00.000Z",
          "wordCount": null,
          "title": "A new standard in microelectronics for defense applications with Menlo Micro’s ideal switch",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490945",
          "author": "Maurizio Di Paolo Emilio",
          "description": "NASA‘s Jet Propulsion Laboratory (JPL) has been running the AVIRIS (Airborne Visible/InfraRed Imaging Spectrometer) project for over 30 years, using a family of ever-advancing JPL imaging spectrometers (AVIRIS Classic, AVIRIS-Next Generation, AVIRIS-3, and soon AVIRIS-5) (https://avirisng.jpl.nasa.gov/planned_campaigns.html). The objective of current state-of-the-art AVIRIS-3 is to identify, measure, and monitor constituents of the Earth’s surface and atmosphere […]\nThe post Chevin, Alpha-Data & Correct Designs Enhance NASA-JPL’s AVIRIS-3 Data Offload appeared first on Embedded.",
          "link": "https://www.embedded.com/chevin-alpha-data-correct-designs-enhance-nasa-jpls-aviris-3-data-offload/",
          "publishedOn": "2024-09-10T06:43:03.000Z",
          "wordCount": null,
          "title": "Chevin, Alpha-Data & Correct Designs Enhance NASA-JPL’s AVIRIS-3 Data Offload",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490902",
          "author": "Maurizio Di Paolo Emilio",
          "description": "In a recent development, NTT Corporation unveiled the “first” gigahertz ultrasonic circuit that utilizes topological insulator principles, indicating a new era in ultrasonic communication technology. This innovative approach represents a significant leap forward in the field of nanomechanics and advanced applied physical science. The core of this advancement lies in developing topological ultrasonic circuits, which […]\nThe post NTT Announces Breakthrough in Ultrasonic Circuit Technology appeared first on Embedded.",
          "link": "https://www.embedded.com/ntt-announces-breakthrough-in-ultrasonic-circuit-technology/",
          "publishedOn": "2024-09-09T08:54:00.000Z",
          "wordCount": null,
          "title": "NTT Announces Breakthrough in Ultrasonic Circuit Technology",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490859",
          "author": "Stephen Evanczuk",
          "description": "It is common for Internet of Things (IoT) devices, industrial sensors, meters, precision, and medical equipment to require both a positive and negative voltage. Often, these voltages must be symmetrical and sourced from a single power supply. Various electronic designs require one or more negative voltages in the power supply, often coming together with a […]\nThe post Generating negative voltages from a positive voltage supply appeared first on Embedded.",
          "link": "https://www.embedded.com/generating-negative-voltages-from-a-positive-voltage-supply/",
          "publishedOn": "2024-09-06T13:52:54.000Z",
          "wordCount": null,
          "title": "Generating negative voltages from a positive voltage supply",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490911",
          "author": "Maurizio Di Paolo Emilio",
          "description": "The U.S. Department of Commerce’s National Institute of Standards and Technology (NIST) has finalized a set of encryption algorithms designed to withstand cyberattacks from quantum computers. These algorithms are part of the first completed standards from NIST’s post-quantum cryptography (PQC) standardization project and are ready for immediate use. The standards encompass three post-quantum cryptography algorithms: […]\nThe post First Four Quantum-Resistant Cryptographic Algorithms appeared first on Embedded.",
          "link": "https://www.embedded.com/first-four-quantum-resistant-cryptographic-algorithms/",
          "publishedOn": "2024-09-05T11:08:00.000Z",
          "wordCount": null,
          "title": "First Four Quantum-Resistant Cryptographic Algorithms",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490892",
          "author": "Maurizio Di Paolo Emilio",
          "description": "The theory now posits that neutrino particles have a very small mass and come in three distinct “flavors” that can be switched between. Previously, it was believed that they had no mass. Studying these particles, which are frequently referred to as “ghost particles,” is exceedingly challenging due to their ability to travel through most of […]\nThe post Spectrum Instrumentation’s liquid scintillator digitizer cards used in JUNO’s neutrino detector appeared first on Embedded.",
          "link": "https://www.embedded.com/spectrum-instrumentations-liquid-scintillator-digitizer-cards-used-in-junos-neutrino-detector/",
          "publishedOn": "2024-09-05T08:00:00.000Z",
          "wordCount": null,
          "title": "Spectrum Instrumentation’s liquid scintillator digitizer cards used in JUNO’s neutrino detector",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490896",
          "author": "Maurizio Di Paolo Emilio",
          "description": "Vanguard International Semiconductor Corporation and NXP Semiconductors have announced their intention to establish a manufacturing joint venture, VisionPower Semiconductor Manufacturing Company Pte Ltd (“VSMC”), which will construct a new 300mm semiconductor wafer manufacturing facility in Singapore. The joint-venture fab will cater to the automotive, industrial, consumer, and mobile end markets by providing support for mixed-signal, […]\nThe post VIS and NXP will establish a joint venture to build and operate a 300mm fab appeared first on Embedded.",
          "link": "https://www.embedded.com/vis-and-nxp-will-establish-a-joint-venture-to-build-and-operate-a-300mm-fab/",
          "publishedOn": "2024-09-05T08:00:00.000Z",
          "wordCount": null,
          "title": "VIS and NXP will establish a joint venture to build and operate a 300mm fab",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490814",
          "author": "Maurizio Di Paolo Emilio",
          "description": "Emerging trends such as AI, edge/IIoT, cybersecurity, and virtualization are increasing the complexity of embedded and edge computing solutions. Application-ready Computer-on-Modules can help OEMs master this challenge, but what exactly does application-ready entail? congatec recognizes a clear need to raise the application readiness of Computer-on-Modules to a new level. Computer-on-Modules represent the most widely used […]\nThe post What does “application-ready” really mean? appeared first on Embedded.",
          "link": "https://www.embedded.com/what-does-application-ready-really-mean/",
          "publishedOn": "2024-09-04T08:55:00.000Z",
          "wordCount": null,
          "title": "What does “application-ready” really mean?",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490871",
          "author": "Maurizio Di Paolo Emilio",
          "description": "STMicroelectronics has become Quintauris GmbH’s sixth stakeholder. ST joins other Quintauris stockholders, including Robert Bosch GmbH, Infineon Technologies AG, Nordic Semiconductor ASA, NXP® Semiconductors, and Qualcomm Technologies, Inc. In December 2023, Quintauris was established to promote the adoption of products that are based on RISC-V principles. This will encompass the provision of reference architectures and […]\nThe post STMicroelectronics becomes sixth shareholder in Quintauris to advance RISC-V adoption appeared first on Embedded.",
          "link": "https://www.embedded.com/stmicroelectronics-becomes-sixth-shareholder-in-quintauris-to-advance-risc-v-adoption/",
          "publishedOn": "2024-09-04T08:00:00.000Z",
          "wordCount": null,
          "title": "STMicroelectronics becomes sixth shareholder in Quintauris to advance RISC-V adoption",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490879",
          "author": "Maurizio Di Paolo Emilio",
          "description": "PEAK-System has recently introduced the PCAN-MicroMod FD ECU, a versatile control unit designed for the seamless incorporation of bespoke accessories in automotive applications. Specifically, it offers a CAN FD connection and a combination of analog and digital input/output (I/O) options. These include 16-bit analog inputs with adjustable measurement ranges of up to ±20 Volt, as […]\nThe post PEAK-System announces the PCAN-MicroMod FD ECU universal control unit for automotive applications appeared first on Embedded.",
          "link": "https://www.embedded.com/peak-system-announces-the-pcan-micromod-fd-ecu-universal-control-unit-for-automotive-applications/",
          "publishedOn": "2024-09-04T08:00:00.000Z",
          "wordCount": null,
          "title": "PEAK-System announces the PCAN-MicroMod FD ECU universal control unit for automotive applications",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490884",
          "author": "Maurizio Di Paolo Emilio",
          "description": "An innovative collaboration between CoreHW, a prominent fabless semiconductor company, and Presto Engineering, a European specialist in application-specific integrated circuit (ASIC) design, engineering, and production services, has resulted in the development of the first advanced low-power radio frequency (RF) 2.4GHz front-end module. This module is implemented in an ultra-small and thin wafer-scale package. This RF […]\nThe post CoreHW and Presto Engineering collaborate in developing ultra-low-power RF IoT Devices appeared first on Embedded.",
          "link": "https://www.embedded.com/corehw-and-presto-engineering-collaborate-in-developing-ultra-low-power-rf-iot-devices/",
          "publishedOn": "2024-09-04T08:00:00.000Z",
          "wordCount": null,
          "title": "CoreHW and Presto Engineering collaborate in developing ultra-low-power RF IoT Devices",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490720",
          "author": "Barbaradellaporta",
          "description": "Beijing, China (August 27, 2024) —GigaDevice, a leading semiconductor company specializing in Flash Memory, 32-bit Microcontrollers (MCUs), Sensors, and Power Management technologies, announces it has signed an Arm® Total Access (ATA) licensing agreement, laying the foundation for ongoing advancement in the design of embedded chips and the strategic expansion of its GD32 MCU product roadmap.  To support the development of leading products, […]\nThe post GigaDevice Semiconductor expands its Arm MCU product roadmap through Arm Total Access appeared first on Embedded.",
          "link": "https://www.embedded.com/gigadevice-semiconductor-expands-its-arm-mcu-product-roadmap-through-arm-total-access/",
          "publishedOn": "2024-09-03T13:36:06.000Z",
          "wordCount": null,
          "title": "GigaDevice Semiconductor expands its Arm MCU product roadmap through Arm Total Access",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490799",
          "author": "Maurizio Di Paolo Emilio",
          "description": "The founders of quantum mechanics of the early 20th century would be captivated to know that the branch of physics they created to explain reality in its fundamental recesses, have today far-reaching potential for disrupting applications. Apart from semiconductors whose role in our society is just incomparable, quantum computing and quantum sensors are set to […]\nThe post Quantum Magnetometers developed by SBQuantum to be tested by Space Agencies appeared first on Embedded.",
          "link": "https://www.embedded.com/quantum-magnetometers-developed-by-sbquantum-to-be-tested-by-space-agencies/",
          "publishedOn": "2024-09-03T08:46:00.000Z",
          "wordCount": null,
          "title": "Quantum Magnetometers developed by SBQuantum to be tested by Space Agencies",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490800",
          "author": "Maurizio Di Paolo Emilio",
          "description": "Advantech has reported the introduction of their latest modular Ethernet switch, the EKI-8528. This switch is engineered to optimize network administration and ensure seamless connectivity in digital substations and power utilities. Structured to adhere to the strict IEC 61850-3 criteria, it provides customized solutions for industrial networks’ intricate and challenging needs ranging from medium to […]\nThe post Advantech announces the EKI-8528, a new modular Ethernet switch appeared first on Embedded.",
          "link": "https://www.embedded.com/advantech-announces-the-eki-8528-a-new-modular-ethernet-switch/",
          "publishedOn": "2024-09-03T08:00:00.000Z",
          "wordCount": null,
          "title": "Advantech announces the EKI-8528, a new modular Ethernet switch",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490785",
          "author": "Stefano Lovati",
          "description": "Radar and LiDAR are two key technologies for sensing the surrounding environment, widely used in industries such as automotive, robotics, security, and environmental monitoring. The fundamental purpose of both technologies is the same, i.e. to detect the presence and volume of objects from various distances, but it is important to grasp the differences between them. […]\nThe post LiDAR and Radar Systems appeared first on Embedded.",
          "link": "https://www.embedded.com/lidar-and-radar-systems/",
          "publishedOn": "2024-09-02T14:00:00.000Z",
          "wordCount": null,
          "title": "LiDAR and Radar Systems",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490765",
          "author": "Maurizio Di Paolo Emilio",
          "description": "Efficient Computer Corporation, a processor designer based in the United States, has partnered strategically with GlobalFoundries (GF) to construct its MRAM chips using the 22FDX process. Efficient is already collaborating with specific clients to provide early access and sampling of the GF 22nm low-power silicon on insulator process, which is anticipated to implement MRAM memory […]\nThe post Efficient Computer signs an agreement with GlobalFoundries to build MRAM chips on the GF 22FDX process appeared first on Embedded.",
          "link": "https://www.embedded.com/efficient-signs-agreement-with-globalfounfries/",
          "publishedOn": "2024-09-01T18:00:00.000Z",
          "wordCount": null,
          "title": "Efficient Computer signs an agreement with GlobalFoundries to build MRAM chips on the GF 22FDX process",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490779",
          "author": "Stephen Evanczuk",
          "description": "Consumers and industry leaders alike are increasingly interested in wearable tech. Devices that remain in contact with the wearer can provide highly accurate and updated statistics about them. Such capabilities remain valuable in settings ranging from health care facilities to military training academies. However, people will only feel safe using the products if they stay […]\nThe post Handling temperature management in wearable tech appeared first on Embedded.",
          "link": "https://www.embedded.com/tackling-temperature-management-in-wearable-tech/",
          "publishedOn": "2024-08-31T17:16:05.000Z",
          "wordCount": null,
          "title": "Handling temperature management in wearable tech",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490741",
          "author": "Nitin Dahad",
          "description": "I am pleased to announce that my colleague Maurizio Di Paolo Emilio is taking on the role of Editor-in-Chief of embedded.com as of today. Maurizio is highly respected in the worlds of science, technology and industry, who with his Ph.D. in physics is recognized for his contributions to the electronics engineering community through his writing, […]\nThe post Welcome to Maurizio Di Paolo Emilio, new Editor-in-Chief of embedded.com appeared first on Embedded.",
          "link": "https://www.embedded.com/welcome-to-maurizio-di-paolo-emilio-new-editor-in-chief-of-embedded-com/",
          "publishedOn": "2024-08-29T13:00:15.000Z",
          "wordCount": null,
          "title": "Welcome to Maurizio Di Paolo Emilio, new Editor-in-Chief of embedded.com",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490751",
          "author": "Nitin Dahad",
          "description": "Imagine using a natural language prompt to specify a design or function and have a software tool that automatically generates a bill of materials (BOM), the corresponding schematics of a fully functional design, and a PCB floor plan in native EDA formats. This is what Munich-based startup Celus claims to do with its design platform, […]\nThe post Software matches components to design and generates BOM and schematics in hours appeared first on Embedded.",
          "link": "https://www.embedded.com/software-matches-components-to-design-and-generates-bom-and-schematics-in-hours/",
          "publishedOn": "2024-08-29T10:08:29.000Z",
          "wordCount": null,
          "title": "Software matches components to design and generates BOM and schematics in hours",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490754",
          "author": "Nitin Dahad",
          "description": "Hybrid edge cloud computing solution developer mimik has launched an operating environment that allows AI agents to run on any computing node, enabling them to discover, interact, and collaborate seamlessly—offline-first, with support for multi-cloud and multi-LLM environments.  Its new mimik ai platform introduces a cloud-native operating environment featuring a generative AI runtime and a comprehensive suite […]\nThe post Platform enables AI agents and on-device microservices on any computing node appeared first on Embedded.",
          "link": "https://www.embedded.com/platform-enables-ai-agents-and-on-device-microservices-on-any-computing-node/",
          "publishedOn": "2024-08-29T10:00:24.000Z",
          "wordCount": null,
          "title": "Platform enables AI agents and on-device microservices on any computing node",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490732",
          "author": "Stephen Evanczuk",
          "description": "Metrics play a critical role in the software development process. If you’re not tracking metrics, you aren’t keeping score, making it difficult to understand how your team is performing. Without understanding their performance, you can’t adjust or identify what can help your team improve. It would be the equivalent of having a star quarterback but […]\nThe post Are you tracking the right metrics for your development team? appeared first on Embedded.",
          "link": "https://www.embedded.com/are-you-tracking-the-right-metrics-for-your-development-team/",
          "publishedOn": "2024-08-28T11:44:58.000Z",
          "wordCount": null,
          "title": "Are you tracking the right metrics for your development team?",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490729",
          "author": "Stephen Evanczuk",
          "description": "Power supply units (PSUs) and BBUs serve as the lifeblood that feeds the functioning of data centers, networks, servers, and storage devices in the cutting-edge Open Compute Project (OCP) Open Rack Version 3 (ORV3) architecture. The central power converter is in charge of delivering the majority of required electrical energy. However, the unrecognized hero is […]\nThe post Auxiliary power system in a smart battery backup unit appeared first on Embedded.",
          "link": "https://www.embedded.com/auxiliary-power-system-in-a-smart-battery-backup-unit/",
          "publishedOn": "2024-08-28T11:33:26.000Z",
          "wordCount": null,
          "title": "Auxiliary power system in a smart battery backup unit",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490678",
          "author": "Nitin Dahad",
          "description": "For years, Linux has dominated the embedded and IoT landscape, lauded for its flexibility and mature ecosystem. However, a renaissance is unfolding in real-time operating systems (RTOS). Propelled by open-source initiatives, big tech backing, and a growing demand for low-latency and resource-constrained applications, RTOS development environments are rapidly closing the gap with their more established […]\nThe post The RTOS renaissance: closing the OS gap with Linux in IoT appeared first on Embedded.",
          "link": "https://www.embedded.com/the-rtos-renaissance-closing-the-os-gap-with-linux-in-iot/",
          "publishedOn": "2024-08-21T14:45:00.000Z",
          "wordCount": null,
          "title": "The RTOS renaissance: closing the OS gap with Linux in IoT",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490671",
          "author": "Stephen Evanczuk",
          "description": "As someone who has spent over two decades in the embedded systems industry, I’ve seen the vast evolution of technology—from 8-bit microcontrollers to today’s sophisticated, multicore systems. Yet, one thing remains constant: pointers in C and C++. They are a double-edged sword that can lead to incredible flexibility in memory management but can also wreak […]\nThe post Best practices to safely navigate pointers in C/C++ appeared first on Embedded.",
          "link": "https://www.embedded.com/best-practices-to-safely-navigate-pointers-in-c-c/",
          "publishedOn": "2024-08-20T22:36:52.000Z",
          "wordCount": null,
          "title": "Best practices to safely navigate pointers in C/C++",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490665",
          "author": "Stephen Evanczuk",
          "description": "Electronics are expected to comprise roughly half the cost of a new car by 2030, which ups the ante for automotive engineers tasked with “designing in” more features and functionality in the same or less space while meeting rigorous demands for enhanced reliability. Fueling this challenge are four transformational trends: connectivity, autonomous driving, in-vehicle experience […]\nThe post Optimizing vehicle design through rugged, miniaturized connectors appeared first on Embedded.",
          "link": "https://www.embedded.com/optimizing-vehicle-design-through-rugged-miniaturized-connectors/",
          "publishedOn": "2024-08-20T22:10:09.000Z",
          "wordCount": null,
          "title": "Optimizing vehicle design through rugged, miniaturized connectors",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490657",
          "author": "Nitin Dahad",
          "description": "Two separate announcements around the Wi-Fi HaLow standard caught our eye over the last few weeks. One is the collaboration between Milesight and Morse Micro to launch Wi-Fi HaLow variants of smart IoT products, and the other was the announcement by the Wireless Broadband Alliance of successful completion of real-world field trials of Wi-Fi HaLow […]\nThe post Wi-Fi HaLow smart IoT products emerge, and real world field trials’ success appeared first on Embedded.",
          "link": "https://www.embedded.com/wi-fi-halow-smart-iot-products-emerge-and-real-world-field-trials-success/",
          "publishedOn": "2024-08-19T13:31:29.000Z",
          "wordCount": null,
          "title": "Wi-Fi HaLow smart IoT products emerge, and real world field trials’ success",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "EmbeddedRelated.com Blogs",
      "feedUrl": "https://www.embeddedrelated.com/blogs_rss.php",
      "siteUrl": "https://www.embeddedrelated.com/blogs.php",
      "articles": [
        {
          "id": "https://www.embeddedrelated.com/showarticle/1692.php",
          "author": null,
          "description": "This was supposed to be a story of heroism; of using brain power, lookup tables and various other means to overcome strict hardware limitations. Instead, it turned out to be just a little reminder to look closely at all of the aspects of the toolchain, because someone else might have already solved the problem for you.\n  \nAs I have mentioned in this blog before, I enjoy tackling programming...",
          "link": "https://www.embeddedrelated.com/showarticle/1692.php",
          "publishedOn": "2024-09-11T21:19:34.000Z",
          "wordCount": null,
          "title": "My friend, the compiler",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1691.php",
          "author": null,
          "description": "In the fall of 2018 I began a graduate program at North Carolina State University that would eventually earn me a Master's degree in Computer Engineering. I was still serving in the US Army at the time, having been selected to go to West Point Military Academy after my graduate program to teach Cadets there in the Electrical Engineering and Computer Science Department. I was excited and...",
          "link": "https://www.embeddedrelated.com/showarticle/1691.php",
          "publishedOn": "2024-09-04T15:30:14.000Z",
          "wordCount": null,
          "title": "What I Learned From Crashing and Burning in Grad School",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1690.php",
          "author": null,
          "description": "Life is often about compromise, but embedded developers really are not good at that. Code generation is a context in which compromise is somewhat inevitable and we call it “optimization”. All modern compilers perform optimization, of course. Some do a better job than others. A lot of the time, the compiler simply guesses which optimization will produce the best result without knowing what...",
          "link": "https://www.embeddedrelated.com/showarticle/1690.php",
          "publishedOn": "2024-08-26T10:18:51.000Z",
          "wordCount": null,
          "title": "Small or fast?",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Evans Library",
      "feedUrl": "https://evan-moon.github.io/feed.xml",
      "siteUrl": "https://evan-moon.github.io",
      "articles": []
    },
    {
      "title": "Better Embedded System SW",
      "feedUrl": "https://feeds.feedburner.com/BetterEmbeddedSystemSw",
      "siteUrl": "http://betterembsw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Google Developers Blog",
      "feedUrl": "https://feeds.feedburner.com/GDBcode",
      "siteUrl": "https://developers.googleblog.com/rss/",
      "articles": [
        {
          "id": "https://developers.googleblog.com/en/gemma-explained-overview-gemma-model-family-architectures/",
          "author": null,
          "description": "Learn more about the different variations of Gemma models, how they are designed for different use cases, and the core parameters of their architecture.",
          "link": "https://developers.googleblog.com/en/gemma-explained-overview-gemma-model-family-architectures/",
          "publishedOn": "2024-09-15T20:14:54.438Z",
          "wordCount": null,
          "title": "Gemma explained: An overview of Gemma model family architectures",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/build-a-text-based-adventure-game-with-gemma-2/",
          "author": null,
          "description": "Create a text-based adventure game using Gemma 2. Here are code snippets and tips for designing the game world, enhancing interactivity and replayability, and more.",
          "link": "https://developers.googleblog.com/en/build-a-text-based-adventure-game-with-gemma-2/",
          "publishedOn": "2024-09-14T20:17:03.186Z",
          "wordCount": null,
          "title": "Build a text-based adventure game with Gemma 2",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/streamlining-llm-inference-at-the-edge-with-tflite/",
          "author": null,
          "description": "XNNPack, the default TensorFlow Lite CPU inference engine, has been updated to improve performance and memory management, allow cross-process collaboration, and simplify the user-facing API.",
          "link": "https://developers.googleblog.com/en/streamlining-llm-inference-at-the-edge-with-tflite/",
          "publishedOn": "2024-09-13T20:15:28.648Z",
          "wordCount": null,
          "title": "Streamlining LLM Inference at the Edge with TFLite",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/enabling-more-private-gen-ai/",
          "author": null,
          "description": "Google has developed a number of technologies that you can use to start experimenting with and exploring the potential of generative AI to process data that needs to stay private.",
          "link": "https://developers.googleblog.com/en/enabling-more-private-gen-ai/",
          "publishedOn": "2024-09-11T20:14:18.686Z",
          "wordCount": null,
          "title": "Enabling more private generative AI",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/3-fun-gemma-project-ideas/",
          "author": null,
          "description": "Use Gemma models to translate an old language, brainstorm game design ideas, and write a letter to Santa.",
          "link": "https://developers.googleblog.com/en/3-fun-gemma-project-ideas/",
          "publishedOn": "2024-09-10T20:16:12.651Z",
          "wordCount": null,
          "title": "3 fun Gemma project ideas",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/get-started-with-gemma-on-ray-on-vertex-ai/",
          "author": null,
          "description": "Use Gemma Supervised tuning on Ray on Vertex AI to train and serve machine learning models efficiently and effectively.",
          "link": "https://developers.googleblog.com/en/get-started-with-gemma-on-ray-on-vertex-ai/",
          "publishedOn": "2024-09-09T20:15:43.369Z",
          "wordCount": null,
          "title": "Get started with Gemma on Ray on Vertex AI",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/gemini-15-flash-updates-google-ai-studio-gemini-api/",
          "author": null,
          "description": "Gemini 1.5 Flash is now available to developers at more than 70% lower prices. Set up billing for Gemini API in Google AI Studio and access other new features like 1.5 Flash tuning.",
          "link": "https://developers.googleblog.com/en/gemini-15-flash-updates-google-ai-studio-gemini-api/",
          "publishedOn": "2024-09-08T20:14:26.686Z",
          "wordCount": null,
          "title": "Gemini 1.5 Flash price drop with tuning rollout complete, and more",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/how-we-built-purrfect-code/",
          "author": null,
          "description": "Purrfect Code is a sokoban style box pushing puzzler Purrfect based on Google tech (Flutter, IDX, FLAME, Firebase) and designed to be playable on web browsers. Open the game in Project IDX, earn badges for each level, and showcase your badges on your Developer Profile.",
          "link": "https://developers.googleblog.com/en/how-we-built-purrfect-code/",
          "publishedOn": "2024-09-08T20:14:26.686Z",
          "wordCount": null,
          "title": "How We Built Purrfect Code: A Puzzle Game for Developers",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/gemma-explained-paligemma-architecture/",
          "author": null,
          "description": "PaliGemma, a lightweight open vision-language model (VLM), is able to take both image and text inputs and produce a text response, adding an additional vision model to the BaseGemma model.",
          "link": "https://developers.googleblog.com/en/gemma-explained-paligemma-architecture/",
          "publishedOn": "2024-09-05T20:15:48.744Z",
          "wordCount": null,
          "title": "Gemma explained: PaliGemma architecture",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/tensorflow-lite-is-now-litert/",
          "author": null,
          "description": "TensorFlow Lite, now named LiteRT, is still the same high-performance runtime for on-device AI, but with an expanded vision to support models authored in PyTorch, JAX, and Keras.",
          "link": "https://developers.googleblog.com/en/tensorflow-lite-is-now-litert/",
          "publishedOn": "2024-09-04T20:15:49.160Z",
          "wordCount": null,
          "title": "TensorFlow Lite is now LiteRT",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/mastering-controlled-generation-with-gemini-15-schema-adherence/",
          "author": null,
          "description": "Controlled Generation for Gemini 1.5 Pro and Flash improves the handoff from data science teams to developers, enhancing the integration of AI output and ensuring AI-generated responses adhere to a defined schema.",
          "link": "https://developers.googleblog.com/en/mastering-controlled-generation-with-gemini-15-schema-adherence/",
          "publishedOn": "2024-09-03T20:15:07.115Z",
          "wordCount": null,
          "title": "Mastering Controlled Generation with Gemini 1.5: Schema Adherence for Developers",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/smaller-safer-more-transparent-advancing-responsible-ai-with-gemma/",
          "author": null,
          "description": "ShieldGemma is a suite of safety content classifiers models built upon Gemma2 designed to keep users safe. GemmaScope is a new model interpretability tool that offers unparalleled insight into our models' inner workings.",
          "link": "https://developers.googleblog.com/en/smaller-safer-more-transparent-advancing-responsible-ai-with-gemma/",
          "publishedOn": "2024-08-31T20:16:02.472Z",
          "wordCount": 1546,
          "title": "Smaller, Safer, More Transparent: Advancing Responsible AI with Gemma",
          "imageUrl": "https://storage.googleapis.com/gweb-developer-goog-blog-assets/images/20240731-Gemma-Blog-ResponsibleAI.2e16d0ba.fill-1200x600.png"
        },
        {
          "id": "https://developers.googleblog.com/en/gemma-explained-recurrentgemma-architecture/",
          "author": null,
          "description": "RecurrentGemma architecture showcases a hybrid model that mixes gated linear recurrences with local sliding window attention; a highly valuable feature when you're concerned about exhausting your LLM's context window.",
          "link": "https://developers.googleblog.com/en/gemma-explained-recurrentgemma-architecture/",
          "publishedOn": "2024-08-29T20:15:19.554Z",
          "wordCount": null,
          "title": "Gemma explained: RecurrentGemma architecture",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/fine-tuning-gemma-2-with-keras-hugging-face-update/",
          "author": null,
          "description": "The next generation of Gemma models is now available in KerasNLP.",
          "link": "https://developers.googleblog.com/en/fine-tuning-gemma-2-with-keras-hugging-face-update/",
          "publishedOn": "2024-08-28T20:15:22.708Z",
          "wordCount": null,
          "title": "Fine-tuning Gemma 2 with Keras - and an update from Hugging Face",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/new-features-for-the-gemini-api-and-google-ai-studio/",
          "author": null,
          "description": "Developers will now be able to give Gemini 1.5 Flash a set of pre-trained data of their own and tune it to improve model performance significantly.",
          "link": "https://developers.googleblog.com/en/new-features-for-the-gemini-api-and-google-ai-studio/",
          "publishedOn": "2024-08-28T20:15:22.708Z",
          "wordCount": null,
          "title": "Gemini 1.5 Pro 2M context window, code execution capabilities, and Gemma 2 are available today",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/bringing-the-io-magic-to-berlin/",
          "author": null,
          "description": "Here are some highlights from what we announced both on stage in Berlin and elsewhere in the world in celebration of this event!",
          "link": "https://developers.googleblog.com/en/bringing-the-io-magic-to-berlin/",
          "publishedOn": "2024-08-28T20:15:22.708Z",
          "wordCount": null,
          "title": "Bringing the I/O magic to Berlin",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/how-we-built-the-io-crossword/",
          "author": null,
          "description": "Adding a helpful twist to a classic crossword puzzle with the power of Flutter, Firebase, and the Gemini API.",
          "link": "https://developers.googleblog.com/en/how-we-built-the-io-crossword/",
          "publishedOn": "2024-08-27T20:16:08.493Z",
          "wordCount": null,
          "title": "How We Built It: The I/O Crossword",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/model-explorer-simplifying-ml-models-for-edge-devices/",
          "author": null,
          "description": "Model Explorer, a new graph visualization tool from Google AI Edge, enables developers to overcome the complexities of optimizing models for edge devices.",
          "link": "https://developers.googleblog.com/en/model-explorer-simplifying-ml-models-for-edge-devices/",
          "publishedOn": "2024-08-27T20:16:08.493Z",
          "wordCount": null,
          "title": "Model Explorer: Simplifying ML models for Edge devices",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/gemma-explained-new-in-gemma-2/",
          "author": null,
          "description": "Gemma 2 is a new suite of open models that sets a new standard for performance and accessibility, outperforming popular models more than twice its size.",
          "link": "https://developers.googleblog.com/en/gemma-explained-new-in-gemma-2/",
          "publishedOn": "2024-08-22T20:15:18.792Z",
          "wordCount": 1310,
          "title": "Gemma explained: What’s new in Gemma 2",
          "imageUrl": "https://storage.googleapis.com/gweb-developer-goog-blog-assets/images/Untitled_1600_x_873_px.2e16d0ba.fill-1200x600.png"
        },
        {
          "id": "https://developers.googleblog.com/en/5-years-of-innovation-student-developers-solving-real-world-problems-using-google-tech/",
          "author": null,
          "description": "Google Developer Student Clubs globally are tackling the United Nations' Sustainable Development Goals",
          "link": "https://developers.googleblog.com/en/5-years-of-innovation-student-developers-solving-real-world-problems-using-google-tech/",
          "publishedOn": "2024-08-21T20:15:16.569Z",
          "wordCount": 1557,
          "title": "5 Years of Innovation: Student developers solving real-world problems using Google tech",
          "imageUrl": "https://storage.googleapis.com/gweb-developer-goog-blog-assets/images/GDSC-Social_1.2e16d0ba.fill-1200x600.png"
        },
        {
          "id": "https://developers.googleblog.com/en/google-url-shortener-links-will-no-longer-be-available/",
          "author": null,
          "description": "Understand how you will be impacted by our decision to turn off the serving portion of Google URL Shortener.",
          "link": "https://developers.googleblog.com/en/google-url-shortener-links-will-no-longer-be-available/",
          "publishedOn": "2024-08-18T20:13:42.773Z",
          "wordCount": null,
          "title": "Google URL Shortener links will no longer be available",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/the-io-journey-continues-in-bengaluru/",
          "author": null,
          "description": "Google's I/O Connect event in Bengaluru highlighted India's contributions to AI and introduced new tools for app development, including AI agents for coding and testing.",
          "link": "https://developers.googleblog.com/en/the-io-journey-continues-in-bengaluru/",
          "publishedOn": "2024-08-17T20:14:16.968Z",
          "wordCount": null,
          "title": "The I/O journey continues in Bengaluru",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/gemma-for-streaming-ml-with-dataflow/",
          "author": null,
          "description": "Use the Gemma language model to gauge customer sentiment, summarize conversations, and assist with crafting responses in near real-time with minimal latency.",
          "link": "https://developers.googleblog.com/en/gemma-for-streaming-ml-with-dataflow/",
          "publishedOn": "2024-08-17T20:14:16.966Z",
          "wordCount": null,
          "title": "Gemma for Streaming ML with Dataflow",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/introducing-genkit-for-go-build-scalable-ai-powered-apps-in-go/",
          "author": null,
          "description": "Genkit for Go is an open source framework for building AI-powered applications in Go. It leverages Go's simplicity, scalability, and security, and is currently in alpha.",
          "link": "https://developers.googleblog.com/en/introducing-genkit-for-go-build-scalable-ai-powered-apps-in-go/",
          "publishedOn": "2024-08-17T20:14:16.966Z",
          "wordCount": null,
          "title": "Introducing Genkit for Go: Build scalable AI-powered apps in Go",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Many But Finite",
      "feedUrl": "https://feeds.feedburner.com/GustavoDuarte",
      "siteUrl": "https://manybutfinite.com/feed.xml",
      "articles": []
    },
    {
      "title": "Krister Walfridsson’s old blog",
      "feedUrl": "http://feeds.feedburner.com/KristerWalfridssonsBlog",
      "siteUrl": "http://kristerw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Python Insider",
      "feedUrl": "https://feeds.feedburner.com/PythonInsider",
      "siteUrl": "https://pythoninsider.blogspot.com/",
      "articles": [
        {
          "id": "https://pythoninsider.blogspot.com/2024/09/python-3130rc2-3126-31110-31015-3920.html",
          "author": null,
          "description": "Hi there!\nPython 3.13.0RC2\nFinal opportunity to test and find any show-stopper bugs before we bless and release 3.13.0 final on October 1st.\nGet it here: Python Release Python 3.13.0rc2 | Python.org\nCall to action\nWe strongly encourage maintainers of third-party Python projects to \nprepare their projects for 3.13 compatibilities during this phase, and \nwhere necessary publish Python 3.13 wheels on PyPI to be ready for the \nfinal release of 3.13.0. Any binary wheels built against Python \n3.13.0rc2 will work with future versions of Python 3.13. As always, \nreport any issues to the Python bug tracker.\nPlease keep in mind that this is a preview release and while it’s as close to the final release as we can get it, its use is not recommended for production environments.\nCore developers: time to…",
          "link": "https://pythoninsider.blogspot.com/2024/09/python-3130rc2-3126-31110-31015-3920.html",
          "publishedOn": "2024-09-07T14:24:00.004Z",
          "wordCount": null,
          "title": "Python 3.13.0RC2, 3.12.6, 3.11.10, 3.10.15, 3.9.20, and 3.8.20 are now available!",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "from pvs-studio.com",
      "feedUrl": "http://feeds.feedburner.com/viva64-blog-en",
      "siteUrl": "https://pvs-studio.com",
      "articles": [
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1160/",
          "author": null,
          "description": "Your attention is invited to the fifth part of an e-book on undefined behavior. This is not a textbook, as it's intended for those who are already familiar with C++ programming. It's a kind of C...",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1160/",
          "publishedOn": "2024-09-11T21:00:00.000Z",
          "wordCount": null,
          "title": "C++ programmer's guide to undefined behavior: part 5 of 11",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/1159/",
          "author": null,
          "description": "Years pass, and projects overgrow dark spots that nobody wants to venture into—they're too tricky and prone to failure. Today, we're diving into refactoring legacy code with OOP. And we're gonna do...",
          "link": "https://pvs-studio.com/en/blog/posts/csharp/1159/",
          "publishedOn": "2024-09-09T21:00:00.000Z",
          "wordCount": null,
          "title": "Time to refactor legacy with OOP",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/1158/",
          "author": null,
          "description": "Welcome to our third news and event digest for the .NET world! The PVS-Studio team is thrilled to bring you the most interesting and useful insights. Let's roll!",
          "link": "https://pvs-studio.com/en/blog/posts/csharp/1158/",
          "publishedOn": "2024-09-03T21:00:00.000Z",
          "wordCount": null,
          "title": ".NET Digest #3",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/1157/",
          "author": null,
          "description": "The concept of clean code is familiar to many people. Some programmers support it, while others think it hurts the industry. Casey Muratori, who's in the second group, stated that clean code is...",
          "link": "https://pvs-studio.com/en/blog/posts/1157/",
          "publishedOn": "2024-08-26T21:00:00.000Z",
          "wordCount": null,
          "title": "Clean code: blessing or curse? Act I. Confrontation",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1156/",
          "author": null,
          "description": "Your attention is invited to the fourth part of an e-book on undefined behavior. This is not a textbook, as it's intended for those who are already familiar with C++ programming. It's a kind of C...",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1156/",
          "publishedOn": "2024-08-22T21:00:00.000Z",
          "wordCount": null,
          "title": "C++ programmer's guide to undefined behavior: part 4 of 11",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Future",
      "feedUrl": "https://future.a16z.com/feed/",
      "siteUrl": "https://future.com/",
      "articles": []
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/feeds/posts/default",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": []
    },
    {
      "title": "Two Cents",
      "feedUrl": "https://hur.substack.com/feed",
      "siteUrl": "https://twocents.hur.xyz",
      "articles": []
    },
    {
      "title": "Interrupt",
      "feedUrl": "https://interrupt.memfault.com/feed.xml",
      "siteUrl": "https://interrupt.memfault.com/",
      "articles": [
        {
          "id": "https://interrupt.memfault.com/blog/august-roundup",
          "author": null,
          "description": "Here are the articles, videos, and tools that we’ve been excited about this\nAugust.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/august-roundup",
          "publishedOn": "2024-09-04T00:00:00.000Z",
          "wordCount": null,
          "title": "What we've been reading in August (2024)",
          "imageUrl": null
        },
        {
          "id": "https://interrupt.memfault.com/blog/memory-debugging",
          "author": null,
          "description": "In this article, we will learn how memory usage patterns can affect the\nreal-time performance of an embedded application, drawing from a recent\nexperience tracing an audio DSP application running on an embedded Linux\nplatform. First, I will introduce the product in question and the real-time\naudio software I developed for it. Then, I’ll describe the issues I encountered\nwith audio callbacks and the strategy I followed to determine the cause of the\nissues, ending with my solution and lessons learned.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/memory-debugging",
          "publishedOn": "2024-08-29T00:00:00.000Z",
          "wordCount": null,
          "title": "How Memory Usage Patterns Can Derail Real-time Performance",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Jay Carlson",
      "feedUrl": "https://jaycarlson.net/feed",
      "siteUrl": "https://jaycarlson.net",
      "articles": []
    },
    {
      "title": "만화로 나누는 자유/오픈소스 소프트웨어 이야기",
      "feedUrl": "https://joone.net/feed/",
      "siteUrl": "https://joone.net",
      "articles": []
    },
    {
      "title": "Kimchi hill",
      "feedUrl": "https://kimchihill.com/feed/",
      "siteUrl": "https://kimchihill.com",
      "articles": [
        {
          "id": "https://kimchihill.com/?p=2773",
          "author": "kimchihill",
          "description": "Tomasz Tunguz’s recent article on selling AI and software struck a chord with me. As AI adoption grows, both buyers and sellers are facing new challenges—especially around scaling and discovery. Below are my thoughts on his key points, based on my live experiences selling the AI chatbot at Sendbird, and how they relate to whatContinue reading \"Tomasz Tunguz’s AI Sales Playbook: Insights from the Field\"\nTomasz Tunguz’s AI Sales Playbook: Insights from the Field appeared first on Kimchi hill.",
          "link": "https://kimchihill.com/2024/09/13/scaling-gen-ai-sales-insights-from-the-field/?utm_source=rss&utm_medium=rss&utm_campaign=scaling-gen-ai-sales-insights-from-the-field",
          "publishedOn": "2024-09-13T11:37:42.000Z",
          "wordCount": null,
          "title": "Tomasz Tunguz’s AI Sales Playbook: Insights from the Field",
          "imageUrl": null
        },
        {
          "id": "https://kimchihill.com/?p=2773",
          "author": "kimchihill",
          "description": "Tomasz Tunguz’s recent article on selling AI and software struck a chord with me. As AI adoption grows, both buyers and sellers are facing new challenges—especially around scaling and discovery. Below are my thoughts on his key points, based on my live experiences selling the AI chatbot at Sendbird, and how they relate to whatContinue reading \"Tomasz Tunguz’s AI Sales Playbook: Insights from the Field\"\nTomasz Tunguz’s AI Sales Playbook: Insights from the Field appeared first on Kimchi hill.",
          "link": "https://kimchihill.com/2024/09/13/scaling-gen-ai-sales/?utm_source=rss&utm_medium=rss&utm_campaign=scaling-gen-ai-sales",
          "publishedOn": "2024-09-13T11:37:42.000Z",
          "wordCount": null,
          "title": "Tomasz Tunguz’s AI Sales Playbook: Insights from the Field",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Kwang Yul Seo",
      "feedUrl": "https://kwangyulseo.com/feed/",
      "siteUrl": "https://kwangyulseo.com",
      "articles": []
    },
    {
      "title": "LimitedResults",
      "feedUrl": "https://limitedresults.com/feed/",
      "siteUrl": "https://limitedresults.com/",
      "articles": []
    },
    {
      "title": "LWN.net",
      "feedUrl": "https://lwn.net/headlines/rss",
      "siteUrl": "https://lwn.net",
      "articles": [
        {
          "id": "https://lwn.net/Articles/990307/",
          "author": "corbet",
          "description": "Linus has released the 6.11 kernel.\n\"I'm once again on the road and not in my normal timezone, but it's\nSunday afternoon here in Vienna, and 6.11 is out.\"\nSignificant changes in this release include\nnew io_uring operations for bind() and listen(),\nthe nested bottom-half locking patches,\nthe ability to write to busy executable\nfiles,\nsupport for writing block drivers in Rust,\nsupport for atomic write operations in the\nblock layer,\nthe dedicated bucket slab allocator,\nthe vDSO implementation of getrandom(),\nand more.  See the LWN merge-window summaries\n(part 1,\npart 2) for more information.",
          "link": "https://lwn.net/Articles/990307/",
          "publishedOn": "2024-09-15T15:32:08.000Z",
          "wordCount": null,
          "title": "The 6.11 kernel has been released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/990270/",
          "author": "jzb",
          "description": "The GNOME Foundation has announced\nthat it is looking for a new Executive Director following the departure of Holly Million\nin July:\nThe window of opportunity for the job is closing quickly,\napplications are due by September 20.",
          "link": "https://lwn.net/Articles/990270/",
          "publishedOn": "2024-09-13T19:08:12.000Z",
          "wordCount": null,
          "title": "GNOME Foundation opens search for new Executive Director",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/990264/",
          "author": "jzb",
          "description": "Germany's Sovereign\nTech Fund (STF) has agreed to invest €688,800\nto improve the security, stability, and functionality of Samba. The investment will take\nplace over three years and will be managed by SerNet, a company that\nemploys several Samba core developers and offers support for\nSamba. According to its announcement,\nwork has already begun and is expected to complete in 2026:\n\n\nThe project's focus is on areas like transparent failover, SMB3 UNIX\nextensions, and modern security protocols such as SMB over QUIC. These\nimprovements are designed to ensure that Samba remains a robust and\nsecure solution for organizations that rely on a sovereign IT\ninfrastructure that is as independent as possible of proprietary\nsoftware regimes, but including optimal interoperability.",
          "link": "https://lwn.net/Articles/990264/",
          "publishedOn": "2024-09-13T17:47:27.000Z",
          "wordCount": null,
          "title": "Sovereign Tech Fund (STF) to invest in Samba improvements",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/988638/",
          "author": "corbet",
          "description": "Read-copy-update (RCU) is a synchronization mechanism that was added to the\nLinux kernel in October 2002.  RCU is most frequently used as a replacement\nfor reader-writer locking, but is also used in a\nnumber of other ways.  This article covers recent changes to the RCU\nAPI; it was contributed by Paul McKenney, Boqun Feng, Frederic Weisbecker,\nJoel Fernandes, Neeraj Upadhyay, and Uladzislau Rezki.",
          "link": "https://lwn.net/Articles/988638/",
          "publishedOn": "2024-09-13T15:50:49.000Z",
          "wordCount": null,
          "title": "[$] The RCU API, 2024 edition",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/990202/",
          "author": "jzb",
          "description": "Security updates have been issued by Fedora (haproxy, osc, and python3.11), Oracle (389-ds:1.4), Red Hat (kernel), SUSE (clamav, colord, kernel, postgresql16, and qemu), and Ubuntu (linux, linux-aws, linux-aws-5.15, linux-gcp, linux-gcp-5.15, linux-gke, linux-gkeop, linux-gkeop-5.15, linux-hwe-5.15, linux-ibm, linux-intel-iotg, linux-intel-iotg-5.15, linux-kvm, linux-nvidia, linux-oracle, linux-raspi, linux-azure, linux-azure-5.15, linux-azure-fde, linux-lowlatency-hwe-6.8, linux-nvidia-6.8, and linux-xilinx-zynqmp).",
          "link": "https://lwn.net/Articles/990202/",
          "publishedOn": "2024-09-13T13:45:36.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/990125/",
          "author": "jzb",
          "description": "Version\n7.1.0 of the VirtualBox virtualization system has been\nreleased. Changes include a major GUI update, a new Network Address\nTranslation (NAT) engine with IPv6 support, shared clipboard support on Wayland, and more.",
          "link": "https://lwn.net/Articles/990125/",
          "publishedOn": "2024-09-12T21:42:31.000Z",
          "wordCount": null,
          "title": "VirtualBox 7.1.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989055/",
          "author": "jzb",
          "description": "Debian does not have an official way to configure\nnetworking. Instead, it has four\nrecommended ways to configure networking, one of which is the\nvenerable ifupdown, which\nhas been part of Debian since the turn of the century and is showing its\nage. A conversation about its maintainability and possible replacement with ifupdown‑ng has\nled to discussions about the default network-management tools for\nDebian \"trixie\"\n(Debian 13, which is expected in 2025) and beyond. No route to consensus\nhas been found, yet.",
          "link": "https://lwn.net/Articles/989055/",
          "publishedOn": "2024-09-12T15:55:50.000Z",
          "wordCount": null,
          "title": "[$] Debating ifupdown replacements for Debian trixie",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/990043/",
          "author": "jake",
          "description": "Greg Kroah-Hartman has announced the release of seven new stable kernels:\n6.10.10, 6.6.51, 6.1.110, 5.15.167, 5.10.226 5.4.284, and 4.19.322.  As usual, they all contain lots of\nimportant fixes throughout the kernel tree.",
          "link": "https://lwn.net/Articles/990043/",
          "publishedOn": "2024-09-12T15:25:44.000Z",
          "wordCount": null,
          "title": "New stable kernels released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/990040/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (chromium and redis), Fedora (nextcloud, python3.10, python3.13, python3.6, vim, and wolfssl), Mageia (expat, libpcap, and microcode), Oracle (dovecot, kernel, and kernel-container), Red Hat (kernel and krb5), SUSE (389-ds, colord, containerd, curl, expat, glib2, go1.22, go1.23, kernel, libpcap, postgresql16, and runc), and Ubuntu (expat, libxmltok, linux, linux-aws, linux-azure, linux-bluefield, linux-gcp, linux-gkeop, linux-ibm, linux-kvm, linux-oracle, linux, linux-aws, linux-gcp, linux-gke, linux-ibm, linux-lowlatency, linux-oem-6.8, linux-oracle, linux-aws-5.4, linux-azure-5.4, linux-gcp-5.4, linux-hwe-5.4, linux-ibm-5.4, linux-oracle-5.4, linux-raspi-5.4, linux-azure, linux-iot, linux-nvidia, linux-nvidia-lowlatency, python-setuptools, setuptools, tiff, and unbound).",
          "link": "https://lwn.net/Articles/990040/",
          "publishedOn": "2024-09-12T15:08:38.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/988984/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for September 12, 2024 is available.",
          "link": "https://lwn.net/Articles/988984/",
          "publishedOn": "2024-09-12T01:16:55.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for September 12, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/988894/",
          "author": "jake",
          "description": "The Python community has been roiled, to a certain extent, by an action\ntaken by\nthe steering council (SC): the three-month suspension\nof a unnamed—weirdly—Python core developer.  Tim Peters is the developer\nin question, as he has acknowledged,\nthough it could easily be deduced from the SC message. Peters has been\ninvolved in the\nproject from its early days and, among many other things, is the author of\nPEP 20 (\"The Zen of\nPython\").  The suspension was due to violations of the project's code of\nconduct that stem from the discussion around a somewhat controversial set\nof proposed changes to the bylaws for the Python Software Foundation\n(PSF) back in mid-June.",
          "link": "https://lwn.net/Articles/988894/",
          "publishedOn": "2024-09-11T16:09:54.000Z",
          "wordCount": null,
          "title": "[$] A mess in the Python community",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989772/",
          "author": "jzb",
          "description": "Security updates have been issued by AlmaLinux (389-ds:1.4, dovecot, emacs, and glib2), Fedora (bluez, iwd, libell, linux-firmware, seamonkey, vim, and wireshark), Mageia (apr, libtiff, Nginx, openssl, orc, unbound, webmin, and zziplib), Red Hat (389-ds:1.4), and SUSE (containerd, curl, go1.22, go1.23, gstreamer-plugins-bad, kernel, ntpd-rs, python-Django, and python311).",
          "link": "https://lwn.net/Articles/989772/",
          "publishedOn": "2024-09-11T13:34:33.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989660/",
          "author": "jzb",
          "description": "Version\n3.4 of the Pandoc\ndocument-conversion tool has been released. Notable changes in this\nrelease include a new ANSI output format (for console output), a switch to  WeasyPrint as the PDF engine for\nHTML to PDF conversion, the ability to position captions\nabove or below tables and figures, and much more.",
          "link": "https://lwn.net/Articles/989660/",
          "publishedOn": "2024-09-10T18:43:32.000Z",
          "wordCount": null,
          "title": "Pandoc 3.4 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989272/",
          "author": "corbet",
          "description": "CPU scheduling is a challenging job; since it inherently requires making\nguesses about what the demands on the system will be in the future, it\nremains reliant on heuristics, despite ongoing efforts to remove them.\nSome of those heuristics take special note of tasks that are (or appear to\nbe) waiting for fast I/O operations.  There is some unhappiness, though,\nwith how this factor is used, leading to a couple of patches taking rather\ndifferent approaches to improve the situation.",
          "link": "https://lwn.net/Articles/989272/",
          "publishedOn": "2024-09-10T13:48:08.000Z",
          "wordCount": null,
          "title": "[$] The trouble with iowait",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989605/",
          "author": "corbet",
          "description": "Version 1.0\nof the Radicle development platform has been released.\n\n\n\tRadicle 1.0 represents the culmination of years of experimentation\n\tand hard work from our team and community, where we set out to\n\tensure that free and open source software ecosystems can flourish\n\twithout having to rely on the whims of Big Tech. We designed\n\tRadicle with a first-principles approach, as a natural extension to\n\tGit, expanding it to work in a collaborative, local-first,\n\tpeer-to-peer setting.\n\n\nLWN looked at Radicle in March.",
          "link": "https://lwn.net/Articles/989605/",
          "publishedOn": "2024-09-10T13:33:01.000Z",
          "wordCount": null,
          "title": "Radicle 1.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989602/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (cacti), Fedora (aardvark-dns, expat, and firefox), Mageia (ffmpeg, ntfs-3g, and vim), Oracle (emacs, glib2, java-11-openjdk, and qt5-qtbase), Red Hat (emacs, python-setuptools, python3.11, python3.11-setuptools, python3.12-setuptools, python3.9, and python39:3.9), Slackware (netatalk), SUSE (buildah, expat, java-1_8_0-ibm, kanidm, kernel, and postgresql16), and Ubuntu (netty, php7.0, php7.2, tiff, and webkit2gtk).",
          "link": "https://lwn.net/Articles/989602/",
          "publishedOn": "2024-09-10T12:55:10.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989517/",
          "author": "jzb",
          "description": "Version\n0.9.0 of Redox OS,\nan open-source, Unix-like operating system written in\nRust, has been released. Notable changes in this release include\nperformance and stability improvements, better management of physical\nand virtual memory, bootloader improvements, and more. It also brings\nsupport for RustPython, Perl 5, Simple HTTP Server, the addition of\nseveral applications including GNU Nano, Helix, and the COSMIC\nFiles, Editor, and Terminal applications. See the changelog\nsection of the announcement for a full list of changes in the release.",
          "link": "https://lwn.net/Articles/989517/",
          "publishedOn": "2024-09-09T19:09:33.000Z",
          "wordCount": null,
          "title": "Redox OS 0.9.0",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987548/",
          "author": "jake",
          "description": "Many projects struggle with attracting and retaining contributors; Debian\nis no different in that regard.  At DebConf24, Carlos Henrique Lima\nMelara and Lucas Kanashiro gave a presentation about efforts that the\nBrazilian Debian community has made to increase participation.  Their ideas\nand the lessons\nlearned can be applied more widely, both for other Debian communities and\nfor other projects.",
          "link": "https://lwn.net/Articles/987548/",
          "publishedOn": "2024-09-09T16:31:25.000Z",
          "wordCount": null,
          "title": "[$] Attracting and retaining Debian contributors",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989489/",
          "author": "corbet",
          "description": "Jacob Adams wanders into\nthe kernel's hibernation code:\n\n\n\tHow does Linux move from an awake machine to a hibernating one? How\n\tdoes it then manage to restore all state? These questions led me to\n\tread way too much C in trying to figure out how this particular\n\thardware/software boundary is navigated.",
          "link": "https://lwn.net/Articles/989489/",
          "publishedOn": "2024-09-09T14:20:52.000Z",
          "wordCount": null,
          "title": "Adams: Linux's bedtime routine",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989488/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (amanda, aom, bluez, python-jwcrypto, and thunderbird), Fedora (chromium, firefox, and thunderbird), Red Hat (bubblewrap and flatpak, containernetworking-plugins, flatpak, and runc), Slackware (python3), SUSE (apache2, bubblewrap and flatpak, postgresql16, and wireshark), and Ubuntu (thunderbird).",
          "link": "https://lwn.net/Articles/989488/",
          "publishedOn": "2024-09-09T14:17:33.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989426/",
          "author": "corbet",
          "description": "Linus has released 6.11-rc7 for testing.\n\n\n\tAnd I wish I could say that things have calmed down, but I can't\n\treally say that. In fact, rc7 is slightly bigger than both rc6 and\n\trc5 were, both in number of commits, and in actual diff\n\tsize. That's not really how it should work out.\n\n\tThat said, there's nothing *scary* in here. \n\n\nHe is apparently \"still waffling\" about whether to release 6.11 next\nweekend, which would cause the 6.12 merge window to land on top of the\nMaintainers Summit, Linux Plumbers Conference, and Open Source Summit.",
          "link": "https://lwn.net/Articles/989426/",
          "publishedOn": "2024-09-08T22:33:28.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.11-rc7",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989409/",
          "author": "corbet",
          "description": "The\n6.10.9,\n6.6.50, and\n6.1.109\nstable kernel updates have been released; each contains another set of\nimportant fixes.",
          "link": "https://lwn.net/Articles/989409/",
          "publishedOn": "2024-09-08T16:08:56.000Z",
          "wordCount": null,
          "title": "Three weekend stable kernels",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987319/",
          "author": "jzb",
          "description": "Code review is in high demand, and short supply, for most open-source projects.\nReviewer time is precious, so any tool that can lighten the load is worth exploring.\nThat is why Jesse Brandeburg and Kamel Ayari decided to test whether\ntools like ChatGPT could review patches to provide quick feedback to\ncontributors about common problems. In a\ntalk at the Netdev 0x18 conference this July, Brandeburg provided an overview of an\nexperiment using machine learning to review emails containing patches\nsent to the netdev\nmailing list. Large-language models (LLMs) will not be replacing human reviewers anytime\nsoon, but they may be a useful addition to help humans focus on deeper\nreviews instead of simple rule violations.",
          "link": "https://lwn.net/Articles/987319/",
          "publishedOn": "2024-09-06T19:16:51.000Z",
          "wordCount": null,
          "title": "[$] Testing AI-enhanced reviews for Linux patches",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989229/",
          "author": "jzb",
          "description": "The NGINX team has announced\nthat official NGINX open-source development has moved away from\nMercurial to GitHub, and\nthe project will now be taking contributions\nin the form of pull requests:\nAdditionally, starting today, we will begin accepting bugs reports,\nfeature requests and enhancements directly through GitHub, under the\n\"Issues\" tab. Moreover, we've moved our community forums to the GitHub\n\"Discussions\" area, where you will now be able\nto engage in conversation, ask, and answer questions.\n[...] We understand that changes like these may require adjustment,\nso to give you more time, we will continue accepting patches and\nprovide community support via mailing lists until December 31st, 2024.",
          "link": "https://lwn.net/Articles/989229/",
          "publishedOn": "2024-09-06T17:00:40.000Z",
          "wordCount": null,
          "title": "NGINX has moved to Github",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989215/",
          "author": "corbet",
          "description": "Alejandro Colomar, who has been maintaining the Linux man pages for the\nlast four years, has announced\nthat he will have to stop that work.\n\n\n\t I've been doing it in my free time, and no company has sponsored\n\t that work at all.  At the moment, I cannot sustain this work\n\t economically any more, and will temporarily and indefinitely stop\n\t working on this project.  If any company has interests in the\n\t future of the project, I'd welcome an offer to sponsor my work\n\t here; if so, please let me know.",
          "link": "https://lwn.net/Articles/989215/",
          "publishedOn": "2024-09-06T14:34:47.000Z",
          "wordCount": null,
          "title": "Man pages maintenance suspended",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989212/",
          "author": "corbet",
          "description": "Work on realtime preemption for the Linux kernel got its start almost exactly 20 years ago\n(though it had its roots in earlier work, of course).  It is fair to say\nthat finishing that job has taken a bit longer than anybody involved would\nhave expected.  Now, though, Sebastian Andrzej Siewior has posted a brief\npatch series making it possible to enable realtime preemption in the\nmainline kernel on three architectures.\n\n\n\tWith the printk bits merged, PREEMPT_RT could be enabled on X86,\n\tARM64 and Risc-V. These three architectures merged required changes\n\tover the years leaving me in a position where I have no essential\n\tchanges in the queue that would affect them.\n\n\nCongratulations are due to the many developers who have worked on this\nproject for the last two decades.",
          "link": "https://lwn.net/Articles/989212/",
          "publishedOn": "2024-09-06T14:28:14.000Z",
          "wordCount": null,
          "title": "The realtime preemption end game — for real this time",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989196/",
          "author": "corbet",
          "description": "Security updates have been issued by AlmaLinux (bubblewrap, flatpak), Debian (libxml2), Fedora (lua-mpack, mingw-python3, python-django, python-django4.2, python3.11, python3.13, and python3.9), Oracle (bubblewrap, flatpak), Red Hat (fence-agents, python-urllib3, resource-agents, and wget), Slackware (expat and mozilla), SUSE (buildah, chromium, firefox, gradle, java-1_8_0-ibm, kubernetes1.26, postgresql16, python-Django, python312-pip, and systemd), and Ubuntu (python-aiohttp).",
          "link": "https://lwn.net/Articles/989196/",
          "publishedOn": "2024-09-06T13:25:58.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989106/",
          "author": "corbet",
          "description": "Version\n1.81.0 of the Rust language has been released.  Changes include the\nstabilization of the Error trait in core, some new sort\nalgorithms, some linting improvements, and more.",
          "link": "https://lwn.net/Articles/989106/",
          "publishedOn": "2024-09-05T17:48:50.000Z",
          "wordCount": 247,
          "title": "Rust 1.81.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/988401/",
          "author": "daroc",
          "description": "OpenSnitch is an\n\"interactive application firewall\". Like other firewalls, it uses a\nseries of rules to decide what network traffic should be permitted. Unlike\nmany other firewalls, though, OpenSnitch does not ask the user to create a list of rules\nahead of time. Instead, the list of rules can be built up\nincrementally as applications make connections — and the user can peruse both\nthe rules that have built up over time, and statistics on the connections that\nhave been attempted.",
          "link": "https://lwn.net/Articles/988401/",
          "publishedOn": "2024-09-05T15:23:02.000Z",
          "wordCount": null,
          "title": "[$] Application monitoring with OpenSnitch",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989047/",
          "author": "corbet",
          "description": "Version 4.21.0 of the Samba Windows interoperability suite has been\nreleased.  Changes include some authentication hardening, a number of LDAP\nimprovements, per-user and per-group veto and hide files, group-managed\nservice accounts, and quite a bit more.",
          "link": "https://lwn.net/Articles/989047/",
          "publishedOn": "2024-09-05T14:19:35.000Z",
          "wordCount": 3099,
          "title": "Samba 4.21.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/989046/",
          "author": "jake",
          "description": "Security updates have been issued by AlmaLinux (bubblewrap and flatpak, containernetworking-plugins, fence-agents, ghostscript, krb5, orc, podman, python3.11, python3.9, resource-agents, runc, and wget), Debian (chromium, cinder, glance, gnutls28, nova, nsis, python-oslo.utils, ruby-sinatra, and setuptools), Fedora (kernel), Oracle (bubblewrap and flatpak, buildah, containernetworking-plugins, fence-agents, ghostscript, gvisor-tap-vsock, kernel, krb5, libndp, nodejs:18, orc, podman, postgresql, python-urllib3, python3.11, python3.12, python3.9, runc, skopeo, and wget), SUSE (hdf5, netcdf, trilinos), and Ubuntu (firefox, imagemagick, ironic, openssl, python-django, vim, and znc).",
          "link": "https://lwn.net/Articles/989046/",
          "publishedOn": "2024-09-05T14:11:29.000Z",
          "wordCount": 399,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987605/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for September 5, 2024 is available.",
          "link": "https://lwn.net/Articles/987605/",
          "publishedOn": "2024-09-05T00:48:55.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for September 5, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/988862/",
          "author": "corbet",
          "description": "The call for candidates\nhas gone out for the 2024 election of members of the Linux Foundation\nTechnical Advisory Board:\n\n\n\tThe TAB exists to provide advice from the kernel community to the\n\tLinux Foundation and holds a seat on the LF's board of directors;\n\tit also serves to facilitate interactions both within the community\n\tand with outside entities.  Over the last year, the TAB has\n\toverseen the organization of the Linux Plumbers Conference, advised\n\ton the setup of the kernel CVE numbering authority, worked behind\n\tthe scenes to help resolve a number of contentious community\n\tdiscussions, worked with the Linux Foundation on community\n\tconference planning, and more.\n\n\nNominations are due by September 20.",
          "link": "https://lwn.net/Articles/988862/",
          "publishedOn": "2024-09-04T18:43:20.000Z",
          "wordCount": null,
          "title": "Call for candidates for the 2024 Linux Foundation TAB election",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/988837/",
          "author": "jzb",
          "description": "Version 4.0 of the Tellico collection-management\nsoftware has been released. This is the first release to use the\nKDE Frameworks 6 and Qt6 libraries, with a fallback\navailable for Frameworks 5 and Qt5. Other notable changes in 4.0\ninclude importing video collections from file metadata and correctly\nimporting multi-disc album data from Discogs, MusicBrainz, and iTunes. Users\nof prior versions are advised to make a backup of their data before upgrading.",
          "link": "https://lwn.net/Articles/988837/",
          "publishedOn": "2024-09-04T17:34:17.000Z",
          "wordCount": null,
          "title": "Tellico 4.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/988438/",
          "author": "corbet",
          "description": "Much of the early Rust code for the kernel has taken the form of\nreimplementations of existing drivers as a proof of concept.  One project,\nthough, is entirely new: the driver for Apple GPUs written by Asahi Lina.\nThis driver has shipped with Asahi\nLinux for some time and, by many accounts, is stable, usable, and a\nshining example of how Rust can be used in a complex kernel subsystem.\nThat driver remains outside of the mainline kernel, though, and merging\ncurrently looks like a distant prospect.  The reasons for that state of\naffairs highlight some of the difficulties inherent in integrating a new\nlanguage (and its associated development style) into the Linux kernel.",
          "link": "https://lwn.net/Articles/988438/",
          "publishedOn": "2024-09-04T13:56:08.000Z",
          "wordCount": null,
          "title": "[$] Whither the Apple AGX graphics driver?",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/988747/",
          "author": "jzb",
          "description": "The 6.10.8, 6.6.49, 6.1.108, 5.15.166, 5.10.225, 5.4.283, and 4.19.321 stable kernel updates have all\nbeen released. As usual, they contain important fixes throughout the\ntree. Users of those kernels should upgrade.",
          "link": "https://lwn.net/Articles/988747/",
          "publishedOn": "2024-09-04T13:00:24.000Z",
          "wordCount": null,
          "title": "Seven stable kernel updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/988746/",
          "author": "jzb",
          "description": "Security updates have been issued by AlmaLinux (buildah, gvisor-tap-vsock, nodejs:18, python-urllib3, and skopeo), Debian (firefox-esr and openssl), Fedora (apr and seamonkey), Red Hat (podman), Slackware (mozilla and seamonkey), SUSE (bubblewrap and flatpak, buildah, docker, dovecot23, ffmpeg, frr, go1.21-openssl, graphviz, java-1_8_0-openj9, kubernetes1.26, kubernetes1.27, kubernetes1.28, openssl-1_0_0, openssl-3, perl-DBI, python-aiohttp, python-Django, python-WebOb, thunderbird, tiff, ucode-intel, unbound, webkit2gtk3, and xen), and Ubuntu (drupal7 and twisted).",
          "link": "https://lwn.net/Articles/988746/",
          "publishedOn": "2024-09-04T12:51:09.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/988607/",
          "author": "jzb",
          "description": "Version\n130.0 of the Firefox browser has been released. Notable in this\nrelease is the addition of a Firefox Labs tab in Firefox\nSettings. This allows users to easily enable experimental features,\nsuch as the ability to translate selected text portions to different\nlanguages after a full-page translation, and add\nan AI chatbot to the sidebar. Firefox 130 also addresses several\nsecurity issues, adds 11 new languages to its translation support,\nand more.",
          "link": "https://lwn.net/Articles/988607/",
          "publishedOn": "2024-09-03T16:49:50.000Z",
          "wordCount": null,
          "title": "Firefox 130.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987315/",
          "author": "jzb",
          "description": "One of the joys of writing about technology is the opportunity to\ncover interesting talks on open‑source and free‑software topics. One\nof the pains is creating transcriptions of said talks, or continually\nreferring back to a recording, to be able to write about\nthem. Speech Note is an\nopen-source application that uses machine-learning models, running locally, to\ntranslate speech to text and take the pain out of transcription. It\nalso handles text to speech, and language translations. While not\nperfect, its transcriptions are better than one might expect, even when\nhandling jargon, accents, and less-than-perfect audio.",
          "link": "https://lwn.net/Articles/987315/",
          "publishedOn": "2024-09-03T15:11:06.000Z",
          "wordCount": null,
          "title": "[$] Transcribing audio with AI using Speech Note",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/988570/",
          "author": "corbet",
          "description": "Security updates have been issued by AlmaLinux (python3.12), Debian (calibre, exfatprogs, frr, git, libtommath, nbconvert, ruby-nokogiri, ruby-tzinfo, and webkit2gtk), Fedora (flatpak, lua-mpack, and python3.12), Red Hat (389-ds-base, 389-ds:1.4, buildah, fence-agents, gvisor-tap-vsock, httpd:2.4, kernel, kernel-rt, nodejs:18, orc, postgresql, postgresql:12, postgresql:13, postgresql:15, python-urllib3, python3.12, and skopeo), SUSE (389-ds, bubblewrap and flatpak, cacti, cacti-spine, curl, glib2, kernel-firmware, libqt5-qt3d, libqt5-qtquick3d, opera, python39, qemu, unbound, xen, and zziplib), and Ubuntu (ffmpeg, linux-raspi-5.4, and python-webob).",
          "link": "https://lwn.net/Articles/988570/",
          "publishedOn": "2024-09-03T13:44:23.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987176/",
          "author": "jzb",
          "description": "At this year's GUADEC in Denver, Colorado, Behdad Esfahbod and Matthias Clasen\npresented a two-part talk on a topic that's deeply important to desktop\nenvironments: fonts. Esfahbod covered advances in font\ntechnology that are making their way to becoming standards, and Clasen briefly\ndiscussed improvements in GTK text rendering. The talk presented some\nfascinating insights into the problems around accurately rendering\nwriting systems on the desktop, and where font technologies may be\ngoing in the near future.",
          "link": "https://lwn.net/Articles/987176/",
          "publishedOn": "2024-09-02T15:34:03.000Z",
          "wordCount": null,
          "title": "[$] Advances in font technology and GTK text rendering",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/988364/",
          "author": "jake",
          "description": "Security updates have been issued by AlmaLinux (postgresql:16), Debian (dovecot, pymatgen, ruby2.7, systemd, and webkit2gtk), Fedora (microcode_ctl, python3.11, vim, and xen), Oracle (kernel, postgresql:12, postgresql:13, postgresql:15, and python39:3.9 and python39-devel:3.9), Slackware (libpcap), SUSE (cacti, cacti-spine, python-Django, and trivy), and Ubuntu (dovecot).",
          "link": "https://lwn.net/Articles/988364/",
          "publishedOn": "2024-09-02T14:23:22.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/988184/",
          "author": "corbet",
          "description": "Linus has released 6.11-rc6 for testing.\n\"Things look pretty normal, although we have perhaps unusually many\nfilesystem fixes here, spread out over smb, xfs, bcachefs and netfs.\"",
          "link": "https://lwn.net/Articles/988184/",
          "publishedOn": "2024-09-01T14:09:12.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.11-rc6",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987892/",
          "author": "jzb",
          "description": "Reading an established open-source project's developer mailing list\nmay leave new contributors wishing they had a decoder ring. Greg\nSabino Mullane has written up a valuable explainer\nfor those new to the PostgreSQL hackers (pgsql-hackers)\nmailing list that may also be useful for decoding other lists as well:\nThe mailing lists are full of acronyms and jargon that might not be\nfamiliar to younger people who did not grow up on email (although text\nmessages have inherited many of the abbreviations). If you are a\nnon-native English speaker, or under the age of 30, or not steeped in\nthe world of tech, I offer some solutions below.\nTo do this, I downloaded the last year's worth of hackers email,\nwrote a program to strip out all the non-human stuff (headers, code\nblocks, attachments, etc.), and then did some data analysis on the\nresults.",
          "link": "https://lwn.net/Articles/987892/",
          "publishedOn": "2024-08-30T15:38:07.000Z",
          "wordCount": null,
          "title": "Understanding the Postgres Hackers Mailing List Language",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987566/",
          "author": "corbet",
          "description": "Here is a piece of advice for anybody wanting an easy and frustration-free\nlife: do not run your own email system.  While there numerous advantages to\nkeeping some control over your communications, there is also a long list of\nthings that can go wrong.  A recent failure of spam filtering on the LWN\nemail system illustrated one of those ways, as well as shining a light on\nhow even a seemingly independent email system is tied to other services\nacross the net.",
          "link": "https://lwn.net/Articles/987566/",
          "publishedOn": "2024-08-30T14:48:21.000Z",
          "wordCount": null,
          "title": "[$] A SpamAssassin surprise",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987850/",
          "author": "corbet",
          "description": "Back in 2021, the ElasticSearch search engine and Kibana visualization\nplatform were relicensed under the non-free\nServer Side Public License (SSPL).  Now, Elastic (the company owning those\nprojects) has announced\nthat those projects will also be distributable under the Affero GPL license.\n\n\n\tWe never stopped believing and behaving like an open source\n\tcommunity after we changed the license. But being able to use the\n\tterm Open Source, by using AGPL, an OSI approved license, removes\n\tany questions, or fud, people might have.",
          "link": "https://lwn.net/Articles/987850/",
          "publishedOn": "2024-08-30T14:07:55.000Z",
          "wordCount": null,
          "title": "ElasticSearch and Kibana become free software (again)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987849/",
          "author": "corbet",
          "description": "Dave Airlie makes\nan analogy between the stages of road building and those of adding Rust\nto the Linux kernel.\n\n\n\tFor the wayfinders the process of interacting with maintainers is\n\tfrustrating and slow, and they don't enjoy it as much as\n\twayfinding, and because they still only care about the hotel at the\n\tend, when a maintainer gets into the details of their particular\n\tintersection they don't want to do anything but go stay in their\n\thotel. \n\n\tThe road will get built, it will get traffic on it. There will be\n\ttunnels where we should have intersections, there will be bridges\n\tthat need to be built from both sides, but I do think it will get\n\tbuilt.",
          "link": "https://lwn.net/Articles/987849/",
          "publishedOn": "2024-08-30T13:55:30.000Z",
          "wordCount": null,
          "title": "Airlie: On Rust, Linux, developers, maintainers",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987847/",
          "author": "corbet",
          "description": "The venerable AnandTech site has announced\nits closing after 27 years of technology-industry coverage.\n\n\n\tStill, few things last forever, and the market for written tech\n\tjournalism is not what it once was – nor will it ever be again. So,\n\tthe time has come for AnandTech to wrap up its work, and let the\n\tnext generation of tech journalists take their place within the\n\tzeitgeist.\n\n\nThe site will surely be missed.",
          "link": "https://lwn.net/Articles/987847/",
          "publishedOn": "2024-08-30T13:50:20.000Z",
          "wordCount": null,
          "title": "AnandTech shuts down",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987836/",
          "author": "jzb",
          "description": "Security updates have been issued by AlmaLinux (libvpx, postgresql, postgresql:12, postgresql:13, postgresql:15, and python39:3.9 and python39-devel:3.9), Debian (chromium and ghostscript), Fedora (python3.13), and SUSE (chromium and podman).",
          "link": "https://lwn.net/Articles/987836/",
          "publishedOn": "2024-08-30T12:43:20.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987715/",
          "author": "jzb",
          "description": "The KDE project plans to directly\nask for donations in the Plasma desktop starting with version\n6.2. According to this\nblog post by Nate Graham, users will see a\nsystem notification once per year (in December) asking for a\ndonation to the non-profit KDE e.V.:\n\n\nNow, I know that messages like this can be controversial! The\nchange was carefully considered, and we tried our best to minimize\nthe annoying-ness factor: It's small and unobtrusive, and no matter\nwhat you do with it (click any button, close it, etc) it'll go away\nuntil next year. It's implemented as a KDE Daemon (KDED) module,\nwhich allows users and distributors to permanently disable it if they\nlike.",
          "link": "https://lwn.net/Articles/987715/",
          "publishedOn": "2024-08-29T19:09:35.000Z",
          "wordCount": null,
          "title": "Graham: Asking for donations in Plasma",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987700/",
          "author": "jzb",
          "description": "Version 5.0.0 of GNU Screen has\nbeen released. Notable changes in this release include\nnew commands for authentication, input into multiple windows at the\nsame time, and to turn on/off truecolor support.",
          "link": "https://lwn.net/Articles/987700/",
          "publishedOn": "2024-08-29T18:11:26.000Z",
          "wordCount": null,
          "title": "GNU Screen v.5.0.0 is released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987677/",
          "author": "jake",
          "description": "Greg Kroah-Hartman has announced the release of the 6.10.7, 6.6.48, and 6.1.107 stable kernels.  They all contain\nimportant fixes throughout the kernel tree, as is the norm.",
          "link": "https://lwn.net/Articles/987677/",
          "publishedOn": "2024-08-29T16:18:31.000Z",
          "wordCount": null,
          "title": "Three new stable kernels",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986899/",
          "author": "jake",
          "description": "Plasma Mobile is an open-source\nuser interface for mobile devices, developed by the KDE community. It's\nbuilt on the same foundations as Plasma Desktop, including KDE Frameworks and the KWin window\nmanager. Much like its desktop counterpart, Plasma Mobile caters to\nadvanced users by offering extensive customizability. It is offered as an\noption on phones with various mobile Linux\ndistributions.",
          "link": "https://lwn.net/Articles/986899/",
          "publishedOn": "2024-08-29T15:11:39.000Z",
          "wordCount": null,
          "title": "[$] Plasma Mobile for highly configurable Linux phones",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987664/",
          "author": "jake",
          "description": "Security updates have been issued by AlmaLinux (bind and bind-dyndb-ldap and postgresql:16), Fedora (less and python3.6), Mageia (nodejs & yarnpkg), Oracle (libvpx and postgresql:16), Red Hat (edk2, git, kernel, openldap, postgresql:15, postgresql:16, python3, and python39:3.9 and python39-devel:3.9), SUSE (apache2, python-setuptools, and python3-setuptools), and Ubuntu (linux-oracle).",
          "link": "https://lwn.net/Articles/987664/",
          "publishedOn": "2024-08-29T14:33:29.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987635/",
          "author": "corbet",
          "description": "Wedson Almeida Filho, one of the key developers driving the Rust-for-Linux project, has retired from the\nproject.\n\n\n\t After almost 4 years, I find myself lacking the energy and\n\t enthusiasm I once had to respond to some of the nontechnical\n\t nonsense, so it's best to leave it up to those who still have it\n\t in them.\n\n\nAs an example of the sort of \"nonsense\" he referred to, he provided a link to the video from the\nRust for filesystems discussion at the 2024\nLinux Storage, Filesystem, Memory-Management, and BPF Summit.  His work was\nfundamental to getting the project as far as it has come; he will be missed.",
          "link": "https://lwn.net/Articles/987635/",
          "publishedOn": "2024-08-29T14:07:26.000Z",
          "wordCount": null,
          "title": "Rust-for-Linux developer Wedson Almeida Filho drops out",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986853/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for August 29, 2024 is available.",
          "link": "https://lwn.net/Articles/986853/",
          "publishedOn": "2024-08-29T01:41:41.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for August 29, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987238/",
          "author": "jake",
          "description": "Immutable data makes concurrent access easier, since it\neliminates the data-race conditions that can plague multithreaded programs. At\nPyCon 2024, Yury Selivanov\nintroduced an early-stage project called MemHive, which uses Python\nsubinterpreters and immutable data to\novercome the problems of thread serialization that are caused by the\nlanguage's Global Interpreter Lock (GIL).  Recent developments in the Python world have opened\nup different strategies for avoiding the longstanding problems with the\nGIL.",
          "link": "https://lwn.net/Articles/987238/",
          "publishedOn": "2024-08-28T19:45:46.000Z",
          "wordCount": null,
          "title": "[$] MemHive: sharing immutable data between Python subinterpreters",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986480/",
          "author": "jzb",
          "description": "Achieving consensus among Debian Developers on technical topics and\nprocedures can be, to put it mildly, challenging. Nevertheless, that\nis exactly what Otto Kekäläinen has tried to do with a proposal that\nwould set up \"principles all Debian packages should follow to be\nopen for collaboration in package maintenance\". In the near term,\nit seems unlikely that the proposal will be accepted, but the\ndiscussion may be effective at improving collaboration nonetheless.",
          "link": "https://lwn.net/Articles/986480/",
          "publishedOn": "2024-08-28T14:20:32.000Z",
          "wordCount": null,
          "title": "[$] Debian discusses principles for package maintenance",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987519/",
          "author": "jzb",
          "description": "Security updates have been issued by Fedora (calibre, dotnet8.0, dovecot, webkit2gtk4.0, and webkitgtk), Oracle (nodejs:20), Red Hat (bind, bind and bind-dyndb-ldap, postgresql:16, and squid), Slackware (kcron and plasma), SUSE (keepalived and webkit2gtk3), and Ubuntu (drupal7).",
          "link": "https://lwn.net/Articles/987519/",
          "publishedOn": "2024-08-28T13:15:06.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987465/",
          "author": "corbet",
          "description": "The Mono project was started in 2001 to develop a .NET environment for\nLinux systems.  Microsoft has owned that project since 2016, but has not\nmade a major release since 2019.  The company has now announced that Mono is being\nhanded over to the WineHQ organization, which will maintain the repository going\nforward.  Microsoft, meanwhile, is steering users toward its \"modern\nfork\" that it continues to maintain.",
          "link": "https://lwn.net/Articles/987465/",
          "publishedOn": "2024-08-27T21:46:14.000Z",
          "wordCount": null,
          "title": "WineHQ to take over Mono",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987414/",
          "author": "jzb",
          "description": "KDE developer Carl Schwan has announced\nthe release of Calligra Office\nversion 4.0. The most significant changes in this release include a \"major\noverhaul\" of the office suite's user interface, and a transition to Qt 6 and KDE Frameworks 6.",
          "link": "https://lwn.net/Articles/987414/",
          "publishedOn": "2024-08-27T17:16:28.000Z",
          "wordCount": null,
          "title": "Calligra Office 4.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987406/",
          "author": "jzb",
          "description": "Nominations are now\nopen for people interested in joining the Ubuntu\nCommunity Council, \"the highest governance body of the Ubuntu\nproject\". Any Ubuntu Member can\napply from now until Sunday, September 22 at 23:59 UTC.\nSee Merlijn Sebrechts's blog\npost, \"A year in the Ubuntu community council\", for an overview of\nwhat it's like to serve on the council.",
          "link": "https://lwn.net/Articles/987406/",
          "publishedOn": "2024-08-27T16:15:54.000Z",
          "wordCount": null,
          "title": "Call for nominations: Ubuntu Community Council",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/973231/",
          "author": "daroc",
          "description": "On August 13, the US National Institute of Standards and Technology (NIST)\n\npublished the final form of its new post-quantum cryptographic standards. One\nkey-exchange mechanism and two digital-signature schemes are now officially\nsanctioned by the institute. Adopting the new standards should be fairly\npainless for most developers, but the overhead added by the schemes could pose\nchallenges for some applications.",
          "link": "https://lwn.net/Articles/973231/",
          "publishedOn": "2024-08-27T13:56:44.000Z",
          "wordCount": null,
          "title": "[$] NIST finalizes post-quantum encryption standards",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987393/",
          "author": "corbet",
          "description": "Security updates have been issued by AlmaLinux (nodejs:20), Debian (python3.11), Fedora (dotnet8.0), Red Hat (bind, krb5, libreoffice, linux-firmware, orc, orc:0.4.28, and orc:0.4.31), SUSE (mariadb and openssl-3), and Ubuntu (linux-aws-5.4).",
          "link": "https://lwn.net/Articles/987393/",
          "publishedOn": "2024-08-27T12:53:01.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987320/",
          "author": "corbet",
          "description": "The developers of the Pidgin chat program\nhave announced that\na malicious plugin had been listed on its third-party plugins list for over\none month.  This plugin included a key logger and could capture\nscreenshots.\n\n\n\tIt went unnoticed at the time that the plugin was not providing any\n\tsource code and was only providing binaries for download. Going\n\tforward, we will be requiring that all plugins that we link to have\n\tan OSI Approved Open Source License and that some level of due\n\tdiligence has been done to verify that the plugin is safe for\n\tusers.",
          "link": "https://lwn.net/Articles/987320/",
          "publishedOn": "2024-08-26T20:45:04.000Z",
          "wordCount": null,
          "title": "A malicious Pidgin plugin",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987311/",
          "author": "jzb",
          "description": "The FreeBSD Foundation has announced that Germany's Sovereign Tech\nFund (STF) has agreed to invest €686,400 toward improvements in the\nFreeBSD project's infrastructure, security, regulatory compliance, and\ndeveloper experience:\nAugust\n9, 2024 summary report released by the U.S. Office of the\nNational Cyber Director (ONCD), consolidating feedback from the 2023\nrequest for information on key priorities for securing the open source\nsoftware ecosystem. By enhancing security controls and SBOM tooling,\nthe FreeBSD Foundation is helping to keep FreeBSD at the forefront of\nimproved vulnerability disclosure mechanisms and secure software\nfoundations.",
          "link": "https://lwn.net/Articles/987311/",
          "publishedOn": "2024-08-26T17:36:07.000Z",
          "wordCount": null,
          "title": "Sovereign Tech Fund (STF) to invest in FreeBSD infrastructure modernization",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986892/",
          "author": "corbet",
          "description": "The genksyms tool has long been buried deeply within the kernel's\nbuild system; it is one of the two C-code parsers shipped with the kernel\n(the other being the\nhorrifying kernel-doc script).  It is a key part of how the\nkernel's module-loading infrastructure works.  While genksyms has\nquietly done its job for decades, that period may soon be coming to an end.\nIt would seem that genksyms is not up to the task of handling Rust\ncode, so Sami Tolvanen is proposing\na new tool to handle this task going forward.",
          "link": "https://lwn.net/Articles/986892/",
          "publishedOn": "2024-08-26T17:19:46.000Z",
          "wordCount": null,
          "title": "[$] A new version of modversions",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987309/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (chromium, python-html-sanitizer, and trafficserver), Fedora (nginx, nginx-mod-fancyindex, nginx-mod-modsecurity, nginx-mod-naxsi, nginx-mod-vts, python-webob, python3-docs, python3.11, python3.12, python3.9, and zabbix), Red Hat (bind, bind and bind-dyndb-ldap, bind9.16, httpd, kernel, kernel-rt, and nodejs:20), SUSE (caddy, chromium, chromium, gn, rust-bindgen, cockpit, fetchmail, gdcm, gh, keybase-client, libhtp, libofx, nano, plasma5-workspace, python-nltk, python-notebook, xen, and znc), and Ubuntu (linux-azure, linux-azure-4.15, linux-azure-5.4, and linux-oracle-5.15).",
          "link": "https://lwn.net/Articles/987309/",
          "publishedOn": "2024-08-26T17:12:19.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987164/",
          "author": "corbet",
          "description": "The 6.11-rc5 kernel prepatch is out for\ntesting.  \"Other than the timing, there's not a whole lot unusual\nhere. The diffstat looks fairly flat, which means 'mostly pretty small\nchanges'.\" Linus Torvalds added a\nnote that today marks the 33rd anniversary of the first Linux\nannouncement; \"A third of a century. And it *still* isn't ready\".",
          "link": "https://lwn.net/Articles/987164/",
          "publishedOn": "2024-08-25T15:35:29.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.11-rc5",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985739/",
          "author": "jake",
          "description": "On the second day of DebConf24\nin Busan, South Korea, Holger Levsen provided a history lesson on the\n\"first 11 years\" of the Reproducible Builds project.\nHe has been involved in the project for most of that time and has been a\nDebian user since the mid-1990s, contributor since 2001, and a Debian\nmember since 2007; \"I love Debian\".  Meanwhile, his aim is to make all free\nsoftware be reproducible, so that anyone can check that a binary program\ncomes from the source code it purports to.",
          "link": "https://lwn.net/Articles/985739/",
          "publishedOn": "2024-08-23T13:47:20.000Z",
          "wordCount": null,
          "title": "[$] The history, status, and plans for reproducible builds",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986998/",
          "author": "daroc",
          "description": "The \n\nForgejo project has announced that, starting from version 9.0, Forgejo will be released under the GPLv3 license (or a later version). Older versions of the software forge remain MIT-licensed.\n\n\n\nA copyleft license makes reusing other copyleft software easier. Recently, we discovered that \n\nsome of the dependencies we used were incompatible with the license Forgejo was distributed with, and they had to be removed for now. Choosing copyleft licenses enables us to reuse more work, and saves us precious time to focus on improving Forgejo itself.",
          "link": "https://lwn.net/Articles/986998/",
          "publishedOn": "2024-08-23T13:39:33.000Z",
          "wordCount": null,
          "title": "Forgejo changes license to GPLv3+",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986997/",
          "author": "daroc",
          "description": "Security updates have been issued by Fedora (community-mysql, iaito, and radare2), Oracle (python3.12-setuptools and tomcat), Red Hat (krb5 and podman), Slackware (ffmpeg), SUSE (apache2, expat, firefox, webkit2gtk3, and xen), and Ubuntu (imagemagick and libxstream-java).",
          "link": "https://lwn.net/Articles/986997/",
          "publishedOn": "2024-08-23T13:03:10.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986906/",
          "author": "corbet",
          "description": "Version\n24.8 of the LibreOffice office suite has been released.  Changes\ninclude the ability to filter identifying information from exported files,\neasier creation of cross reference, better control over hyphenation, a\nnumber of new spreadsheet functions, accessibility improvements, and more.",
          "link": "https://lwn.net/Articles/986906/",
          "publishedOn": "2024-08-22T18:51:48.000Z",
          "wordCount": null,
          "title": "LibreOffice 24.8 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985853/",
          "author": "daroc",
          "description": "On July 30, Al Viro sent\n\na patch set to the linux-fsdevel mailing list with a\ncomprehensive cover letter explaining his\nrecent work on ensuring that the kernel's internal representation of\nfile descriptors are used correctly in the kernel.\nFile descriptors are ubiquitous; many system calls\nneed to handle them. Viro's review\nidentified a few existing bugs, and may prevent more in the future. He also had\nsuggestions for ways to keep uses consistent throughout the kernel.",
          "link": "https://lwn.net/Articles/985853/",
          "publishedOn": "2024-08-22T15:19:56.000Z",
          "wordCount": null,
          "title": "[$] A review of file descriptor memory safety in the kernel",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986844/",
          "author": "corbet",
          "description": "Matthew Garrett describes\nthe role of the Secure Boot Advanced Targeting mechanism and how it\nplayed into the recent Windows upgrade problems.\n\n\n\tSo why is this suddenly relevant? SBAT was developed\n\tcollaboratively between the Linux community and Microsoft, and\n\tMicrosoft chose to push a Windows update that told systems not to\n\ttrust versions of grub with a security generation below a certain\n\tlevel. This was because those versions of grub had genuine security\n\tvulnerabilities that would allow an attacker to compromise the\n\tWindows secure boot chain, and we've seen real world examples of\n\tmalware wanting to do that.",
          "link": "https://lwn.net/Articles/986844/",
          "publishedOn": "2024-08-22T14:25:01.000Z",
          "wordCount": null,
          "title": "Garrett: What is an SBAT and why does everyone suddenly care",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986841/",
          "author": "jake",
          "description": "Security updates have been issued by AlmaLinux (.NET 8.0, bind, bind9.16, curl, edk2, firefox, gnome-shell, grafana, jose, krb5, libreoffice, mod_auth_openidc:2.3, orc, pcs, poppler, python-setuptools, python-urllib3, python3.11-setuptools, python3.12-setuptools, thunderbird, tomcat, and wget), Fedora (webkitgtk), SUSE (apache2, glib2, and roundcubemail), and Ubuntu (kernel, linux, linux-aws, linux-aws-5.15, linux-azure, linux-azure-5.15,\n linux-azure-fde, linux-azure-fde-5.15, linux-gcp, linux-gcp-5.15,\n linux-gke, linux-gkeop, linux-gkeop-5.15, linux-hwe-5.15, linux-ibm,\n linux-ibm-5.15, linux-intel-iotg, linux-intel-iotg-5.15, linux-kvm,\n linux-lowlatency, linux-lowlatency-hwe-5.15, linux-nvidia, linux-oracle,\n linux-raspi, linux, linux-aws, linux-azure, linux-bluefield, linux-gcp, linux-gcp-5.4,\n linux-gkeop, linux-hwe-5.4, linux-ibm, linux-ibm-5.4, linux-kvm,\n linux-oracle, linux-oracle-5.4, linux-raspi, linux-xilinx-zynqmp, linux, linux-aws, linux-azure, linux-gcp, linux-gke, linux-ibm,\n linux-lowlatency, linux-nvidia, linux-nvidia-6.8, linux-nvidia-lowlatency,\n linux-oem-6.8, linux-oracle, linux-raspi, linux, linux-aws, linux-kvm, linux-lts-xenial, linux, linux-gcp, linux-gcp-4.15, linux-hwe, linux-kvm, linux-aws, linux-aws-hwe, linux-bluefield, linux-hwe-5.15, linux-raspi-5.4, and qemu).",
          "link": "https://lwn.net/Articles/986841/",
          "publishedOn": "2024-08-22T14:07:33.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985783/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for August 22, 2024 is available.",
          "link": "https://lwn.net/Articles/985783/",
          "publishedOn": "2024-08-22T01:51:50.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for August 22, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986659/",
          "author": "jzb",
          "description": "Ars Technica covers\na recent update\nthat is causing problems for users with systems that dual-boot Windows\nand Linux.\n\"Note that Windows says this update won't apply to systems that\ndual-boot Windows and Linux,\" one frustrated person wrote. \"This\nobviously isn't true, and likely depends on your system configuration\nand the distribution being run. It appears to have made some linux efi\nshim bootloaders incompatible with microcrap efi bootloaders (that's\nwhy shifting from MS efi to 'other OS' in efi setup works). It appears\nthat Mint has a shim version that MS SBAT doesn't recognize.\"\nThe reports indicate that multiple distributions, including Debian,\nUbuntu, Linux Mint, Zorin OS, and Puppy Linux, are all\naffected. Microsoft has yet to acknowledge the error publicly, explain\nhow it wasn't detected during testing, or provide technical guidance\nto those affected. Company representatives didn't respond to an email\nseeking answers.",
          "link": "https://lwn.net/Articles/986659/",
          "publishedOn": "2024-08-21T18:03:27.000Z",
          "wordCount": null,
          "title": "\"Something has gone seriously wrong,\" dual-boot systems warn after Microsoft update (Ars Technica)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986655/",
          "author": "jzb",
          "description": "Gentoo developer Michał Górny has written a lengthy blog\npost that explains how Gentoo approaches releases:\n\n\nGentoo is something of a hybrid, as it combines the best of both\nworlds. It is a rolling release distribution with a single shared\nrepository that is available to all users. However, within this\nrepository we use a keywording system to provide a choice between\nstable and testing packages, to facilitate both production and\ndevelopment systems (with some extra flexibility), and versioned\nprofiles to tackle major lock-step upgrades.",
          "link": "https://lwn.net/Articles/986655/",
          "publishedOn": "2024-08-21T17:31:46.000Z",
          "wordCount": null,
          "title": "Górny: Gentoo: profiles and keywords rather than releases",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974969/",
          "author": "jzb",
          "description": "Linux installers receive a disproportionate amount of attention\ncompared to the amount of time that most users spend with them. Ideally,\na user spends only a few minutes using the installer, versus years using\nthe distribution after it is installed. Yet, the installer sets the\nfirst impression, and if it fails to do its job, little else matters.\nInstallers also have to continually evolve to keep pace with new\nhardware, changes in distribution packaging (such as image-based Linux\ndistributions), and so forth. Along those lines, the SUSE team that maintains the\nvenerable YaST installer has\ndecided it's time to start (almost) fresh with a new Linux installer\nproject, called Agama,\nfor new projects. YaST is not going away as an administration tool,\nbut it is likely to be relieved of installer duties at some point.",
          "link": "https://lwn.net/Articles/974969/",
          "publishedOn": "2024-08-21T15:37:13.000Z",
          "wordCount": null,
          "title": "[$] Modernizing openSUSE installation with Agama",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986628/",
          "author": "jzb",
          "description": "Security updates have been issued by Debian (aom, cinder, dovecot, glance, and nova), Fedora (mysql8.0), Oracle (curl and libreoffice), SUSE (oniguruma, openssl-1_0_0, openssl1, and xen), and Ubuntu (cacti, curl, exfatprogs, firefox, and vim).",
          "link": "https://lwn.net/Articles/986628/",
          "publishedOn": "2024-08-21T13:20:30.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985041/",
          "author": "jake",
          "description": "At\nPyCon 2024 in Pittsburgh,\nPennsylvania, Anthony Shaw looked at the various kinds of parallelism\navailable to Python programs.  There have been two major developments on\nthe parallel-execution front over the last few years, with the effort to\nprovide subinterpreters, each with its own\nglobal interpreter lock (GIL), along with the work to remove the GIL entirely.  In the talk, he\nexplored the two approaches to try to give attendees a sense of how to make\nthe right choice for their applications.",
          "link": "https://lwn.net/Articles/985041/",
          "publishedOn": "2024-08-20T22:24:01.000Z",
          "wordCount": null,
          "title": "[$] Python subinterpreters and free-threading",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986528/",
          "author": "jzb",
          "description": "Version 0.3.0 of the uv\nPython package and project manager has been released. Introduced in\nFebruary, uv is written in Rust and aims to be \"Cargo for\nPython\".  Notable changes in this release include the addition of\ninterfaces for managing projects, installing\nPython, and running scripts,\nalong with adding new documentation. See the\naccompanying blog post for more information.",
          "link": "https://lwn.net/Articles/986528/",
          "publishedOn": "2024-08-20T21:31:09.000Z",
          "wordCount": null,
          "title": "uv 0.3.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986174/",
          "author": "corbet",
          "description": "One tactic often used by attackers set on compromising a system is heap spraying; in\nshort, the attacker fills as much of the heap as possible with crafted data\nin the hope of getting the target system to use that data in a bad way.  If\nheap spraying can be blocked, attackers will lose an important tool.  The\nkernel has some heap-spraying defenses now, including the dedicated bucket allocator merged for the\nupcoming 6.11 release, but its author, Kees Cook, thinks that more can be\ndone.",
          "link": "https://lwn.net/Articles/986174/",
          "publishedOn": "2024-08-20T13:29:07.000Z",
          "wordCount": null,
          "title": "[$] Per-call-site slab caches for heap-spraying protection",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986450/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (squid), Fedora (putty), Mageia (quictls), Oracle (bind, curl, python-setuptools, python3.11-setuptools, and python3.12-setuptools), Red Hat (kernel, kpatch-patch-4_18_0-305_120_1, kpatch-patch-4_18_0-372_87_1 and kpatch-patch-4_18_0-372_91_1, kpatch-patch-4_18_0-477_43_1, kpatch-patch-4_18_0-553, kpatch-patch-5_14_0-284_48_1 and kpatch-patch-5_14_0-284_52_1, kpatch-patch-5_14_0-427_13_1, and libreoffice), SUSE (cosign, dri3proto, presentproto, wayland-protocols, xwayland, freerdp, fwupdate, git, gnome-settings-daemon, hdf5, jasper, java-17-openjdk, java-1_8_0-ibm, java-1_8_0-openjdk, kernel, kernel-firmware, libaom, libqt5-qt3d, libqt5-qtquick3d, ntfs-3g_ntfsprogs, osc, python, python-aiohttp, python-azure-core, python-azure-storage-blob, python- azure-storage-queue, python-typing, python-typing_extensions, python-Jinja2, python-PyMySQL, python-requests, python-tqdm, python-WebOb, python3-sqlparse, python310, python311, qemu, sssd, thunderbird, tiff, unixODBC, uriparser, and wireshark), and Ubuntu (intel-microcode, linux-azure-5.4, and postgresql-12, postgresql-14, postgresql-16).",
          "link": "https://lwn.net/Articles/986450/",
          "publishedOn": "2024-08-20T13:22:37.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985210/",
          "author": "jzb",
          "description": "The FreeBSD Project is, for the second\ntime this year, engaging in a long-running discussion about the\npossibility of including Rust in its base\nsystem. The sequel to the first discussion included some work by\nAlan Somers to show what it might look like to use Rust code in the\nbase tree. Support for Rust code does not appear much closer to being\nincluded in FreeBSD's base system, but the conversation has been\nenlightening.",
          "link": "https://lwn.net/Articles/985210/",
          "publishedOn": "2024-08-19T15:12:03.000Z",
          "wordCount": null,
          "title": "[$] FreeBSD considers Rust in the base system",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986229/",
          "author": "jake",
          "description": "Today's crop of new stable kernels consists of seven new versions: 6.10.6, 6.6.47, 6.1.106, 5.15.165, 5.10.224, 5.4.282, and 4.19.320.  As usual, each contains important\nfixes throughout the kernel tree.",
          "link": "https://lwn.net/Articles/986229/",
          "publishedOn": "2024-08-19T14:43:44.000Z",
          "wordCount": null,
          "title": "Seven new stable kernels",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986225/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (python-asyncssh), Fedora (bind, bind-dyndb-ldap, httpd, and tor), SUSE (cosign, cpio, curl, expat, java-11-openjdk, ncurses, netty, netty-tcnative, opera, python-Django, python-Pillow, shadow, sudo, and wpa_supplicant), and Ubuntu (firefox).",
          "link": "https://lwn.net/Articles/986225/",
          "publishedOn": "2024-08-19T14:14:39.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986167/",
          "author": "corbet",
          "description": "The Rust code being added to the kernel is documented using the usual rustdoc\nconventions; that documentation is now available on kernel.org in\nformatted form.  There is also the linux-next version of\nthe documentation for Rust code that will land in the kernel soon.",
          "link": "https://lwn.net/Articles/986167/",
          "publishedOn": "2024-08-18T22:28:35.000Z",
          "wordCount": null,
          "title": "Formatted Rust kernel documentation available",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986163/",
          "author": "corbet",
          "description": "The fourth 6.11 kernel prepatch is out for\ntesting.  According to Linus:\n\n\n\tBut it all looks fairly normal. rc4 is bigger than either rc2 or\n\trc3 were, but not hugely so, and it's actually a normal pattern,\n\twhere it takes a while before people find some issues. So nothing\n\tfeels all that odd.",
          "link": "https://lwn.net/Articles/986163/",
          "publishedOn": "2024-08-18T22:23:07.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.11-rc4",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "M0AGX / LB9MG",
      "feedUrl": "https://m0agx.eu/feeds/all.rss.xml",
      "siteUrl": "https://m0agx.eu/",
      "articles": [
        {
          "id": "tag:m0agx.eu,2024-08-19:/multiprocessing-pythons-best-kept-secret.html",
          "author": null,
          "description": "I use Python for most of my offline data processing needs.\nRecently I had to analyze a big set of data from an experiment.\nThe unit task was not that difficult, open a file, run a couple of\nalgorithms, and calculate several metrics from the signal.\nIt took around ten seconds. All done in Scipy and NumPy.\nThe \"only\" problem that I had thousands of files with\na total volume around 20 GB.\nIt should be trivial to parallelize - or so I thought.",
          "link": "https://m0agx.eu/multiprocessing-pythons-best-kept-secret.html",
          "publishedOn": "2024-08-19T00:00:00.000Z",
          "wordCount": null,
          "title": "Multiprocessing - Python's best kept secret",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://martinfowler.com/articles/fitness-functions-data-products.html",
          "author": null,
          "description": "Decentralized data management requires automation to scale governance\n       effectively. Fitness functions are a powerful automated governance\n       technique my colleagues have applied to data products within the context\n       of a Data Mesh. Since data products serve as the foundational building\n       blocks of a data strategy, ensuring robust governance around them\n       significantly increases the chances of success. Kiran\n       Prakash explains how to do this, starting with simple tests for\n       key architectural characteristics and moving on to leveraging metadata\n       and Large Language Models.\nmore…",
          "link": "https://martinfowler.com/articles/fitness-functions-data-products.html",
          "publishedOn": "2024-09-05T13:37:00.000Z",
          "wordCount": 3085,
          "title": "Governing data products using fitness functions",
          "imageUrl": "https://martinfowler.com/articles/fitness-functions-data-products/card.png"
        },
        {
          "id": "https://martinfowler.com/bliki/CycleTime.html",
          "author": null,
          "description": "Cycle Time is a measure of how long it takes to get a new feature in a\n  software system from idea to running in production. In Agile circles, we try\n  to minimize cycle time. We do this by defining and implementing very small\n  features and minimizing delays in the development process. Although the rough\n  notion of cycle time, and the importance of reducing it, is common, there is a\n  lot of variations on how cycle time is measured.\n\n\nA key characteristic of agile software development is a shift from a\n  Waterfall Process, where work is decomposed based on\n  activity (analysis, coding, testing) to an Iterative Process where work is\n  based on a subset of functionality (simple pricing, bulk discount,\n  valued-customer discount). Doing this generates a feedback loop where we can learn\n  fr…",
          "link": "https://martinfowler.com/bliki/CycleTime.html",
          "publishedOn": "2024-09-04T04:00:00.000Z",
          "wordCount": null,
          "title": "Bliki: Cycle Time",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/2024-strangler-fig-rewrite.html",
          "author": null,
          "description": "Two decades ago, I posted that I found that the strangler fig plant was an interesting metaphor for the gradual replacement of a legacy system. I didn’t refer to the metaphor since, but meanwhile it grew a life of its own. Other people increasingly referred to the strangler fig approach to modernization, and traffic to that post steadily increased: currently it gets about 5000 page views a month, one of the more popular pages on this site. So I decided I needed to update that page, and have rewritten it, focusing on the core activities we need to do to make a success of such a venture.\n(This summarizes more detailed writing from Ian Cartwright, Rob Horn, and James Lewis.)",
          "link": "https://martinfowler.com/articles/2024-strangler-fig-rewrite.html",
          "publishedOn": "2024-08-22T15:51:00.000Z",
          "wordCount": null,
          "title": "Rewriting Strangler Fig",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "MCU on Eclipse",
      "feedUrl": "https://mcuoneclipse.com/feed/",
      "siteUrl": "https://mcuoneclipse.com",
      "articles": [
        {
          "id": "http://mcuoneclipse.com/?p=41191",
          "author": "Erich Styger",
          "description": "In my Eclipse workspace I have many projects, from multiple git repositories. How can I share a list of projects, say in a development team? As we all should know: the Eclipse workspace (.metadata folder) should not be shared. So … Continue reading →",
          "link": "https://mcuoneclipse.com/2024/08/27/eclipse-workspace-sharing-team-project-set-export-and-import/",
          "publishedOn": "2024-08-27T21:34:00.000Z",
          "wordCount": null,
          "title": "Eclipse Workspace Sharing: Team Project Set Export and Import",
          "imageUrl": null
        },
        {
          "id": "http://mcuoneclipse.com/?p=41143",
          "author": "Erich Styger",
          "description": "The SEGGER SystemView, a real-time recording and visualization tool for embedded systems, now supports plotting custom data and offers deeper insights into timing and application behavior. The new feature includes a data plot window, support for data sampling events, and an API update. With this addition, users can send and visualize arbitrary data with ease. Continue reading →",
          "link": "https://mcuoneclipse.com/2024/08/25/how-to-use-systemview-data-plot-feature-for-real-time-data-visualization/",
          "publishedOn": "2024-08-25T14:30:16.000Z",
          "wordCount": null,
          "title": "How to Use SystemView Data Plot Feature for Real-time Data Visualization",
          "imageUrl": null
        },
        {
          "id": "http://mcuoneclipse.com/?p=41100",
          "author": "Erich Styger",
          "description": "In an earlier article I explained how to generate GNU coverage information, for an embedded application written in C. In this article, I show the steps and configuration needed to use GNU gcov targeting an embedded application with C++. Outline … Continue reading →",
          "link": "https://mcuoneclipse.com/2024/08/17/tutorial-gnu-coverage-with-c-for-embedded-applications/",
          "publishedOn": "2024-08-17T13:39:38.000Z",
          "wordCount": null,
          "title": "Tutorial: GNU Coverage with C++ for Embedded Applications",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The ESP Journal - Medium",
      "feedUrl": "https://medium.com/feed/the-esp-journal",
      "siteUrl": "https://blog.espressif.com?source=rss----d5414d5dee73---4",
      "articles": [
        {
          "id": "https://medium.com/p/8c64ca156a81",
          "author": "Anant Raj Gupta",
          "description": "",
          "link": "https://blog.espressif.com/wireless-connectivity-solutions-for-esp32-p4-8c64ca156a81?source=rss----d5414d5dee73---4",
          "publishedOn": "2024-08-20T03:14:38.000Z",
          "wordCount": null,
          "title": "Wireless Connectivity Solutions for ESP32-P4",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "/* the devil is in the detail */",
      "feedUrl": "https://minjang.github.io/feed.xml",
      "siteUrl": "http://minjang.github.io/",
      "articles": []
    },
    {
      "title": "mingrammer's note",
      "feedUrl": "https://mingrammer.com/index.xml",
      "siteUrl": "https://mingrammer.com/",
      "articles": []
    },
    {
      "title": "Novel Bits",
      "feedUrl": "https://www.novelbits.io/feed",
      "siteUrl": "https://novelbits.io/",
      "articles": []
    },
    {
      "title": "null program",
      "feedUrl": "https://nullprogram.com/feed/",
      "siteUrl": "https://nullprogram.com",
      "articles": [
        {
          "id": "https://nullprogram.com/blog/2024/09/04/",
          "author": null,
          "description": "Suppose you’re working in C using one of the major toolchains — that is,\nit’s mainly a C++ implementation — and you need regular expressions. You\ncould integrate a library, but there’s a regex implementation in the C++\nstandard library included with your compiler, just within reach. As a\nresourceful engineer, using an asset already in hand seems prudent. But\nit’s a C++ interface, and you’re using C instead of C++ for a reason,\nperhaps to avoid dealing with C++. Have no worries. This article is\nabout wrapping std::regex in a tidy C interface which not only\nhides all the C++ machinery, but utterly tames it. It’s not so much\npractical as a potpourri of interesting techniques.\nIf you’d like to skip ahead, here’s the full source up front. Tested with\nw64devkit, MSVC cl, and clang-cl: scratch/re…",
          "link": "https://nullprogram.com/blog/2024/09/04/",
          "publishedOn": "2024-09-04T17:15:07.000Z",
          "wordCount": null,
          "title": "Giving C++ std::regex a C makeover",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Almost Secure",
      "feedUrl": "https://palant.info/rss.xml",
      "siteUrl": "https://palant.info/",
      "articles": []
    },
    {
      "title": "Preshing on Programming",
      "feedUrl": "http://preshing.com/feed",
      "siteUrl": "https://preshing.com/feed",
      "articles": []
    },
    {
      "title": "research!rsc",
      "feedUrl": "https://research.swtch.com/feed.atom",
      "siteUrl": "http://research.swtch.com/feed.atom",
      "articles": []
    },
    {
      "title": "AEP코리아네트",
      "feedUrl": "https://rss.blog.naver.com/aepkoreanet.xml",
      "siteUrl": "https://blog.naver.com/aepkoreanet?fromRss=true&trackingCode=rss",
      "articles": []
    },
    {
      "title": "애자일 이야기",
      "feedUrl": "http://rss.egloos.com/blog/agile",
      "siteUrl": "http://agile.egloos.com",
      "articles": []
    },
    {
      "title": "The Shape of Code",
      "feedUrl": "https://shape-of-code.com/feed/",
      "siteUrl": "https://shape-of-code.com",
      "articles": [
        {
          "id": "https://shape-of-code.com/?p=9334",
          "author": "Derek Jones",
          "description": "Developers often assume that it’s possible to predict the execution path a program will take, for a given set of input values, i.e., program behavior is deterministic. The execution path may be very complicated, and may depend on the contents of certain files (e.g., database…), but it’s deterministic. There is one kind of program where […]",
          "link": "https://shape-of-code.com/2024/09/08/measuring-non-determinism-in-the-linux-kernel/",
          "publishedOn": "2024-09-08T21:31:40.000Z",
          "wordCount": null,
          "title": "Measuring non-determinism in the Linux kernel",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=9321",
          "author": "Derek Jones",
          "description": "Software contained in safety related applications has to have a very low probability of failure. How is a failure rate for software calculated? The people who calculate these probabilities, or at least claim that some program has a suitably low probability, don’t publish the details or make their data publicly available. People have been talking […]",
          "link": "https://shape-of-code.com/2024/09/01/survival-of-cves-in-the-linux-kernel/",
          "publishedOn": "2024-09-01T22:42:33.000Z",
          "wordCount": null,
          "title": "Survival of CVEs in the Linux kernel",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=9308",
          "author": "Derek Jones",
          "description": "Reliability research is a worthwhile investment for very large organizations that fund the development of many major mission-critical software systems, where reliability is essential. In the 1970s, the US Air Force’s Rome Air Development Center probably funded most of the evidence-based software research carried out in the previous century. In the 1980s, Rome fell, and […]",
          "link": "https://shape-of-code.com/2024/08/25/1970s-the-founding-decade-of-software-reliability-research/",
          "publishedOn": "2024-08-25T21:59:42.000Z",
          "wordCount": null,
          "title": "1970s: the founding decade of software reliability research",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=9296",
          "author": "Derek Jones",
          "description": "How do the people define software reliability? One answer can be found by analyzing defect report logs: one study found that 42.6% of fault reports were requests for an enhancement, changes to documentation, or a refactoring request; a study of NASA spaceflight software found that 63% of reports in the defect tracking system were change […]",
          "link": "https://shape-of-code.com/2024/08/18/the-units-of-measurement-for-software-reliability/",
          "publishedOn": "2024-08-18T22:01:02.000Z",
          "wordCount": null,
          "title": "The units of measurement for software reliability",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Stacey on IoT | Internet of Things news and analysis",
      "feedUrl": "https://staceyoniot.com/feed/",
      "siteUrl": "https://staceyoniot.com/",
      "articles": []
    },
    {
      "title": "Blog – Modern Embedded Software | Quantum Leaps",
      "feedUrl": "https://www.state-machine.com/category/blog/feed",
      "siteUrl": "https://www.state-machine.com",
      "articles": []
    },
    {
      "title": "IT의 중심에서",
      "feedUrl": "https://subokim.wordpress.com/feed/",
      "siteUrl": "https://subokim.wordpress.com",
      "articles": []
    },
    {
      "title": "코드쓰는사람",
      "feedUrl": "https://taegon.kim/feed",
      "siteUrl": "https://taegon.kim",
      "articles": []
    },
    {
      "title": "The Pasture",
      "feedUrl": "https://thephd.dev/feed",
      "siteUrl": "https://thephd.dev/",
      "articles": []
    },
    {
      "title": "Vivonomicon's Blog",
      "feedUrl": "https://vivonomicon.com/feed/",
      "siteUrl": "https://vivonomicon.com",
      "articles": []
    },
    {
      "title": "zserge's blog",
      "feedUrl": "https://zserge.com/rss.xml",
      "siteUrl": "https://zserge.com/",
      "articles": [
        {
          "id": "https://zserge.com/posts/langs-apl/",
          "author": null,
          "description": "This is part 5 from series “Tiny Great Languages”.\nFinal code is on Github. Part 1: Assembly. Part 2: BASIC. Part 3: Forth/MOUSE. Part 4: Lisp. Part 5: APL/K. This would be a controversial language, but it fits perfectly into the 50-lines-of-less code category. Let’s talk about APL family, and specifically – K.\nCreated by Arthur Whitney the language is known for its terse and cryptic syntax. But it fixes one “issue” with APL – K uses ASCII symbols.",
          "link": "https://zserge.com/posts/langs-apl/",
          "publishedOn": "2024-09-13T00:00:00.000Z",
          "wordCount": null,
          "title": "Tiny Great Languages: APL",
          "imageUrl": null
        },
        {
          "id": "https://zserge.com/posts/langs-lisp/",
          "author": null,
          "description": "This is part 4 from series “Tiny Great Languages”.\nFinal code is on Github. Part 1: Assembly. Part 2: BASIC. Part 3: Forth/MOUSE. Part 4: Lisp. Part 5: APL/K. Done with the concatenative language MOUSE, we can now turn our attention to another small and elegant language from way back: Lisp. Lisp is famous for its minimalist syntax (similar to Forth, the parser is almost nonexistent) and its clear, logical evaluation rules.",
          "link": "https://zserge.com/posts/langs-lisp/",
          "publishedOn": "2024-09-12T00:00:00.000Z",
          "wordCount": null,
          "title": "Tiny Great Languages: Lisp",
          "imageUrl": null
        },
        {
          "id": "https://zserge.com/posts/langs-mouse/",
          "author": null,
          "description": "This is part 3 from series “Tiny Great Languages”.\nFinal code is on Github. Part 1: Assembly. Part 2: BASIC. Part 3: Forth/MOUSE. Let’s go Forth. A concatenative language available on early computers, a great example of how small, elegant languages can be both powerful and efficient.\nI’ve already covered building a proper Forth from the ground up in an earlier post. Now, let’s explore a much smaller Forth-like language: MOUSE.",
          "link": "https://zserge.com/posts/langs-mouse/",
          "publishedOn": "2024-09-11T00:00:00.000Z",
          "wordCount": null,
          "title": "Tiny Great Languages: MOUSE",
          "imageUrl": null
        },
        {
          "id": "https://zserge.com/posts/langs-basic/",
          "author": null,
          "description": "This is part 2 from series “Tiny Great Languages”.\nFinal code is on Github. Part 1: Assembly. Part 2: BASIC. Part 3: Forth/MOUSE. Meet BASIC, the king of home computing in the late 1970s. Originally designed to promote computer literacy in schools, BASIC inspired a whole generation of professional software engineers.\nBASIC typically combined a simple text editor with a command shell and interpreter. Lines starting with a number were added, deleted, or edited in the program space, while lines without numbers were executed immediately.",
          "link": "https://zserge.com/posts/langs-basic/",
          "publishedOn": "2024-09-10T00:00:00.000Z",
          "wordCount": null,
          "title": "Tiny Great Languages: BASIC",
          "imageUrl": null
        },
        {
          "id": "https://zserge.com/posts/langs-asm/",
          "author": null,
          "description": "This is part 1 from series “Tiny Great Languages”.\nFinal code is on Github. Part 1: Assembly. Part 2: BASIC. Part 3: Forth/MOUSE. Decades ago, I wrote my first interpreter – a Turtle Graphics IDE designed to help kids at my school learn programming. I built it in Pascal, and to this day, I still wonder how I managed to make it work without any formal knowledge of writing interpreters.",
          "link": "https://zserge.com/posts/langs-asm/",
          "publishedOn": "2024-09-08T00:00:00.000Z",
          "wordCount": null,
          "title": "Tiny Great Languages: Assembly",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Boston Globe",
      "feedUrl": "https://www.bostonglobe.com/rss/bigpicture",
      "siteUrl": "https://www.bostonglobe.com",
      "articles": []
    },
    {
      "title": "이바닥늬우스",
      "feedUrl": "https://ebadak.news/feed",
      "siteUrl": "https://ebadak.news",
      "articles": []
    },
    {
      "title": "economic view",
      "feedUrl": "http://feeds.feedburner.com/Economic_View",
      "siteUrl": "http://economicview.net",
      "articles": []
    },
    {
      "title": "슬로우뉴스.",
      "feedUrl": "https://feeds.feedburner.com/slownews",
      "siteUrl": "https://slownews.kr",
      "articles": [
        {
          "id": "https://slownews.kr/?p=116877",
          "author": "선정수",
          "description": "1. 적당히 살찌면 사망 위험이 더 낮다? (사실이에요) 건강하게 사는 것은 예나 지금이나 남녀노소를 불문하고 가장 큰 관심사 중 하나일 겁니다. 첫 번째 비만 팩트체크 주제는 ‘비만인 사람이 정상 체중인 사람보다 오래 산다’인데요. 절로 고개가 갸웃거리는 내용인데요. 어떻게 나온 말이죠?  2. 비만의 역설 그렇다면 비만 전단계, 1단계와 2단계 비만은 정상체중보다 오히려 사망 위험이 낮다는 이야기인데요. 좀 이상하네요. 이유는 뭘까요? 3. 그럼...\nThe post 비만 팩트체크: 적당히 살찌면 사망 위험 더 낮다? 어릴 적 살은 키로 간다? appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116877",
          "publishedOn": "2024-09-13T09:15:56.000Z",
          "wordCount": null,
          "title": "비만 팩트체크: 적당히 살찌면 사망 위험 더 낮다? 어릴 적 살은 키로 간다?",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116887",
          "author": "이정환",
          "description": "[슬로우리포트] 대통령 관저 공사 12억 원 수의 계약의 비밀… 자격 없는 인테리어 업체, 코바나컨텐츠 후원사였던 게 우연일까. 감사원이 미루고 미루던 감사결과를 발표했는데 별 내용은 없다. 대통령실은 “특혜가 없었던 것으로 확인됐다”고 주장하고 있다. 오마이뉴스가 “김건희가 주무르고 있다”는 첫 보도를 했고 참여연대가 국민 감사를 청구한 사건이다. 이게 왜 중요한가. 이것이 핵심이다. 1년 8개월 걸린 감사 결과. 필요한...\nThe post 감사원의 꼬리 자르기: 누군지 기억 안 난다고? 그 누구가 김건희일 가능성은? appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116887",
          "publishedOn": "2024-09-13T08:42:46.000Z",
          "wordCount": null,
          "title": "감사원의 꼬리 자르기: 누군지 기억 안 난다고? 그 누구가 김건희일 가능성은?",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116863",
          "author": "참여연대 사법감시센터",
          "description": "소위 ‘건축왕’ 일당의 인천 미추홀구 전세사기는 최소 665세대, 536억 원의 전세금 피해를 낳았습니다. 피해 사례와 금액은 계속 추가되고 있어, 실질적인 피해는 그 이상일 것으로 추정됩니다. 그러나 최근 법원은 ‘건축왕’에게 징역 15년을 선고한 1심을 뒤집고, 대폭 감형된 징역 7년을 선고했습니다. 2022년 1월 이전 발생한 계약에 대해서는 전부 무죄를 선고했고, 공범으로 기소된 이들에게도 무더기로 무죄를 선고했습니다. 수많은...\nThe post 법원, 미추홀 전세사기 일당에 무더기 무죄·감형 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116863",
          "publishedOn": "2024-09-13T07:24:44.000Z",
          "wordCount": null,
          "title": "법원, 미추홀 전세사기 일당에 무더기 무죄·감형",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116835",
          "author": "이정환",
          "description": "윤석열(대통령) 지지율이 20%를 기록했다. 부정 평가는 70%를 찍었다. 갤럽 정기 여론조사 결과다. 이게 왜 중요한가. 지지율 폭락의 원인. 심리적 마지노선. 정당 지지율도 역전, 국민의힘도 최저 기록. 분석과 전망.\nThe post 윤석열 지지율 20%, 심리적 탄핵 마지노선을 찍었다. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116835",
          "publishedOn": "2024-09-13T04:22:56.000Z",
          "wordCount": null,
          "title": "윤석열 지지율 20%, 심리적 탄핵 마지노선을 찍었다.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116785",
          "author": "이정환",
          "description": "대통령실 공사 비리, 캐다가 말았다. 왜 무자격 업체에 맡겼을까. 쟁점과 현안. 김건희 주가조작 사건, 성격이 달라졌다. 이종호는 유죄. 더 깊게 읽기. 김건희가 몰랐을 수 있나. “꾸준히 할 예정이다.” 쟁점과 현안. 응급실 의사 절반으로 줄었다. “어디서 죽어 나가나.” 이재명과 김종인의 만남. 인구 주는데 가구 수는 는다. 다르게 읽기. 미국 대선, 끝까지 가봐야 안다. 서울 아파트 62%가...\nThe post 감사원이 빠뜨린 질문, 김건희 요청으로 무자격 업체에 공사 줬나: 슬로우레터 9월13일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116785",
          "publishedOn": "2024-09-12T22:24:33.000Z",
          "wordCount": null,
          "title": "감사원이 빠뜨린 질문, 김건희 요청으로 무자격 업체에 공사 줬나: 슬로우레터 9월13일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116680",
          "author": "이정환",
          "description": "해리스 판정승. 준비부터 달랐다. 강력한 ‘한방’은 없었다. 도박 사이트에서는 여전히 트럼프. 테일러 스위프트의 해리스 지지. 윤석열과 한동훈의 거리. 쟁점과 현안. 해병대 단톡방 멤버들의 기자회견. 오늘 도이치모터스 주가 조작 항소심 선고. 8월 주택담보대출 8조 원. 평산 책방 테러. 다르게 읽기. 부자들만의 응급실. 25만 원 지원금 반대, 김동연의 소신. 김건희-최재영은 공동 운명체. 더 깊게 읽기. 피의사실 공표,...\nThe post “내가 정권을 잡으면…”, 조선일보가 제안한 김건희만 할 수 있는 일: 슬로우레터 9월12일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116680",
          "publishedOn": "2024-09-11T22:25:50.000Z",
          "wordCount": null,
          "title": "“내가 정권을 잡으면…”, 조선일보가 제안한 김건희만 할 수 있는 일: 슬로우레터 9월12일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116672",
          "author": "신현호",
          "description": "[신현호 칼럼] Chart of the Day. 미 대선 토론에서 해리스가 승리했다. 그 결과가 여론조사에 반영되려면 며칠은 걸린다. 하지만 폴리마켓(정치 예측 베팅 사이트)은 실시간으로 승리 가능성에 대선 토론 결과를 반영했다. 해리스가 ABC 주최 대통령선거 토론에서 승리했다. 토론회 직후 뉴욕타임스는 ‘해리스가 트럼프를 수세에 몰아넣었다’라고 선언하였고, CNN은 ‘해리스가 던진 미끼를 트럼프가 물었다’고 평가하였다. 심지어 보수 성향인 폭스 뉴스조차도...\nThe post 미 대선 토론 후 승리 가능성: 해리스 3% 상승, 트럼프 3% 하락 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116672",
          "publishedOn": "2024-09-11T08:57:54.000Z",
          "wordCount": null,
          "title": "미 대선 토론 후 승리 가능성: 해리스 3% 상승, 트럼프 3% 하락",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116597",
          "author": "민주언론시민연합",
          "description": "박민 KBS 사장은 정말 억울했나보다. 야당 의원들이 KBS 친일·극우방송 논란을 질타하자 “그걸 틀어서 친일하겠다고 하면 미친놈”이라는 격한 발언을 쏟아냈기 때문이다. 2023년 회계연도 KBS 결산심사를 위해 8월 28일 국회 과학기술정보방송통신위원회에 참석했을 때다. “친일하겠다고 하면 미친놈” 발끈한 박민 사장 KBS는 8월 15일 광복절 자정이 되자마자 일본 국가 기미가요가 나오는 오페라 ‘나비부인’을 방영해 큰 논란을 일으켰다. 박민 사장은...\nThe post 뉴라이트로 하나되는 윤석열 정권 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116597",
          "publishedOn": "2024-09-11T03:30:04.000Z",
          "wordCount": null,
          "title": "뉴라이트로 하나되는 윤석열 정권",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116598",
          "author": "이정환",
          "description": "미국 시각으로 9월10일 저녁, 카멀라 해리스(민주당 후보)와 도널드 트럼프(공화당 후보)의 대선 토론이 열렸다. 이게 왜 중요한가. 공격과 방어. 트럼프의 치명적인 거짓말. 해리스의 프레임 전환. 버튼 눌린 트럼프. 결정적인 장면. 총평.\nThe post 해리스의 도발과 트럼프의 자폭. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116598",
          "publishedOn": "2024-09-11T03:12:16.000Z",
          "wordCount": null,
          "title": "해리스의 도발과 트럼프의 자폭.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116592",
          "author": "민주언론시민연합",
          "description": "MBC 대주주인 방송문화진흥회(이하 ‘방문진’) 이사들이 방송통신위원회(이하 ‘방통위’)를 상대로 방문진 신임이사 임명 처분에 대한 효력정지를 구한 가처분 신청이 8월 26일 서울행정법원에서 받아들여졌다. 법원에 의해 제동걸린 MBC 장악 시도 윤석열 정권이 KBS, YTN에 이어 눈엣가시 같았던 MBC까지 장악하려는 시도가 사법부에 의해 제동이 걸린 것이다. 그러나 방통위는 즉각 항고했고, 국민의힘 미디어특위 소속 의원들은 재판부 규탄 시위를 벌이고 있다....\nThe post KBS는 접수, YTN은 매각, MBC는? 일단 제동 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116592",
          "publishedOn": "2024-09-11T02:53:13.000Z",
          "wordCount": null,
          "title": "KBS는 접수, YTN은 매각, MBC는? 일단 제동",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116554",
          "author": "이정환",
          "description": "89년 만의 9월 열대야. 쟁점과 현안. “추석에 생선전 먹지 마세요.” 추석 연휴 응급실 근무, 돈 더 준다. “이거 아니면 안 된다는 건 없다.” 응급실 사망률 숫자로 드러났다. 더 깊게 읽기. 전교 5등? 올해는 10등까지. 김건희의 격려 방문, “현장의 목소리 귀 기울이겠다.” 윤석열과 김건희의 추석 인사. 해리스-트럼프 운명의 토론. 다르게 읽기. 국민연금 자동조정장치, 관건은 삭감 규모....\nThe post “힘들고 어려운 것 잘 알고 있다”, 대통령 같았던 김건희의 격려 방문: 슬로우레터 9월11일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116554",
          "publishedOn": "2024-09-10T22:20:02.000Z",
          "wordCount": null,
          "title": "“힘들고 어려운 것 잘 알고 있다”, 대통령 같았던 김건희의 격려 방문: 슬로우레터 9월11일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116248",
          "author": "민노씨",
          "description": "왜 샤넬은 동종 다수 업체가 넉넉하게 합의한 사안, 그것도 노조의 “소박하기 짝이 없는” ‘감정노동수당 월 2만 원과 감정노동휴가 연 1일’을 홀로 거절했을까. 인터뷰의 화두는 그것이었다. 하지만 인터뷰 직후 샤넬코리아는 ‘감정노동수당(월 2만 원)’과 ‘감정노동휴가(연 1일)’요구를 수용했다. 하지만 그렇다고 그 질문의 의미가 사라지는 것은 아니다. 왜 17년 동안이나 샤넬은 ‘감정노동’을 부인했을까. 현장에 잠깐이라도 눈길을 보낸다면 누구도 부인할...\nThe post 감정노동, 샤넬의 판도라 상자 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116248",
          "publishedOn": "2024-09-10T06:51:37.000Z",
          "wordCount": null,
          "title": "감정노동, 샤넬의 판도라 상자",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116505",
          "author": "이정환",
          "description": "김태효(국가안보실 1차장)를 보면 윤석열(대통령)을 이해할 수 있다. 윤석열의 동네 주민이었고 과외 교사였고 술친구다. 안보실장이 세 차례 바뀌는 동안 김태효는 자리를 지켰다. 이게 왜 중요한가. 김태효는 누구인가. 블랙핑크 때문에 날아간 김성한. 조태용과 장호진, 신원식. 실세 김태효. 왜 안보실장으로 승진하지 않나. 김태효의 말말말. 윤석열이 김태효 차장을 감싸는 이유가 뭔가. ‘중일마’ 정부.\nThe post 윤석열이 ‘중일마’ 김태효를 감싸고 도는 이유. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116505",
          "publishedOn": "2024-09-10T06:35:54.000Z",
          "wordCount": null,
          "title": "윤석열이 ‘중일마’ 김태효를 감싸고 도는 이유.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116424",
          "author": "이정환",
          "description": "윤석열 만찬, 한동훈은 안 불렀다. 쟁점과 현안. 반쪽짜리 플랫폼법, 배민도 쿠팡도 빠졌다. 티메프 금지법에 티메프가 없다. 플랫폼 규제, 조사만 1~2년. ‘영부남’ 윤석열. 최순실을 기억하라. 안창호 딜레마, 첫 진정 사건은 안창호의 혐오 발언. 김건희 수사심의위 또 열린다. 올해 의대 증원은 ‘떠난 버스’. 추석 연휴가 큰일, 응급 환자 하루 3만 명 어디로. 다르게 읽기. 8월 전기요금 13%...\nThe post 누가 뒤를 봐주나, 배민도 쿠팡도 빠져나간 반쪽짜리 플랫폼법: 슬로우레터 9월10일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116424",
          "publishedOn": "2024-09-09T22:15:44.000Z",
          "wordCount": null,
          "title": "누가 뒤를 봐주나, 배민도 쿠팡도 빠져나간 반쪽짜리 플랫폼법: 슬로우레터 9월10일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116402",
          "author": "이정환",
          "description": "옆자리 동료에게 운동화를 새로 사야겠어, 이렇게 이야기했더니 갑자기 페이스북에 운동화 광고가 뜬다든가 하는 기묘한 경험 해본 적 있나. 페이스북이 내 말을 엿듣는 것 아니냐는 음모론이 있었는데 이런 음모론을 뒷받침하는 주장이 나왔다. 오늘은 ‘액티브 리스닝’이라는 일탈적인 광고 마케팅 기법과 개인 정보 보호 이슈를 살펴본다. 이게 왜 중요한가. 새롭게 제기된 의혹. 구체적으로 내용을 살펴볼까. 불법은 아닌가. 페이스북과...\nThe post 도청을 허용하시겠습니까: 약관을 제대로 안 읽으면 벌어지는일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116402",
          "publishedOn": "2024-09-09T09:14:24.000Z",
          "wordCount": null,
          "title": "도청을 허용하시겠습니까: 약관을 제대로 안 읽으면 벌어지는일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116302",
          "author": "이정환",
          "description": "이제 절반? 두 달 더 남았다. 쟁점과 현안. 의대 증원, 윤석열이 고집을 꺾었나. 2027년부터 vs. 2027년부터. 내년 증원 백지화는 불가능. 중재자 한동훈 역할론. “잘못하고 있다”, 64%. 윤석열이 나서야 한다. 추석 연휴, 중증 환자 진료 수가 3배. 다르게 읽기. 예정된 면죄부, 수사심의위 김건희 불기소 의견. 조선일보의 제안, “사과로 마무리 짓자”. 아낌없이 주는 윤석열. 더 깊게 읽기....\nThe post 조선일보의 출구전략, “이제라도 김건희 사과로 마무리짓자”: 슬로우레터 9월9일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116302",
          "publishedOn": "2024-09-08T22:17:39.000Z",
          "wordCount": null,
          "title": "조선일보의 출구전략, “이제라도 김건희 사과로 마무리짓자”: 슬로우레터 9월9일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116269",
          "author": "최명진",
          "description": "우리의 이야기는 3개의 큰 축을 중심으로 흘러간다. 요리 세계의 주연급인 굵직한 식재료가 첫 번째, 두 번째는 그 재료가 사람의 손을 만나 변화하는 원리 즉, 테크닉이다. 그리고 마지막 세 번째는 이 모든 서사가 수렴하는 종착지, 바로 ‘맛’을 바라보는 관점이다. 지금껏 10편에 걸친 글에서 ‘단맛’과 ‘짠맛’이 주로 도마 위에 올랐고 지난 토마토 편에서 ‘감칠맛’도 잠시 등장했다. 그래서 마지막으로 언급할 중요한 맛이 남았다. 바로...\nThe post 산미 예찬: 구이 야채 샐러드 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116269",
          "publishedOn": "2024-09-06T13:53:38.000Z",
          "wordCount": null,
          "title": "산미 예찬: 구이 야채 샐러드",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116244",
          "author": "참여연대 의정감시센터",
          "description": "22대 국회가 개원했습니다. 유권자의 소중한 한 표, 한 표를 읍소하며 당선된 300명의 국회의원이 과연 유권자를 위해 제대로 일하는지 지켜보고 감시해야 할 때입니다. 이들이 어떤 일을 하는지, 어떤 일을 해야 하는데 안하는지에 따라 우리의 삶이 달라지니까요. 참여연대 의정감시센터는 칼럼을 통해 유권자의 시각에서 22대 국회와 정치를 비평합니다. 무엇보다 ‘중’요한 건 ‘꺾’이지 않는 ‘정’치개혁이니까요. 이 글의 필자는 안용흔(대구가톨릭대 정치외교학과...\nThe post 정치적 해법으로 검증된 연립정부 구성, 왜 우리는 하지 못하나 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116244",
          "publishedOn": "2024-09-06T05:32:14.000Z",
          "wordCount": null,
          "title": "정치적 해법으로 검증된 연립정부 구성, 왜 우리는 하지 못하나",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116238",
          "author": "민주언론시민연합",
          "description": "윤석열 대통령이 8월 29일 국정브리핑 및 기자회견을 130분간 진행했습니다. 하지만 시간만 다소 늘어났을 뿐 취임 2주년 기자회견에서 나타난 문제점이 고스란히 반복됐습니다. 윤 대통령은 언론 및 국민과 소통할 의지가 있는 것인지 다시 한번 의구심이 들 수밖에 없는데요. 채상병 특검법, 김건희 여사 특혜조사 의혹, 뉴라이트 인사 중용 등 국민들의 관심이 높은 사안에도 여론과 동떨어진 동문서답식 답변이나 핵심을...\nThe post 윤석열 세 번째 기자회견, 왜 추가 질문하지 않았나 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116238",
          "publishedOn": "2024-09-06T04:54:53.000Z",
          "wordCount": null,
          "title": "윤석열 세 번째 기자회견, 왜 추가 질문하지 않았나",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116181",
          "author": "이정환",
          "description": "김건희가 공천에 개입했나. 오늘 김건희 수사 심의위 결론. 쟁점과 현안. 병원 100미터 앞에 두고. 군의관으로 땜방 안 된다. 응급실 찾아달라 119 요청 두 배 늘었다. “부탁한 환자 지금 수술 중.” 더 깊게 읽기. ‘더 내고 덜 받는’ 개혁은 “국민 합의 역행”. 20세와 50세, 시뮬레이션해 보니. 자동 조정장치가 더 문제. 다르게 읽기. “추석 밥상에 김건희 대신...\nThe post 김건희의 텔레그램 메시지… 공천 개입 논란, 빠져나갈 수 있을까: 슬로우레터 9월6일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116181",
          "publishedOn": "2024-09-05T22:16:22.000Z",
          "wordCount": null,
          "title": "김건희의 텔레그램 메시지… 공천 개입 논란, 빠져나갈 수 있을까: 슬로우레터 9월6일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116056",
          "author": "민노씨",
          "description": "샤넬, 랑콤, 시세이도, 클라랑스, 록시땅, 에스티로더, 디올 등 백화점과 면세점에서 화장품 등을 판매하는 직원들이 열악한 노동환경을 개선하기 위해 노동조합을 결성한 지 벌써 10여 년이 흘렀다. (중략) 2024년 노사 교섭의 핵심은 감정노동 수당(월 2만 원)과 감정노동 휴가(연 1일 확대)였다. (중략) 감정노동의 심각성을 고려한다면 노동조합의 요구는 소박하기 짝이 없을 정도다. (중략) 2024년 3월 첫 7개 회사와 노동조합과의...\nThe post 배당금 3000억 샤넬, 감정노동수당 2만 원은 거부 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116056",
          "publishedOn": "2024-09-05T07:08:12.000Z",
          "wordCount": null,
          "title": "배당금 3000억 샤넬, 감정노동수당 2만 원은 거부",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116150",
          "author": "이정환",
          "description": "한국 정부가 엘리엇매니지먼트와 투자자-국가 소송에서 패소한 뒤 취소 소송을 냈는데 패소했다. 원래 손해배상 금액이 5359만 달러였는데 그 사이에 이자가 붙어 1500억 원 정도로 불어났다. 송기호(수륜아시아 변호사)는 한국 정부가 이재용(삼성전자 회장)에게 구상권을 청구해야 한다고 주장하고 있다. 제일모직과 삼성물산 합병은 2015년 9월1일이다. 불법 행위로 인한 손해배상의 공소시효가 10년이니 구상권을 행사할 수 있는 시간이 이제 1년도 채 남지...\nThe post 이재용에게 5000억 원 청구할 공소시효 1년 남았다. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116150",
          "publishedOn": "2024-09-05T06:59:26.000Z",
          "wordCount": null,
          "title": "이재용에게 5000억 원 청구할 공소시효 1년 남았다.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116105",
          "author": "이정환",
          "description": "4%포인트 더 내고 2%포인트 더 받는다. 50대는 빠르게, 정부 연금 개혁안 초안. 국민연금 자동 조정장치. 더 깊게 읽기. 모수 개혁과 구조 개혁. 갈라치기? 전문가들 평가는. 쟁점과 현안. 공보의 투입? “의료 사고 겁난다.” 다시 찾아온 R의 공포. “전화할 수 있으면 찢어져 피 많이 나도 경증.” 적자성 국가 채무 1000조 원 넘을 수도. 한동훈이 발뺌도 발의도 못...\nThe post 국민연금 갈라치기? 미래 위한 빅 스텝?: 슬로우레터 9월5일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116105",
          "publishedOn": "2024-09-04T22:23:57.000Z",
          "wordCount": null,
          "title": "국민연금 갈라치기? 미래 위한 빅 스텝?: 슬로우레터 9월5일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116044",
          "author": "민주언론시민연합",
          "description": "‘광부엄마’ 취재를 총괄한 최기영 기자에게 지역언론의 어려움을 묻자 “다양한 플랫폼을 통해 강원일보 기사와 영상을 선보일 수 있는 최근 상황은 긍정적”이라고 말했다. “AI가 대체할 직업에 기자가 빠지지 않고 등장하지만 사람 체온이 필요한 보도는 AI가 할 수 없다”며 “깊숙이 사람 속으로 들어가는 보도는 지역언론이 잘할 수 있는 것이니 오히려 지역언론에겐 지금이 기회”라고 확신했다. 강원일보 ‘광부엄마’는 여성을 터부시하는...\nThe post 광부엄마, 태백시의 현실을 비추는 여성 광부의 삶 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116044",
          "publishedOn": "2024-09-04T04:00:10.000Z",
          "wordCount": null,
          "title": "광부엄마, 태백시의 현실을 비추는 여성 광부의 삶",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=116007",
          "author": "이정환",
          "description": "“심정지 환자만 받을 수 있습니다.” 응급실 뺑뺑이 돌던 두 살 아기. 쟁점과 현안. “창조론을 학교에서 가르치면 좋겠다.” 네 번째 채 상병 특검법. 감기 환자 응급실행? 실손보험이 변수. 더 깊게 읽기. 문재인과 다를 게 뭔가, 차갑게 식은 조선일보. 역대급 전력 수요 버틴 비결은? 내년 예산안의 네 가지 문제. 정부 ‘쌈짓돈’이 늘었다. 구글코리아 매출은 12조 원. 다르게...\nThe post 극우의 주류화, 가장 큰 위험은 우리가 여기에 익숙해지는 것: 슬로우레터 9월4일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/116007",
          "publishedOn": "2024-09-03T22:19:59.000Z",
          "wordCount": null,
          "title": "극우의 주류화, 가장 큰 위험은 우리가 여기에 익숙해지는 것: 슬로우레터 9월4일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115952",
          "author": "민노씨",
          "description": "아무도 없는 숲속에서 커다란 나무가 쓰러졌다. 쿵 소리가 났겠는가? 안 났겠는가? 아무도 없는 숲속에서, 2024, 손호영 극본, 넷플릭스. 드라마 [아무도 없는 숲속에서] (이하 ‘숲속에서’)는 매회 주인공을 달리하며 이렇게 독백한다. 이 독백은 드라마의 진실을 관통하는 수수께끼 같다. 이 수수께끼를 함께 풀어보고 생각하는 것, 그게 이 글의 목적이다. 본질주의와 구성주의 이 질문은 뻔한 것 같아 보인다. 그런데...\nThe post 죄와 벌, 그 상처의 가청 범위: 본격 부동산 스릴러 [아무도 없는 숲속에서] appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115952",
          "publishedOn": "2024-09-03T08:12:38.000Z",
          "wordCount": null,
          "title": "죄와 벌, 그 상처의 가청 범위: 본격 부동산 스릴러 [아무도 없는 숲속에서]",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115913",
          "author": "이정환",
          "description": "국회 개원, 두 가지 놀라운 사실. 쟁점과 현안. “응급실 상황 엄중.” 응급실 의료진 43% 줄었다. 그래서 해법은? “추석에 아프면 안 된다.” 저녁에도 아프면 안 된다. 의료 개혁을 완수한 정권으로 남지 않겠나. 전공의들은? 알바 중. 다르게 읽기. 의대 증원 1만 명 부족하다는 주장의 근거는. “내 처지와 상황이 그렇다.” 더 깊게 읽기. ‘계엄 괴담’ 나도는 이유. 계엄이라는...\nThe post 개혁을 완수한 정권으로 남지 않겠나, 의료 대란에 윤석열이 버티는 이유: 슬로우레터 9월3일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115913",
          "publishedOn": "2024-09-02T20:59:20.000Z",
          "wordCount": null,
          "title": "개혁을 완수한 정권으로 남지 않겠나, 의료 대란에 윤석열이 버티는 이유: 슬로우레터 9월3일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115895",
          "author": "참여연대 사법감시센터",
          "description": "‘N번방 사태’ 이후 수사기관이 엄정한 형사 처리를 공언했음에도 불구하고, 텔레그램 등을 중심으로 딥페이크(deepfake)를 이용한 성범죄 실태가 매우 심각한 수준이라는 것이 재확인됐습니다. 디지털 성범죄에 대한 미온적인 경찰 수사는 시민의 불신을 초래했고, 이에 대한 반동으로 ‘함정수사’ 등을 이용한 수사가 필요하다는 주장이 제기됩니다. 그러나 섣부른 함정수사가 ‘위법한 수사’로 진행된다면, 오히려 가해자의 무죄 근거로 활용될 위험도 큰데요. 우리나라 법은...\nThe post 함정수사, 그 모호한 경계: 기회 제공은 합법, 범의 유발은 위법 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115895",
          "publishedOn": "2024-09-02T08:40:57.000Z",
          "wordCount": null,
          "title": "함정수사, 그 모호한 경계: 기회 제공은 합법, 범의 유발은 위법",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115870",
          "author": "한상기",
          "description": "1. 영국 AI 전략을 재편하려는 노동당, 이유는 비용 절감! 로이터, 8월 29일 영국의 AI 전략은 우리에게 늘 중요한 참고가 되어 왔다. 2021년 9월 22일에 발표한 국가 AI 전략은 2022년 12월 18일에 수정했고 그 내용은 웹사이트를 통해서 공개했다. 또한 2023년 11월에 개최한 블레츨리 AI 안전 정상회의를 통해 AI 안전 분야에서는 세계를 리드하는 국가가 되고자 하는 의지를...\nThe post 왜 AI는 예술 작품을 만들지 못하는가 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115870",
          "publishedOn": "2024-09-02T04:30:08.000Z",
          "wordCount": null,
          "title": "왜 AI는 예술 작품을 만들지 못하는가",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115823",
          "author": "이정환",
          "description": "윤석열 지지율 다시 23%. 쟁점과 현안. 문재인이 피의자라고? 결혼한 딸과 경제 공동체 맞나. “결백”이 아니라 “정국 전환용”이라 말하는 이유. 김건희 수사심의위에 최재영 안 불렀다. 더 깊게 읽기. 빈손? 첫발? 합의한 것과 못한 것. 한동훈의 알리바이 정치. 다르게 읽기. 윤석열의 낙관론이 위험한 이유. 은행 이자 수익 29.8조 원. 딥페이크 피해자 60%와 가해자 76%가 10대. 해법과 대안....\nThe post 김건희 뭉개던 검찰이 문재인을 피의자로 몰아붙이는 이유: 슬로우레터 9월2일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115823",
          "publishedOn": "2024-09-01T22:19:43.000Z",
          "wordCount": null,
          "title": "김건희 뭉개던 검찰이 문재인을 피의자로 몰아붙이는 이유: 슬로우레터 9월2일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115817",
          "author": "신현호",
          "description": "같은 사건을 다룬 전혀 다른 두 건의 기사가 있다. 첫 번째 기사: “아마존, 막대한 이윤을 내며 진격”. 2020년 4사분기 아마존 실적 발표를 다룬 뉴욕타임스 기사 제목이다. 매출이 874억 달러로 전년 대비 21% 늘었고, 사용자 증가도 역대 최대였다. 주당순이익이 6.47달러로 시장 컨세서스 4.04달러를 훌쩍 뛰어넘었다. 두 번째 기사: “아마존 1조 달러 이정표 놓쳐”. 같은 이슈를 다룬...\nThe post 팔은 안으로 굽었다: 숫자로 확인한 NYT와 WSJ의 당파성. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115817",
          "publishedOn": "2024-09-01T15:05:38.000Z",
          "wordCount": null,
          "title": "팔은 안으로 굽었다: 숫자로 확인한 NYT와 WSJ의 당파성.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115799",
          "author": "박미숙",
          "description": "복수란 무엇인가? 사전에 복수란 해를 입은 피해자가 가해자에게 해를 돌려주는 행위다. 하지만 그 사전적 정의는 얼마나 껍데기인가. 얼마나 무의미인가. 현실의 복수는 영원히 채워지지 않는 욕망이다. 왜냐하면 완벽한 복수란 기적에 가깝기 때문이다. 가령 뉴스와 드라마 그리고 영화 속 복수를 보라. 이들이 다루는 복수는 대체로 성공하지만 결국은 처음부터 성공이라는 건 없다. 그 피해가 이미 채워질 수 없는...\nThe post 2024년, 우리에게 복수란 무엇인가 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115799",
          "publishedOn": "2024-09-01T00:27:19.000Z",
          "wordCount": null,
          "title": "2024년, 우리에게 복수란 무엇인가",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115761",
          "author": "민주언론시민연합",
          "description": "윤석열 정부가 친일반민족 색채를 거리낌 없이 드러내는 지경에 이르렀습니다. 김태호 대통령실 국가안보실 1차장은 “중요한 건, 일본의 마음”이라며 “국익을 중시한 것”이란 친일발언을 내놓고, 각 부처 장관과 방송통신위원장까지 ‘1945년 광복’을 부정하는 망언을 이어가고 있습니다. 허동현 국사편찬위원장, 김낙년 한국학중앙연구원장, 박지향 동북아역사재단 이사장 등 3대 역사기관 수장은 뉴라이트·극우 성향 인물로 채워지고, 관련 공공기관으로 넓히면 그 인원이 20여 명에 달합니다....\nThe post “못난 반일(反日)” 일장기 신문 조선일보의 훈계 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115761",
          "publishedOn": "2024-08-30T07:42:52.000Z",
          "wordCount": null,
          "title": "“못난 반일(反日)” 일장기 신문 조선일보의 훈계",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115723",
          "author": "이정환",
          "description": "부실한 온실가스 감축목표, 국민의 기본권을 침해했다. 쟁점과 현안. 윤석열의 세 번째 기자회견. 목소리 높아지고 주먹도 불끈. 언론의 총평, “국민이 바보인가.” “달라진 게 없다.” 더 깊게 읽기. 차등보험료와 자동안정장치. “경제는 확실히 살아나는 중.” 김문수 임명, 청문보고서 채택 없이 27번째 인사. 해직 교사 특별 채용 유죄, 조희연 교육감직 상실. 곽노현 다시 출마할까. 이재명 수사 검사 탄핵안 기각....\nThe post 혼자 다른 나라에 사나, 윤석열 세 번째 기자회견에 쏟아진 탄식과 분노: 슬로우레터 8월30일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115723",
          "publishedOn": "2024-08-29T22:08:35.000Z",
          "wordCount": null,
          "title": "혼자 다른 나라에 사나, 윤석열 세 번째 기자회견에 쏟아진 탄식과 분노: 슬로우레터 8월30일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115652",
          "author": "이정환",
          "description": "[슬로우리포트] 오래된 질문과 지극히 상식적인 답변, 대한민국은 언제 건국됐나. “Is it weird? Absolutely.” 팀 월즈(미국 민주당 부통령 후보)가 한 말이다. 도널드 트럼프(미국 공화당 후보)와 그 지지자들을 두고 하는 말이지만 요즘 한국에서 광복절을 두고 벌어지는 논란을 보면 이 말이 떠오른다. 장면 1. 8월26일, 국회 정무위원회 회의. 장면 2. 8월26일, 고용노동부 장관 인사 청문회. 이게 왜 중요한가. 사실....\nThe post 저 사람들 정말 이상하지 않아요? appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115652",
          "publishedOn": "2024-08-29T08:28:48.000Z",
          "wordCount": 4897,
          "title": "저 사람들 정말 이상하지 않아요?",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/08/desk_20240827_195934_1_6_Large.jpg"
        },
        {
          "id": "https://slownews.kr/?p=115405",
          "author": "민노씨",
          "description": "미 대선 어떻게 볼 것인가. 어떻게 봐야 하나. 몇 가지 ‘힌트’를 얻고자 미국 최대의 경합 주 중 하나인 펜실베이니아 주 필라델피아에 사는 캡콜드(김낙호 교수, 드렉셀대학교 커뮤니케이션과)에게 미 대선의 프레임 전쟁, 그 현재 스코어를 물었다. 1. 해리스, 공화당의 ‘자유’를 영리하게 탈취하다 이번 미 대선 최대 이슈는 낙태와 이민이다. 해리스는 직접 ‘낙태’라는 표현을 쓰기보다는 “당신 몸에 관해...\nThe post 해리스는 어떻게 공화당으로부터 ‘자유’를 되찾아 왔나 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115405",
          "publishedOn": "2024-08-29T08:23:52.000Z",
          "wordCount": 7080,
          "title": "해리스는 어떻게 공화당으로부터 ‘자유’를 되찾아 왔나",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/08/53030024773_e5a273350b_k.jpg"
        },
        {
          "id": "https://slownews.kr/?p=115613",
          "author": "민주언론시민연합",
          "description": "방송통신위원회가 위기에 빠졌다. 위기 원인은 분명하다. 공영방송 이사진을 교체할 수 있는 권한 때문에 중요한 정치 격변기마다 방송통신위원회는 항상 시끄러웠다. 그러나 최근 같은 파행은 없었다. 드러난 방송통신위원회의 한계 윤석열 정부는 이동관, 김홍일에 이어 이진숙 전 대전MBC 사장을 세 번째 방송통신위원장으로 임명했다. 이진숙 방송통신위원장은 2024년 7월 31일 취임 당일, 100분 만에 MBC 대주주 방송문화진흥회 이사 지원자 80여...\nThe post 2인 체제 ‘위법 파행’ 방통위, 독립적 미디어위원회로 개편하자 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115613",
          "publishedOn": "2024-08-29T01:57:31.000Z",
          "wordCount": 4539,
          "title": "2인 체제 ‘위법 파행’ 방통위, 독립적 미디어위원회로 개편하자",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/08/art_648849_1722409287.jpg"
        },
        {
          "id": "https://slownews.kr/?p=115567",
          "author": "이정환",
          "description": "“굴복하면 정상적인 나라 아니다.” “응급실을 너무 만만하게 본다.” “병원장 아버지도 뺑뺑이 돌다 돌아가셨다.” 윤석열-한동훈, 밥 안 먹는다. 쟁점과 현안. 모처럼 국회가 일했다. 피해학교 500여 곳, 중학생이 만든 딥페이크 지도. “세상이 무너졌다.” 재판 넘겨져도 절반이 집행유예. 미국은 제작만 해도 처벌한다. 더 깊게 읽기. 중대재해 처벌법 위반, 아리셀 대표 구속. 관치가 왜곡한 금리. 부모 소득과 거주 지역이...\nThe post “굴복하면 정상적인 나라 아니다”, 윤석열은 남은 임기를 버틸 수 있을까: 슬로우레터 8월29일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115567",
          "publishedOn": "2024-08-28T22:23:14.000Z",
          "wordCount": 6339,
          "title": "“굴복하면 정상적인 나라 아니다”, 윤석열은 남은 임기를 버틸 수 있을까: 슬로우레터 8월29일.",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/08/sCEnTAwr2wpR66cd983f4baf20.01914641-1000x652.jpeg"
        },
        {
          "id": "https://slownews.kr/?p=115424",
          "author": "이정환",
          "description": "윤석열과 한동훈의 다섯 번째 충돌. 한동훈은 기분이 좋지 않다. 의사들이 받을까. 쟁점과 현안. “마른 수건을 쥐어짰다”는데. 약자 복지가 아니라 약한 복지. 뺏었다 다른 사람 주는 복구. 딥페이크 텔레그램 채널 22만 명. “처음이라”, “어려서”, “반성하니까.” PA 간호사법 합의. 더 깊게 읽기. 자살 직전 97%가 신호를 보낸다. 도장값만 수천만 원. 다르게 읽기. 방통위 딜레마. 불났을 때 화장실,...\nThe post 한동훈의 헤어질 결심? 윤석열과 다섯 번째 충돌: 슬로우레터 8월28일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115424",
          "publishedOn": "2024-08-27T22:12:02.000Z",
          "wordCount": null,
          "title": "한동훈의 헤어질 결심? 윤석열과 다섯 번째 충돌: 슬로우레터 8월28일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115337",
          "author": "참여연대 의정감시센터",
          "description": "22대 국회가 개원했습니다. 유권자의 소중한 한 표, 한 표를 읍소하며 당선된 300명의 국회의원이 과연 유권자를 위해 제대로 일하는지 지켜보고 감시해야 할 때입니다. 이들이 어떤 일을 하는지, 어떤 일을 해야 하는데 안하는지에 따라 우리의 삶이 달라지니까요. 참여연대 의정감시센터는 칼럼을 통해 유권자의 시각에서 22대 국회와 정치를 비평합니다. 무엇보다 ‘중’요한 건 ‘꺾’이지 않는 ‘정’치개혁이니까요. 이번 칼럼의 필자는 서복경(참여연대 의정감시센터...\nThe post 통치 음모론 vs. 저항 음모론: 윤석열과 김민석 그리고 하나둘 사라지는 독도 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115337",
          "publishedOn": "2024-08-27T06:58:48.000Z",
          "wordCount": null,
          "title": "통치 음모론 vs. 저항 음모론: 윤석열과 김민석 그리고 하나둘 사라지는 독도",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115313",
          "author": "신현호",
          "description": "1. 연준의 승리 선언 제롬 파월 미국 연준 의장은 8월 23일 인플레이션에 대한 승리를 선언했다. 무대는 ‘잭슨 홀 미팅’(Jackson Hole Meeting)이라 불리는 와이오밍주 그랜드 테튼 국립공원 내 휴양지에서 개최된 연례 경제 심포지엄이었고, 관객은 연준과 각국 중앙은행의 주요 인사들, 취재차 달려온 기자들 그리고 생방송으로 지켜본 전 세계의 투자자들이었다. 파월의 이날 메시지는 요약하면 다음과 같았다. 이 메시지는...\nThe post 트럼프는 연준의장 파월을 해고할 수 있을까? appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115313",
          "publishedOn": "2024-08-27T03:09:57.000Z",
          "wordCount": null,
          "title": "트럼프는 연준의장 파월을 해고할 수 있을까?",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115269",
          "author": "이정환",
          "description": "이진숙 방통위, 맘대로 못 한다. 이진숙의 딜레마. 권태선의 투쟁. 쟁점과 현안. 한동훈의 제안, “내년 의대 정원 유예하자.” “채 상병 특검법 빨리 내라.” 윤석열 명예훼손 수사, 통신 조회 최소 3176명. 다르게 읽기. “1945년 광복 인정하나?” “멘트하지 않겠다.” “‘임시정부 수립=건국’은 억지다.” 더 깊게 읽기. 딥페이크 범죄 가벼운 처벌이 문제. 당첨만 되면 20억 원, 로또 만드는 분양가 상한제....\nThe post ‘셀카왕’ 한동훈의 ‘발 연기’에 진정성이 안 보이는 이유: 슬로우레터 8월27일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115269",
          "publishedOn": "2024-08-26T22:11:57.000Z",
          "wordCount": null,
          "title": "‘셀카왕’ 한동훈의 ‘발 연기’에 진정성이 안 보이는 이유: 슬로우레터 8월27일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114978",
          "author": "김훤주",
          "description": "[김훤주의 지역에서 본 세상] 베테랑 기자 김훤주가 세상 이야기를 따뜻하고 담백한 시선으로 전합니다. 8월 15일에 창녕박물관을 찾아갔었다. 전시 내용을 둘러보는데 적지 않게 당황스러웠다. 설렁설렁 훑어보았는데도 잘못되거나 적당하지 않은 표현이 여러 군데 있었다. 안내데스크에 말했더니 “휴일이라 학예사가 없고 자기는 해설사라 책임 있는 대답을 하기 어렵다”면서 “전달해 드릴 수는 있지만 이런 지적은 담당자에게 직접 해야 더 효과가...\nThe post “예산 없어요 내년에 고칠게요” 창녕박물관 엉터리 해설 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114978",
          "publishedOn": "2024-08-26T08:56:05.000Z",
          "wordCount": null,
          "title": "“예산 없어요 내년에 고칠게요” 창녕박물관 엉터리 해설",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115167",
          "author": "한상기",
          "description": "1. AI는 기술 부채를 해결하는 데 아주 효과적인 도구다 아마존 앤디 재시의 트윗, 8월 22일 개인적으로 AI에 대한 가장 많은 소식과 의견을 듣는 공간은 아직 과거 트위터였던 X.com이다. 8월 22일에 아마존의 사장인 앤디 재시가 올린 트윗을 보았다. 그는 아마존의 Q라는 소프트웨어 개발 어시스턴트를 이용해 아마존이 기술 부채를 어떻게 효과적으로 해결할 수 있었는지 알렸다. 기업에서 개발자들도...\nThe post AI 진화가 생물학적 지옥문을 열 수도 있다: 4가지 역량, 5가지 예방책 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115167",
          "publishedOn": "2024-08-26T07:48:34.000Z",
          "wordCount": null,
          "title": "AI 진화가 생물학적 지옥문을 열 수도 있다: 4가지 역량, 5가지 예방책",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115090",
          "author": "이정환",
          "description": "김건희 사건, 수사심의위로 간다. 이원석의 결단. “수사심의위 망설일 것 없다.” 쟁점과 현안. 정부+가계 부채 3000조 원 시대. 글로벌 피벗 임박했는데. 이스라엘-헤즈볼라 폭격. 더 깊게 읽기. 한은 압박하는 대통령실. 간호사 총파업. 피할 수 있었던 죽음 늘어난다. 추석 연휴 셧 다운 우려. 다르게 읽기. 샤이 트럼프 얼마나 될까. 선 벨트와 러스트 벨트. 해법과 대안. ‘세이 온 클라이밋’....\nThe post 검찰총장의 마지막 자존심, 수심위는 김건희를 건드릴 수 있을까: 슬로우레터 8월26일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115090",
          "publishedOn": "2024-08-25T22:19:33.000Z",
          "wordCount": null,
          "title": "검찰총장의 마지막 자존심, 수심위는 김건희를 건드릴 수 있을까: 슬로우레터 8월26일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115049",
          "author": "이정환",
          "description": "기록적인 폭우, 물 폭탄과 침수, 고립, 피해… 장마철마다 반복되는 기사다. 어떻게 다른 방식으로 쓰고 다른 문제의식을 끌어낼 수 있을까. JIBS제주방송 기사 두 건이 눈길을 끈다. “유역 차원에서 배수를 시켜줘야 한다”는 박창열(제주연구원 연구위원)의 인터뷰와 함께 “분담형 치수 대책이 시급하다”고 지적했다. “정확한 홍수량조차 파악하지 못하고 있다”는 기사도 있었다. 10년 이상 데이터를 축적해야 분석이 가능한데 4개 관측소에서 유량과...\nThe post 지역 기반 솔루션 저널리즘 네트워크 모델을 만들자. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115049",
          "publishedOn": "2024-08-25T12:52:55.000Z",
          "wordCount": null,
          "title": "지역 기반 솔루션 저널리즘 네트워크 모델을 만들자.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114983",
          "author": "민주언론시민연합",
          "description": "7월 27일, 일본 니가타현의 ‘사도광산’이 유네스코 세계문화유산으로 등재되었다. 2010년 일본 정부가 사도광산을 유네스코 세계 유산 추천 잠정 목록에 등재한 이후 14년 만의 일이다. 한국에서는 사도광산의 세계 유산 등재에 대한 비판적인 목소리가 끊이지 않고 있다. 사도광산이 일제 강점기 당시 조선인을 강제 동원해 가혹한 노동을 시켰던 아픈 역사의 현장이기 때문이다. 한국 정부는 등재 과정에서 역사적 사실이 충분히...\nThe post “조선인 강제노동 사실무근” 사도광산의 역사적 진실 부정하는 일본의 극우 언론 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114983",
          "publishedOn": "2024-08-23T08:35:34.000Z",
          "wordCount": null,
          "title": "“조선인 강제노동 사실무근” 사도광산의 역사적 진실 부정하는 일본의 극우 언론",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114963",
          "author": "참여연대 사법감시센터",
          "description": "비정규직 차별에 맞서 노동조합을 설립한 이후, 회사로부터 ‘문자 한 통’으로 해고됐던 아사히글라스 해고 노동자들이 출근길에 나섰습니다. 이에 이르기까지 9년의 시간과 대법원의 세 판결이 있었습니다. 직접고용을 구하는 민사, 부당노동행위가 쟁점인 행정, 파견법 위반이 문제 된 형사의 세 판결입니다. 대법원은 아사히글라스 하청업체 해고 노동자의 근로자 지위를 인정하고, 사측의 파견법 위반 인정했지만, 사측의 부당노동행위에 대해선 인정하지 않았습니다. 각각의...\nThe post ‘문자 한 통 해고’ 아사히글라스 9년 투쟁… 얼마나 더 싸워야 하는가 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114963",
          "publishedOn": "2024-08-23T07:29:46.000Z",
          "wordCount": null,
          "title": "‘문자 한 통 해고’ 아사히글라스 9년 투쟁… 얼마나 더 싸워야 하는가",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114859",
          "author": "이정환",
          "description": "최장기 금리 동결. 쟁점과 현안. 윤석열의 불만, “선제 대응 아쉽다.” 집값에 달렸다. 윤석열의 뒤끝, 보수판 광복회 만든다. 디올 백 무혐의, 수사심의위 거쳐라. 더 깊게 읽기. 이자 장사로 30조 원 이익. “누구 때문인데.” 윤석열이 술을 안 먹는다고? “저 사람이 우리 아빠야.” 다르게 읽기. “최저임금 다 줄 필요 있나.” 한동훈의 차별화. 저출산 대책, 세금 더 낼 수...\nThe post 윤석열이 요즘 술을 자제하고 있다는 놀라운 사실: 8월23일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114859",
          "publishedOn": "2024-08-22T22:13:15.000Z",
          "wordCount": null,
          "title": "윤석열이 요즘 술을 자제하고 있다는 놀라운 사실: 8월23일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114838",
          "author": "이정환",
          "description": "국민권익위원회에서 만든 카드뉴스가 화제다. 언뜻 보면 ‘가짜뉴스’로 오해할 정도로 믿기 어려운 내용이다. 가뜩이나 김건희(대통령 부인)를 닮은 것 같은 캐릭터까지 있는데 놀랍게도 이 카드뉴스는 진짜였다. 국민권익위가 만들어서 홈페이지에 올려놓은 카드뉴스다. ‘가짜뉴스’가 아니었다. 이 카드뉴스가 말하지 않는 것. 직무 관련성이 없으니 괜찮다고? 최재영과 윤석열이 직무 관련성이 없는 건 맞나? 대통령 부인에게 300만 원 상당의 엿을 선물한다면? 핵심은...\nThe post “직무 관련 없으면 선물 가능”, ‘괴짤’의 실체는? appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114838",
          "publishedOn": "2024-08-22T13:36:31.000Z",
          "wordCount": null,
          "title": "“직무 관련 없으면 선물 가능”, ‘괴짤’의 실체는?",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114783",
          "author": "홍윤희",
          "description": "팀 월즈 미네소타주지사가 카멀라 해리스 부통령의 러닝메이트로 발표된 지 몇 시간 만에 펜실베이니아주 필라델피아에서 14,000명이 운집한 미 민주당 첫 정∙부통령 후보 공동 유세를 본 몇 가지 느낌을 공유한다. 대학 부전공(커뮤니케이션)과 20년 회사 경력(홍보)에 의거한 지극히 개인적 평가이며 반박 시 반박하는 분이 맞는 걸로. 😉 월즈 주지사. 민주당 역대 대선후보 중 케네디 이후 연설(stump speech) 가장...\nThe post 민주당 부통령 후보 월즈의 일곱 가지 연설 전략: 역대 최고(🐐) 인정! appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114783",
          "publishedOn": "2024-08-22T02:20:41.000Z",
          "wordCount": null,
          "title": "민주당 부통령 후보 월즈의 일곱 가지 연설 전략: 역대 최고(🐐) 인정!",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114744",
          "author": "이정환",
          "description": "김건희 디올 백 무혐의. 윤석열 검사라면 어땠을까. 총장 패싱? 이원석의 시간이 됐다. 쟁점과 현안. 한동훈-이재명 회담 생중계가 변수. 윤석열 정부 경제가 빠진 세 가지 함정. 세수 56조 원 펑크, 순방비는 예비비로. 민주당 방통위원 2명 추천한다. “이게 나라냐”, 중앙일보 논설위원의 한숨. 더 깊게 읽기. 이재명표 감세 법안. 뜬금없이 문재인 사위 털기. 재일동포 학교 교토국제고, 고시엔 결승...\nThe post “이게 나라냐”, 디올 백은 무혐의, 경제는 엉망, 보수 언론도 ‘부글부글’:슬로우레터 8월22일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114744",
          "publishedOn": "2024-08-21T22:18:14.000Z",
          "wordCount": null,
          "title": "“이게 나라냐”, 디올 백은 무혐의, 경제는 엉망, 보수 언론도 ‘부글부글’:슬로우레터 8월22일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114701",
          "author": "민주언론시민연합",
          "description": "2022년 8월 서울엔 시간당 최대 141.5㎜의 기록적인 폭우가 쏟아졌다. 극한호우 기준인 시간당 72㎜의 두 배가량으로 신림동과 상도동 반지하 주택에서는 다수의 사망자가 발생했다. 문제는 역대급 폭우가 더 새로운 일이 아니라는 것이다. 기후위기로 ‘더 자주, 더 세게’ 폭우가 발생할 가능성이 높아지고 있다. 앞으로 50년 이내 시간당 200㎜의 비가 내릴 수 있다니, 이제 폭우는 여름철 일상이 되었다. 변화된...\nThe post 빗물에 세금을? 도쿄∙베를린에서 ‘힌트’ 얻는 극한호우 대책 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114701",
          "publishedOn": "2024-08-21T09:12:29.000Z",
          "wordCount": null,
          "title": "빗물에 세금을? 도쿄∙베를린에서 ‘힌트’ 얻는 극한호우 대책",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114654",
          "author": "이정환",
          "description": "“용산에서 심각하게 보고 있다고, 머리가 하얘지는 느낌이었다.” 채 상병 사건 경찰판? 여기도 김건희의 그림자. 쟁점과 현안. 가계부채 1896조 원, 골든타임 놓쳤나. 윤석열 거부권 행사한 전세사기법 여야 합의로 통과. 추석이 두렵다. 의대생 1년 유급, 감당할 수 있나. 더 깊게 읽기. 이재명 앞의 세 가지 태풍. ‘임대 문의’ 늘어나는 이유. “나는 내 일을 사랑했지만 미국을 더 사랑했다.”...\nThe post 마약 외압 사건에 김건희 개입 의혹이 나오는 이유: 슬로우레터 8월21일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114654",
          "publishedOn": "2024-08-20T22:33:45.000Z",
          "wordCount": null,
          "title": "마약 외압 사건에 김건희 개입 의혹이 나오는 이유: 슬로우레터 8월21일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114607",
          "author": "신현호",
          "description": "1. 해리스의 약진 여론조사에 따라 조금씩 다르게 나오지만 해리스가 지지율에서 트럼프를 약간 앞서고 있을 뿐 아니라 차이를 벌리고 있다는 점은 공통적이다. 아직 결과를 알 수는 없으나 불과 45일 전 바이든이 TV 토론에서 참패한 이래 민주당의 승리 가능성이 곤두박칠쳤던 것을 고려하면 상전벽해라고 할 수 있을 정도이다. 자신의 돈을 걸고 대통령 당선 결과를 맞추는 정치 예측 플랫폼에서도...\nThe post 가격통제, 해리스의 승부수 또는 해프닝 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114607",
          "publishedOn": "2024-08-20T04:01:21.000Z",
          "wordCount": null,
          "title": "가격통제, 해리스의 승부수 또는 해프닝",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114594",
          "author": "김훤주",
          "description": "[김훤주의 지역에서 본 세상] 베테랑 기자 김훤주가 세상 이야기를 따뜻하고 담백한 시선으로 전합니다. 며칠 전 삿갓배미를 보았다. 옛날에는 흔했지만 요즘은 귀해진 삿갓배미를 보니 기분이 좋았다. 삿갓은 삿갓처럼 조그맣다는 말이고 배미는 한 배미 두 배미 세 배미 하며 논을 헤아리는 단위다. 삿갓배미의 유래는 이렇다. 옛날 농부가 논에서 김을 매다가 세어 봤더니 한 배미가 모자랐다. 아무리 찾아도...\nThe post 삿갓배미, 가난의 간절함이 만든 아름다운 다랑논 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114594",
          "publishedOn": "2024-08-20T02:58:58.000Z",
          "wordCount": null,
          "title": "삿갓배미, 가난의 간절함이 만든 아름다운 다랑논",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114550",
          "author": "이정환",
          "description": "쟁점과 현안. 네이버 항의 방문한 국민의힘. 한동훈-이재명 만난다. 더 깊게 읽기. 긱 이코노미 시대. 자영업자도 계속 줄고 있다. 쌀값 폭락, 풍년이 반갑지 않다. 다르게 읽기. “오염수 괴담 1년도 못 갔다.” 투자자 상위 1%가 401조 원 주식 보유. 지나치게 좋은 건 좋지 않을 수도 있다. 해법과 대안. 골든아워 도착률, 서울은 94%, 충북은 41%. 보호출산제 한 달...\nThe post 광복절 ‘나비부인’ 사고, 실수도 우연도 아닐 수 있다: 슬로우레터 8월20일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114550",
          "publishedOn": "2024-08-19T22:11:25.000Z",
          "wordCount": null,
          "title": "광복절 ‘나비부인’ 사고, 실수도 우연도 아닐 수 있다: 슬로우레터 8월20일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114521",
          "author": "한상기",
          "description": "1. 당신의 논문이 AI 학습용으로 사용될 가능성이 높아졌다 네이처, 8월 14일 지금 생성형 AI의 큰 과제는 품질이 높은 학습용 데이터 확보다. 그래서 오픈AI를 필두로 빅 테크 기업은 고품질 데이터를 갖고 있는 기업이나 조직과 협의를 통해 경쟁적인 데이터 라이센스 계약을 하고 있다. 들리는 얘기로는 2022년 말에 이미 인터넷의 거의 모든 데이터를 학습용으로 사용했으며 더 이상의 의미...\nThe post AI 학습용 데이터가 말라가고 있다 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114521",
          "publishedOn": "2024-08-19T06:42:53.000Z",
          "wordCount": null,
          "title": "AI 학습용 데이터가 말라가고 있다",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114450",
          "author": "이정환",
          "description": "‘중일마’ 파문. 쟁점과 현안. 이재명 연임 성공. 정봉주 탈락. “배타적 행태 배격하자”, 문재인 축사에 야유. 더 깊게 읽기. 채 상병 특검법 새로운 변수. 25만 원도, 노란봉투법도 거부권. “그냥 쉰다”는 청년 5.4%. 개딸 닮아가는 한동훈 강성 팬덤. “회의록은 없습니다.” “대통령 주위에 이상한 역사의식 부추기는 이들.” 다르게 읽기. 5억 상속은 0원, 5억 소득은 1억 원. 총주주수익률을 아십니까....\nThe post “중요한 건 일본의 마음”? 어느 나라 정부인가: 슬로우레터 8월19일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114450",
          "publishedOn": "2024-08-18T22:10:25.000Z",
          "wordCount": null,
          "title": "“중요한 건 일본의 마음”? 어느 나라 정부인가: 슬로우레터 8월19일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114422",
          "author": "이정환",
          "description": "[슬로우리포트] 바이오로직스 과징금 처분은 취소, 제일모직 분식회계는 인정… 이재용 편법 승계 항소심 뒤집힐 수도 있다. 분식회계 의혹 승소? 이게 왜 중요한가. 이재용의 복잡한 사연. 이재용의 세 가지 꼼수. 4조8085억 원, 바이오로직스의 마법. 세 가지 범죄 의혹. 2015년 9월15일 무슨 일이 있었나. 결국 이재용 지분 늘려주기 프로젝트였다. TMI지만 결정적인 변수. 두 가지 충돌하는 재판 결과. 이것이...\nThe post 삼바 승소? 이재용이 떨고 있는 이유. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114422",
          "publishedOn": "2024-08-18T07:04:31.000Z",
          "wordCount": null,
          "title": "삼바 승소? 이재용이 떨고 있는 이유.",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "꿈꾸는섬",
      "feedUrl": "https://happist.com/feed",
      "siteUrl": "https://happist.com",
      "articles": [
        {
          "id": "https://happist.com/?p=595924",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595924/%eb%8f%84%ec%9d%b4%ec%b2%b4%eb%b0%a9%ed%81%ac-%ec%98%ac%ed%95%b4%eb%a7%90-sp-500-%ec%a0%84%eb%a7%9d-5750-%ec%a3%bc%ec%9e%a5",
          "publishedOn": "2024-09-15T04:52:56.000Z",
          "wordCount": null,
          "title": "도이체방크, 올해말 S&P 500 전망 5,750 주장",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595922",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595922/sp-global-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%a3%bc%ea%b0%80-%ec%83%81%ec%8a%b9%ec%9d%80-%ed%96%a5%ed%9b%84-1%eb%85%84%ec%9d%b4%ec%83%81-%ec%a7%80%ec%86%8d%eb%90%a0-%ea%b2%83",
          "publishedOn": "2024-09-14T10:01:45.000Z",
          "wordCount": null,
          "title": "S&P Global, 엔비디아 주가 상승은 향후 1년이상 지속될 것",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595917",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595917/9-14-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d-%eb%b3%b4%ea%b3%a0%ec%84%9c",
          "publishedOn": "2024-09-14T07:06:51.000Z",
          "wordCount": null,
          "title": "9/14, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595908",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595908/9-12-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d-%eb%b3%b4%ea%b3%a0%ec%84%9c",
          "publishedOn": "2024-09-11T22:03:47.000Z",
          "wordCount": null,
          "title": "9/12, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595906",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595906/%ec%a3%bc%ec%8b%9d-%eb%a7%a4%eb%8f%84-%ec%8b%9c%ea%b8%b0%eb%8a%94-%ec%96%b8%ec%a0%9c%ec%9d%b8%ea%b0%80",
          "publishedOn": "2024-09-11T05:43:40.000Z",
          "wordCount": null,
          "title": "주식 매도 시기는 언제인가?",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595902",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595902/%ec%95%84%ec%9d%b4%ed%8f%b016-%ec%95%84%ec%9d%b4%ed%8f%b0-%ec%8b%a0%ec%a0%9c%ed%92%88-%ec%b6%9c%ec%8b%9c%eb%a5%bc-%eb%b3%b4%eb%8a%94-%ec%9b%94%ea%b0%80%ec%9d%98-%ec%8b%9c%ec%84%a0",
          "publishedOn": "2024-09-11T05:07:31.000Z",
          "wordCount": null,
          "title": "애플 아이폰 신제품(아이폰16) 출시를 보는 월가의 시선",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595895",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595895/9-11-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d-%eb%b3%b4%ea%b3%a0%ec%84%9c",
          "publishedOn": "2024-09-10T22:02:42.000Z",
          "wordCount": null,
          "title": "9/11, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595892",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595892/9-10-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d-%eb%b3%b4%ea%b3%a0%ec%84%9c",
          "publishedOn": "2024-09-09T21:55:19.000Z",
          "wordCount": null,
          "title": "9/10, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595890",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595890/%ec%8b%9c%ed%8b%b0-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%a3%bc%ea%b0%80%eb%8a%94-%ec%83%81%ec%8a%b9%ed%95%98%ec%a7%80%eb%a7%8c-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%a7%80%eb%b0%b0%eb%a0%a5",
          "publishedOn": "2024-09-09T13:47:50.000Z",
          "wordCount": null,
          "title": "시티, 엔비디아 주가는 상승하지만, 엔비디아 지배력 끝나고 엔비디아 주가 상승은 끝나고 있다.",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595888",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595888/9-7-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d-%eb%b3%b4%ea%b3%a0%ec%84%9c",
          "publishedOn": "2024-09-07T11:29:23.000Z",
          "wordCount": null,
          "title": "9/7, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595886",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595886/%eb%b0%b0%eb%9f%b0%ec%8a%a4-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%a3%bc%ea%b0%80-%ed%8f%ad%eb%9d%bd-%ed%9b%84-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2024-09-05T03:09:20.000Z",
          "wordCount": null,
          "title": "[배런스] 엔비디아 주가 폭락 후 엔비디아 주가 전망",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595882",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595882/9-5-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d-%eb%b3%b4%ea%b3%a0%ec%84%9c",
          "publishedOn": "2024-09-04T22:34:52.000Z",
          "wordCount": null,
          "title": "9/5, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595878",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595878/%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d-%ec%9b%94%ea%b0%80%eb%8a%94-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%a3%bc%ea%b0%80-%ec%a0%80%ec%a7%80%ec%84%a0-100",
          "publishedOn": "2024-09-04T13:48:33.000Z",
          "wordCount": null,
          "title": "엔비디아 주가 전망, 월가는 엔비디아 주가 저지선 $100을 주시한다.",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595868",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595868/9-4-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d-%eb%b3%b4%ea%b3%a0%ec%84%9c",
          "publishedOn": "2024-09-03T23:36:57.000Z",
          "wordCount": null,
          "title": "9/4, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595860",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595860/8-31-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d-%eb%b3%b4%ea%b3%a0%ec%84%9c",
          "publishedOn": "2024-08-31T11:16:32.000Z",
          "wordCount": null,
          "title": "8/31, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595840",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595840/%ed%8f%89%ed%99%94%eb%a1%9c%ec%9a%b4-%ec%98%a4%ec%b2%9c%ed%95%ad-%ed%92%8d%ea%b4%91%ec%9d%b4-%ec%9d%bc%ed%92%88%ec%9d%b8-%ec%b6%a9%ec%b2%ad-%ec%88%98%ec%98%81%ec%84%b1-%eb%b0%a9%eb%ac%b8%ea%b8%b0",
          "publishedOn": "2024-08-30T06:00:50.000Z",
          "wordCount": null,
          "title": "평화로운 오천항 풍광이 일품인 충청 수영성 방문기",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595835",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/595835/2%eb%b6%84%ea%b8%b0-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%8b%a4%ec%a0%81%ec%9d%84-%ec%9d%bd%eb%8a%94-%ec%9b%94%ea%b0%80%ec%9d%98-%ec%8b%9c%ec%84%a0-%eb%a7%a4%eb%8f%84%ec%97%90-%eb%a7%a4%ec%88%98",
          "publishedOn": "2024-08-29T10:04:09.000Z",
          "wordCount": 6339,
          "title": "2분기 엔비디아 실적을 읽는 월가의 시선 : 매도에 매수하라",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595833",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/595833/2%eb%b6%84%ea%b8%b0-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%8b%a4%ec%a0%81-%ec%9a%94%ec%95%bd",
          "publishedOn": "2024-08-28T21:59:33.000Z",
          "wordCount": 6021,
          "title": "2분기 엔비디아 실적 요약",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595828",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595828/2%eb%b6%84%ea%b8%b0-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%8b%a4%ec%a0%81-%ec%a0%84%eb%a7%9d-%ea%b8%b0%eb%8c%80%eb%b3%b4%eb%8b%a4-%ec%a2%8b%ec%9d%84-%ea%b2%83",
          "publishedOn": "2024-08-22T14:31:43.000Z",
          "wordCount": null,
          "title": "2분기 엔비디아 실적 전망, 기대보다 좋을 것",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "NewsPeppermint",
      "feedUrl": "https://newspeppermint.com/feed/",
      "siteUrl": "https://newspeppermint.com",
      "articles": [
        {
          "id": "https://newspeppermint.com/?p=79723",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 7월 26일 스프에 쓴 글입니다. *** 하도 뉴스가 많이 쏟아져서 한 달 반 전에 개막한 올림픽에 관해 쓴 글이 지난 세기에 쓴 글처럼 멀리 느껴지네요. 어제 있었던 미국 대선 토론 관전평은 아메리카노 유튜브에서 자세히 → 더 보기",
          "link": "https://newspeppermint.com/2024/09/11/npsp_olympicmedalcounts/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_olympicmedalcounts",
          "publishedOn": "2024-09-11T22:59:38.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 왜 저 나라가 스포츠 강국이냐… 올림픽 메달 개수보다 조금 더 ‘공정’한 방법은",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79979",
          "author": "NewsPeppermint",
          "description": "잠시 후 해리스와 트럼프가 처음으로 맞붙는 TV 토론을 앞두고, 어떤 점을 눈여겨 봐야 할지 프리뷰를 썼습니다. 전문 번역: “해리스가 TV 토론서 이기고 싶다면 꼭 해야 할 말들” [프리드먼 칼럼] 해설: 공격의 고삐 쥔 트럼프, TV 토론으로 승리 방정식 재현할까?",
          "link": "https://newspeppermint.com/2024/09/10/npsp_trumpharrisdebate/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_trumpharrisdebate",
          "publishedOn": "2024-09-10T23:15:27.000Z",
          "wordCount": null,
          "title": "공격의 고삐 쥔 트럼프, TV 토론으로 승리 방정식 재현할까?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79970",
          "author": "NewsPeppermint",
          "description": "두 달도 채 남지 않은 미국 대선의 최대 승부처는 경합주 유권자의 마음을 누가 잡느냐에 달렸습니다. 그런데 경합주 유권자 중 적잖은 비중을 차지하는 이들이 바로 러스트벨트 지역의 노동자들입니다. 트럼프와 해리스가 지목한 부통령 후보 J.D. 밴스와 팀 월즈 모두 러스트벨트 유권자들에게 어필할 수 있는 인물인 데는 다 이유가 있던 겁니다. 그런데 노동자들의 어려움을 잘 헤아리는 정당은 어느 쪽일까요? 흔히 전통적으로 노동조합의 지지를 받아온 민주당이 친 노조 성향이라고 알려져 있지만, 보수 성향 싱크탱크 → 더 보기",
          "link": "https://newspeppermint.com/2024/09/09/npsp_laborfriendly/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_laborfriendly",
          "publishedOn": "2024-09-10T00:30:46.000Z",
          "wordCount": null,
          "title": "“‘진짜 노동자’의 절망, 내가 누구보다 잘 안다” 미국 대선의 진짜 승부처는 여기",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79699",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 7월 23일 스프에 쓴 글입니다. 조 바이든 대통령이 오는 11월 재선에 도전하지 않겠다고 밝혔습니다. 후보 사퇴 소식은 현지 시각으로 일요일(21일) 오후 전격적으로 알려졌습니다. 바이든 대통령은 X(옛 트위터) 자신의 개인 계정에 오후 1시 46분 “미국인에게 쓰는 → 더 보기",
          "link": "https://newspeppermint.com/2024/09/07/npsp_bidenharristrumpvance/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_bidenharristrumpvance",
          "publishedOn": "2024-09-07T22:59:09.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] “구국의 결단” 바이든 그 이후… 절대 놓치면 안 되는 것들이 있다",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79948",
          "author": "NewsPeppermint",
          "description": "자리에 없는 사람에 관한 이야기는 인간이라면 누구나 참기 어려운 일입니다. 꼭 남의 흉을 보거나 험담을 하는 게 아니라도 말이죠. 그런데 이 달콤한 유혹을 참아내는 사람들이 있습니다. 각자 뒷담화하지 않기로 마음먹고, 이를 실천에 옮기는 이유와 동기는 다르지만, 이 사람들에게서 공통으로 발견할 수 있는 점은 마음의 평안을 얻게 됐고, 더 나은 삶을 살게 됐다는 점입니다. 뒷담화하지 않는 사람을 만나 인터뷰한 뉴욕타임스 오피니언 에디터 미칼 리보위츠의 칼럼을 번역하고, 친구를 통해 비슷한 경험을 해본 → 더 보기",
          "link": "https://newspeppermint.com/2024/09/05/npsp_gossip/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_gossip",
          "publishedOn": "2024-09-06T00:00:20.000Z",
          "wordCount": null,
          "title": "이야기꽃 피우다 뜨끔했던 친구의 말… “조금씩 내 삶이 달라졌다”",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79679",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 7월 19일 스프에 쓴 글입니다. 현지시각 17일 밤, J.D. 밴스 오하이오주 상원의원이 부통령 후보직 제안을 공식 수락하며, 공화당 전당대회 사흘째 프로그램의 대미를 장식했습니다. 밴스 의원은 지난 중간선거에서 처음 당선돼 상원의원이 된 지 2년이 채 → 더 보기",
          "link": "https://newspeppermint.com/2024/09/04/npsp_jdvance/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_jdvance",
          "publishedOn": "2024-09-04T22:59:12.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 트럼프의 픽은 ‘리틀 트럼프’… 그가 그리는 더 큰 그림은",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79926",
          "author": "NewsPeppermint",
          "description": "스타벅스의 경영 실적이 부진하다는 소식이 들린 지도 꽤 시간이 지났습니다. 좀처럼 반등하지 못한 채 표류하고 있는 스타벅스를 보고, 매번 스타벅스가 힘들 때마다 구원투수로 등장했던 창업자 하워드 슐츠도 나서보고, 최근 CEO도 교체했지만, 그 효과가 기대대로 나타날지는 여전히 미지수입니다. 매거진 잉크의 편집장 빌 사포리토는 그 원인을 고객 경험을 무시할 만큼 너무 복잡해진 메뉴와 주문 방식에서 찾았습니다. 쉽게 말해 커피 한 잔 주문하는 게 이렇게 어려워서 되겠냐는 거죠. 사포리토가 쓴 칼럼을 번역하고, 스타벅스가 → 더 보기",
          "link": "https://newspeppermint.com/2024/09/02/npsp_starbucks/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_starbucks",
          "publishedOn": "2024-09-03T02:50:50.000Z",
          "wordCount": null,
          "title": "스벅 주문법이 3천8백억 개? 창업자 호소까지 불러온 뜻밖의 악순환",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79657",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 7월 16일 스프에 쓴 글입니다. *** 45일 전만 해도 “지금은 트럼프의 시간”이라고 말할 만큼 선거 구도는 한쪽으로 쏠려 있는 듯했습니다. 구사일생으로 암살 시도를 피한 트럼프 전 대통령은 바이든을 상대로 압승을 거둘 것이란 전망 속에 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/30/npsp_rnctrump/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_rnctrump",
          "publishedOn": "2024-08-30T22:59:54.000Z",
          "wordCount": 2139,
          "title": "[뉴페@스프] ‘조지 클루니, 너마저…’ 바이든의 속내가 어떻든 지금은 ‘트럼프의 시간’",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=79914",
          "author": "NewsPeppermint",
          "description": "중국 경제가 휘청이는 신호가 감지되면서 중국에 의존해 온 개발도상국 경제도 흔들리고 있습니다. 이를 두고 중국이 세계 경제에서 차지하는 비중은 높아졌지만, 책임감 있는 모습을 보이지 않고 있다는 비판이 미국을 위시한 서방 국가들 사이에서 나오고 있습니다. 중국의 책임이 작지 않다는 마이클 베클리의 뉴욕타임스 칼럼과 서구 관점에서만 보면 중국이 거둔 일대일로 정책의 성과를 균형 있게 보지 못할 수 있다는 이종혁 교수의 해설을 함께 실었습니다. 전문 번역: 숙취에 시달리는 중국… 좀처럼 벗어나지 못하는 까닭 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/29/npsp_chinaeconomy-2/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_chinaeconomy-2",
          "publishedOn": "2024-08-30T01:15:55.000Z",
          "wordCount": null,
          "title": "‘문제투성이 중국의 일대일로 정책’? 이 관점에서 보면 다르다",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79900",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 7월 9일 스프에 쓴 글입니다. 지난달 말 대통령 후보 TV 토론에서 바이든이 참패했고, 이어 지난주 미국 대법원이 대통령이 재임 중에 한 일에 대해 상당 부분 면책특권을 인정해 줬다는 소식도 전해드렸습니다. 두 가지 사건 모두 오는 11월 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/28/npsp_trumptariffs/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_trumptariffs",
          "publishedOn": "2024-08-28T22:59:50.000Z",
          "wordCount": 2176,
          "title": "[뉴페@스프] “수입품에 10% 일괄 관세를” 트럼프의 이토록 허술한 공약이 먹히는 이유",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=79898",
          "author": "NewsPeppermint",
          "description": "민주당 전당대회의 스포트라이트를 가장 많이 받은 건 대통령 후보 카말라 해리스였지만, 해리스가 빛나도록 받쳐주는 역할을 기꺼이, 묵묵히 수행하던 이들의 전통적이지 않은 남성성도 주목을 받았습니다. 본인도 미식축구 NFL 스타지만, 팝스타인 여자친구 테일러 스위프트를 진심으로 응원하며 공개적인 장소에서 ‘남자답지 못하게’ 울기도 하는 트래비스 켈시, 가족을 위해 헌신하고 이웃을 돕기 좋아하는 해리스의 러닝메이트 팀 월즈까지 민주당 전당대회를 통해 주목받은 새로운 남성상을 짚어봤습니다. 전문 번역: 남성성 뽐낼 필요 없는 ‘진짜 사나이’의 등장? 이것은 “한 발짝 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/27/npsp_madamepresident/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_madamepresident",
          "publishedOn": "2024-08-27T13:15:26.000Z",
          "wordCount": null,
          "title": "미국 최초의 여성 대통령이 탄생한다면, 이런 ‘최초들’도 함께 겪게 될 것",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79621",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 7월 5일 스프에 쓴 글입니다. 지구상에서 가장 막강한 권력을 지닌 사람을 꼽으라면, 많은 사람이 미국 대통령을 몇 손가락 안에 꼽을 겁니다. 세계에서 가장 강력한 나라 미국의 군대를 움직일 수 있는 통수권자이자 정부를 이끄는 정치지도자인 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/25/npsp_imperialpresidency/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_imperialpresidency",
          "publishedOn": "2024-08-25T22:59:38.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] “마녀사냥에 복수” 다짐하는 그, 정말로 ‘제왕적 대통령’ 될까",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79603",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 7월 2일 스프에 쓴 글입니다. *** 글을 시차 발행하는 오늘(8월 22일) 밤 카말라 해리스는 민주당 전당대회 마지막날 대통령 후보 지명을 수락할 예정입니다. 불과 두 달도 채 되지 않는 시점에는 상상도 하기 어려웠던 일이 현실로 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/22/npsp_openconvention/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_openconvention",
          "publishedOn": "2024-08-23T01:30:42.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 만약 바이든이 후보 사퇴한다면? 이렇게 진행될 겁니다",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79864",
          "author": "NewsPeppermint",
          "description": "민주당 전당대회를 앞둔 지난 금요일, 카말라 해리스 부통령은 자신의 경제 공약을 발표했습니다. 바이든 행정부에서 치솟은 물가를 안정시키고 서민과 중산층에게 도움이 되는 정책을 위해 해리스가 꺼낸 카드는 치솟는 집값을 안정화시키겠다는 일련의 정책이었습니다. 뉴욕타임스 칼럼니스트 피터 코이가 수요와 공급이라는 경제학의 기본 원리를 바탕으로 해리스의 경제 공약을 분석했습니다. 해설에서는 이번 선거의 향방을 가를 경합주의 경제 상황을 함께 진단해 봤습니다. 전문 번역: “해리스의 경제 공약, 완벽하지는 않지만 트럼프보다는 낫다” 해설: ‘주머니 사정’이 선거 승패 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/22/npsp_economicplanharristrump/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_economicplanharristrump",
          "publishedOn": "2024-08-23T00:15:09.000Z",
          "wordCount": null,
          "title": "‘주머니 사정’이 선거 승패 가른다면 누가 더 유리할까?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79588",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 6월 28일 스프에 쓴 글입니다. *** 파리 올림픽에서 실제로 XY 염색체를 지닌 복싱 선수 이마네 칼리프(알제리)와 린위팅(대만)의 여성 종목 출전이 논란을 낳기도 했습니다. 이에 관해 언론에도 많은 기사가 소개됐습니다. 연합뉴스: IOC, XY염색체 여자 복싱선수 논란에 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/21/npsp_sextestingolympics/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_sextestingolympics",
          "publishedOn": "2024-08-21T22:59:40.000Z",
          "wordCount": 2478,
          "title": "[뉴페@스프] “그렇게만 할 거면… 올림픽 왜 하니?” 배제와 포용, 답은 정해져 있다",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=79845",
          "author": "NewsPeppermint",
          "description": "이번 미국 대선의 중요한 이슈 가운데 하나가 이민 문제입니다. 얼핏 보기엔 이민 문제에 있어서 주로 공세를 펴는 쪽은 트럼프와 공화당이고, 반대로 민주당은 정책을 방어하는 경우가 많아 보입니다. 그러나 자세히 뜯어 보면, 이민 문제가 지금처럼 심각해진 데는 공화당과 민주당, 진보와 보수 할 것 없이 현실에 한참 뒤처진 이민 제도를 방치한 정치권 전반의 책임이 큽니다. 실제로 미국에 합법적으로 정착하기 위해 비자를 받거나 영주권을 얻는 일은 굉장히 어렵습니다. 전문 번역: 미국에 ‘합법 이민’이 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/20/npsp_usimmigrationelection/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_usimmigrationelection",
          "publishedOn": "2024-08-20T20:00:08.000Z",
          "wordCount": null,
          "title": "“이민자들이 몰려온다”는데… 문제 못 풀게 발목 잡은 건 누구였나",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79580",
          "author": "eyesopen1",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 6월 25일 스프에 쓴 글입니다. 흡연자든 흡연자가 아니든 담뱃갑에 흉측한 사진과 함께 충격적인 경고 문구가 등장했던 때를 기억할 겁니다. 2015년 통과된 새로운 국민건강증진법에 따라 담뱃갑에 흡연의 위험성을 경고하는 그림이 삽입된 것은 2016년 말이었습니다. 그전까지는 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/18/npsp_socialmediasurgeongeneral/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_socialmediasurgeongeneral",
          "publishedOn": "2024-08-18T22:59:40.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 흡연 이상으로 해로운 소셜미디어? “지금은 비상상황”… 여기에 공감하나요?",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "WALLFLOWER",
      "feedUrl": "http://rss.egloos.com/blog/wallflower",
      "siteUrl": "http://wallflower.egloos.com",
      "articles": []
    },
    {
      "title": "내 마음의 풍경",
      "feedUrl": "https://rss.blog.naver.com/sellars.xml",
      "siteUrl": "https://blog.naver.com/sellars?fromRss=true&trackingCode=rss",
      "articles": [
        {
          "id": "https://blog.naver.com/sellars/223548745573",
          "author": "sellars",
          "description": "1. 나는 철학이란 철학적 논증을 비판적으로 검토하는 작업이라고 생각한다. 따라서 제시된 논증이 타당성이 있는지, 건전성이 있는지 비판적으로 검토하는 것이 철학이다. 그런데 우리는 어떤 명제에 대해서 결정적으로 완벽한 정당화를 할 수 없다. 가령 나는 칸트가 주장하는 인간을 목적으로 대우하라는 정언명법을 옳은 것으로 받아들이지만, 그것이 어찌 옳은지 철학적으로 정당화할 수 없다. 그럼에도 불구하고 나는 칸트의 정언명법을 받아들인다. 그것이 바로 내 실존적 선택이다. 이런 의미에서 철학은 논증을 정당화하고 그 부당성을 따지는 지성적 작업이지만, 동시에 그것은 마치 예술 작품이 보여주는 세계를 받아들이는 것처럼 실.......",
          "link": "https://blog.naver.com/sellars/223548745573?fromRss=true&trackingCode=rss",
          "publishedOn": "2024-08-15T04:14:11.000Z",
          "wordCount": 101,
          "title": "내 철학적 목소리(2020)-1",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223543049809",
          "author": "sellars",
          "description": "오랜기간.. 많은 시간을 보낸 학교.. 그 많은 시간들이 때로는 힘들고 지치고 많은 고민들로 채워졌을거라 생각하면 우리에겐 가슴아픈 장소로 남았다. 외로웠을 그시간들.. 그 허기진 마음을 술로 다 채우지 않았을까.. \"홀로 황량한 모래바람이 부는 사막을 걷는 기분이였다\"라고..했던... 그 길 끝에 그의 나무가 있다..... 언제쯤 편히 이곳을 찾을수 있을까...",
          "link": "https://blog.naver.com/sellars/223543049809?fromRss=true&trackingCode=rss",
          "publishedOn": "2024-08-10T03:53:25.000Z",
          "wordCount": 101,
          "title": "학교에...",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The ZipCPU by Gisselquist Technology",
      "feedUrl": "https://zipcpu.com/feed",
      "siteUrl": "https://zipcpu.com/",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}