{
  "sources": [
    {
      "title": "ACM Queue - All Queue Content",
      "feedUrl": "https://queue.acm.org/rss/feeds/queuecontent.xml",
      "siteUrl": "http://queue.acm.org/",
      "articles": [
        {
          "id": "3649303",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3649303",
          "publishedOn": "2024-03-12T16:35:15.000Z",
          "wordCount": null,
          "title": "A \"Perspectival\" Mirror of the Elephant",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "3649297",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3649297",
          "publishedOn": "2024-03-12T16:22:34.000Z",
          "wordCount": null,
          "title": "Software Drift",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "3649402",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3649402",
          "publishedOn": "2024-03-11T12:26:27.000Z",
          "wordCount": null,
          "title": "Challenges in Adopting and Sustaining Microservice-based Software Development",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "3649298",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3649298",
          "publishedOn": "2024-03-11T12:09:55.000Z",
          "wordCount": null,
          "title": "Free and Open Source Software - and Other Market Failures",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Arjun Sreedharan",
      "feedUrl": "https://arjunsreedharan.org/rss",
      "siteUrl": "https://arjunsreedharan.org/",
      "articles": []
    },
    {
      "title": "공간주의",
      "feedUrl": "https://attention2.space/feed/",
      "siteUrl": "https://attention2.space",
      "articles": [
        {
          "id": "https://attention2.space/?p=3606",
          "author": "attention2space",
          "description": "[텍스트 뷔페]는 다양한 전문 분야별 작가의 '원고 단위의 글'을 뷔페의 형태로 진열된 텍스트 큐레이팅 전시입니다. 독자의 취향과 관심분야에 따라 글을 수집하며 만들어지는 배열 속에 모두가 각잠나의 문장을 발견하게 되기를, 글을 찾고 읽는 과정에 온전한 시간과 사유의 공간을 담아 냈습니다.",
          "link": "https://attention2.space/2024/textbuffet3/",
          "publishedOn": "2024-04-07T09:46:04.000Z",
          "wordCount": null,
          "title": "[소식] 전시 – 텍스트 뷔페 VOL.3",
          "imageUrl": null
        },
        {
          "id": "https://attention2.space/?p=3550",
          "author": "attention2space",
          "description": "헤르만 슈미츠의 『사랑의 현상학』에서도, 파트너 간의 사랑을 다룬다는 것은 나에게 있어서 수치스럽기 까지 한 감정을 느끼게 만들지만 그래도 그의 논의에서 건질 점은 있다. 이른바 감정은 공간적이라는 것이다. 나는 그를 짝사랑한다. 이러한 감정은 나를 쓸쓸하게 만든다. 그와 나는 공간적으로 가까울 수 도 있지만 기본적으로는 무한히 멀리 떨어져 있다. 감정적으로든, 공간적으로든 둘다든. 또는 수 천 키로미터 바깥일 수도 있다. 하지만 우리는 가까이 있기도 하다.",
          "link": "https://attention2.space/2024/fade-into-you/",
          "publishedOn": "2024-03-30T04:19:12.000Z",
          "wordCount": null,
          "title": "[쇼트] 짝사랑의 정신증적 기제에 관해서",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Clean Code Blog",
      "feedUrl": "https://blog.cleancoder.com/atom.xml",
      "siteUrl": "http://blog.cleancoder.com/atom.xml",
      "articles": []
    },
    {
      "title": "C++ Stories",
      "feedUrl": "https://www.cppstories.com/index.xml",
      "siteUrl": "https://www.cppstories.com/",
      "articles": []
    },
    {
      "title": "Sticky Bits – Powered by Feabhas",
      "feedUrl": "https://blog.feabhas.com/feed/",
      "siteUrl": "https://blog.feabhas.com/",
      "articles": []
    },
    {
      "title": "The LLVM Project Blog",
      "feedUrl": "https://blog.llvm.org/index.xml",
      "siteUrl": "https://blog.llvm.org/",
      "articles": [
        {
          "id": "https://blog.llvm.org/posts/2024-02-26-gsoc/",
          "author": null,
          "description": "The LLVM organization was accepted to participate in Google Summer of Code in 2024. Soon, prospective participants will begin submitting their project proposals, and mentors will review them to select those who will spend a significant amount of time this year contributing to various parts of LLVM.\nBut first, let’s look back and see what we had in 2023. The Google Summer of Code 2023 was very successful for the LLVM project. Overall, we received 54 proposals for 24 open projects. Out of this set of proposals, 20 projects were successfully completed and covered many different aspects of LLVM and its subprojects.\n\nExtractAPI while building by Ankur Saini, mentored by Daniel Grumberg\nWebAssembly Support for clang-repl by Anubhab Ghosh, mentored by Vassil Vassilev and Alexander Penev\nModules B…",
          "link": "https://blog.llvm.org/posts/2024-02-26-gsoc/",
          "publishedOn": "2024-03-14T00:00:00.000Z",
          "wordCount": null,
          "title": "LLVM Google Summer of Code 2024 & 2023",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Embedded in Academia",
      "feedUrl": "https://blog.regehr.org/feed",
      "siteUrl": "https://blog.regehr.org",
      "articles": []
    },
    {
      "title": "Siemens Blog Network",
      "feedUrl": "https://blogs.sw.siemens.com/feed/",
      "siteUrl": "https://blogs.sw.siemens.com",
      "articles": []
    },
    {
      "title": "Embedded Software Insights | Latest Embedded Technology News",
      "feedUrl": "https://www.bluefruit.co.uk/blog/feed",
      "siteUrl": "https://bluefruit.co.uk/blog/",
      "articles": [
        {
          "id": "https://bluefruit.co.uk/?p=14079",
          "author": "Tristan Jago",
          "description": "The space industry is among the most innovative in the world. Propelled by communications, exploration, and R&D possibilities, it is estimated […]\nThe post 5 ways aerospace product development solves real-time challenges in space appeared first on Bluefruit Software.",
          "link": "https://bluefruit.co.uk/quality/aerospace-product-development-challenges/",
          "publishedOn": "2024-01-04T15:14:19.000Z",
          "wordCount": 2411,
          "title": "5 ways aerospace product development solves real-time challenges in space",
          "imageUrl": "https://bluefruit.co.uk/content/uploads/2024/01/Space-design-thumb.jpg"
        }
      ]
    },
    {
      "title": "Bartosz Ciechanowski",
      "feedUrl": "https://ciechanow.ski/atom.xml",
      "siteUrl": "https://ciechanow.ski/",
      "articles": []
    },
    {
      "title": "Architectures and Processors blog",
      "feedUrl": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog/rss",
      "siteUrl": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog",
      "articles": []
    },
    {
      "title": "CPUU의 Daydreamin&#039;",
      "feedUrl": "https://cpuu.postype.com/rss",
      "siteUrl": "https://cpuu.postype.com",
      "articles": [
        {
          "id": "https://cpuu.postype.com/post/16559829",
          "author": "CPUU",
          "description": "아래 논문은 USENIX 2019에서 발표되었다.\n\nLiljestrand, Hans, et al. \"{PAC} it up: Towards pointer integrity using {ARM} pointer authentication.\" 28th USENIX Security Symposium (USENIX Security 19). 2019.\n\n출처: https://www.usenix.org/conference/usenixsecurity19/presentation/liljestrand\n\n\nAbstract:\nC나 C++ 등 메모리 취약점으로부터 안전하지 않은 언어로 작성된 프로그램에 대한 런타임 공격이 컴퓨터 시스템을 위협하고 있다. 실제로 ROP 등의 공격이 발전하면서 프로세서 주요 제조사들은 이를 하드웨어적으로 방어할 수 있는 방법을 고안하고 있다. 특히 스마트폰과 같은 장치에서 흔히 사용되는 ARMv8-A 프로세서 아키텍처에 최근 추가된 포인터 인증(PA) 지원이 있다. PA는 메모리 취약점에 저항하기 위해 포인터를 인증하는 저비용 기술이다. 이는 반환 주소나 함수 포인터를 변조하는 메모리 취약점에 대한 실용적인 보호를 가능하게 한다. 글나 지금까지 PA를 활용한 구체적인 사례들이 많지는 않았다. 이에 본 논문에서는 ARM 환경에서 PA를 활용하여 보호를 강화하는 방법을 다루고, LLVM 컴파일러에 이를 통합하는 도구인 PARTS 를 제안하고자 한다. 실제 실험 결과 PARTS를 사용하면 기존의 유사 솔루션에 비해 합리적인 성능으로 보안성을 강화할 수 있었다.\n\n\n1. 서론 및 본 연구의 목적:\n이 연구에서는…",
          "link": "https://cpuu.postype.com/post/16559829",
          "publishedOn": "2024-04-02T02:46:21.000Z",
          "wordCount": null,
          "title": "[논문리뷰] PAC it up (ARM Pointer Authentication)",
          "imageUrl": null
        }
      ]
    },
    {
      "title": null,
      "feedUrl": "https://danluu.com/atom.xml",
      "siteUrl": "https://danluu.com/atom/index.xml",
      "articles": [
        {
          "id": "https://danluu.com/slow-device/",
          "author": null,
          "description": "In 2017, we looked at how web bloat affects users with slow connections. Even in the U.S., many users didn't have broadband speeds, making much of the web difficult to use. It's still the case that many users don't have broadband speeds, both inside and outside of the U.S. and that much of the modern web isn't usable for people with slow internet, but the exponential increase in bandwidth (Nielsen suggests this is 50% per year for high-end connections) has outpaced web bloat for typical sites, making this less of a problem than it was in 2017, although it's still a serious problem for people with poor connections.\nCPU performance for web apps hasn't scaled nearly as quickly as bandwidth so, while more of the web is becoming accessible to people with low-end connections, more of the web is …",
          "link": "https://danluu.com/slow-device/",
          "publishedOn": "2024-03-16T00:00:00.000Z",
          "wordCount": null,
          "title": "How web bloat impacts users with slow devices",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Dave Cheney",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "Red Hat Developer",
      "feedUrl": "https://developers.redhat.com/blog/feed",
      "siteUrl": "https://developers.redhat.com/",
      "articles": [
        {
          "id": "1c7c86ac-2eae-4b0a-bc74-e36cc0ea51a4",
          "author": "Veda Barrenkala",
          "description": "Picture this: A customer approaches a support engineer due to an issue they are facing, perhaps something like packet drop or latency—it could be anything. The immediate response from the support engineer is to request system information or an SOS report. They then attempt to replicate the setup to simulate the packet drops. The root cause might remain elusive. If the issue remains unsolved, they turn to the developer for guidance. This back-and-forth communication can be quite time-consuming, stretching over weeks or even months in some cases.\nThe idea here is to accelerate this process and speed up the communication between the customers, Global Support Services (GSS), and developers to quickly address the anomaly.\nOpen vSwitch (OVS) is the key component that provides a production-grade …",
          "link": "https://developers.redhat.com/articles/2024/04/08/detect-network-issues-open-vswitch-using-red-hat-insights",
          "publishedOn": "2024-04-08T07:00:00.000Z",
          "wordCount": null,
          "title": "Detect network issues in Open vSwitch using Red Hat Insights",
          "imageUrl": null
        },
        {
          "id": "80e1dd2b-9eba-48f2-aa8f-c5359635080e",
          "author": "Pablo Iranzo Gómez, Brett Thurber",
          "description": "In this article we cover the required steps to configure Kernel Module Management Operator (KMM) and use it to deploy an out-of-tree (OOT) kernel module, as well as leveraging other related technologies to build a toolset for hardware enablement. To illustrate that process, we'll leverage the Intel Data Center GPU Flex 140.\nWhat is the Kernel Module Management Operator?\nThe Kernel Module Management Operator manages, builds, signs, and deploys out-of-tree (OOT) kernel modules and device plug-ins on Red Hat OpenShift Container Platform clusters.\nBefore KMM, cluster admins had to manually install drivers to multiple nodes. Upgrades were painful and prone to errors from incompatible drivers. Furthermore, workloads might get scheduled to a node with broken drivers causing scheduling issues or m…",
          "link": "https://developers.redhat.com/articles/2024/04/05/enable-gpu-acceleration-kernel-module-management-operator",
          "publishedOn": "2024-04-05T19:00:00.000Z",
          "wordCount": 7108,
          "title": "Enable GPU acceleration with the Kernel Module Management Operator",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/RHODS-GPU-featured_3.png?itok=kXHy3-IQ"
        },
        {
          "id": "a72ac10e-05c5-453a-ad0c-654bd49ce2a3",
          "author": "Hans-Peter Grahsl",
          "description": "In the first article in this series, you learned how to leverage MongoDB from within your cloud-native applications written in Quarkus. While developing a sample application from scratch, you've been introduced to a few selected Quarkus extensions that speed up the development process and remove friction when it comes to deploying the containerized application to Kubernetes.\nThis second article will allow you to seamlessly continue your Quarkus and MongoDB development journey. Based on where you left off in part 1, in this article we will continue iterating the same example application. We will walk through the steps to carrying out the following tasks:\nPerform a Quarkus version upgrade for your application.\nAdd Entity <=> DTO (data transfer object) mapping.\nIntroduce a service layer.\nSwit…",
          "link": "https://developers.redhat.com/articles/2024/04/04/getting-started-mongodb-and-quarkus-beyond-basics",
          "publishedOn": "2024-04-04T07:00:00.000Z",
          "wordCount": null,
          "title": "Getting started with MongoDB and Quarkus: Beyond the basics",
          "imageUrl": null
        },
        {
          "id": "37e9b438-8c34-4fae-a57c-e1ddb61ab500",
          "author": "David Malcolm",
          "description": "I work at Red Hat on GCC, the GNU Compiler Collection. For the last five releases of GCC, I've been working on -fanalyzer, a static analysis pass that tries to identify various problems at compile-time, rather than at runtime. It performs \"symbolic execution\" of C source code—effectively simulating the behavior of the code along the various possible paths of execution through it.\nThis article summarizes what's new with -fanalyzer in GCC 14, which I hope will be officially released sometime in April 2024.\nSolving the halting problem?\nObviously I'm kidding with the title here, but for GCC 14 I've implemented a new warning: -Wanalyzer-infinite-loop that's able to detect some simple cases of infinite loops.\nFor example, consider the following C code:\nvoid test (int m, int n)\n{\n  float arr[m][n…",
          "link": "https://developers.redhat.com/articles/2024/04/03/improvements-static-analysis-gcc-14-compiler",
          "publishedOn": "2024-04-03T07:00:00.000Z",
          "wordCount": 4328,
          "title": "Improvements to static analysis in the GCC 14 compiler",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2021/04/gcc_1x.png?itok=6l1b8Lo9"
        },
        {
          "id": "29f06dce-0a8a-4c3d-b2b0-e5952a359a10",
          "author": "Derek Parker, Archana Ravindar",
          "description": "A stripped binary is generally devoid of symbol and debug information. There could be many reasons why one would need to generate a stripped binary. Symbol information takes up a lot of storage space, so when there are space constraints, it makes sense to work with stripped binaries.\nIn the case of Go, we can create a stripped binary either by using go build ldflags=\"-s -w\" or by using the strip command. Debugging is the other side of development, and debugging a stripped binary can be challenging. Go is unique, and unlike other languages, we can still hack our way around to obtain some amount of symbol information from the binaries. This article focuses on how we support stripped binaries in Delve, the Go debugger. \nFinding symbols in stripped binaries\nGo retains some information on symbo…",
          "link": "https://developers.redhat.com/articles/2024/04/03/how-add-debug-support-go-stripped-binaries",
          "publishedOn": "2024-04-03T07:00:00.000Z",
          "wordCount": 4252,
          "title": "How to add debug support for Go stripped binaries",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/delve-debug_2x.png?itok=F-0v2qbw"
        },
        {
          "id": "9b61fb1e-9012-4216-9fc3-b1bf45d85f07",
          "author": "Maja Massarini",
          "description": "Have you ever wanted to bring your pull request changes in a cloud image easily?\nCurious about how easy it can be? With Packit, it can be just a matter of commenting on your pull request with the following command:\n/packit vm-image-build\nWith the above command, Packit automates all the manual steps needed to create an RPM package with your pull request changes and asks the Red Hat Enterprise Linux image builder (RHEL image builder) to install it inside a brand new cloud image.\nLet's have a look at the prerequisites for this.\nJoin the Red Hat Developer program\nIf you don't already have a business account, you can create a Red Hat Developer account at no cost.\nYou need a subscription in order to use the RHEL image builder service and launch the builded images in the Amazon Web Services (AWS)…",
          "link": "https://developers.redhat.com/articles/2024/04/02/customize-aws-cloud-images-rhel-image-builder-and-packit",
          "publishedOn": "2024-04-02T14:00:00.000Z",
          "wordCount": null,
          "title": "Customize AWS cloud images with RHEL image builder and Packit",
          "imageUrl": null
        },
        {
          "id": "f152e694-10b2-45c8-8ee2-ca166ca5c93d",
          "author": "Philip Hayes",
          "description": "The recent release of Red Hat JBoss EAP 8.0 includes native support for OpenID Connect (OIDC) via the elytron-oidc-client subsystem. OIDC is an identity layer that enables clients, such as JBoss EAP, to verify a user’s identity based on authentication performed by an OpenID provider. For example, you can secure your JBoss EAP applications using the Red Hat build of Keycloak as the OpenID provider.\nIn this article, we will use the elytron-oidc-subsystem to secure a simple web application using Microsoft Entra ID (formerly Azure Active Directory) as the OpenID provider.\nFor more information about JBoss EAP 8.0's native OpenID Connect support, refer to the product documentation.\nPrerequisites\nA local installation of JBoss EAP 8.0. Download the installation manager from Red Hat Developer.\nJBOS…",
          "link": "https://developers.redhat.com/articles/2024/04/01/secure-jboss-eap-apps-microsoft-entra-id-openid-connect",
          "publishedOn": "2024-04-01T07:00:00.000Z",
          "wordCount": null,
          "title": "Secure JBoss EAP apps with Microsoft Entra ID & OpenID Connect",
          "imageUrl": null
        },
        {
          "id": "1436d8ea-2740-42a2-ae76-77d9e38bb08f",
          "author": "Shachee Mishra Gupta",
          "description": "Network observability is the ability to easily identify and answer questions about your network in real-time, and use the information to make informed decisions to manage and optimize network resources. To facilitate and dig deeper with more insights into an ongoing network flow in real-time, we present Packet Capture Agent (PCA), an extension to the Network Observability eBPF Agent (netobserv-agent).\nHistorically, network observability data constituted of flow logs. A flow log record captures network flow, essentially layer 4 and 5 data. While this is useful and is extensively used for making network decisions, the question we ask is: can we do better? Is there still information hiding that we have not been able to collect/use for observability?\nWe argue that significant additional networ…",
          "link": "https://developers.redhat.com/articles/2024/03/28/packet-capture-using-network-observability-ebpf-agent",
          "publishedOn": "2024-03-28T14:00:00.000Z",
          "wordCount": null,
          "title": "Packet capture using Network Observability eBPF Agent",
          "imageUrl": null
        },
        {
          "id": "10be0b9c-46f7-4bec-a02e-978e75e1450a",
          "author": "Michael Thirion, Ivo Bek",
          "description": "This article proposes a simplified migration path for Red Hat build of Apache Camel that aims to drastically decrease your migration effort using a template-based solution pattern.\nMigrating from Red Hat Fuse to Red Hat build of Apache Camel\nModernization is about more than just adopting the latest technologies; we should do it in a way that is both reliable and cost-effective to ensure that the investments we make today will preserve their impact and utility well into the future. Therefore, we choose vendor-neutral solutions that offer longevity, scalability, and flexibility. By utilizing integration best practices and patterns, developer teams can focus on high-value tasks.\nRed Hat Fuse is the Red Hat solution for integrating applications based on Apache Camel version 2. Red Hat build of…",
          "link": "https://developers.redhat.com/articles/2024/03/27/migrating-red-hat-fuse-red-hat-build-apache-camel",
          "publishedOn": "2024-03-27T07:00:00.000Z",
          "wordCount": null,
          "title": "Migrating from Red Hat Fuse to Red Hat build of Apache Camel",
          "imageUrl": null
        },
        {
          "id": "a7ad6a5c-040a-4a72-ae30-c08f0e516c73",
          "author": "David Severiano",
          "description": "As we reviewed in my previous articles about blue/green deployment, a critical topic in cloud-native computing is the microservice architecture. We are no longer dealing with one monolithic application. We have several applications that have dependencies on each other and also have other dependencies like brokers or databases.\nApplications have their own life cycle, so we should be able to execute independent canary deployment. All the applications and dependencies will not change their version at the same time.\nAnother important topic in the cloud-native space is continuous delivery. If we are going to have several applications doing canary deployment independently, we have to automate it. We will use Helm, Red Hat OpenShift Service Mesh, Red Hat OpenShift GitOps, and (of course) Red Hat …",
          "link": "https://developers.redhat.com/articles/2024/03/26/canary-deployment-strategy-openshift-service-mesh",
          "publishedOn": "2024-03-26T07:00:00.000Z",
          "wordCount": null,
          "title": "Canary deployment strategy with OpenShift Service Mesh",
          "imageUrl": null
        },
        {
          "id": "36f335d3-2ccb-4038-bcb4-e4835f82cc3a",
          "author": "Jaya Christina Baskaran",
          "description": "APIs and API management form critical pieces of an enterprise’s technology landscape. A typical API starts with identification of the need for an API and progresses through various lifecycle stages, including design, implementation, testing, deployment, and ongoing management.\nWith the evolution of business needs and the enterprise and technology landscape, changes to APIs become inevitable. The only constant is change, and APIs are no exception. Therefore it is important how well enterprises are adapted to change when it occurs—because it is bound to occur.\nTo better manage changes to APIs, the API management artifacts will need to be versioned just like any other software. Such artifacts which include OpenAPI specifications and the API management platform configurations should be version…",
          "link": "https://developers.redhat.com/articles/2024/03/25/how-navigate-api-evolution-versioning",
          "publishedOn": "2024-03-25T07:00:00.000Z",
          "wordCount": null,
          "title": "How to navigate API evolution with versioning",
          "imageUrl": null
        },
        {
          "id": "393c0a78-a4d0-423e-ad01-f704b54d989e",
          "author": "Matias Ezequiel Vara Larsen, Alexander Lougovski, Marcelo Tosatti",
          "description": "When users have to choose a middleware technology to communicate different software components, they often pick Robot Operating System 2 (ROS 2) due to its features like efficiency and reliability. These components can be deployed locally (i.e., same host, or remotely, different hosts), and they communicate by following a service-oriented pattern.\nFor example, a software component that reads data from a sensor would publish the sensor values whereas another software component that processes that data would subscribe to it. ROS 2 takes care of sending the data between the components and ensures that data arrives on time. ROS 2 relies on a DDS as its middleware, which is a specification that is implemented by different vendors, e.g., Eclipse Cyclone DDS, OpenDDS. DDS is used in a wide variet…",
          "link": "https://developers.redhat.com/articles/2024/03/21/benchmark-cyclone-dds-centos-stream-9-vms-low-latency",
          "publishedOn": "2024-03-21T07:00:00.000Z",
          "wordCount": null,
          "title": "Benchmark Cyclone DDS in CentOS Stream 9 VMs for low latency",
          "imageUrl": null
        },
        {
          "id": "06c32f8b-1ca8-484a-bfb7-e06f2af8285c",
          "author": "Kevin Chung, Amr Abualrub",
          "description": "The advent of cloud technologies brings many benefits to the enterprise, such as provisioning at scale and a cloud-native DevOps approach. However, it also brings new challenges for developers and infrastructure engineers who wish to migrate from their datacenter to the public cloud. Among those challenges are integrating existing development methodologies with tool sets provided by the cloud provider as on-premise and cloud environments can each differ greatly. In this article, we explore a real-world implementation of a complete CI/CD pipeline using Source-to-Image builds deployed in Microsoft Azure Red Hat OpenShift with Azure tooling (see Figure 1).\n\n\n        Figure 1: This logical workflow highlights the pipeline that will be built in this article.\nThe tools that will be leveraged in …",
          "link": "https://developers.redhat.com/articles/2024/03/21/implement-source-image-builds-azure-devops-pipeline",
          "publishedOn": "2024-03-21T07:00:00.000Z",
          "wordCount": null,
          "title": "Implement Source-to-Image builds in an Azure DevOps pipeline",
          "imageUrl": null
        },
        {
          "id": "1edc2259-2997-4963-89d7-11658ec714a8",
          "author": "Steven Lee",
          "description": "Network Observability 1.5 is the new version of the operator from Red Hat that focuses on providing insights into networking. There's an upstream version that runs on plain Kubernetes, but this article will focus on using Red Hat OpenShift Container Platform (RHOCP) and the OpenShift web console for the user interface.\nI will highlight the most important new features of this release, so if you want a summary of all the changes including bug fixes, check out the release notes. If you want some background of this product, read the OpenShift documentation and various Red Hat blogs on this topic, including my blog on the previous 1.4 release.\nTo get started, you should have an OpenShift cluster. You will need to log in with a cluster-admin role. Follow the documentation steps to install Networ…",
          "link": "https://developers.redhat.com/articles/2024/03/20/whats-new-network-observability-15",
          "publishedOn": "2024-03-20T07:00:00.000Z",
          "wordCount": 4461,
          "title": "What's new in Network Observability 1.5",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/2020_OS_Shared_image_A_3.png?itok=96qQ_zu-"
        },
        {
          "id": "752edb9f-3db0-4abc-afc2-777c857ff4ef",
          "author": "David Martin",
          "description": "In the enterprise Kubernetes world, many developers use Kubernetes as a platform for designing, building, and deploying applications. The platform needs to be managed and provide a range of features, integrations, and checks and balances for developers. The role of the platform engineer is important in that regard. Policies are at the heart of what a platform engineer has to be define and enforce in their platform. Two technologies that aim to make defining and enforcing policies easier are Gatekeeper and Gateway API.\nIn this article, we'll talk about how these two policy-focused technologies can work together to solve platform engineer and application developer concerns.\nWhat are Gatekeeper policies?\nGatekeeper is a policy controller for Kubernetes. Its main focus is to allow users to enf…",
          "link": "https://developers.redhat.com/articles/2024/03/20/using-kuadrant-gateway-api-policies-gatekeeper-policies",
          "publishedOn": "2024-03-20T07:00:00.000Z",
          "wordCount": 5007,
          "title": "Using Kuadrant Gateway API policies with Gatekeeper policies",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2021/02/5-steps-api-management_2x.png?itok=pyJRhX05"
        },
        {
          "id": "c67496be-1af3-4507-b845-8d7ae904be28",
          "author": "Donna Smalls",
          "description": "Red Hat OpenShift 4.15, based on Kubernetes 1.28 and CRI-O 1.28, is now generally available. This article highlights notable updates in this release for developers with OpenShift.\nPipelines, Developer Hub, and more\nThe Developer Perspective in the OpenShift console includes four new capabilities:\nA new dynamic plug-in-based dashboard for Red Hat OpenShift Pipelines;\nAccess to additional information in OpenShift Pipelines for Red Hat Trusted Software Supply Chain;\nBuild strategy enhancements;\nThe ability to create serverless functions.\nThe PipelineRun Details page in the Developer or Administrator perspective of the web console provides an enhanced visual representation of PipelineRuns within a Project.\nDiscover Red Hat Developer Hub in the web console with new quick starts that provide ste…",
          "link": "https://developers.redhat.com/articles/2024/03/19/whats-new-developers-red-hat-openshift-415",
          "publishedOn": "2024-03-19T13:05:00.000Z",
          "wordCount": null,
          "title": "What's new for developers in Red Hat OpenShift 4.15",
          "imageUrl": null
        },
        {
          "id": "aa656170-d0af-49ce-8f3c-6b8174c2d317",
          "author": "Vishnu Challa",
          "description": "Welcome to the second part of our exploration. In this continuation from our previous article, we will delve deeper into the results of our database profiling efforts and discuss strategies for further optimizing overall application performance.\nProfiling results before optimization for Clair database\nTo gain insights into the inner workings of the Clair database, we conducted profiling using the pgBadger tool, specifically designed for PostgreSQL. This tool extracts information from the database logs and generates a comprehensive HTML report for result analysis. Through profiling, we identified that the recurrent spikes are attributed to bulk updates executed on the database, specifically around 10,000 updates by the updater, a sub-component of Clair that is responsible for maintaining an…",
          "link": "https://developers.redhat.com/articles/2024/03/19/optimizing-quayclair-database-profiling-results",
          "publishedOn": "2024-03-19T07:00:00.000Z",
          "wordCount": null,
          "title": "Optimizing Quay/Clair: Database profiling results",
          "imageUrl": null
        },
        {
          "id": "843cca29-b59f-4fdf-915d-231506503a3a",
          "author": "Vishnu Challa",
          "description": "Red Hat Quay (also offered as a service via Quay.io) is a cloud-based container registry service that allows users to store, manage, and distribute container images. It provides a platform for hosting, sharing, and securing container images across multiple environments, including on-premise data centers, public cloud platforms, and hybrid cloud deployments.\nAs a complementary subproduct, Clair is an application specifically designed for parsing image contents and delivering reports on vulnerabilities that may impact these contents. Noteworthy is that this analysis is conducted through static analysis rather than at runtime. Clair excels in supporting the extraction of contents and the identification of vulnerabilities, enhancing the overall security and reliability of containerized applica…",
          "link": "https://developers.redhat.com/articles/2024/03/19/optimizing-quayclair-profiling-performance-and-efficiency",
          "publishedOn": "2024-03-19T07:00:00.000Z",
          "wordCount": null,
          "title": "Optimizing Quay/Clair: Profiling, performance, and efficiency",
          "imageUrl": null
        },
        {
          "id": "dcf2cfd6-d435-491b-a4fc-b5a076f3571e",
          "author": "Sean Rickerd",
          "description": "Security around building and deploying applications is more critical than ever. As such, it is also just as important to understand what comprises the applications your developers are building and where they are coming from. This is the mentality behind a trusted software supply chain. The ability to code, build, and monitor your applications through proven platforms, and get artifacts from trusted sources are imperative to building safer, and more reliable applications. One of the important aspects of this is the Software Bill of Materials (SBOM).\nWhat is an SBOM?\nA Software Bill of Materials functions as an inventory with layers, containing a comprehensive collection of elements that make up software components. This information can be used to ensure the elements used to build an applica…",
          "link": "https://developers.redhat.com/articles/2024/03/18/red-hat-trusted-profile-analyzer-now-tech-preview",
          "publishedOn": "2024-03-18T13:00:00.000Z",
          "wordCount": null,
          "title": "Red Hat Trusted Profile Analyzer is now in tech preview",
          "imageUrl": null
        },
        {
          "id": "824ee847-33ff-496c-b309-28101352aa8c",
          "author": "Sabbir Hasan, Ian Miller",
          "description": "Maintaining a fleet of thousands of Red Hat OpenShift clusters, as is typical in network far edge deployments, requires a disciplined and consistent approach to managing configuration. In an ideal world all of the clusters would be running the same versions of software from the OpenShift Container Platform through application workload. In reality, however, the fleet of clusters will contain a mix of software versions due to phased rollouts, regional differences, or other operational requirements that may pin a set of clusters to an older release.\nAddressing the complexity of multiple versions can be achieved by building on top of a couple of very powerful tools. Red Hat’s GitOps (Argo CD) operator allows for single-source of truth definitions of clusters and their configuration and Red Hat…",
          "link": "https://developers.redhat.com/articles/2024/03/18/how-manage-fleet-heterogeneous-openshift-clusters",
          "publishedOn": "2024-03-18T07:00:00.000Z",
          "wordCount": null,
          "title": "How to manage a fleet of heterogeneous OpenShift clusters",
          "imageUrl": null
        },
        {
          "id": "76e84722-e0b5-4c43-8ab1-12524eaa73ce",
          "author": "Saurabh Agarwal, Yuan Tang",
          "description": "KServe is a standard Model Inference Platform on Kubernetes built for highly scalable use cases. It is a popular open source platform available as a community project, as well as a core component of Red Hat OpenShift AI. It provides a Kubernetes custom resource definition (CRD) for serving machine learning (ML) models on arbitrary frameworks. It aims to solve production model serving use cases by providing performant, high abstraction interfaces for common ML frameworks and model formats like TensorFlow, PyTorch, XGBoost, Scikit-learn, and ONNX.\nIt simplifies the deployment process by abstracting the complexities associated with serving machine learning models at scale in production. KServe is framework-agnostic, supporting various machine learning frameworks, and it leverages Kubernetes' …",
          "link": "https://developers.redhat.com/articles/2024/03/15/empower-conversational-ai-scale-kserve",
          "publishedOn": "2024-03-15T07:00:00.000Z",
          "wordCount": null,
          "title": "Empower conversational AI at scale with KServe",
          "imageUrl": null
        },
        {
          "id": "0f384911-a9e7-474c-8d1f-871c3f778e7d",
          "author": "Maarten Vandeperre",
          "description": "In this article, I aim to share personal insights gained over the past year, rather than presenting factual or technological certainties. It is important for readers to recognize that the perspectives I offer are shaped by my own experiences and reflections.\nTo provide some background: approximately one year ago, I transitioned from a career in software development to a role as a Solution Architect at Red Hat, with a continued focus on application development. At that time, I identified as a full-stack developer and a DevOps engineer. However, I soon came to understand that the concept of a \"full-stack developer\" is somewhat misleading; in reality, my strengths lay in back-end development, with a keen interest in front-end technologies. While I was capable of initiating projects using Angu…",
          "link": "https://developers.redhat.com/articles/2024/03/14/standardization-and-innovation-enemies-or-partners-crime",
          "publishedOn": "2024-03-14T07:00:00.000Z",
          "wordCount": null,
          "title": "Standardization and innovation: Enemies or partners in crime?",
          "imageUrl": null
        },
        {
          "id": "4ff7241c-f709-4f2d-9a9e-addf632b85f2",
          "author": "Francisco De Melo Junior",
          "description": "A brief foray into containerized Java, this article describes the usage and implications of container-aware Java application deployments, and how to use it to your advantage of fully containerized deployments. We also cover the risks of decoupling the heap (off-heap) from the container limits. Finally, we will explain Red Hat OpenShift Container Platform limit settings and specific container-aware troubleshooting tools.\nJava is container-aware\nWhen deploying Java inside a container, sometimes we see questions such as:\nShould the user set max heap (Xmx)? What about the initial heap (Xms)? What about MaxRAM?\nShould we set MaxRAM to contain the full size of the memory?\nThe answer for most of those questions is no—for most use cases. The reason is that Java is container-aware.\nThis is a great …",
          "link": "https://developers.redhat.com/articles/2024/03/14/how-use-java-container-awareness-openshift-4",
          "publishedOn": "2024-03-14T07:00:00.000Z",
          "wordCount": null,
          "title": "How to use Java container awareness in OpenShift 4",
          "imageUrl": null
        },
        {
          "id": "9b1f4ce8-c323-4119-8eb5-046d2a61366b",
          "author": "Robert Krawitz",
          "description": "OpenShift Virtualization, a feature of Red Hat OpenShift, allows running virtual machines (VMs) alongside containers on the same platform, simplifying management. It allows using VMs in containerized environments by running VMs the same way as any other pod, so that organizations with significant investment in virtualization or who desire the greater isolation provided by VMs with legacy workloads can use them in an orchestrated containerized environment.\nWhile VMs offer important advantages in this regard, they do consume additional memory. There are several reasons why, but one of them is that while VMs can expand their memory use up to the limit of the defined size, but until now they cannot shrink their memory footprint. In this post, I will present a technology, Free Page Reporting (F…",
          "link": "https://developers.redhat.com/articles/2024/03/13/save-memory-openshift-virtualization-using-free-page-reporting",
          "publishedOn": "2024-03-13T07:00:00.000Z",
          "wordCount": null,
          "title": "Save memory with OpenShift Virtualization using Free Page Reporting",
          "imageUrl": null
        },
        {
          "id": "cb1323a4-598b-4dbc-935d-8eebaad1e5f9",
          "author": "Federico Valeri, Luke Chen",
          "description": "Tiered storage is a new early access feature available as of Apache Kafka 3.6.0 that allows you to scale compute and storage resources independently, provides better client isolation, and allows faster maintenance of your Kafka cluster. Let's dive into this new feature to see the motivations, design, and implementation details. In this post, we will focus on Tiered storage implementation, so it is assumed a good understanding of the Kafka architecture and main components. If you are looking for a tutorial or example, we recommend reading Getting started with tiered storage in Apache Kafka.\nTiering\nThe idea of tiering is not new in the software industry. The three-tier is a well-established software application architecture that organizes applications into three logical and physical computi…",
          "link": "https://developers.redhat.com/articles/2024/03/13/kafka-tiered-storage-deep-dive",
          "publishedOn": "2024-03-13T07:00:00.000Z",
          "wordCount": null,
          "title": "Kafka tiered storage deep dive",
          "imageUrl": null
        },
        {
          "id": "0824d6b5-31bf-409a-b757-a9441b94b703",
          "author": "Vivien Wang",
          "description": "As a Technology Partner within the Red Hat OpenShift ecosystem, Stakater's Multi Tenant Operator has been officially certified by Red Hat since March 2022, with the latest release certified in November 2023. With Red Hat OpenShift Certified Operators, customers can benefit from validated, verified, mature and supported Operators from Red Hat and partner ISVs in their hybrid cloud environments.\nLearn more about Red Hat OpenShift Operator certification here. To learn more about becoming a Red Hat Partner see this link.\nThis is the third part in a series featuring the exploration of Multi Tenant Operator (MTO) by Stakater, an operator designed to streamline and secure multi-tenancy in OpenShift and Kubernetes environments. In our two previous blogs (1) (2), we described MTO fundamentals. In t…",
          "link": "https://developers.redhat.com/articles/2024/03/12/understanding-templates-stakaters-multi-tenancy-operator",
          "publishedOn": "2024-03-12T07:00:00.000Z",
          "wordCount": null,
          "title": "Understanding Templates in Stakater's Multi Tenancy Operator",
          "imageUrl": null
        },
        {
          "id": "721f8a8a-c6e1-4104-b201-c0a229e5aeb4",
          "author": "Josephine Pfeiffer",
          "description": "A client company’s Red Hat OpenShift team was facing a common issue: engineering teams had to allocate time to handle repetitive and manual tasks, such as addressing a high volume of service desk tickets. Many of these tickets stemmed from misconfigurations and unclear documentation, which not only consume valuable time and effort from the engineering team but also hinder the productivity and satisfaction of end-users.\nThe client wanted to improve the developer experience by introducing more self-service and automation. To achieve this, the client tested out Red Hat Developer Hub as a unified access point to tools and resources.\nBackground\nToil, as defined by Google’s site reliability engineering (SRE) framework, is work that doesn’t drive long-term value. In this case, answering recurring…",
          "link": "https://developers.redhat.com/articles/2024/03/12/achieve-more-less-using-red-hat-developer-hubs-self-service-features",
          "publishedOn": "2024-03-12T07:00:00.000Z",
          "wordCount": null,
          "title": "Achieve more with less using Red Hat Developer Hub's self-service features",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "edykim.com 블로그 RSS 피드: undefined",
      "feedUrl": "https://edykim.com/ko/feed.xml",
      "siteUrl": "https://edykim.com/",
      "articles": [
        {
          "id": "https://edykim.com/ko/post/40-20-method/",
          "author": null,
          "description": "",
          "link": "https://edykim.com/ko/post/40-20-method/",
          "publishedOn": "2024-04-01T11:01:27.000Z",
          "wordCount": null,
          "title": "40+20 작업법",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Eli Bendersky's website",
      "feedUrl": "https://eli.thegreenplace.net/feeds/all.atom.xml",
      "siteUrl": "https://eli.thegreenplace.net/",
      "articles": [
        {
          "id": "https://eli.thegreenplace.net/2024/summary-of-reading-january-march-2024/",
          "author": null,
          "description": "<ul class=\"simple\">\n<li>&quot;Lessons in Chemistry: A Novel&quot; by Bonnie Garmus - a research chemist finds\nher way in the world following multiple personal tragedies and facing extreme\ngender discrimination. I have some mixed feelings about this book. On one hand\nit's original, enternaining, well-written and thought provoking. On the\nother hand it's full …</li></ul>",
          "link": "https://eli.thegreenplace.net/2024/summary-of-reading-january-march-2024/",
          "publishedOn": "2024-04-01T05:02:00.000Z",
          "wordCount": null,
          "title": "Summary of reading: January - March 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Embedded Artistry",
      "feedUrl": "https://embeddedartistry.com/feed/",
      "siteUrl": "https://embeddedartistry.com/",
      "articles": []
    },
    {
      "title": "Embedded.com",
      "feedUrl": "https://www.embedded.com/feed/",
      "siteUrl": "https://www.embedded.com/",
      "articles": [
        {
          "id": "https://www.embedded.com/?p=4481903",
          "author": "Nitin Dahad",
          "description": "Collaboration enables integrated solution to manage communication for ECU consolidation in zonal controllers for software-defined vehicle (SDV) architectures.\nThe post Green Hills Software, ST & Cetitec offer platform for SDVs appeared first on Embedded.com.",
          "link": "https://www.embedded.com/green-hills-software-st-cetitec-offer-platform-for-sdvs/",
          "publishedOn": "2024-04-09T06:31:09.000Z",
          "wordCount": null,
          "title": "Green Hills Software, ST & Cetitec offer platform for SDVs",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481898",
          "author": "Nitin Dahad",
          "description": "Agilex 5 FPGAs with AI infused into the fabric offer a high level of integration, low latency and improved computing capabilities for intelligent edge applications, according to Intel.\nThe post embedded world: Altera optimizes FPGAs for edge AI appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-world-altera-optimizes-fpgas-for-edge-ai/",
          "publishedOn": "2024-04-09T06:05:46.000Z",
          "wordCount": null,
          "title": "embedded world: Altera optimizes FPGAs for edge AI",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481885",
          "author": "Nitin Dahad",
          "description": "New multiprotocol MCX W wireless MCUs enable smart connected devices with a software-upgradeable radio subsystem, and also feature Bluetooth channel sounding.\nThe post New wireless MCUs feature software radio and Bluetooth channel sounding appeared first on Embedded.com.",
          "link": "https://www.embedded.com/new-wireless-mcus-feature-software-radio-and-bluetooth-channel-sounding/",
          "publishedOn": "2024-04-08T16:04:18.000Z",
          "wordCount": null,
          "title": "New wireless MCUs feature software radio and Bluetooth channel sounding",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481876",
          "author": "Nitin Dahad",
          "description": "New DDR5 modules in Intelligent Memory’s DRAM portfolio available in multiple capacities and form factors and lead-free options mean no need to rely on exemption 7c-I to the RoHS directive.\nThe post embedded world: New DDR5 modules don’t need RoHS exemption appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-world-new-ddr5-modules-dont-need-rohs-exemption/",
          "publishedOn": "2024-04-08T09:04:15.000Z",
          "wordCount": null,
          "title": "embedded world: New DDR5 modules don’t need RoHS exemption",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481859",
          "author": "Nitin Dahad",
          "description": "AI IP combines four IPs together to form one, integrated solution with fully customizable RISC-V 64-bit core, vector units, Tensor Unit and Gazzillion unit to ensure huge amounts of data can be handled from anywhere in the memory.\nThe post Semidynamics launches AI IP based on single ISA and one toolchain appeared first on Embedded.com.",
          "link": "https://www.embedded.com/semidynamics-launches-ai-ip-based-on-single-isa-and-one-toolchain/",
          "publishedOn": "2024-04-05T07:33:46.000Z",
          "wordCount": null,
          "title": "Semidynamics launches AI IP based on single ISA and one toolchain",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481851",
          "author": "Simon Jakob",
          "description": "How embedded systems can benefit from immutable Linux in a container environment.\nThe post Immutable Linux in a box appeared first on Embedded.com.",
          "link": "https://www.embedded.com/immutable-linux-in-a-box/",
          "publishedOn": "2024-04-04T20:55:07.000Z",
          "wordCount": null,
          "title": "Immutable Linux in a box",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481842",
          "author": "Alexander Lenz",
          "description": "In this article, we delve deeper into the multifaceted security features of e.MMC 5.1 devices.\nThe post Exploring e.MMC security: protecting embedded storage appeared first on Embedded.com.",
          "link": "https://www.embedded.com/exploring-e-mmc-security-protecting-embedded-storage/",
          "publishedOn": "2024-04-04T20:03:00.000Z",
          "wordCount": null,
          "title": "Exploring e.MMC security: protecting embedded storage",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481835",
          "author": "Stewart Merkel",
          "description": "1-Wire networks with many 1-Wire nodes can require dedicated 1-Wire channels. This article discusses a method for using only one 1-Wire host in a network...\nThe post Multiplexing a 1-Wire host across multiple channels appeared first on Embedded.com.",
          "link": "https://www.embedded.com/multiplexing-a-1-wire-host-across-multiple-channels/",
          "publishedOn": "2024-04-03T13:31:20.000Z",
          "wordCount": null,
          "title": "Multiplexing a 1-Wire host across multiple channels",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481837",
          "author": "Emily Newton",
          "description": "Smaller device form factors often bring PCB design challenges that can subsequently affect inspection. Making printed circuit boards (PCBs) progressively smaller is an ongoing trend...\nThe post How miniaturization impacts PCB inspection appeared first on Embedded.com.",
          "link": "https://www.embedded.com/how-miniaturization-impacts-pcb-inspection/",
          "publishedOn": "2024-04-03T13:03:00.000Z",
          "wordCount": null,
          "title": "How miniaturization impacts PCB inspection",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481826",
          "author": "Nitin Dahad",
          "description": "Platform is designed to provide OEMs and Tier 1s with a safe, secure processing platform to develop domain and zonal controllers as well as drivetrains for electric vehicles for next-generation software-defined vehicle architectures.\nThe post Infineon and Green Hills combine MCU and RTOS for EVs and SDVs appeared first on Embedded.com.",
          "link": "https://www.embedded.com/infineon-and-green-hills-combine-mcu-and-rtos-for-evs-and-sdvs/",
          "publishedOn": "2024-04-02T17:40:23.000Z",
          "wordCount": null,
          "title": "Infineon and Green Hills combine MCU and RTOS for EVs and SDVs",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481821",
          "author": "Nitin Dahad",
          "description": "The solution includes full Altium design files and all required software and firmware, along with an environmental sensor measuring temperature, humidity, air quality, and air pressure.\nThe post embedded world: Synzen brings first free-to download OS IoT design appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-world-synzen-brings-first-free-to-download-os-iot-design/",
          "publishedOn": "2024-04-02T13:01:00.000Z",
          "wordCount": null,
          "title": "embedded world: Synzen brings first free-to download OS IoT design",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481814",
          "author": "Nitin Dahad",
          "description": "The “Rust Fundamentals” course serves as a general introduction to Rust programming for building embedded systems and can be delivered in four days of in-person training or five interactive sessions of six hours each of live online training.\nThe post HighTec and Doulos offer Rust training including use with legacy C/C++ code appeared first on Embedded.com.",
          "link": "https://www.embedded.com/hightec-and-doulos-offer-rust-training-including-use-with-legacy-c-c-code/",
          "publishedOn": "2024-04-02T12:31:32.000Z",
          "wordCount": null,
          "title": "HighTec and Doulos offer Rust training including use with legacy C/C++ code",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481808",
          "author": "Nitin Dahad",
          "description": "Microchip said its new 2Mb and 4 Mb serial SRAM devices are intended to replace expensive parallel SRAM with an easy and cost-effective alternative.\nThe post embedded world: Microchip adds 2 Mb and 4 Mb serial SRAM devices appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-world-microchip-adds-2-mb-and-4-mb-serial-sram-devices/",
          "publishedOn": "2024-04-02T11:19:15.000Z",
          "wordCount": null,
          "title": "embedded world: Microchip adds 2 Mb and 4 Mb serial SRAM devices",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481800",
          "author": "Nitin Dahad",
          "description": "Among its x86/ARM portfolio for emerging markets such as EV charging and AI-integrated robotics, Advantech will be launching new OSM modules based on Qualcomm and NXP.\nThe post embedded world: Advantech to show new OSM modules targeting edge AI appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-world-advantech-to-show-new-osm-modules-targeting-edge-ai/",
          "publishedOn": "2024-04-02T10:52:45.000Z",
          "wordCount": null,
          "title": "embedded world: Advantech to show new OSM modules targeting edge AI",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481788",
          "author": "Nitin Dahad",
          "description": "Synopsys highlighted momentum its ai suite which includes DSO.ai and VSO.ai, and introduced 3DSO.ai to enable 3D design space optimization for multi-die systems, plus new hardware-assisted verification solutions and access to a new cloud hybrid system.\nThe post Synopsys SNUG: AI driven EDA momentum, new tools for multi-die appeared first on Embedded.com.",
          "link": "https://www.embedded.com/synopsys-snug-ai-driven-eda-momentum-new-tools-for-multi-die/",
          "publishedOn": "2024-04-01T20:05:47.000Z",
          "wordCount": null,
          "title": "Synopsys SNUG: AI driven EDA momentum, new tools for multi-die",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481779",
          "author": "Nitin Dahad",
          "description": "NIMs enable users to create and deploy custom applications on their own platforms and retain full ownership of their IP. Built on top of CUDA, a catalog of cloud-native microservices is available Nvidia and its partners.\nThe post Nvidia GTC: NIM microservices will drive more generative AI copilots appeared first on Embedded.com.",
          "link": "https://www.embedded.com/nvidia-gtc-nim-microservices-will-drive-more-generative-ai-copilots/",
          "publishedOn": "2024-04-01T19:08:15.000Z",
          "wordCount": null,
          "title": "Nvidia GTC: NIM microservices will drive more generative AI copilots",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481772",
          "author": "Nitin Dahad",
          "description": "Ambiq said combination of performance and efficiency enables its customers to deploy sophisticated speech, vision, health, and industrial AI models on battery-powered devices everywhere.\nThe post Ambiq launches SoC for running AI/ML on batteries appeared first on Embedded.com.",
          "link": "https://www.embedded.com/ambiq-launches-soc-for-running-ai-ml-on-batteries/",
          "publishedOn": "2024-04-01T17:42:11.000Z",
          "wordCount": null,
          "title": "Ambiq launches SoC for running AI/ML on batteries",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481763",
          "author": "Nitin Dahad",
          "description": "The Bluetooth Channel Sounding feature will enable unprecedented positioning accuracy for consumer and commercial applications. Rohde & Schwarz will demonstrate signal measurement capabilities to support chip and device development.\nThe post Rohde & Schwarz to show measurements on novel Bluetooth Channel Sounding signals appeared first on Embedded.com.",
          "link": "https://www.embedded.com/rohde-schwarz-to-show-measurements-on-novel-bluetooth-channel-sounding-signals/",
          "publishedOn": "2024-03-28T23:08:23.000Z",
          "wordCount": null,
          "title": "Rohde & Schwarz to show measurements on novel Bluetooth Channel Sounding signals",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481758",
          "author": "Nitin Dahad",
          "description": "While many MCU providers have recently joined investment alliances to advance the development of RISC-V products, Renesas said it has already designed and tested a new RISC-V core independently.\nThe post Renesas launches first general-purpose 32-bit RISC-V based MCUs appeared first on Embedded.com.",
          "link": "https://www.embedded.com/renesas-launches-first-general-purpose-32-bit-risc-v-based-mcus/",
          "publishedOn": "2024-03-27T22:54:04.000Z",
          "wordCount": null,
          "title": "Renesas launches first general-purpose 32-bit RISC-V based MCUs",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481742",
          "author": "Anton Shilov",
          "description": "The next generation of AI clusters will require more GPUs and more machines which will require either optical interconnects or PCIe active electrical cables. We dive into the details of Astera Labs new Aries 6 PCIe Gen6 retimers that support the CXL 3.x protocol.\nThe post New PCIe Gen6 CXL3.0 retimer: a small chip for big next-gen AI appeared first on Embedded.com.",
          "link": "https://www.embedded.com/new-pcie-gen6-cxl3-0-retimer-a-small-chip-for-big-next-gen-ai/",
          "publishedOn": "2024-03-26T22:37:12.000Z",
          "wordCount": null,
          "title": "New PCIe Gen6 CXL3.0 retimer: a small chip for big next-gen AI",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481737",
          "author": "Jacob Beningo",
          "description": "Rust makes a lot of sense for general application development, but does it really make sense for embedded software teams? Have you heard about Rust?...\nThe post Embedded Rust: where are we today? appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-rust-where-are-we-today/",
          "publishedOn": "2024-03-26T16:02:09.000Z",
          "wordCount": null,
          "title": "Embedded Rust: where are we today?",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481731",
          "author": "Gilad David Maayan",
          "description": "Of the MITRE Common Weakness Enumeration (CWE) Top 25 security weaknesses, 18 are commonly found in IoT devices. MITRE ATT&CK, which stands for Adversarial Tactics,...\nThe post Mitigating MITRE CWE threats in IoT devices appeared first on Embedded.com.",
          "link": "https://www.embedded.com/mitigating-mitre-cwe-threats-in-iot-devices/",
          "publishedOn": "2024-03-26T15:43:52.000Z",
          "wordCount": null,
          "title": "Mitigating MITRE CWE threats in IoT devices",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481726",
          "author": "Miro Samek",
          "description": "Assertions and Design by Contract (DBC) are the most valuable and effective best practices for delivering high-quality software. Assertions and Design by Contract (DBC) [1]...\nThe post Programming embedded systems: assertions and Design by Contract appeared first on Embedded.com.",
          "link": "https://www.embedded.com/programming-embedded-systems-assertions-and-design-by-contract/",
          "publishedOn": "2024-03-26T13:59:20.000Z",
          "wordCount": null,
          "title": "Programming embedded systems: assertions and Design by Contract",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481675",
          "author": "Jacob Beningo",
          "description": "We explore several low-power design techniques that I often see overlooked but that can make a big difference. Designing an embedded system for battery life...\nThe post 3 techniques to improve low-power design appeared first on Embedded.com.",
          "link": "https://www.embedded.com/3-techniques-to-improve-low-power-design/",
          "publishedOn": "2024-03-20T12:48:14.000Z",
          "wordCount": null,
          "title": "3 techniques to improve low-power design",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481672",
          "author": "Neil Bosworth",
          "description": "By optimizing water distribution, leveraging real-time data, and preventing structural damage, IoT stands as a transformative force in ensuring a sustainable and efficient water future....\nThe post How IoT offers a transformative solution to water management appeared first on Embedded.com.",
          "link": "https://www.embedded.com/how-iot-offers-a-transformative-solution-to-water-management/",
          "publishedOn": "2024-03-20T12:32:32.000Z",
          "wordCount": null,
          "title": "How IoT offers a transformative solution to water management",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481668",
          "author": "Nitin Dahad",
          "description": "Cadence and Arm join forces to provide ADAS chiplet reference design and software development platform based on the latest Automotive Enhanced technologies from Arm.\nThe post Cadence and Arm launch ADAS chiplet development platform appeared first on Embedded.com.",
          "link": "https://www.embedded.com/cadence-and-arm-launch-adas-chiplet-development-platform/",
          "publishedOn": "2024-03-18T11:58:58.000Z",
          "wordCount": null,
          "title": "Cadence and Arm launch ADAS chiplet development platform",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481665",
          "author": "Nitin Dahad",
          "description": "Revision 2.2 of PICMG carrier design guide introduces new diagrams, figures, and design notes for COM-HPC Mini, and contains technical materials such as interface schematics and practical guidance on design rules.\nThe post PICMG releases version 2.2 of COM-HPC Mini design guide appeared first on Embedded.com.",
          "link": "https://www.embedded.com/picmg-releases-version-2-2-of-com-hpc-mini-design-guide/",
          "publishedOn": "2024-03-18T11:12:51.000Z",
          "wordCount": null,
          "title": "PICMG releases version 2.2 of COM-HPC Mini design guide",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481659",
          "author": "Nitin Dahad",
          "description": "Latest ams OSRAM sensor provides accurate current, voltage and temperature measurement for industrial applications, as part of its portfolio of high-precision sensors for battery management systems.\nThe post IVT sensor provides precise battery state of charge measurement appeared first on Embedded.com.",
          "link": "https://www.embedded.com/ivt-sensor-provides-precise-battery-state-of-charge-measurement/",
          "publishedOn": "2024-03-18T10:53:13.000Z",
          "wordCount": null,
          "title": "IVT sensor provides precise battery state of charge measurement",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481655",
          "author": "Jacob Beningo",
          "description": "As developers of embedded and edge IoT devices, it’s time to start learning the lessons of robust software development engrained in teams working on high-reliability...\nThe post Leveraging space system software best practices for edge IoT appeared first on Embedded.com.",
          "link": "https://www.embedded.com/leveraging-space-system-software-best-practices-for-edge-iot/",
          "publishedOn": "2024-03-13T12:38:10.000Z",
          "wordCount": null,
          "title": "Leveraging space system software best practices for edge IoT",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481652",
          "author": "Miro Samek",
          "description": "In this video tutorial, we explain the general principles of software tracing based on a binary protocol, which is far less intrusive than using printf()....\nThe post Programming embedded systems: software tracing with binary protocols appeared first on Embedded.com.",
          "link": "https://www.embedded.com/programming-embedded-systems-software-tracing-with-binary-protocols/",
          "publishedOn": "2024-03-13T12:25:02.000Z",
          "wordCount": null,
          "title": "Programming embedded systems: software tracing with binary protocols",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4481643",
          "author": "Gilad David Maayan",
          "description": "Kubernetes offers a powerful, scalable platform for managing IoT workloads, with KubeEdge extending these capabilities to the edge. Kubernetes is an open-source platform designed to...\nThe post Kubernetes for IoT: a practical guide appeared first on Embedded.com.",
          "link": "https://www.embedded.com/kubernetes-for-iot-a-practical-guide/",
          "publishedOn": "2024-03-13T12:11:27.000Z",
          "wordCount": null,
          "title": "Kubernetes for IoT: a practical guide",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "EmbeddedRelated.com Blogs",
      "feedUrl": "https://www.embeddedrelated.com/blogs_rss.php",
      "siteUrl": "https://www.embeddedrelated.com/blogs.php",
      "articles": [
        {
          "id": "https://www.embeddedrelated.com/showarticle/1650.php",
          "author": null,
          "description": "I have often talked and written about my thoughts on programming languages. In particular, the fact that there really is no language that was designed with embedded programming specifically in mind. Historically, there was assembly language, but that is rarely used for large scale coding nowadays. Intel promoted PL/M many years ago, but that has long since fallen by the wayside.\nC and C++ are...",
          "link": "https://www.embeddedrelated.com/showarticle/1650.php",
          "publishedOn": "2024-04-01T16:38:34.000Z",
          "wordCount": null,
          "title": "The volatile keyword",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1649.php",
          "author": null,
          "description": "Mongooses and very small pythons can coexist, and even be friends.\r\n\r\nThis is more a framework than an actual application, with it you can integrate MicroPython and Cesanta's Mongoose. Mongoose runs when called by MicroPython and is able to run Python functions as callbacks for the events you decide in your event handler. The code is completely written in C, except for the example Python...",
          "link": "https://www.embeddedrelated.com/showarticle/1649.php",
          "publishedOn": "2024-03-31T20:31:40.000Z",
          "wordCount": null,
          "title": "When a Mongoose met a MicroPython",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1648.php",
          "author": null,
          "description": "Overview\nIn the previous blog post (Getting Started With CUDA C on Jetson Nvidia: Hello CUDA World!) I showed how to develop applications targeted at a GPU on a Nvidia Jetson Nano. As we observed in that blog post, performing a calculation on a 1-D array on a GPU had no performance benefit compared to a traditional CPU implementation, even on an array with many elements. In this blog post,...",
          "link": "https://www.embeddedrelated.com/showarticle/1648.php",
          "publishedOn": "2024-03-28T10:47:29.000Z",
          "wordCount": null,
          "title": "Getting Started With CUDA C on an Nvidia Jetson: GPU Architecture",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1624.php",
          "author": null,
          "description": "Understaning PIC Configuration\r\nThis second in a series of five blog posts continues exploring getting started with Microchip’s 8-bit PIC family of\r\nmicrocontrollers by delving into basic processor memory organization and how this family of microcontrollers initialize, specifically:\r\n\r\n\r\n\t\nPIC Memory & Registers\n\r\n\t\nPIC Configuration Sources\nRevisiting MPLAB X Project...",
          "link": "https://www.embeddedrelated.com/showarticle/1624.php",
          "publishedOn": "2024-03-26T13:05:03.000Z",
          "wordCount": null,
          "title": "Understanding Microchip 8-bit PIC Configuration",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1647.php",
          "author": null,
          "description": "While beneficial to embedded developers, the C programming language can be inflexible. For example, have you ever had a function that had to manage multiple types? How did you solve that problem?\r\n\r\nI bet you either duplicated that function, which led to confusing code or used a complex series of macros. Neither of those is terribly helpful because it creates code that is difficult to maintain...",
          "link": "https://www.embeddedrelated.com/showarticle/1647.php",
          "publishedOn": "2024-03-24T11:53:42.000Z",
          "wordCount": null,
          "title": "C to C++: Templates and Generics – Supercharging Type Flexibility",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1646.php",
          "author": null,
          "description": "Previously in the EmbeddedRelated article (https://embeddedrelated.com/showarticle/1633.php)\r\n we saw how to use LEDs Subsystem on NuttX testing on RaspberryPi Pico. In the same way we avoided using GPIO Subsystem to control LEDs we can avoid using GPIO Subsystem to read Buttons inputs. That is right, NuttX has an Input Device Subsystem like Linux and today we will learn how to use...",
          "link": "https://www.embeddedrelated.com/showarticle/1646.php",
          "publishedOn": "2024-03-23T00:29:19.000Z",
          "wordCount": null,
          "title": "Using (Apache) NuttX Buttons Subsystem",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1628.php",
          "author": null,
          "description": "When the going gets tough, the tough get going. So, if you are going to deal with a problem slightly harder than switching a lightbulb on and off, you may want something better in your toolbox than what I described in my previous post on State Machines.\r\n\r\nIn this post, I'll start from the basic ad-hoc implementation presented in my last post and will decouple the state handling (the state...",
          "link": "https://www.embeddedrelated.com/showarticle/1628.php",
          "publishedOn": "2024-03-14T08:00:54.000Z",
          "wordCount": null,
          "title": "Simple C++ State Machine Engine",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1641.php",
          "author": null,
          "description": "Introduction\r\nSales of Graphics Processing Units (GPU) have exploded over the past few years due to the rising popularity of machine learning applications. However, GPUs were originally architected and designed for gaming applications. Their native architecture naturally translated into use in machine learning due to the similar operations performed. Nvidia is one of the most...",
          "link": "https://www.embeddedrelated.com/showarticle/1641.php",
          "publishedOn": "2024-03-13T14:26:46.000Z",
          "wordCount": null,
          "title": "Getting Started With CUDA C on an Nvidia Jetson: Hello CUDA World!",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1640.php",
          "author": null,
          "description": "This is a short article about how to analyze the diode in some gate drive circuits when figuring out turn-off characteristics — specifically, determining the relationship between gate drive current and gate voltage during turn-off of a power transistor.\n\r\nHere’s the diode I’m talking about; it’s the one labeled D1:\n\r\n\r\n\r\nJust as an example, I’m going to use the...",
          "link": "https://www.embeddedrelated.com/showarticle/1640.php",
          "publishedOn": "2024-03-11T23:08:57.000Z",
          "wordCount": null,
          "title": "Modeling Gate Drive Diodes",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1622.php",
          "author": null,
          "description": "Welcome to the first of five posts focusing on getting started with Microchip's 8-bit PIC® microcontrollers. The series of posts introduce successive topics culminating in a final project implementing a simple 4-bit counter with a \"UI\" of four external LEDs connected to GPIO pins counting up at a one second interval via an internal timer.\r\n\r\nThis post introduces the...",
          "link": "https://www.embeddedrelated.com/showarticle/1622.php",
          "publishedOn": "2024-03-11T15:14:09.000Z",
          "wordCount": 5495,
          "title": "Getting Started with the Microchip PIC® Microcontroller",
          "imageUrl": "https://www.embeddedrelated.com/new2/images/blog_generic_image.png"
        }
      ]
    },
    {
      "title": "Evans Library",
      "feedUrl": "https://evan-moon.github.io/feed.xml",
      "siteUrl": "https://evan-moon.github.io",
      "articles": [
        {
          "id": "20240402-category-theory-for-programmers-8-functoriality",
          "author": null,
          "description": "이제 펑터가 무엇인지 알았으니, 작은 펑터로부터 큰 펑터를 구축해나가는 방법에 대해서 살펴보도록 하겠다. 여기서 특히 흥미로운 부분은 카테고리 내 대상 간의 매핑에 대당하는 타입의 생성자가 확장되어 사상 간의 매핑을 포함하는 펑터가 되는 과정을 볼 수 있다는 것이다.",
          "link": "https://evan-moon.github.io/2024/04/02/category-theory-for-programmers-8-functoriality/",
          "publishedOn": "2024-04-02T05:29:53.000Z",
          "wordCount": null,
          "title": "[번역] 프로그래머를 위한 카테고리 이론 - 8. 펑터의 특성",
          "imageUrl": null
        },
        {
          "id": "20240315-category-theory-for-programmers-7-functors",
          "author": null,
          "description": "이번 챕터에서는 펑터(Functor)에 대해서 이야기를 해보려고 한다. 펑터는 간단하지만 매우 강력한 개념이며 카테고리 이론은 이처럼 간단하지만 강력한 아이디어로 가득 차있다.",
          "link": "https://evan-moon.github.io/2024/03/15/category-theory-for-programmers-7-functors/",
          "publishedOn": "2024-03-19T10:30:00.000Z",
          "wordCount": null,
          "title": "[번역] 프로그래머를 위한 카테고리 이론 - 7. 펑터",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Better Embedded System SW",
      "feedUrl": "https://feeds.feedburner.com/BetterEmbeddedSystemSw",
      "siteUrl": "http://betterembsw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Google for Developers Blog - News about Web, Mobile, AI and Cloud",
      "feedUrl": "https://feeds.feedburner.com/GDBcode",
      "siteUrl": "http://developers.googleblog.com/",
      "articles": [
        {
          "id": "http://developers.googleblog.com/2024/04/gemini-15-pro-in-public-preview-with-new-features.html",
          "author": null,
          "description": "Posted by Jaclyn Konzelmann and Megan Li - Google Labs\n\n\n\n\n\n\nGrab an API key in Google AI Studio, and get started with the Gemini API Cookbook\nLess than two months ago, we made our next-generation Gemini 1.5 Pro model available in Google AI Studio for developers to try out. We’ve been amazed by what the community has been able to debug, create and learn using our groundbreaking 1 million context window.\nToday, we’re making Gemini 1.5 Pro available in 180+ countries via the Gemini API in public preview, with a first-ever native audio (speech) understanding capability and a new File API to make it easy to handle files. We’re also launching new features like system instructions and JSON mode to give developers more control over the model’s output. Lastly, we’re releasing our next generation t…",
          "link": "http://developers.googleblog.com/2024/04/gemini-15-pro-in-public-preview-with-new-features.html",
          "publishedOn": "2024-04-09T16:00:00.000Z",
          "wordCount": null,
          "title": "Gemini 1.5 Pro Now Available in 180+ Countries; With Native Audio Understanding, System Instructions, JSON Mode and More",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2024/04/meet-google-for-startups-accelerator-inaugural-cohort-ai-first-north-america.html",
          "author": null,
          "description": "Posted by Matt Ridenour, Head of Startup Developer Ecosystem - USA\n\n\n\n\n\n\nStartups are at the forefront of developing solutions for some of humanity's most pressing challenges by using AI, driving breakthroughs across industries from healthcare to cybersecurity.\nTo help AI-focused startups scale quickly while building responsibly, we’re thrilled to introduce the inaugural class of the Google for Startups Accelerator: AI-First program in North America. This new program is for startups building AI solutions based in the U.S. and Canada. This is the first of several AI-focused programs we'll offer throughout the year in Europe, India and Brazil.\nThis equity-free program provides 10 weeks of hands-on mentorship and technical project support to startups using AI in their core service or product.…",
          "link": "http://developers.googleblog.com/2024/04/meet-google-for-startups-accelerator-inaugural-cohort-ai-first-north-america.html",
          "publishedOn": "2024-04-09T13:00:00.000Z",
          "wordCount": null,
          "title": "Meet the inaugural cohort of our Google for Startups Accelerator: AI First North America",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2024/04/gemma-family-expands.html",
          "author": null,
          "description": "Posted by Tris Warkentin – Director, Product Management and Jane Fine - Senior Product Manager\n\n\n\n\n\n\nIn February we announced Gemma, our family of lightweight, state-of-the-art open models built from the same research and technology used to create the Gemini models. The community's incredible response – including impressive fine-tuned variants, Kaggle notebooks, integration into tools and services, recipes for RAG using databases like MongoDB, and lots more – has been truly inspiring.\nToday, we're excited to announce our first round of additions to the Gemma family, expanding the possibilities for ML developers to innovate responsibly: CodeGemma for code completion and generation tasks as well as instruction following, and RecurrentGemma, an efficiency-optimized architecture for research e…",
          "link": "http://developers.googleblog.com/2024/04/gemma-family-expands.html",
          "publishedOn": "2024-04-09T12:00:00.000Z",
          "wordCount": null,
          "title": "Gemma Family Expands with Models Tailored for Developers and Researchers",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2024/04/ml-olympiad-2024-globally-distributed-ml-competitions-by-google-ml-community.html",
          "author": null,
          "description": "Posted by Bitnoori Keum – DevRel Community Manager\n\n\n\n\n\n\n\nThe ML Olympiad consists of Kaggle Community Competitions organized by ML GDE, TFUG, and other ML communities, aiming to provide developers with opportunities to learn and practice machine learning. Following successful rounds in 2022 and 2023, the third round has now launched with support from Google for Developers for each competition host. Over the last two rounds, 605 teams participated in 32 competitions, generating 105 discussions and 170 notebooks. We encourage you to join this round to gain hands-on experience with machine learning and tackle real-world challenges.\n\n\n\nML Olympiad Community Competitions\nOver 20 ML Olympiad community competitions are currently open. Visit the ML Olympiad page to participate.\nSmoking Detection …",
          "link": "http://developers.googleblog.com/2024/04/ml-olympiad-2024-globally-distributed-ml-competitions-by-google-ml-community.html",
          "publishedOn": "2024-04-03T16:00:00.000Z",
          "wordCount": null,
          "title": "ML Olympiad 2024: Globally Distributed ML Competitions by Google ML Community",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2024/03/weareplay-meet-founders-changing-womens-lives-womens-history-month-stories.html",
          "author": null,
          "description": "Posted by Leticia Lago – Developer Marketing\n\n\n\n\n\n\nIn celebration of Women’s History month, we’re celebrating the founders behind groundbreaking apps and games from around the world - made by women or for women. Let's discover four of my favorites in this latest batch of nine  #WeArePlay stories.\n\n\n\nMúkami Kinoti Kimotho\nRoyelles Revolution / Royelles Revolution: Gaming For Girls (USA)\n\n\n\n\n\nMúkami's journey began when she noticed the lack of representation for girls in the gaming industry. Determined to change this narrative, she created Royelles, a game designed to inspire girls and non-binary people to pursue careers in STEAM (science, technology, engineering, art, math) fields. The game is anchored in fierce female avatars like the real life NASA scientist Mara who voices a character. R…",
          "link": "http://developers.googleblog.com/2024/03/weareplay-meet-founders-changing-womens-lives-womens-history-month-stories.html",
          "publishedOn": "2024-03-25T16:00:00.000Z",
          "wordCount": null,
          "title": "#WeArePlay | Meet the founders changing women's lives: Women’s History Month Stories",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2024/03/build-with-google-ai-video-series-season-2.html",
          "author": null,
          "description": "Posted by Joe Fernandez – Google AI Developer Relations\n\n\n\n\n\nWe are off to another exciting year in Artificial Intelligence (AI) and it's time to build more applications with Google AI technology! The Build with Google AI video series is for developers looking to build helpful and practical applications with AI. We focus on useful code projects you can implement and extend in an afternoon to bring the power of artificial intelligence into your workflow or organization. Our first season received over 100,000 views in six weeks! We are glad to see that so many of you liked the series, and we are excited to bring you even more Google AI application projects.\nToday, we are launching Season 2 of the Build with Google AI series, featuring projects built with Google's Gemini API technology. The l…",
          "link": "http://developers.googleblog.com/2024/03/build-with-google-ai-video-series-season-2.html",
          "publishedOn": "2024-03-20T16:00:00.000Z",
          "wordCount": null,
          "title": "Build with Google AI video series, Season 2: more AI patterns",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2024/03/tune-gemini-pro-in-google-ai-studio-or-gemini-api.html",
          "author": null,
          "description": "Posted by Cher Hu, Product Manager and Saravanan Ganesh, Software Engineer for Gemini API\n\n\n\n\n\n\n\nThe following post was originally published in October 2023. Today, we've updated the post to share how you can easily tune Gemini models in Google AI Studio or with the Gemini API.\n\n\nLast year, we launched Gemini 1.0 Pro, our mid-sized multimodal model optimized for scaling across a wide range of tasks. And with 1.5 Pro this year, we demonstrated the possibilities of what large language models can do with an experimental 1M context window. Now, to quickly and easily customize the generally available Gemini 1.0 Pro model (text) for your specific needs, we’ve added Gemini Tuning to Google AI Studio and the Gemini API.\n\n\nWhat is tuning?\nDevelopers often require higher quality output for custom us…",
          "link": "http://developers.googleblog.com/2024/03/tune-gemini-pro-in-google-ai-studio-or-gemini-api.html",
          "publishedOn": "2024-03-19T18:00:00.000Z",
          "wordCount": null,
          "title": "Tune Gemini Pro in Google AI Studio or with the Gemini API",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2024/03/google-io-2024-save-the-date.html",
          "author": null,
          "description": "Posted by Jeanine Banks – VP & General Manager, Developer X, and Head of Developer Relations\n\n\n\n\n\n\nGoogle I/O is arriving this year on May 14th and you’re invited to join us online! I/O offers something for everyone, whether you are developing a new application, modernizing an existing one, or transforming it into a business.\nThe Gemini era unlocks new possibilities for developers to build creative and productive AI-enabled applications. I/O is where you’ll hear how you can get from idea to production AI applications faster. We’re  excited to share what’s new for mobile, web, and multiplatform development, and how to scale your applications in the cloud. You will be able to dive deeper into topics that interest you with over 100 sessions, workshops, codelabs, and demos.\n \n\nVisit the Google I/O site and register to stay informed about I/O and other related events coming soon. The livestreamed keynotes start May 14 at 10am PT, so mark your calendar.\nIf you haven’t already, go try out our newest Google I/O puzzle and head to @googlefordevs on Instagram if you need a hint.",
          "link": "http://developers.googleblog.com/2024/03/google-io-2024-save-the-date.html",
          "publishedOn": "2024-03-14T20:00:00.000Z",
          "wordCount": null,
          "title": "Tune in for Google I/O on May 14",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2024/03/gde-womens-history-month-feature-gema-parreno-piqueras.html",
          "author": null,
          "description": "Posted by Justyna Politanska-Pyszko – Program Manager, Google Developer Experts \n\n\n\n\n\n\n\nFor Women's History Month, we're shining a spotlight on Gema Parreño Piqueras, an AI/ML Google Developer Expert (GDE) from Madrid, Spain. GDEs are recognized by Google for their outstanding technical expertise and passion for sharing knowledge.\n\n\n\nGema Parreño Piqueras, AI/ML GDE, Madrid, Spain \n\n\n\nGema's dedication to the GDE program makes her a true leader within the Google Developers community, and her work in Artificial Intelligence and Machine Learning pushes the boundaries of Google's technological capabilities.\nGema is a force to be reckoned with in the world of data science. As a data scientist at Izertis and a GDE, she's not only making significant contributions to the field of AI/ML but also b…",
          "link": "http://developers.googleblog.com/2024/03/gde-womens-history-month-feature-gema-parreno-piqueras.html",
          "publishedOn": "2024-03-13T19:00:00.000Z",
          "wordCount": null,
          "title": "GDE Women’s History Month Feature: Gema Parreño Piqueras, AI/ML GDE",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2024/03/google-for-games-is-coming-to-gdc-2024.html",
          "author": null,
          "description": "Posted by Aurash Mahbod – General Manager, Games on Google Play\n\n\n\n\n\n\nGoogle for Games is coming to GDC in San Francisco! Join us on March 19 for the Game Developers Conference (GDC) at the Moscone Center, where game developers from across the world will gather to learn, network, problem-solve, and help shape the future of the industry. From March 18 to March 22, experience our comprehensive suite of multi-platform game development tools and explore the new features from Play Pass at the West Hall, Level 2 Lobby.\nThis year, we’re proud to host eight sessions for developers, designers, business and marketing teams, and everyone else in the gaming community with an interest to grow their game business. Take a look at this year’s sessions below and if you’re interested in learning more about …",
          "link": "http://developers.googleblog.com/2024/03/google-for-games-is-coming-to-gdc-2024.html",
          "publishedOn": "2024-03-12T15:45:00.000Z",
          "wordCount": null,
          "title": "Google for Games is coming to GDC 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Many But Finite",
      "feedUrl": "https://feeds.feedburner.com/GustavoDuarte",
      "siteUrl": "https://manybutfinite.com/feed.xml",
      "articles": []
    },
    {
      "title": "Krister Walfridsson’s old blog",
      "feedUrl": "http://feeds.feedburner.com/KristerWalfridssonsBlog",
      "siteUrl": "http://kristerw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Python Insider",
      "feedUrl": "https://feeds.feedburner.com/PythonInsider",
      "siteUrl": "https://pythoninsider.blogspot.com/",
      "articles": [
        {
          "id": "https://pythoninsider.blogspot.com/2024/04/python-3123-and-3130a6-released.html",
          "author": null,
          "description": "It’s time to eclipse the Python 3.11.9 release with two releases, one of which is the very last alpha release of Python 3.13:\n\n \nPython 3.12.3\n300+ of the finest commits went into this latest maintenance release \nof the latest Python version, the most stablest, securest, bugfreeest we\n could make it.\n\nhttps://www.python.org/downloads/release/python-3123/\n \n\n\n\nPython 3.13.0a6\nWhat’s that? The last alpha release? Just one more month until \nfeature freeze! Get your features done, get your bugs fixed, let’s get \n3.13.0 ready for people to actually use! Until then, let’s test with \nalpha 6. The highlights of 3.13 you ask? Well:\nIn the interactive interpreter, exception tracebacks are now colorized by default.\nA preliminary, experimental JIT was added, providing the ground work for significant p…",
          "link": "https://pythoninsider.blogspot.com/2024/04/python-3123-and-3130a6-released.html",
          "publishedOn": "2024-04-09T19:14:00.003Z",
          "wordCount": null,
          "title": "Python 3.12.3 and 3.13.0a6 released",
          "imageUrl": null
        },
        {
          "id": "https://pythoninsider.blogspot.com/2024/04/python-3119-is-now-available.html",
          "author": null,
          "description": "This is the last bug fix release of Python 3.11 \n\nThis is the ninth maintenance release of Python 3.11\nPython 3.11.9 is the newest major release of the Python programming language, and it contains many new features and optimizations. Get it here:\nhttps://www.python.org/downloads/release/python-3119/\nMajor new features of the 3.11 series, compared to 3.10\n\nAmong the new major new features and changes so far:\n\n\nPEP 657 – Include Fine-Grained Error Locations in Tracebacks\nPEP 654 – Exception Groups and except*\nPEP 673 – Self Type\nPEP 646 – Variadic Generics\nPEP 680 – tomllib: Support for Parsing TOML in the Standard Library\nPEP 675 – Arbitrary Literal String Type\nPEP 655 – Marking individual TypedDict items as required or potentially-missing\nbpo-46752 – Introduce task groups to asyncio\nPEP 68…",
          "link": "https://pythoninsider.blogspot.com/2024/04/python-3119-is-now-available.html",
          "publishedOn": "2024-04-08T08:26:00.003Z",
          "wordCount": null,
          "title": "Python 3.11.9 is now available",
          "imageUrl": null
        },
        {
          "id": "https://pythoninsider.blogspot.com/2024/03/python-31014-3919-and-3819-is-now.html",
          "author": null,
          "description": "Howdy!\nPython 3.10.14\nGet it here: Python Release Python 3.10.14\n26 commits since the last release.\n\nPython 3.9.19\nGet it here: Python Release Python 3.9.19\n26 commits since the last release. \n\nPython 3.8.19\nGet it here: Python Release Python 3.8.19\n28 commits since the last release.\n\nSecurity content in this release\ngh-115399 & gh-115398: bundled libexpat was updated to 2.6.0 to address CVE-2023-52425,\n and control of the new reparse deferral functionality was exposed with \nnew APIs. Thanks to Sebastian Pipping, the maintainer of libexpat, who \nworked with us directly on incorporating those fixes!\ngh-109858: zipfile is now protected from the “quoted-overlap” zipbomb to address CVE-2024-0450. It now raises BadZipFile when attempting to read an entry that overlaps with another entry or cent…",
          "link": "https://pythoninsider.blogspot.com/2024/03/python-31014-3919-and-3819-is-now.html",
          "publishedOn": "2024-03-20T00:29:00.003Z",
          "wordCount": 2017,
          "title": "Python 3.10.14, 3.9.19, and 3.8.19 is now available",
          "imageUrl": null
        },
        {
          "id": "https://pythoninsider.blogspot.com/2024/03/python-3130-alpha-5-is-now-available.html",
          "author": null,
          "description": "Python 3.13.0 alpha 5 is now available:\n\n\n  \nhttps://www.python.org/downloads/release/python-3130a5/\n\n\n\n\nThis is an early developer preview of Python 3.13\nMajor new features of the 3.13 series, compared to 3.12\nPython 3.13 is still in development. This release, 3.13.0a5, is the fifth of six planned alpha releases.\nAlpha releases are intended to make it easier to test the current \nstate of new features and bug fixes and to test the release process.\nDuring the alpha phase, features may be added up until the start of \nthe beta phase (2024-05-07) and, if necessary, may be modified or \ndeleted up until the release candidate phase (2024-07-30). Please keep \nin mind that this is a preview release and its use is not recommended for production environments.\nMany new features for Python 3.13 are sti…",
          "link": "https://pythoninsider.blogspot.com/2024/03/python-3130-alpha-5-is-now-available.html",
          "publishedOn": "2024-03-13T00:01:00.000Z",
          "wordCount": null,
          "title": "Python 3.13.0 alpha 5 is now available",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "from pvs-studio.com",
      "feedUrl": "http://feeds.feedburner.com/viva64-blog-en",
      "siteUrl": "https://pvs-studio.com",
      "articles": [
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1112/",
          "author": null,
          "description": "How often do you see the sizeof(array)/sizeof(array[0]) statement used to get the size of an array? I really hope it's not too often, because it's 2024 already. In this note, we'll talk about the...",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1112/",
          "publishedOn": "2024-04-04T21:00:00.000Z",
          "wordCount": 6278,
          "title": "How not to check array size in C++",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/1112_wrong_array_size_check/image1_thm_intoblank_1200x630.png?ver=04-05-2024-11-25-04"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/1111/",
          "author": null,
          "description": "Each of us encounters game bugs, and some games have more of them than others. Many games suffer from bugs caused by errors in code. Today, we'll see how static analysis can help easily detect errors...",
          "link": "https://pvs-studio.com/en/blog/posts/csharp/1111/",
          "publishedOn": "2024-04-02T21:00:00.000Z",
          "wordCount": null,
          "title": "Simple & quick search for bugs in Unity games (for C# developers)",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/1110/",
          "author": null,
          "description": "The PVS-Studio analyzer's been supporting the analysis of the Unreal Engine projects for a long time. Since the last post on the topic, we've hammered away at this mode. That's why we'd like to...",
          "link": "https://pvs-studio.com/en/blog/posts/1110/",
          "publishedOn": "2024-03-26T21:00:00.000Z",
          "wordCount": null,
          "title": "Setting up static analysis for Unreal Engine project",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/1109/",
          "author": null,
          "description": "The nopCommerce project is a free open-source platform on ASP.NET Core to create online stores. Today we'll find out what ambiguities lurk in its code.",
          "link": "https://pvs-studio.com/en/blog/posts/csharp/1109/",
          "publishedOn": "2024-03-20T21:00:00.000Z",
          "wordCount": null,
          "title": "Invincible null: digging into nopCommerce source code",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/1108/",
          "author": null,
          "description": "Many psychologists recommend cultivating acceptance. That is, accepting one's mistakes, for example. Some game developers have taken this quite seriously. They decided, \"Why not?\" and made errors...",
          "link": "https://pvs-studio.com/en/blog/posts/1108/",
          "publishedOn": "2024-03-14T21:00:00.000Z",
          "wordCount": null,
          "title": "Don't fix anything — cultivate acceptance instead: bugs in games that have become features",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Future",
      "feedUrl": "https://future.a16z.com/feed/",
      "siteUrl": "https://future.com/",
      "articles": []
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/feeds/posts/default",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": []
    },
    {
      "title": "Two Cents",
      "feedUrl": "https://hur.substack.com/feed",
      "siteUrl": "https://twocents.hur.xyz",
      "articles": []
    },
    {
      "title": "Interrupt",
      "feedUrl": "https://interrupt.memfault.com/feed.xml",
      "siteUrl": "https://interrupt.memfault.com/",
      "articles": [
        {
          "id": "https://interrupt.memfault.com/blog/march-2024-roundup",
          "author": null,
          "description": "Here are the articles, videos, and tools that we’ve been excited about this\nMarch.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/march-2024-roundup",
          "publishedOn": "2024-04-04T00:00:00.000Z",
          "wordCount": null,
          "title": "What we've been reading in March (2024)",
          "imageUrl": null
        },
        {
          "id": "https://interrupt.memfault.com/blog/diving-into-jtag-part-4",
          "author": null,
          "description": "In the previous article of this series, we briefly touched on how .bsd files\nwritten in Boundary Scan Description Language (BSDL) describe the structure of\nthe boundary scan chain and the instruction set. In this article, we will\nexamine this language’s syntax more closely before seeing how .bsd files are leveraged\nin JTAG testing in the next article.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/diving-into-jtag-part-4",
          "publishedOn": "2024-03-29T00:00:00.000Z",
          "wordCount": null,
          "title": "Diving into JTAG — BSDL (Part 4)",
          "imageUrl": null
        },
        {
          "id": "https://interrupt.memfault.com/blog/diving-into-jtag-part-3",
          "author": null,
          "description": "In the third installment of this JTAG deep dive series, we will talk in-depth\nabout JTAG Boundary-Scan, a method used to test interconnects on PCBs and\ninternal IC sub-blocks. It is defined in the IEEE 1149.1 standard. I recommend\nreading Part 1 &\nPart 2 of the\nseries to get a good background on debugging with JTAG before jumping into this\none!\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/diving-into-jtag-part-3",
          "publishedOn": "2024-03-22T00:00:00.000Z",
          "wordCount": null,
          "title": "Diving into JTAG — Debugging (Part 3)",
          "imageUrl": null
        },
        {
          "id": "https://interrupt.memfault.com/blog/elf-format-differences",
          "author": null,
          "description": "The ELF object file format is one of the most commonly used today. Most build\nsystems provide an output to this format, and ELF is commonly used to output\ncoredumps. The format varies in subtle ways for 32-bit and 64-bit targets\nthough, which can present problems for tools supporting both. This post will\nhighlight the main differences and is intended as a quick reference for these\ndifferences.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/elf-format-differences",
          "publishedOn": "2024-03-13T00:00:00.000Z",
          "wordCount": null,
          "title": "Differences Between ELF-32 and ELF-64",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Jay Carlson",
      "feedUrl": "https://jaycarlson.net/feed",
      "siteUrl": "https://jaycarlson.net",
      "articles": []
    },
    {
      "title": "만화로 나누는 자유/오픈소스 소프트웨어 이야기",
      "feedUrl": "https://joone.net/feed/",
      "siteUrl": "https://joone.net",
      "articles": []
    },
    {
      "title": "Kimchi hill",
      "feedUrl": "https://kimchihill.com/feed/",
      "siteUrl": "https://kimchihill.com",
      "articles": []
    },
    {
      "title": "Kwang Yul Seo",
      "feedUrl": "https://kwangyulseo.com/feed/",
      "siteUrl": "https://kwangyulseo.com",
      "articles": []
    },
    {
      "title": "LimitedResults",
      "feedUrl": "https://limitedresults.com/feed/",
      "siteUrl": "https://limitedresults.com/",
      "articles": []
    },
    {
      "title": "LWN.net",
      "feedUrl": "https://lwn.net/headlines/rss",
      "siteUrl": "https://lwn.net",
      "articles": [
        {
          "id": "https://lwn.net/Articles/969210/",
          "author": "corbet",
          "description": "The mainline kernel has just received a set of commits mitigating the\nlatest x86 hardware vulnerability, known as \"branch history injection\".\nFrom this commit:\n\n\n\tBranch History Injection (BHI) attacks may allow a malicious\n\tapplication to influence indirect branch prediction in kernel by\n\tpoisoning the branch history. eIBRS isolates indirect branch\n\ttargets in ring0.  The BHB can still influence the choice of\n\tindirect branch predictor entry, and although branch predictor\n\tentries are isolated between modes when eIBRS is enabled, the BHB\n\titself is not isolated between modes.\n\n\nSee this commit for\ndocumentation on the command-line parameter that controls this mitigation.\nThere are stable kernel releases (6.8.5,\n6.6.26,\n6.1.85,\nand 5.15.154)\nin the works that also contain the mitigations.",
          "link": "https://lwn.net/Articles/969210/",
          "publishedOn": "2024-04-09T19:22:50.000Z",
          "wordCount": null,
          "title": "The \"branch history injection\" hardware vulnerability",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/969031/",
          "author": "corbet",
          "description": "On February 20, Linaro held the initial\nget-together for what is intended to be a regular Linux Kernel Forum for\nthe Arm-focused kernel community. This gathering aims to convene\napproximately a few weeks prior to the merge window opening and prior to\nthe release of the current kernel version under development.  Topics\ncovered in the first gathering include preparing 64-bit Arm kernels for\nlow-end embedded systems, memory errors and Compute Express\nLink (CXL), devlink objectives, and scheduler integration.",
          "link": "https://lwn.net/Articles/969031/",
          "publishedOn": "2024-04-09T14:50:28.000Z",
          "wordCount": null,
          "title": "[$] The first Linaro Forum for Arm Linux kernel topics",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/969172/",
          "author": "corbet",
          "description": "Version 3.3.0 of the OpenSSL SSL/TLS implementation has been released.\nChanges include a number of additions to its QUIC protocol support, some\nyear-2038 improvements for 32-bit systems, and a lot of cryptographic\nfeatures with descriptions like \"Added a new EVP_DigestSqueeze()\nAPI. This allows SHAKE to squeeze multiple times with different output\nsizes.\"  See the release\nnotes for details.",
          "link": "https://lwn.net/Articles/969172/",
          "publishedOn": "2024-04-09T14:18:38.000Z",
          "wordCount": null,
          "title": "OpenSSL 3.3.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967016/",
          "author": "daroc",
          "description": "There are many mechanisms for deferred work in the Linux kernel. One of them,\n\nworkqueues, has seen increasing use as part of\nthe move away from software interrupts. Alison Chaiken gave a talk\nat SCALE\nabout how they compare to software interrupts, the new challenges they pose for\nsystem administrators, and what tools are available to\nkernel developers wishing to diagnose problems with workqueues as they become\nincreasingly prevalent.",
          "link": "https://lwn.net/Articles/967016/",
          "publishedOn": "2024-04-09T13:51:46.000Z",
          "wordCount": null,
          "title": "[$] Diagnosing workqueues",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/969141/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (expat), Oracle (less and nodejs:20), Slackware (libarchive), SUSE (kubernetes1.23, nghttp2, qt6-base, and util-linux), and Ubuntu (python-django).",
          "link": "https://lwn.net/Articles/969141/",
          "publishedOn": "2024-04-09T13:25:51.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/969046/",
          "author": "jzb",
          "description": "Version 4.2.0 of the Rivendell\nradio automation system has been released. Changes include a new data\nfeed for 'next' data objects, improvements to its podcast system,\nnumerous bug fixes, and more.",
          "link": "https://lwn.net/Articles/969046/",
          "publishedOn": "2024-04-08T20:02:12.000Z",
          "wordCount": null,
          "title": "Rivendell v4.2.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/969027/",
          "author": "corbet",
          "description": "The Google Open Source Blog is carrying an\nannouncement for a new JPEG library called \"Jpegli\".  There are a\nnumber of advantages claimed, including:\n\n\n\tJpegli can be encoded with 10+ bits per component. Traditional JPEG\n\tcoding solutions offer only 8 bit per component dynamics causing\n\tvisible banding artifacts in slow gradients. Jpegli's 10+ bits\n\tcoding happens in the original 8-bit formalism and the resulting\n\timages are fully interoperable with 8-bit viewers. 10+ bit dynamics\n\tare available as an API extension and application code changes are\n\tneeded to benefit from it.\n\n\nThe library is BSD-licensed.",
          "link": "https://lwn.net/Articles/969027/",
          "publishedOn": "2024-04-08T15:25:52.000Z",
          "wordCount": null,
          "title": "Introducing Jpegli: A New JPEG Coding Library (Google Open Source Blog)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968300/",
          "author": "corbet",
          "description": "Sometimes the smallest patches create the biggest discussions.  A case in\npoint would be the process by which the PostgreSQL community — not a group\nnormally prone to extended, strongly worded megathreads — resolved the question of\nwhether to merge a brief patch adding a new configuration parameter. \nSometimes, a proposal that looks like a security patch is not, in\nfact, intended to be a security patch, but getting that point across can be\ndifficult.",
          "link": "https://lwn.net/Articles/968300/",
          "publishedOn": "2024-04-08T15:18:48.000Z",
          "wordCount": null,
          "title": "[$] The PostgreSQL community debates ALTER SYSTEM",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/969003/",
          "author": "jzb",
          "description": "Version 2.4.0 of the GNU Stow symbolic-link manager has been released.\nThis marks the first release for\nGNU Stow since 2019. Maintainer\nAdam Spires wrote:\nSpires notes that this release \"makes considerable efforts to make the \ninternals more understandable and easy to maintain\", and has put out a\ncall for a co-maintainer.",
          "link": "https://lwn.net/Articles/969003/",
          "publishedOn": "2024-04-08T15:06:25.000Z",
          "wordCount": null,
          "title": "GNU Stow 2.4.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968999/",
          "author": "jzb",
          "description": "Security updates have been issued by Debian (jetty9, libcaca, libgd2, tomcat9, and util-linux), Fedora (chromium, micropython, and upx), Mageia (chromium-browser-stable, dav1d, libreswan, libvirt, nodejs, texlive-20220321, and util-linux), Red Hat (less, nodejs:20, and varnish), Slackware (tigervnc), and SUSE (buildah, c-ares, cdi-apiserver-container, cdi-cloner-container, cdi- controller-container, cdi-importer-container, cdi-operator-container, cdi- uploadproxy-container, cdi-uploadserver-container, cont, curl, expat, go1.21, go1.22, guava, helm, indent, krb5, kubevirt, virt-api-container, virt-controller-container, virt-exportproxy-container, virt-exportserver-container, virt-handler-container, virt-launcher-container, virt-libguestfs-t, libcares2, libvirt, ncurses, nghttp2, podman, postfix, python-Django, python-Pillow, python310, qemu, rubygem-rack, thunderbird, ucode-intel, and xen).",
          "link": "https://lwn.net/Articles/968999/",
          "publishedOn": "2024-04-08T14:12:14.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968937/",
          "author": "corbet",
          "description": "The 6.9-rc3 kernel prepatch is out for\ntesting.\n\n\n\tOk, so this rc3 looks a bit different than the usual ones, because\n\tthere's a large series to bcachefs to do filesystem repair after\n\tcorruption. Not normally something we'd see in an rc kernel, but\n\they, if you had a corrupted bcachefs filesystem you'd probably want\n\tthis, and if you thought bcachefs was stable already, I have a\n\tbridge to sell you. Special deal only for you, real cheap.",
          "link": "https://lwn.net/Articles/968937/",
          "publishedOn": "2024-04-08T13:43:37.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.9-rc3",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968732/",
          "author": "jzb",
          "description": "Wayne Davison has announced\nthe release of rsync version 3.3.0, which\ncontains a number of bug fixes and minor enhancements. Davison has\nalso announced a change in maintainers and a move to a new GitHub\nproject:\nThe new GitHub organization is here.",
          "link": "https://lwn.net/Articles/968732/",
          "publishedOn": "2024-04-06T21:24:08.000Z",
          "wordCount": 1521,
          "title": "Tridge returns to rsync",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967981/",
          "author": "jzb",
          "description": "The nominations have closed and campaigning is underway to see who\nwill be the next Debian\nProject Leader (DPL). This year, two\ncandidates are campaigning for the position Jonathan Carter has\nheld for four eventful years: Sruthi Chandran and\nAndreas Tille. Topics that have emerged so far include how the\nprospective DPLs would spend project money, their opinions on handling\ncontroversial topics, and project diversity.",
          "link": "https://lwn.net/Articles/967981/",
          "publishedOn": "2024-04-05T18:11:45.000Z",
          "wordCount": null,
          "title": "[$] A look at the 2024 Debian Project Leader election",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968584/",
          "author": "corbet",
          "description": "OpenBSD 7.5 has been released.  The list of changes and improvements is, as\nusual, long; it includes the pinsyscalls() functionality covered\nhere in January.",
          "link": "https://lwn.net/Articles/968584/",
          "publishedOn": "2024-04-05T14:44:18.000Z",
          "wordCount": null,
          "title": "OpenBSD 7.5 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968566/",
          "author": "daroc",
          "description": "The Eclipse Foundation, the organization\nbehind the Eclipse IDE and many other software projects, announced\na collaboration between several different open-source-software foundations to\ncreate a specification describing secure software development best practices.\nThis work is motivated by the European Union's Cyber Resilience Act (CRA).\n\n\n\nThe leading open source communities and foundations have for\n\tyears developed and practised secure software development\n\tprocesses. These are processes that have often defined or set\n\tindustry best practices around things such as coordinated\n\tdisclosure, peer review, and release processes. These processes\n\thave been documented by each of these communities, albeit\n\tsometimes using different terminology and approaches. We\n\thypothesise that the cybersecurity process technical\n\tdocumentation that already exists amongst the open source\n\tcommunities can provide a useful starting point for developing\n\tthe cybersecurity processes required for regulatory compliance.\n\n\n\n(Thanks to Martin Michlmayr.)",
          "link": "https://lwn.net/Articles/968566/",
          "publishedOn": "2024-04-05T14:34:21.000Z",
          "wordCount": null,
          "title": "Eclipse Foundation announces collaboration for CRA compliance",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968565/",
          "author": "corbet",
          "description": "Version 7.0 of the\nFFmpeg audio/video toolkit is out.  \"The most noteworthy changes for\nmost users are a native VVC decoder (currently experimental, until more\nfuzzing is done), IAMF support, or a multi-threaded ffmpeg CLI tool\".\nThere's also the usual list of new formats and codecs, and a few deprecated\nfeatures have been removed.",
          "link": "https://lwn.net/Articles/968565/",
          "publishedOn": "2024-04-05T13:47:12.000Z",
          "wordCount": null,
          "title": "FFmpeg 7.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968561/",
          "author": "daroc",
          "description": "Security updates have been issued by Debian (cockpit), Mageia (python-pygments), Red Hat (nodejs), Slackware (httpd and nghttp2), SUSE (avahi, gradle, gradle-bootstrap, and squid), and Ubuntu (xorg-server, xwayland).",
          "link": "https://lwn.net/Articles/968561/",
          "publishedOn": "2024-04-05T13:35:04.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968468/",
          "author": "jake",
          "description": "The 6.8.4 and 6.6.25 stable kernels have been released.\nThey both contain 11 reversions of workqueue patches.",
          "link": "https://lwn.net/Articles/968468/",
          "publishedOn": "2024-04-04T19:13:44.000Z",
          "wordCount": null,
          "title": "Stable kernels 6.8.4 and 6.6.25",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968429/",
          "author": "daroc",
          "description": "V8, the JavaScript engine used in Chrome,\nannounced\nthat its memory sandbox is no longer experimental.\n\n\n\nChrome 123 could therefore be considered to be a sort of \"beta\"\nrelease for the sandbox. This blog post uses this opportunity to\ndiscuss the motivation behind the sandbox, show how it prevents\nmemory corruption in V8 from spreading within the host process, and\nultimately explain why it is a necessary step towards memory safety.",
          "link": "https://lwn.net/Articles/968429/",
          "publishedOn": "2024-04-04T17:46:56.000Z",
          "wordCount": null,
          "title": "V8 incorporates new sandbox",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967001/",
          "author": "jzb",
          "description": "Among the numerous approaches to funding the development and advancement of\nopen-source software, corporate sponsorship in the form of donations to umbrella\norganizations is perhaps the most visible. At SCALE21x in Pasadena, California, Duane O'Brien\npresented\na slice of his recent research into the landscape of such sponsorship arrangements,\nwith an overview of the identifiable trends of the past ten years and some initial\ninsights he hopes are valuable for sponsors and community members alike.",
          "link": "https://lwn.net/Articles/967001/",
          "publishedOn": "2024-04-04T17:38:16.000Z",
          "wordCount": null,
          "title": "[$] A focus on FOSS funding",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968421/",
          "author": "corbet",
          "description": "Version\n6.0 LTS of the Incus container management system has been released.\n\"This is a major milestone for Incus as it marks our first release with\nextended support, suitable for use in production environments where monthly\nfeature releases aren't suitable.\"  Changes include swap limits for\ncontainers, a new shell completion mechanism, support for the creation of\nVLAN interfaces, improved live migration, and more.",
          "link": "https://lwn.net/Articles/968421/",
          "publishedOn": "2024-04-04T15:38:14.000Z",
          "wordCount": null,
          "title": "Incus 6.0 LTS released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968395/",
          "author": "jake",
          "description": "Security updates have been issued by CentOS (firefox and thunderbird), Debian (chromium and gtkwave), Fedora (micropython), Slackware (xorg), SUSE (util-linux and xen), and Ubuntu (firefox).",
          "link": "https://lwn.net/Articles/968395/",
          "publishedOn": "2024-04-04T14:21:52.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966925/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for April 4, 2024 is available.",
          "link": "https://lwn.net/Articles/966925/",
          "publishedOn": "2024-04-04T00:01:07.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for April 4, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968299/",
          "author": "jzb",
          "description": "AlmaLinux has announced\nupdated kernels for AlmaLinux 8 and 9 to address CVE-2024-1086, a\nuse-after-free vulnerability in the kernel that could be exploited to\ngain local privilege escalation. This is notable because the fix\nmarks a divergence between AlmaLinux and Red Hat Enterprise Linux (RHEL):\nIn January of this year, a kernel flaw was disclosed and named CVE-2024-1086.\nThis flaw is trivially exploitable on most RHEL-equivalent\nsystems. There are many proof-of-concept posts available now,\nincluding one from our Infrastructure team lead, Jonathan Wright (Dealing\nwith CVE-2024-1086). In multi-user scenarios, this flaw is\nespecially problematic.\n\n\nThough this was flagged as something to be fixed in Red Hat\nEnterprise Linux, Red Hat has only rated this as a moderate\nimpact.\nThe AlmaLinux project would also like to note that it is not\nimpacted by the XZ backdoor. \"Because enterprise Linux takes a bit\nlonger to adopt those updates (sometimes to the chagrin of our users),\nthe version of XZ that had the back door inserted hadn't made it\nfurther than Fedora in our ecosystem.\"",
          "link": "https://lwn.net/Articles/968299/",
          "publishedOn": "2024-04-03T18:39:45.000Z",
          "wordCount": null,
          "title": "AlmaLinux OS - CVE-2024-1086 and XZ (AlmaLinux blog)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968297/",
          "author": "corbet",
          "description": "David Malcolm writes\nabout some static-analyzer features that are coming in the GCC 14\nrelease.\n\n\n\tSolving the halting problem?\n\n\tObviously I'm kidding with the title here, but for GCC 14 I've\n\timplemented a new warning: -Wanalyzer-infinite-loop that's able to\n\tdetect some simple cases of infinite loops.\n\n\nSee also: this report from the 2023 GNU\nTools Cauldron.",
          "link": "https://lwn.net/Articles/968297/",
          "publishedOn": "2024-04-03T16:44:48.000Z",
          "wordCount": null,
          "title": "Malcolm: Improvements to static analysis in the GCC 14 compiler",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968250/",
          "author": "jzb",
          "description": "The 6.8.3, 6.7.12, 6.6.24, and 6.1.84 stable kernel updates have been\nreleased. Each contains an important set of fixes. Note that 6.7.12 is\nthe final release for the 6.7.y series, and that branch is now\nend-of-life. Users should move to the 6.8.y branch.",
          "link": "https://lwn.net/Articles/968250/",
          "publishedOn": "2024-04-03T14:53:12.000Z",
          "wordCount": null,
          "title": "Four stable kernel updates",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967049/",
          "author": "corbet",
          "description": "The Rust programming language differs from C in many ways; those\ndifferences tend to be what users admire in the language.  But those\ndifferences can also lead to an impedance mismatch when Rust code is\nintegrated into a C-dominated system, and it can be even worse in the\nkernel, which is not a typical C program.  Memory models are a case in\npoint.  A programming language's view of memory is sufficiently fundamental\nand arcane that many developers never have to learn much about it.  It is\nhard to maintain that sort of blissful ignorance while working in the\nkernel, though, so a recent discussion of how to choose a memory model for\nkernel code in Rust is of interest.",
          "link": "https://lwn.net/Articles/967049/",
          "publishedOn": "2024-04-03T14:36:13.000Z",
          "wordCount": null,
          "title": "[$] A memory model for Rust code in the kernel",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968220/",
          "author": "corbet",
          "description": "The SUSE Security Team Blog is carrying a\ndetailed article on SUSE's review of the KDE6 release.\n\n\n\tThe SUSE security team restricts the installation of system wide\n\tD-Bus services and Polkit policies in openSUSE distributions and\n\tderived SUSE products. Any package that ships these features needs\n\tto be reviewed by us first, before it can be added to production\n\trepositories.\n\n\tIn November, openSUSE KDE packagers approached us with a long list\n\tof KDE components for an upcoming KDE6 major release. The packages\n\tneeded adjusted D-Bus and Polkit whitelistings due to renamed\n\tinterfaces or other breaking changes. Looking into this many\n\tcomponents at once was a unique experience that also led to new\n\tinsights, which will be discussed in this article.",
          "link": "https://lwn.net/Articles/968220/",
          "publishedOn": "2024-04-03T13:45:43.000Z",
          "wordCount": null,
          "title": "KDE6 release: D-Bus and Polkit Galore (SUSE security team blog)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968218/",
          "author": "jzb",
          "description": "Security updates have been issued by Debian (py7zr), Fedora (biosig4c++ and podman), Oracle (kernel, kernel-container, and ruby:3.1), Red Hat (.NET 7.0, bind9.16, curl, expat, grafana, grafana-pcp, kernel, kernel-rt, kpatch-patch, less, opencryptoki, and postgresql-jdbc), and Ubuntu (cacti).",
          "link": "https://lwn.net/Articles/968218/",
          "publishedOn": "2024-04-03T13:41:17.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/968183/",
          "author": "corbet",
          "description": "The first stable release of Redict, a fork of the Redis in-memory database\nunder a copyleft license, has been announced.\n\n\n\tYou may be wondering why Redict would be of interest to you,\n\tparticularly when compared with Valkey,\n\tanother Redis fork that was announced on Thursday.\n\n\tIn technical terms, we are focusing on stability and long-term\n\tmaintenance, and on achieving excellence within our current\n\tscope. We believe that Redict is near feature-complete and that it\n\tis more valuable to our users if we take a conservative stance to\n\tinnovation and focus on long-term reliability instead. This is in\n\tpart a choice we've made to distinguish ourselves from Valkey,\n\twhose commercial interests are able to invest more resources into\n\tdeveloping more radical innovations, but also an acknowledgement of\n\ta cultural difference between our projects, in that the folks\n\tbehind Redict place greater emphasis on software with a finite\n\tscope and ambitions towards long-term stability rather than\n\tfocusing on long-term growth in scope and complexity.",
          "link": "https://lwn.net/Articles/968183/",
          "publishedOn": "2024-04-03T13:24:22.000Z",
          "wordCount": null,
          "title": "Redict 7.3.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967192/",
          "author": "daroc",
          "description": "Versions 5.6.0 and 5.6.1 of the\nXZ\ncompression utility and library\nwere shipped with a backdoor that targeted\nOpenSSH.\nAndres Freund\n\ndiscovered the backdoor by\nnoticing that failed SSH logins were taking a lot of\nCPU time while doing some\nmicro-benchmarking, and tracking down the backdoor from there. It was introduced\nby XZ co-maintainer \"Jia Tan\" — a probable alias for person or persons unknown.\nThe backdoor is a sophisticated attack with multiple parts, from the build\nsystem, to link time, to run time.",
          "link": "https://lwn.net/Articles/967192/",
          "publishedOn": "2024-04-02T20:41:41.000Z",
          "wordCount": null,
          "title": "[$] How the XZ backdoor works",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967866/",
          "author": "corbet",
          "description": "A common theme in early-days anti-Linux FUD was that, since anybody can\ncontribute to the code, it cannot be trusted.  Over two decades later, one\nrarely hears that line anymore; experience has shown that free-software\ncommunities are not prone to shipping overtly hostile code.  But, as the backdooring of XZ has reminded us, the\nembedding of malicious code is, unfortunately, not limited to the\nproprietary realm.  Our community will be busy analyzing this incident for\nsome time to come, but clear conclusions may be hard to come by.",
          "link": "https://lwn.net/Articles/967866/",
          "publishedOn": "2024-04-02T16:22:13.000Z",
          "wordCount": null,
          "title": "[$] Free software's not-so-eXZellent adventure",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967959/",
          "author": "corbet",
          "description": "Security updates have been issued by Fedora (kernel and webkitgtk), Mageia (unixODBC and w3m), and SUSE (libvirt, netty, netty-tcnative, and perl-DBD-SQLite).",
          "link": "https://lwn.net/Articles/967959/",
          "publishedOn": "2024-04-02T13:41:40.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966618/",
          "author": "daroc",
          "description": "At SCALE\nthis year Dan Schatzberg and Tejun Heo,\nboth from Meta, gave back-to-back talks about some\nof the performance-engineering work that they do there. Schatzberg presented on\nthe extensible BPF scheduler, which has been\ndiscussed extensively on the kernel mailing list.\nHeo presented on IOCost — a control group (cgroup) I/O controller\noptimized for solid-state disks (SSDs) — and the benchmark suite that is necessary to\nmake it work well on different models of disk.",
          "link": "https://lwn.net/Articles/966618/",
          "publishedOn": "2024-04-01T17:57:19.000Z",
          "wordCount": null,
          "title": "[$] Improving performance with SCHED_EXT and IOCost",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967856/",
          "author": "corbet",
          "description": "Version 10.0 of the NetBSD system has been released.\n\n\n\tThe netbsd-10 release branch is more than a year old now, so it is\n\thigh time the 10.0 release makes it to the front stage. This\n\tmatches the long time it took for the development branch to get\n\tready for branching, a lot of development went into this new\n\trelease.\n\n\tThis also caused the release announcement to be one of the longest\n\twe ever did.\n\n\nAs might be imagined, there are a lot of changes; see the\nabove-mentioned release announcement for the details.",
          "link": "https://lwn.net/Articles/967856/",
          "publishedOn": "2024-04-01T14:28:56.000Z",
          "wordCount": null,
          "title": "NetBSD 10.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967851/",
          "author": "jake",
          "description": "Security updates have been issued by Arch Linux (xz), Debian (libvirt, mediawiki, util-linux, and xz-utils), Fedora (apache-commons-configuration, cockpit, ghc-base64, ghc-hakyll, ghc-isocline, ghc-toml-parser, gitit, gnutls, pandoc, pandoc-cli, patat, podman-tui, prometheus-podman-exporter, seamonkey, suricata, and xen), Gentoo (XZ utils), Mageia (aide & mhash, emacs, microcode, opensc, and squid), Red Hat (ruby:3.1), and SUSE (kanidm and qpid-proton).",
          "link": "https://lwn.net/Articles/967851/",
          "publishedOn": "2024-04-01T14:10:19.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967792/",
          "author": "corbet",
          "description": "The 6.9-rc2 kernel prepatch is out for\ntesting.  \"Neither snow nor rain nor heat nor gloom of night stays kernel rc releases.\n\nNor does Easter.\"",
          "link": "https://lwn.net/Articles/967792/",
          "publishedOn": "2024-04-01T13:30:38.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.9-rc2",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967420/",
          "author": "corbet",
          "description": "I'm on a holiday and only happened to look at my emails and it\n\tseems to be a major mess. \n\n— Lasse Collin\n\n\n\tThe reality that we are struggling with is that the free software\n\tinfrastructure on which much of computing runs is massively and\n\tpainfully underfunded by society as a whole, and is almost entirely\n\tdependent on random people maintaining things in their free time\n\tbecause they find it fun, many of whom are close to burnout.  This\n\tis, in many ways, the true root cause of this entire event.\n\n— Russ Allbery\n\n\n\n\tIncredible work from Andres.  The attackers made a serious\n\tstrategic mistake: they made PostgreSQL slightly slower.\n\n— Thomas\nMunro\n\n\n\n\tThere is no way to discuss this in public without turning a single\n\tmalicious entity into 10 000 malicious entities once the\n\tinformation is widely known.\n\n\tMaking sure the impact and mitigations are known before posting\n\tthis publicly so that everyone knows what to do before the 10 000\n\tmalicious entities start attacking is just common sense.\n\n— Marc\nDeslauriers\n\n\n\n\tAgain the FOSS world has proven to be vigilant and proactive in\n\tfinding bugs and backdoors, IMHO. The level of transparency is\n\tstellar, especially compared to proprietary software\n\tcompanies. What the FOSS world has accomplished in 24 hours after\n\tdetection of the backdoor code in #xz deserves a moment of\n\thumbleness. Instead we have flamewars and armchair experts shouting\n\tthat we must change everything NOW. Which would introduce even more\n\trisks. Progress is made iteratively. Learn, adapt, repeat.\n\n— Jan Wildeboer",
          "link": "https://lwn.net/Articles/967420/",
          "publishedOn": "2024-03-30T14:18:07.000Z",
          "wordCount": null,
          "title": "A few relevant quotes",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967180/",
          "author": "corbet",
          "description": "Andres Freund has posted a\ndetailed investigation into a backdoor that was shipped with versions\n5.6.0 and 5.6.1 of the xz compression utility.  It appears that the\nmalicious code may be aimed at allowing SSH authentication to be bypassed.\n\n\n\tI have not yet analyzed precisely what is being checked for in the\n\tinjected code, to allow unauthorized access. Since this is running\n\tin a pre-authentication context, it seems likely to allow some form\n\tof access or other form of remote code execution.\n\n\nThe affected versions are not yet widely shipped, but checking systems for\nthe bad version would be a good idea.\n\nUpdate: there are advisories out now from\nArch,\nDebian,\nRed\nHat, and\nopenSUSE.\n\nA further\nupdate from openSUSE:\n\n\n\tFor our openSUSE Tumbleweed users where SSH is exposed to the\n\tinternet we recommend installing fresh, as it’s unknown if the\n\tbackdoor has been exploited. Due to the sophisticated nature of the\n\tbackdoor an on-system detection of a breach is likely not\n\tpossible. Also rotation of any credentials that could have been\n\tfetched from the system is highly recommended.",
          "link": "https://lwn.net/Articles/967180/",
          "publishedOn": "2024-03-29T17:33:57.000Z",
          "wordCount": null,
          "title": "A backdoor in xz",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966869/",
          "author": "corbet",
          "description": "Radicle is a new, peer-to-peer,\nMIT/Apache-licensed collaboration platform written in Rust and built on top\nof Git. It adds support for issues and pull requests (which Radicle calls\n\"patches\") on top of core Git, which are stored in the Git repository\nitself. Unlike GitHub, GitLab, and similar forges, Radicle is distributed;\nit doesn't rely on having everyone use the same server. Instead, Radicle\ninstances form a network that synchronizes changes between nodes.",
          "link": "https://lwn.net/Articles/966869/",
          "publishedOn": "2024-03-29T13:40:35.000Z",
          "wordCount": null,
          "title": "[$] Radicle: peer-to-peer collaboration with Git",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967134/",
          "author": "daroc",
          "description": "Security updates have been issued by Debian (chromium), Fedora (apache-commons-configuration, chromium, csmock, ofono, onnx, php-tcpdf, and podman-tui), Mageia (curl), Oracle (libreoffice), Slackware (coreutils, seamonkey, and util), SUSE (minidlna, PackageKit, and podman), and Ubuntu (linux-azure-6.5 and linux-intel-iotg, linux-intel-iotg-5.15).",
          "link": "https://lwn.net/Articles/967134/",
          "publishedOn": "2024-03-29T13:11:27.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/967107/",
          "author": "corbet",
          "description": "Christian Schaller writes\nabout the desktop-oriented work aimed at the upcoming Fedora 40\nrelease.\n\n\n\tAnother major feature landing in Fedora Workstation 40 that Jonas\n\tÅdahl and Ray Strode has spent a lot of effort on is finalizing the\n\tremote desktop support for GNOME on Wayland. So there has been\n\tsupport for remote connections for already logged in sessions\n\talready, but with these updates you can do the login remotely too\n\tand thus the session do not need to be started already on the\n\tremote machine. This work will also enable 3rd party solutions to\n\tdo remote logins on Wayland systems, so while I am not at liberty\n\tto mention names, be on the lookout for more 3rd party Wayland\n\tremoting software becoming available this year.",
          "link": "https://lwn.net/Articles/967107/",
          "publishedOn": "2024-03-29T12:56:12.000Z",
          "wordCount": null,
          "title": "Schaller: Fedora Workstation 40 – what are we working on",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966631/",
          "author": "jzb",
          "description": "On March 21, Redis Ltd. announced that the Redis \"in-memory data store\" project would now be\nreleased under non-free, source-available licenses, starting with Redis 7.4. The\nnews is unwelcome, but not entirely unexpected. What is unusual with this situation is\nthe number of Redis alternatives to choose from; there are at least\nfour options to choose as a replacement for those who wish to stay\nwith free software, including a pre-existing fork called KeyDB and the Linux Foundation's newly-announced Valkey project. The question now is which one(s)\nLinux distributions, users, and providers will choose to take its place.",
          "link": "https://lwn.net/Articles/966631/",
          "publishedOn": "2024-03-28T20:31:35.000Z",
          "wordCount": null,
          "title": "[$] The race to replace Redis",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965508/",
          "author": "daroc",
          "description": "Keith Fiske gave a talk\n(with \nslides) about the state of partitioning — splitting a large\ntable into smaller tables for performance reasons — in\nPostgreSQL at\nSCALE\nthis year. He spoke about the existing support for partitioning, what work still\nneeds to be done, and what place existing partitioning tools, like his own\n\npg_partman, still have as PostgreSQL gains more built-in features.",
          "link": "https://lwn.net/Articles/965508/",
          "publishedOn": "2024-03-28T15:34:47.000Z",
          "wordCount": null,
          "title": "[$] Declarative partitioning in PostgreSQL",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966996/",
          "author": "corbet",
          "description": "Version 4.20.0 of the Samba Windows interoperability suite has been\nreleased.  Changes include better support for group-managed service\naccounts, an experimental Windows search protocol client, support for\nconditional access control entries, and more.",
          "link": "https://lwn.net/Articles/966996/",
          "publishedOn": "2024-03-28T14:19:35.000Z",
          "wordCount": null,
          "title": "Samba 4.20.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966961/",
          "author": "jake",
          "description": "Security updates have been issued by Fedora (perl-Data-UUID, python-pygments, and thunderbird), Mageia (clojure, grub2, kernel,kmod-xtables-addons,kmod-virtualbox, kernel-linus, nss firefox, nss, python3, python, tcpreplay, and thunderbird), Oracle (nodejs:18), Red Hat (.NET 6.0 and dnsmasq), SUSE (avahi and python39), and Ubuntu (curl, linux-intel-iotg, linux-intel-iotg-5.15, unixodbc, and util-linux).",
          "link": "https://lwn.net/Articles/966961/",
          "publishedOn": "2024-03-28T13:54:43.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966118/",
          "author": "daroc",
          "description": "The LWN.net Weekly Edition for March 28, 2024 is available.",
          "link": "https://lwn.net/Articles/966118/",
          "publishedOn": "2024-03-28T00:22:04.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for March 28, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966868/",
          "author": "corbet",
          "description": "The PostgreSQL community is dealing with the loss of Simon Riggs, who\npassed away on March 26:\n\n\n\tSimon was responsible for many of the enterprise features we find\n\tin PostgreSQL today, including point in time recovery, hot standby,\n\tand synchronous replication. He was the founder of 2ndQuadrant\n\twhich employed many of the PostgreSQL developers, later becoming\n\tpart of EDB where he worked as a Postgres Fellow until his\n\tretirement. He was responsible for the UK PostgreSQL conferences\n\tfor many years until he passed that responsibility to PostgreSQL\n\tEurope last year.",
          "link": "https://lwn.net/Articles/966868/",
          "publishedOn": "2024-03-27T15:51:25.000Z",
          "wordCount": null,
          "title": "The PostgreSQL community mourns Simon Riggs",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965516/",
          "author": "daroc",
          "description": "Jason Nucciarone and Felipe Reyes gave back-to-back talks\nabout high-performance computing (HPC) using Ubuntu at\nSCALE this\nyear. Nucciarone talked about ongoing work packaging\n\nOpen OnDemand — a web-based HPC cluster interface —\nto make high-performance-computing clusters\nmore user friendly. Reyes presented on using\nOpenStack — a cloud-computing platform\n— to pass the performance benefits of one's hardware through\nto virtual machines (VMs) running on a cluster.",
          "link": "https://lwn.net/Articles/965516/",
          "publishedOn": "2024-03-27T15:36:15.000Z",
          "wordCount": null,
          "title": "[$] High-performance computing with Ubuntu",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966835/",
          "author": "jzb",
          "description": "Security updates have been issued by Debian (composer and nodejs), Fedora (w3m), Mageia (tomcat), Oracle (expat, firefox, go-toolset:ol8, grafana, grafana-pcp, nodejs:18, and thunderbird), Red Hat (dnsmasq, expat, kernel, kernel-rt, libreoffice, and squid), and SUSE (firefox, krb5, libvirt, and shadow).",
          "link": "https://lwn.net/Articles/966835/",
          "publishedOn": "2024-03-27T13:18:26.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966755/",
          "author": "jake",
          "description": "Sasha Levin has announced the release of the 6.8.2, 6.7.11,\n6.6.23, 6.1.83, 5.15.153, 5.10.214, 5.4.273, and 4.19.311 stable kernels.  Each contains a long\nlist of important fixes throughout the kernel tree.",
          "link": "https://lwn.net/Articles/966755/",
          "publishedOn": "2024-03-26T22:59:30.000Z",
          "wordCount": null,
          "title": "Eight new stable kernels",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966187/",
          "author": "jzb",
          "description": "The GNOME project announced\nGNOME 46 (code-named \"Kathmandu\") on March 20. The release has quite a few updates and improvements\nacross user applications, developer tools, and under the hood. One\nthing stood out while looking over this release—a major emphasis on\nFlatpaks as the way to acquire and update GNOME software.",
          "link": "https://lwn.net/Articles/966187/",
          "publishedOn": "2024-03-26T16:58:31.000Z",
          "wordCount": null,
          "title": "[$] GNOME 46 puts Flatpaks front and center",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966678/",
          "author": "jake",
          "description": "Security updates have been issued by CentOS (kernel), Debian (firefox-esr), Fedora (webkitgtk), Mageia (curaengine & blender and gnutls), Red Hat (firefox, grafana, grafana-pcp, libreoffice, nodejs:18, and thunderbird), SUSE (glade), and Ubuntu (crmsh, debian-goodies, linux-aws, linux-aws-6.5, linux-aws-hwe, linux-azure, linux-azure-4.15, linux-oracle, linux-azure, linux-azure-5.4, linux-oracle, linux-oracle-5.15, pam, and thunderbird).",
          "link": "https://lwn.net/Articles/966678/",
          "publishedOn": "2024-03-26T14:16:34.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965631/",
          "author": "daroc",
          "description": "The first-ever NixCon\nin North America was co-located with\nSCALE this year. The\nevent drew a mix of experienced\nNix users\nand people new to the project.\nI attended talks that covered using Nix to build Docker images, upcoming changes\nto how NixOS performs early booting, and ideas for making the set of services\nprovided in nixpkgs\nmore useful for self hosting. (LWN covered the relationship between\nNix, NixOS, and nixpkgs in a\nrecent article.)\nNear the end of the\nconference, a collection of Nix contributors gave a \"State of the Union\"\nabout the growth of the project and highlighting areas of concern.",
          "link": "https://lwn.net/Articles/965631/",
          "publishedOn": "2024-03-25T17:35:09.000Z",
          "wordCount": null,
          "title": "[$] Nix at SCALE",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965541/",
          "author": "corbet",
          "description": "The 6.9-rc1\nkernel prepatch was released on March 24, closing the merge window for\nthis development cycle. By that time, 12,435 non-merge changesets had been\nmerged into the mainline, making for a less-busy merge window than the last\ncouple of kernel releases (but similar to the 12,492 seen for 6.5).  Well\nover 7,000 of those changes were merged after the first-half merge-window summary was\nwritten, meaning that the latter part of the merge window brought many more\ninteresting changes.",
          "link": "https://lwn.net/Articles/965541/",
          "publishedOn": "2024-03-25T16:08:21.000Z",
          "wordCount": null,
          "title": "[$] The rest of the 6.9 merge window",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966611/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (cacti, firefox-esr, freeipa, gross, libnet-cidr-lite-perl, python2.7, python3.7, samba, and thunderbird), Fedora (amavis, chromium, clojure, firefox, gnutls, kubernetes, and tcpreplay), Mageia (freeimage, libreswan, nodejs-hawk, and python, python3), Oracle (golang, nodejs, nodejs:16, and postgresql-jdbc), Slackware (emacs and mozilla), SUSE (dav1d, ghostscript, go1.22, indent, kernel, openvswitch, PackageKit, python-uamqp, rubygem-rack-1_4, shadow, ucode-intel, xen, and zziplib), and Ubuntu (firefox, graphviz, libnet-cidr-lite-perl, and qpdf).",
          "link": "https://lwn.net/Articles/966611/",
          "publishedOn": "2024-03-25T15:11:39.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966547/",
          "author": "corbet",
          "description": "Version 29.3 of the\nEmacs editor has been released:\n\n\n\tEmacs 29.3 is an emergency bugfix release; it includes no new\n\tfeatures except a small number of changes intended to resolve\n\tsecurity vulnerabilities uncovered in Emacs 29.2.\n\n\nThose vulnerabilities mostly have to do with executing untrusted Lisp code;\nsee the\nNEWS file for a bit more information.",
          "link": "https://lwn.net/Articles/966547/",
          "publishedOn": "2024-03-25T11:11:13.000Z",
          "wordCount": null,
          "title": "Emacs 29.3 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966525/",
          "author": "jake",
          "description": "The 6.9-rc1 kernel prepatch is out for\ntesting.  Linus Torvalds described some rather large updates to the core\nkernel code that are coming for 6.9:\n\n\nThe timer subsystem had a fairly big rewrite, to have per-cpu timer\nwheels to improve performance of timers, which can be a big deal\nparticularly for networking. The other fairly notable core update is\nto the workqueue subsystem, where one notable addition is for BH\nworkqueue support. That's notable mainly because it means we finally\nhave a way away from tasklets. The tasklet interface has basically\nbeen deprecated for a long while, but we've never really had any good\nalternatives (with threaded interrupt handlers being one suggested\nuse-case, but not realistic in many cases).",
          "link": "https://lwn.net/Articles/966525/",
          "publishedOn": "2024-03-24T23:10:05.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.9-rc1",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966415/",
          "author": "daroc",
          "description": "Security updates have been issued by Debian (firefox-esr, pillow, and thunderbird), Fedora (apptainer, chromium, ovn, and webkitgtk), Mageia (apache-mod_auth_openidc, ffmpeg, fontforge, libuv, and nodejs-tough-cookie), Oracle (kernel, libreoffice, postgresql-jdbc, ruby:3.1, squid, and squid:4), Red Hat (go-toolset:rhel8 and libreoffice), SUSE (firefox, jbcrypt, trilead-ssh2, jsch-agent-proxy, kernel, tiff, and zziplib), and Ubuntu (linux-aws and openssl1.0).",
          "link": "https://lwn.net/Articles/966415/",
          "publishedOn": "2024-03-22T12:50:22.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965837/",
          "author": "corbet",
          "description": "While a programming error in the kernel may be subject to direct\nexploitation, usually a more roundabout approach is required to take\nadvantage of a security bug.  One popular approach for those wishing to\ntake advantage of vulnerabilities  is heap spraying, and\nit has often been employed to compromise the kernel.  In the future,\nthough, heap-spraying attacks may be a bit harder to pull off, thanks to the\n\"dedicated bucket allocator\" proposed by Kees Cook.",
          "link": "https://lwn.net/Articles/965837/",
          "publishedOn": "2024-03-21T15:07:29.000Z",
          "wordCount": null,
          "title": "[$] Hardening the kernel against heap-spraying attacks",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966246/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (pdns-recursor and php-dompdf-svg-lib), Fedora (grub2, libreswan, rubygem-yard, and thunderbird), Mageia (libtiff and python-scipy), Red Hat (golang, nodejs, and nodejs:16), Slackware (python3), and Ubuntu (linux, linux-azure, linux-azure-5.15, linux-azure-fde,\n linux-azure-fde-5.15, linux-gcp, linux-gcp-5.15, linux-gke, linux-gkeop,\n linux-gkeop-5.15, linux-hwe-5.15, linux-ibm, linux-ibm-5.15, linux-kvm,\n linux-lowlatency, linux-lowlatency-hwe-5.15, linux-nvidia, linux, linux-azure, linux-gcp, linux-gcp-6.5, linux-hwe-6.5,\n linux-lowlatency, linux-lowlatency-hwe-6.5, linux-oem-6.5, linux-oracle,\n linux-oracle-6.5, linux-raspi, linux-starfive, linux-starfive-6.5, linux-aws, linux-aws-5.15, linux-aws, linux-aws-5.4, linux-gcp-5.4, linux-raspi, linux-raspi-5.4,\n linux-xilinx-zynqmp, linux-gcp, linux-gcp-4.15, linux-kvm, linux-laptop, linux-oem-6.1, and linux-raspi).",
          "link": "https://lwn.net/Articles/966246/",
          "publishedOn": "2024-03-21T14:57:19.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966205/",
          "author": "corbet",
          "description": "Version\n1.77.0 of the Rust language has been released.  Changes include support\nfor NUL-terminated C-string literals, the ability for async\nfunctions to call themselves recursively, the stabilization of the\noffset_of!() macro, and more.",
          "link": "https://lwn.net/Articles/966205/",
          "publishedOn": "2024-03-21T13:48:04.000Z",
          "wordCount": null,
          "title": "Rust 1.77.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966181/",
          "author": "corbet",
          "description": "Verson 5.39.9 of the Perl language has been released.  Changes this time\ninclude a new \"medium-precedence\" logical exclusive-or operator, a number\nof updated modules, and more; see this\npage for details.",
          "link": "https://lwn.net/Articles/966181/",
          "publishedOn": "2024-03-21T11:16:57.000Z",
          "wordCount": null,
          "title": "Perl 5.39.9 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966133/",
          "author": "corbet",
          "description": "The Redis in-memory database system has had\nits license changed to either the Redis Source Available\nLicense or the Server Side\nPublic License (covered here in 2018);\nneither license qualifies as free software.\n\n\n\tUnder the new license, cloud service providers hosting Redis\n\tofferings will no longer be permitted to use the source code of\n\tRedis free of charge. For example, cloud service providers will be\n\table to deliver Redis 7.4 only after agreeing to licensing terms\n\twith Redis, the maintainers of the Redis code.\n\n\nDistributors like Fedora are already looking\nat removing Redis as a consequence.  (Thanks to  Emmanuel Seyman).",
          "link": "https://lwn.net/Articles/966133/",
          "publishedOn": "2024-03-21T07:33:03.000Z",
          "wordCount": null,
          "title": "Redis is no longer free software",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966129/",
          "author": "corbet",
          "description": "Danilo Krummrich has announced the\nexistence of the \"Nova\" project within Red Hat.\n\n\n\tWe just started to work on Nova, a Rust-based GSP-only driver for\n\tNvidia GPUs. Nova, in the long term, is intended to serve as the\n\tsuccessor of Nouveau for GSP-firmware-based GPUs.\n\n\tWith Nova we see the chance to significantly decrease the\n\tcomplexity of the driver compared to Nouveau for mainly two\n\treasons. First, Nouveau's historic architecture, especially around\n\tnvif/nvkm, is rather complicated and inflexible and requires major\n\trework to solve certain problems (such as locking hierarchy in VMM\n\t/ MMU code for VM_BIND currently being solved with a workaround)\n\tand second, with a GSP-only driver there is no need to maintain\n\tcompatibility with pre-GSP code.\n\n\tBesides that, we also want to take the chance to contribute to the\n\tRust efforts in the kernel and benefit from from more memory safety\n\toffered by the Rust programming language.\n\n\nGiven that the effort has just begun, it will be a while before this driver\nshows up in a distribution release.",
          "link": "https://lwn.net/Articles/966129/",
          "publishedOn": "2024-03-21T07:10:14.000Z",
          "wordCount": null,
          "title": "The \"Nova\" driver for NVIDIA chipsets",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965368/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for March 21, 2024 is available.",
          "link": "https://lwn.net/Articles/965368/",
          "publishedOn": "2024-03-21T00:50:37.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for March 21, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966096/",
          "author": "corbet",
          "description": "Version 46 of the GNOME desktop\nhas been released.  \"GNOME 46 is code-named 'Kathmandu', in recognition\nof the amazing work done by the organizers of GNOME.Asia 2023.\"\nSignificant changes include a new global search feature, enhancements to\nthe Files app, improved remote login support, and more.",
          "link": "https://lwn.net/Articles/966096/",
          "publishedOn": "2024-03-20T21:07:55.000Z",
          "wordCount": null,
          "title": "GNOME 46 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965434/",
          "author": "jzb",
          "description": "Cockpit is an interesting\nproject for web-based Linux administration that has received\nrelatively little attention over the years. Part of that may be due to\nthe project's strategy of minor releases roughly every two weeks,\nrather than larger releases with many new features. While the strategy\nhas done little to garner headlines, it has delivered a useful and\nextensible tool to observe, manage, and troubleshoot Linux servers.",
          "link": "https://lwn.net/Articles/965434/",
          "publishedOn": "2024-03-20T17:53:20.000Z",
          "wordCount": null,
          "title": "[$] Managing Linux servers with Cockpit",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966056/",
          "author": "jzb",
          "description": "The Python project has announced three security releases, 3.10.14,\n3.9.19,\nand 3.8.19.\nIn addition to the security fixes, these releases are notable for two reasons;\nthey are the first to make use of GitHub Actions to perform\npublic builds instead of building artifacts \"on a local computer of one\nof the release managers\", and the first since Python became a\nCVE Numbering Authority (CNA).\nPython release team member Łukasz Langa said\nthat being a CNA means Python is able to \"ensure the quality of the vulnerability\nreports is high, and that the severity estimates are accurate.\" It also\nallows Python to coordinate CVE announcements with the patched versions of\nPython, as it has with two CVEs addressed in these releases. CVE-2023-6597 \ndescribes a flaw in CPython's zipfile module that made it vulnerable to a zip-bomb exploit. CVE-2024-0450 is an\nissue with Python's tempfile.TemporaryDirectory class which could be\nexploited to modify permissions of files referenced by symbolic links. \nUsers of affected versions should upgrade soon.",
          "link": "https://lwn.net/Articles/966056/",
          "publishedOn": "2024-03-20T16:42:32.000Z",
          "wordCount": null,
          "title": "Python announces first security releases since becoming a CNA",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/966053/",
          "author": "jzb",
          "description": "Security updates have been issued by Debian (fontforge and imagemagick), Fedora (firefox), Mageia (cherrytree, python-django, qpdf, and sqlite3), Red Hat (bind, cups, emacs, fwupd, gmp, kernel, libreoffice, libX11, nodejs, opencryptoki, postgresql-jdbc, postgresql:10, postgresql:13, and ruby:3.1), Slackware (gnutls and mozilla), and Ubuntu (firefox, linux, linux-bluefield, linux-gcp, linux-gkeop, linux-hwe-5.4, linux-ibm,\n linux-ibm-5.4, linux-iot, linux-kvm, linux-oracle, linux-oracle-5.4, linux-aws, linux-aws-5.4, linux-aws, linux-aws-6.5, and linux-oracle, linux-oracle-5.15).",
          "link": "https://lwn.net/Articles/966053/",
          "publishedOn": "2024-03-20T12:51:11.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/964839/",
          "author": "jake",
          "description": "There are a number of different language-enhancement ideas that crop up\nwith some \nregularity in \nthe Python community; many of them have been debated and shot down multiple\ntimes over the years.  When one inevitably arises anew, it can sometimes be\ndifficult to tamp it down, even if it is unlikely that the idea will go\nany further than the last N times it cropped up.  A recent discussion about\n\"real\" anonymous functions follows a somewhat predictable path, but there\nare still reasons to participate in vetting these \"new\" ideas, despite the\ntiresome, repetitive \nnature of the exercise—examples of \nrecurring feature ideas that were eventually adopted definitely exist.",
          "link": "https://lwn.net/Articles/964839/",
          "publishedOn": "2024-03-19T21:18:30.000Z",
          "wordCount": null,
          "title": "[$] \"Real\" anonymous functions for Python",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965959/",
          "author": "corbet",
          "description": "Version\n124.0 of the Firefox browser is out.  Changes include support for\n\"caret browsing mode\" in the PDF viewer and the ability to control the\nsorting of tabs in the Firefox View screen.",
          "link": "https://lwn.net/Articles/965959/",
          "publishedOn": "2024-03-19T16:57:36.000Z",
          "wordCount": null,
          "title": "Firefox 124.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965958/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (cacti, postgresql-11, and zfs-linux), Fedora (freeimage, mingw-expat, and mingw-freeimage), Mageia (apache-mod_security-crs, expat, and multipath-tools), Oracle (.NET 7.0 and kernel), Red Hat (kernel, kernel-rt, and kpatch-patch), and Ubuntu (bash, kernel, linux, linux-aws, linux-hwe, linux-kvm, linux-oracle, linux, linux-aws, linux-kvm, linux-lts-xenial, and vim).",
          "link": "https://lwn.net/Articles/965958/",
          "publishedOn": "2024-03-19T16:55:09.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965926/",
          "author": "corbet",
          "description": "Man Yue Mo explains\nhow to compromise a Pixel 8 phone even when the Arm memory-tagging extension is in use, by taking\nadvantage of the Mali GPU.\n\n\n\tSo, by using the GPU to access physical addresses directly, I'm\n\table to completely bypass the protection that MTE\n\toffers. Ultimately, there is no memory safe code in the code that\n\tmanages memory accesses. At some point, physical addresses will\n\thave to be used directly to access memory.",
          "link": "https://lwn.net/Articles/965926/",
          "publishedOn": "2024-03-19T13:39:04.000Z",
          "wordCount": null,
          "title": "Man Yue Mo: Gaining kernel code execution on an MTE-enabled Pixel 8",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/964793/",
          "author": "corbet",
          "description": "Kernel developers have long been told that any attempt to allocate memory\nmight fail, so their code must be prepared for memory to be unavailable.\nInformally, though, the kernel's memory-management subsystem implements a\npolicy whereby requests below a certain size will not fail (in process\ncontext, at least), regardless of\nhow tight memory may be.  A recent discussion on the linux-mm list has\nlooked at the idea of making the \"too small to\nfail\" rule a policy that developers can rely on.",
          "link": "https://lwn.net/Articles/964793/",
          "publishedOn": "2024-03-18T15:17:14.000Z",
          "wordCount": null,
          "title": "[$] Toward a real \"too small to fail\" rule",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965829/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (curl, spip, and unadf), Fedora (chromium, iwd, opensc, openvswitch, python3.6, shim, shim-unsigned-aarch64, and shim-unsigned-x64), Mageia (batik, imagemagick, irssi, jackson-databind, jupyter-notebook, ncurses, and yajl), Oracle (.NET 7.0, .NET 8.0, and dnsmasq), Red Hat (postgresql:10), SUSE (chromium, kernel, openvswitch, python-rpyc, and tiff), and Ubuntu (openjdk-8).",
          "link": "https://lwn.net/Articles/965829/",
          "publishedOn": "2024-03-18T14:17:39.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/964735/",
          "author": "daroc",
          "description": "Cranelift is an Apache-2.0-licensed\ncode-generation backend being developed as part\nof the Wasmtime runtime for\nWebAssembly.\nIn October 2023, the Rust project made Cranelift available as an optional\ncomponent in its nightly toolchain.\nUsers can now use Cranelift as the code-generation backend for debug builds of\nprojects written in Rust,\nmaking it an opportune time to look at what makes Cranelift different.\nCranelift is designed to compete with existing compilers by generating\ncode more quickly than they can, thanks to a stripped-down design that prioritizes\nonly the most important optimizations.",
          "link": "https://lwn.net/Articles/964735/",
          "publishedOn": "2024-03-15T20:05:21.000Z",
          "wordCount": null,
          "title": "[$] Cranelift code generation comes to Rust",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965584/",
          "author": "jzb",
          "description": "Zach Mitchell has announced the 1.0 release of Flox, a tool that lets its users install packages from nixpkgs inside portable virtual environments, and share those virtual environments with others as an alternative to Docker-style containers. Flox is based on Nix but allows users to skip learning how to work with the Nix language:\ninstall, uninstall, etc, but we also provide an entire new suite of functionality with the ability to share environments via flox push, flox pull, and flox activate --remote.\n\n\nFlox is GPLv2-licensed, and releases are available as RPMs and Debian packages for x86_64 and arm64 systems.",
          "link": "https://lwn.net/Articles/965584/",
          "publishedOn": "2024-03-15T19:49:17.000Z",
          "wordCount": null,
          "title": "Mitchell: Today we launched Flox 1.0",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965603/",
          "author": "jzb",
          "description": "Sasha Levin has announced the release of the 6.8.1,\n6.7.10, 6.6.22,\n6.1.82, 5.15.152,\n5.10.213, 5.4.272,\nand 4.19.310 stable kernels. As always, they contain important fixes throughout the tree. Users of those kernels should upgrade.",
          "link": "https://lwn.net/Articles/965603/",
          "publishedOn": "2024-03-15T19:26:48.000Z",
          "wordCount": null,
          "title": "Eight stable kernel updates for the weekend",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965576/",
          "author": "jzb",
          "description": "Security updates have been issued by Debian (composer and node-xml2js), Fedora (baresip), Mageia (fonttools, libgit2, mplayer, open-vm-tools, and packages), Red Hat (dnsmasq, gimp:2.8, and kernel-rt), and SUSE (389-ds, gdb, kernel, python-Django, python3, python36-pip, spectre-meltdown-checker, sudo, and thunderbird).",
          "link": "https://lwn.net/Articles/965576/",
          "publishedOn": "2024-03-15T13:12:09.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965141/",
          "author": "corbet",
          "description": "As of this writing, just over 4,900 non-merge changesets have been pulled\ninto the mainline for the 6.9 release.  This work includes the usual array\nof changes all over the kernel tree; read on for a summary of the most\nsignificant work merged during the first part of the 6.9 merge window.",
          "link": "https://lwn.net/Articles/965141/",
          "publishedOn": "2024-03-14T15:00:05.000Z",
          "wordCount": null,
          "title": "[$] The first half of the 6.9 merge window",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965470/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (chromium and openvswitch), Fedora (chromium, python-multipart, thunderbird, and xen), Mageia (java-17-openjdk and screen), Red Hat (.NET 7.0, .NET 8.0, kernel-rt, kpatch-patch, postgresql:13, and postgresql:15), Slackware (expat), SUSE (glibc, python-Django, python-Django1, sudo, and vim), and Ubuntu (expat, linux-ibm, linux-ibm-5.4, linux-oracle, linux-oracle-5.4, linux-lowlatency, linux-raspi, python-cryptography, texlive-bin, and xorg-server).",
          "link": "https://lwn.net/Articles/965470/",
          "publishedOn": "2024-03-14T14:06:04.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/964623/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for March 14, 2024 is available.",
          "link": "https://lwn.net/Articles/964623/",
          "publishedOn": "2024-03-14T00:17:54.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for March 14, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/964739/",
          "author": "jzb",
          "description": "Kaitlyn Abdo of Fedora's AI/ML\nSIG opened an issue with the\nFedora Engineering Steering Committee (FESCo) recently that carried a few tricky\nquestions about packaging machine-learning (ML) models for Fedora. \nSpecifically, the SIG is looking for guidance on whether pre-trained weights for\nPyTorch constitute code or content. And, if the models are released under a\nlicense approved by the\nOpen Source Initiative (OSI),\ndoes it matter what data the models were trained on? The issue was quickly\ntossed over to Fedora's legal\nmailing list and sparked an interesting discussion about how to\nhandle these items, and a temporary path forward.",
          "link": "https://lwn.net/Articles/964739/",
          "publishedOn": "2024-03-13T18:08:10.000Z",
          "wordCount": null,
          "title": "[$] Questions about machine-learning models for Fedora",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965278/",
          "author": "jzb",
          "description": "Security updates have been issued by Fedora (edk2, freeipa, kernel, and liblas), Oracle (kernel), Red Hat (docker, edk2, kernel, kernel-rt, and kpatch-patch), SUSE (axis, fontforge, gnutls, java-1_8_0-openjdk, kernel, python3, sudo, and zabbix), and Ubuntu (dotnet7, dotnet8, libgoogle-gson-java, openssl, and ovn).",
          "link": "https://lwn.net/Articles/965278/",
          "publishedOn": "2024-03-13T12:54:02.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/963749/",
          "author": "corbet",
          "description": "The pidfd abstraction is a Linux-specific\nway of referring to processes that avoids the race conditions inherent in\nUnix process ID numbers.  Since a pidfd is a file descriptor, it needs a\nfilesystem to implement the usual operations performed on files.  As the\nuse of pidfds has grown, they have stressed the limits of the simple\nfilesystem that was created for them.  Christian Brauner has created\na new filesystem for pidfds that seems likely to debut in the 6.9\nkernel, but it ran into a little bump along the way, demonstrating that\nthings you cannot see can still hurt you.",
          "link": "https://lwn.net/Articles/963749/",
          "publishedOn": "2024-03-13T08:20:54.000Z",
          "wordCount": null,
          "title": "[$] A new filesystem for pidfds",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965167/",
          "author": "corbet",
          "description": "The mainline kernel has just received a set of commits addressing the\n\"register file data sampling\" hardware vulnerability.\n\n\n\tRFDS may allow a malicious actor to infer data values previously\n\tused in floating point registers, vector registers, or integer\n\tregisters. RFDS does not provide the ability to choose which data\n\tis inferred\n\n\nOnly Atom cores are affected, but those cores can be found inside a number\nof processors.  See this documentation\ncommit for more information.",
          "link": "https://lwn.net/Articles/965167/",
          "publishedOn": "2024-03-12T20:38:49.000Z",
          "wordCount": null,
          "title": "Today's hardware vulnerability: register file data sampling",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965147/",
          "author": "daroc",
          "description": "Herb Sutter, chair of the ISO C++ standards committee,\n\nwrites about the current problems with writing secure C++,\nand his personal opinion on next steps to address this while maintaining\nbackward compatibility.\n\n\n\nIf there were 90-98% fewer C++ type/bounds/initialization/lifetime\nvulnerabilities we wouldn't be having this discussion. All languages have CVEs,\nC++ just has more (and C still more); so far in 2024,\n\nRust has 6 CVEs, and\n\nC and C++ combined have 61 CVEs. So zero isn't the goal; something like a 90%\nreduction is necessary, and a 98% reduction is sufficient, to achieve security\nparity with the levels of language safety provided by MSLs [memory-safe languages]… and has the strong\nbenefit that I believe it can be achieved with perfect backward link\ncompatibility (i.e., without changing C++'s object model, and its lifetime\nmodel which does not depend on universal tracing garbage collection and is not\nlimited to tree-based data structures) which is essential to our being able to\nadopt the improvements in existing C++ projects as easily as we can adopt other\nnew editions of C++. — After that, we can pursue additional improvements to\nother buckets, such as thread safety and overflow safety.",
          "link": "https://lwn.net/Articles/965147/",
          "publishedOn": "2024-03-12T19:21:16.000Z",
          "wordCount": 570,
          "title": "Herb Sutter on increasing safety in C++",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/964392/",
          "author": "daroc",
          "description": "Serialization is the process of transforming Python objects into a sequence of\nbytes which can be used to recreate a copy of the object later — or on another\nmachine.\n\npickle is Python's native serialization module. It can store complex Python\nobjects,\nmaking it an appealing prospect for moving data without having to write\ncustom serialization code. For example, pickle is an integral component of\nseveral file\nformats used for machine learning. However, using pickle to deserialize\nuntrusted files is a major security risk, because doing so can invoke arbitrary\nPython functions. Consequently, the machine-learning community is working to address the\nsecurity issues caused by widespread use of pickle.",
          "link": "https://lwn.net/Articles/964392/",
          "publishedOn": "2024-03-12T15:35:34.000Z",
          "wordCount": null,
          "title": "[$] Insecurity and Python pickles",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965113/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (qemu), Mageia (libtiff and thunderbird), Red Hat (kernel, kpatch-patch, postgresql, and rhc-worker-script), SUSE (compat-openssl098, openssl, openssl1, python-Django, python-Django1, and wpa_supplicant), and Ubuntu (accountsservice, libxml2, linux-bluefield, linux-raspi-5.4, linux-xilinx-zynqmp, linux-oem-6.1, openvswitch, postgresql-9.5, and ruby-rack).",
          "link": "https://lwn.net/Articles/965113/",
          "publishedOn": "2024-03-12T14:50:11.000Z",
          "wordCount": 258,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965067/",
          "author": "corbet",
          "description": "Geoff Huston digs into the\ndetails of the KeyTrap DNS vulnerability, which was disclosed in February.\n\n\n\tIt's by no means \"[devastating]\" for the DNS, and the fix is much the\n\tsame as the previous fix. As well as limiting the number of queries\n\tthat a resolver can generate to resolve a queried name, a careful\n\tresolver will limit both the elapsed time and perhaps the amount of\n\tthe resolver's processing resources that are used to resolve any\n\tsingle query name.\n\n\tIt's also not a novel discovery by the ATHENE folk. The\n\tvulnerability was described five years ago by a student at the\n\tUniversity of Twente. I guess the issue was that the student failed\n\tto use a sufficient number of hysterical adjectives in describing\n\tthis DNS vulnerability in the paper!",
          "link": "https://lwn.net/Articles/965067/",
          "publishedOn": "2024-03-12T08:46:40.000Z",
          "wordCount": 651,
          "title": "Huston: KeyTrap!",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/964106/",
          "author": "corbet",
          "description": "The 6.8 kernel was released on March 10\nafter a typical, nine-week development cycle.  Over this time, 1,938\ndevelopers contributed 14,405 non-merge changesets, making 6.8 into a\nslower cycle than 6.7 (but busier than 6.6), with the lowest number of\ndevelopers participating since the 6.5 release.  Still, there was\na lot going on during this cycle; read on for some of the details.",
          "link": "https://lwn.net/Articles/964106/",
          "publishedOn": "2024-03-11T15:59:55.000Z",
          "wordCount": null,
          "title": "[$] Development statistics for 6.8",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/965032/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (libuv1, nss, squid, tar, tiff, and wordpress), Fedora (chromium, exercism, grub2, qpdf, and wpa_supplicant), Oracle (edk2 and opencryptoki), and SUSE (cpio, openssl-1_0_0, openssl-1_1, openssl-3, sudo, tomcat, and xen).",
          "link": "https://lwn.net/Articles/965032/",
          "publishedOn": "2024-03-11T14:09:38.000Z",
          "wordCount": 258,
          "title": "Security updates for Monday",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "M0AGX / LB9MG",
      "feedUrl": "https://m0agx.eu/feeds/all.rss.xml",
      "siteUrl": "https://m0agx.eu/",
      "articles": [
        {
          "id": "tag:m0agx.eu,2024-03-24:/reducing-home-assistant-ram-usage.html",
          "author": null,
          "description": "I tried running Home Assistant with zigbee2mqtt on an A20 OLinuXino board that has only 1 GB of RAM.\nStartup and initial operation was okay but after a random while (days)\nthe system locked up and become unreachable over the network. Without Home Assistant the board was running okay for weeks so I guessed that it must have been RAM usage.",
          "link": "https://m0agx.eu/reducing-home-assistant-ram-usage.html",
          "publishedOn": "2024-03-24T00:00:00.000Z",
          "wordCount": null,
          "title": "Reducing Home Assistant RAM usage",
          "imageUrl": null
        },
        {
          "id": "tag:m0agx.eu,2024-03-15:/stack-overflow-detection-cortex-m-and-risc-v.html",
          "author": null,
          "description": "There are many ways of detecting and dealing\nwith stack overflow in embedded systems. Here is a very, very easy stack canary with minimal\noverhead that can be used on Cortex-M and RISC-V with GNU and LLVM toolchains.",
          "link": "https://m0agx.eu/stack-overflow-detection-cortex-m-and-risc-v.html",
          "publishedOn": "2024-03-15T00:00:00.000Z",
          "wordCount": null,
          "title": "Very simple stack overflow detection for Cortex-M and RISC-V",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://martinfowler.com/articles/uncovering-mainframe-seams.html#batch-pipeline",
          "author": null,
          "description": "Mainframe processing is often organized into pipelines of batch\n       processes consuming and creating data files. Alessio\n       Ferri and Tom Coggrave show a couple of ways\n       they found to introduce seams into these pipelines, so that processing\n       could be replaced by steps in a replacement platform.\nmore…",
          "link": "https://martinfowler.com/articles/uncovering-mainframe-seams.html#batch-pipeline",
          "publishedOn": "2024-04-04T13:39:00.000Z",
          "wordCount": 5792,
          "title": "Creating Seams in a Mainframe's Batch Pipelines",
          "imageUrl": "https://martinfowler.com/articles/uncovering-mainframe-seams/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/uncovering-mainframe-seams.html#InternalInterfaces",
          "author": null,
          "description": "Alessio Ferri and Tom Coggrave move\n       on to analyzing the internal seams of the application by treating\n       the database as a coarse-grained seam. They describe how they introduced\n       seams into the database readers and writers.\n       \nmore…",
          "link": "https://martinfowler.com/articles/uncovering-mainframe-seams.html#InternalInterfaces",
          "publishedOn": "2024-04-02T13:46:00.000Z",
          "wordCount": null,
          "title": "Uncovering Seams in a Mainframe's external interfaces",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/2024-joining-linkedin.html",
          "author": null,
          "description": "As the enmuskification of Twitter continues, I’ve increasingly heard that more people are using LinkedIn to keep up with new professional material. So, a couple of weeks ago, I set up my LinkedIn account, so people can follow me on that platform.\nI’ve always avoided LinkedIn - I’ve found the whole vibe of connections rather off-putting. I get too much spam from people wanting to connect as it is. But LinkedIn has added a “creator mode”, which encourages people to follow someone for posts rather than the bi-directional connection.  It seems to be working reasonably well so far, so I’ve decided that I shall post all updates here to that account too. However I’m still avoiding connections, so please don’t send me a connection request unless we’ve done some substantial work together.\nI’m still posting to X (Twitter), but as it steadily deteriorates, it gets less of my attention. If you follow me there, I recommend switching to one of my other feeds if you can.\nI don’t particularly like LinkedIn for its feed, as I have little control over it. I never like the site suggestions, preferring as simple feeds of people. Sadly, LinkedIn doesn’t have lists, and pushes everything someone likes into the single connection feed. This leads to Too Many Posts which means I don’t pay attention to much.",
          "link": "https://martinfowler.com/articles/2024-joining-linkedin.html",
          "publishedOn": "2024-03-28T16:26:00.000Z",
          "wordCount": null,
          "title": "Joining LinkedIn",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/kordyback-tribute.html",
          "author": null,
          "description": "John Kordyback, a treasured colleague and friend, died last week, aged 64.\nmore…",
          "link": "https://martinfowler.com/articles/kordyback-tribute.html",
          "publishedOn": "2024-03-27T16:48:00.000Z",
          "wordCount": null,
          "title": "Farewell, John Kordyback",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/uncovering-mainframe-seams.html#Seams",
          "author": null,
          "description": "Alessio Ferri and Tom Coggrave start\n       detailing the seams they explored with two areas of external interfaces.\n       Batch input of files are copied to new implementations while comparing the output of the\n       processing pipelines. API access points can be covered with a proxy and\n       traffic gradually directed to the new implementation.\nmore…",
          "link": "https://martinfowler.com/articles/uncovering-mainframe-seams.html#Seams",
          "publishedOn": "2024-03-27T14:36:00.000Z",
          "wordCount": null,
          "title": "Uncovering Seams in a Mainframe's external interfaces",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/uncovering-mainframe-seams.html",
          "author": null,
          "description": "Mainframe systems continue to run much of the world's computing workload,\n       but it's often difficult to add new features to support growing business\n       needs. Furthermore the architectural challenges that make them slow to\n       enhance also make them hard to replace. To reduce the risk involved, we\n       use an incremental approach to legacy displacement, gradually replacing\n       legacy capabilities with implementations in modern technology. This\n       strategy requires us to introduce seams into the mainframe system: points\n       in which we could divert logic flow into newer services. In a recent\n       project Alessio Ferri and Tom Coggrave\n       investigated several approaches to introduce these seams into a\n       long-lived mainframe system.\nmore…",
          "link": "https://martinfowler.com/articles/uncovering-mainframe-seams.html",
          "publishedOn": "2024-03-26T13:32:00.000Z",
          "wordCount": null,
          "title": "Uncovering the seams in Mainframes for Incremental Modernisation",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/measuring-developer-productivity-humans.html#HowToCaptureQualitativeMetrics",
          "author": null,
          "description": "Abi Noda and Tim Cochran complete\n        their article on qualitative metrics by outlining how to capture them\n        effectively. They discuss the mental steps that people go through as\n        they respond to a survey and provide a template to get started when assessing\n        developer experience. A final section looks at how qualitative and\n        quantitative work together: often by starting with qualitative metrics to\n        establish baselines and determine where to focus, followed with\n        quantitative metrics to drill deeper into specific areas.\nmore…",
          "link": "https://martinfowler.com/articles/measuring-developer-productivity-humans.html#HowToCaptureQualitativeMetrics",
          "publishedOn": "2024-03-19T13:33:00.000Z",
          "wordCount": null,
          "title": "How to capture qualitative metrics",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/2024-refactoring-code-samples.html",
          "author": null,
          "description": "From time to time people ask me for a copy of the code I used in the\n       opening chapter of Refactoring, so\n       they can follow along themselves. I had Reasons for not providing this code,\n       specifically laziness. Fortunately Emily Bache is more dedicated, and she\n       has set up a github repository - the Theatrical\n       Players Refactoring Kata - with the code, and enough tests to make it\n       reasonable to do the refactoring.\nThe repository goes further than this, however, in that it includes similar\n       sample code in a dozen languages, including C, Java, Rust, and Python.\nShe has recently posted a video to her YouTube\n       channel, which outlines why she encourages folks to use this code while\n       they are reading that chapter. Her channel includes a lot of videos on good\n       code technique, and she has a Patreon for readers to support\n       her work.",
          "link": "https://martinfowler.com/articles/2024-refactoring-code-samples.html",
          "publishedOn": "2024-03-15T15:04:00.000Z",
          "wordCount": null,
          "title": "Code samples for the opening chapter of Refactoring",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/measuring-developer-productivity-humans.html#TheTwoTypesOfQualitativeMetrics",
          "author": null,
          "description": "Abi Noda and Tim Cochran continue their\n       discussion on using qualitative metrics to assess the productivity of\n       development teams. In this installment they classify qualitative metrics into\n       attitudinal and behavioral metrics. We also see that qualitative metrics\n       allow you to measure things that are otherwise unmeasurable, provide missing\n       visibility, and supply necessary context for quantitative data.\nmore…",
          "link": "https://martinfowler.com/articles/measuring-developer-productivity-humans.html#TheTwoTypesOfQualitativeMetrics",
          "publishedOn": "2024-03-13T14:36:00.000Z",
          "wordCount": null,
          "title": "The Benefits of Qualitative Metrics",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/measuring-developer-productivity-humans.html",
          "author": null,
          "description": "Measuring developer productivity is a difficult challenge.\n       Conventional metrics focused on development cycle time and throughput are\n       limited, and there aren't obvious answers for where else to turn.\n       Qualitative metrics offer a powerful way to measure and understand\n       developer productivity using data derived from developers themselves.\n       Abi Noda and Tim Cochran begin their\n       discussion by explaining what a qualitative metric is and\n       why we shouldn't reject them for being subjective or unreliable. \nmore…",
          "link": "https://martinfowler.com/articles/measuring-developer-productivity-humans.html",
          "publishedOn": "2024-03-12T13:36:00.000Z",
          "wordCount": null,
          "title": "Measuring Developer Productivity via Humans",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "MCU on Eclipse",
      "feedUrl": "https://mcuoneclipse.com/feed/",
      "siteUrl": "https://mcuoneclipse.com",
      "articles": [
        {
          "id": "http://mcuoneclipse.com/?p=40340",
          "author": "Erich Styger",
          "description": "This post discusses creating custom wood business cards with integrated RFID chips using a laser cutter, plywood, veneer, and NXP NTAG213 RFID stickers. It explains the components, programming the RFID, and provides links to necessary resources. The writer presents it as an easy and customizable option, suitable for modern smartphones. Continue reading →",
          "link": "https://mcuoneclipse.com/2024/04/08/diy-wood-rfid-business-cards/",
          "publishedOn": "2024-04-08T21:33:00.000Z",
          "wordCount": null,
          "title": "DIY Wood RFID Business Cards",
          "imageUrl": null
        },
        {
          "id": "http://mcuoneclipse.com/?p=40282",
          "author": "Erich Styger",
          "description": "Rust programming language gains popularity in embedded systems, and tools like probe-rs make it easier. The NXP MCU-Link debug probe, affordable at $15, is compatible with Rust and Visual Studio Code for debugging. With simple installation and usage, it offers a versatile and cost-effective solution for Rust applications. Links: probe-rs, MCU-Link debug probe. Continue reading →",
          "link": "https://mcuoneclipse.com/2024/03/17/nxp-mcu-link-for-rust-with-probe-rs/",
          "publishedOn": "2024-03-17T15:48:45.000Z",
          "wordCount": null,
          "title": "NXP MCU-Link for Rust with probe-rs",
          "imageUrl": null
        },
        {
          "id": "http://mcuoneclipse.com/?p=40242",
          "author": "Erich Styger",
          "description": "The article explains ways to avoid float and double data types in embedded applications to prevent precision, code size, and performance issues. It introduces using pragma to 'poison' these data types and setting options for software floating point runtime routines, as well as catching them in libraries through linker options. These methods ensure no floating point operations are used, providing greater control over the application. Continue reading →",
          "link": "https://mcuoneclipse.com/2024/03/13/how-to-make-sure-no-floating-point-code-is-used/",
          "publishedOn": "2024-03-13T18:55:21.000Z",
          "wordCount": null,
          "title": "How to make sure no floating point code is used",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The ESP Journal - Medium",
      "feedUrl": "https://medium.com/feed/the-esp-journal",
      "siteUrl": "https://blog.espressif.com?source=rss----d5414d5dee73---4",
      "articles": [
        {
          "id": "https://medium.com/p/6f90a0e44efe",
          "author": "Harshal Patil",
          "description": "",
          "link": "https://blog.espressif.com/trying-out-esp32-c3s-security-features-using-qemu-6f90a0e44efe?source=rss----d5414d5dee73---4",
          "publishedOn": "2024-04-05T12:03:50.000Z",
          "wordCount": null,
          "title": "Trying out ESP32-C3’s security features using QEMU",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "/* the devil is in the detail */",
      "feedUrl": "https://minjang.github.io/feed.xml",
      "siteUrl": "http://minjang.github.io/",
      "articles": []
    },
    {
      "title": "mingrammer's note",
      "feedUrl": "https://mingrammer.com/index.xml",
      "siteUrl": "https://mingrammer.com/",
      "articles": []
    },
    {
      "title": "Novel Bits",
      "feedUrl": "https://www.novelbits.io/feed",
      "siteUrl": "https://novelbits.io/",
      "articles": []
    },
    {
      "title": "null program",
      "feedUrl": "https://nullprogram.com/feed/",
      "siteUrl": "https://nullprogram.com",
      "articles": []
    },
    {
      "title": "Almost Secure",
      "feedUrl": "https://palant.info/rss.xml",
      "siteUrl": "https://palant.info/",
      "articles": []
    },
    {
      "title": "Preshing on Programming",
      "feedUrl": "http://preshing.com/feed",
      "siteUrl": "https://preshing.com/feed",
      "articles": []
    },
    {
      "title": "research!rsc",
      "feedUrl": "https://research.swtch.com/feed.atom",
      "siteUrl": "http://research.swtch.com/feed.atom",
      "articles": [
        {
          "id": "http://research.swtch.com/xz-script",
          "author": null,
          "description": "A detailed walkthrough of the xz attack shell script.",
          "link": "http://research.swtch.com/xz-script",
          "publishedOn": "2024-04-02T08:00:00.000Z",
          "wordCount": null,
          "title": "The xz attack shell script",
          "imageUrl": null
        },
        {
          "id": "http://research.swtch.com/xz-timeline",
          "author": null,
          "description": "A detailed timeline of the xz open source attack, from 2021 to 2024.",
          "link": "http://research.swtch.com/xz-timeline",
          "publishedOn": "2024-04-02T03:23:00.000Z",
          "wordCount": null,
          "title": "Timeline of the xz open source attack",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "AEP코리아네트",
      "feedUrl": "https://rss.blog.naver.com/aepkoreanet.xml",
      "siteUrl": "https://blog.naver.com/aepkoreanet?fromRss=true&trackingCode=rss",
      "articles": []
    },
    {
      "title": "애자일 이야기",
      "feedUrl": "http://rss.egloos.com/blog/agile",
      "siteUrl": "http://agile.egloos.com",
      "articles": []
    },
    {
      "title": "The Shape of Code",
      "feedUrl": "https://shape-of-code.com/feed/",
      "siteUrl": "https://shape-of-code.com",
      "articles": [
        {
          "id": "https://shape-of-code.com/?p=8682",
          "author": "Derek Jones",
          "description": "How many software companies are there in the UK, and where are they concentrated? This question begs the question of what kinds of organization should be counted as a software company. My answer to this question is driven by the available data. Companies House is the executive agency of the British Government that maintains the […]",
          "link": "https://shape-of-code.com/2024/04/07/software-companies-in-the-uk/",
          "publishedOn": "2024-04-07T21:28:56.000Z",
          "wordCount": null,
          "title": "Software companies in the UK",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=8670",
          "author": "Derek Jones",
          "description": "In the 1960s a small number of computer manufacturers sold a relatively small number of general purpose computers (IBM dominated the market). Between 1962 and 1974 the magazine Computers and Automation published a monthly census listing the total number of installed, and unfilled orders for, general purpose computers. A pdf of all the scanned census […]",
          "link": "https://shape-of-code.com/2024/03/31/census-of-general-purpose-computers-installed-in-the-1960s/",
          "publishedOn": "2024-03-31T22:06:02.000Z",
          "wordCount": null,
          "title": "Census of general purpose computers installed in the 1960s",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=8663",
          "author": "Derek Jones",
          "description": "Papers describing vacuous research results get published all the time. Sometimes they get accepted at premier conferences, such as ICSE, and sometimes they even win a distinguished paper award, such as this one appearing at ICSE 2024. If the paper Breaking the Flow: A Study of Interruptions During Software Engineering Activities had been produced by […]",
          "link": "https://shape-of-code.com/2024/03/24/a-paper-to-forget-about/",
          "publishedOn": "2024-03-24T23:32:28.000Z",
          "wordCount": null,
          "title": "A paper to forget about",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=8651",
          "author": "Derek Jones",
          "description": "What is the best way to locate a freely downloadable copy of a report or paper on the web? The process I follow is outlined below (if you are new to this, you should first ask yourself whether reading a scientific paper will produce the result you are expecting): Google search. For the last 20 […]",
          "link": "https://shape-of-code.com/2024/03/17/finding-reports-and-papers-on-the-web/",
          "publishedOn": "2024-03-17T23:14:47.000Z",
          "wordCount": null,
          "title": "Finding reports and papers on the web",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Stacey on IoT | Internet of Things news and analysis",
      "feedUrl": "https://staceyoniot.com/feed/",
      "siteUrl": "https://staceyoniot.com/",
      "articles": []
    },
    {
      "title": "Blog – Modern Embedded Software | Quantum Leaps",
      "feedUrl": "https://www.state-machine.com/category/blog/feed",
      "siteUrl": "https://www.state-machine.com",
      "articles": []
    },
    {
      "title": "IT의 중심에서",
      "feedUrl": "https://subokim.wordpress.com/feed/",
      "siteUrl": "https://subokim.wordpress.com",
      "articles": [
        {
          "id": "http://subokim.wordpress.com/?p=13359",
          "author": "subokim",
          "description": "※ 아직 써보진 않았습니다. 써보면 의견이 어떻게 달라질지 모르겠네요. 작년 : “ChatGPT야, Java Spring 코드 만들어 줘”올해 : “Devin, 이런 거 이렇게 짜 줘” Cognition labs 라는 회사에서 세계 최초의 AI 개발자 “Devin”을 만들었습니다.Engineer 와 Developer는 다른데 그냥 “개발자”라고 의역을 하겠습니다. 회사 홈페이지를 가보았습니다. “왜 만들었나…” 궁금하더라고요.달랑 두 개의 블로그 글만 올라와 있습니다. 회사 이야기... Continue Reading →",
          "link": "https://subokim.wordpress.com/2024/03/28/devins/",
          "publishedOn": "2024-03-28T03:17:00.000Z",
          "wordCount": null,
          "title": "AI 개발자 Devin 소개를 보고 느낀 점",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "코드쓰는사람",
      "feedUrl": "https://taegon.kim/feed",
      "siteUrl": "https://taegon.kim",
      "articles": []
    },
    {
      "title": "The Pasture",
      "feedUrl": "https://thephd.dev/feed",
      "siteUrl": "https://thephd.dev/",
      "articles": []
    },
    {
      "title": "Vivonomicon's Blog",
      "feedUrl": "https://vivonomicon.com/feed/",
      "siteUrl": "https://vivonomicon.com",
      "articles": []
    },
    {
      "title": "zserge's blog",
      "feedUrl": "https://zserge.com/rss.xml",
      "siteUrl": "https://zserge.com/",
      "articles": []
    },
    {
      "title": "The Boston Globe",
      "feedUrl": "https://www.bostonglobe.com/rss/bigpicture",
      "siteUrl": "https://www.bostonglobe.com",
      "articles": []
    },
    {
      "title": "이바닥늬우스",
      "feedUrl": "https://ebadak.news/feed",
      "siteUrl": "https://ebadak.news",
      "articles": []
    },
    {
      "title": "economic view",
      "feedUrl": "http://feeds.feedburner.com/Economic_View",
      "siteUrl": "http://economicview.net",
      "articles": []
    },
    {
      "title": "슬로우뉴스.",
      "feedUrl": "https://feeds.feedburner.com/slownews",
      "siteUrl": "https://slownews.kr",
      "articles": [
        {
          "id": "https://slownews.kr/?p=106684",
          "author": "이정환",
          "description": "[슬로우리포트] “통계는 물량이 깡패”, 여론조사꽃의 389번 조사가 의미하는 것. “비싼 게 정확하다.” 김어준(딴지일보 총수)이 만든 여론조사 업체 여론조사꽃은 물량 공세로 선거 판을 주도하고 있다. 이게 왜 중요한가. 관전 포인트. 어떻게 다른가. 질문이 달랐다. 진보-보수 비중도 달랐다. “이길 수가 없다.” “비싼 게 정확하다”, 물량이 깡패”라는 주장은 맞을까. 여론조사꽃의 강점. 서울 동작을과 부산 사하을의 경우. 더 깊게...\nThe post “비싼 게 정확하다”, 김어준의 여론조사 실험은 성공할까. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106684",
          "publishedOn": "2024-04-09T06:16:29.000Z",
          "wordCount": null,
          "title": "“비싼 게 정확하다”, 김어준의 여론조사 실험은 성공할까.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106667",
          "author": "정혜승",
          "description": "[마냐의 북라이딩] 북살롱 목요일 언니, 청와대 국민청원 기획자, 얼룩소 설립자, ‘정부가 없다’ 저자 정혜승의 종횡무진 독서 탐험기. 사람에게 반하고, 사귀어 가는 것은 잊지 못할 순간들의 연속이다. 유대인 소년 한스가 귀족 전학생 콘라딘과 우정을 쌓기 시작하는 순간이 가장 설레는 대목이다. 오랜만에 마음을 흔드는 소설이다. 우정, 광채로 세상을 감싸다 “나는 그날 콘라딘이 내게 무슨 말을 했고 내가...\nThe post 홀로코스트, 야만의 시대를 만난 우정 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106667",
          "publishedOn": "2024-04-09T03:34:46.000Z",
          "wordCount": null,
          "title": "홀로코스트, 야만의 시대를 만난 우정",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106636",
          "author": "이정환",
          "description": "의대 증원, 말이 안 맞는다. 역대급 부자감세 성적표, 총선 뒤로 미뤘나. 키워드는 민주당 단독 과반. 3가지 시나리오. 쟁점과 현안. 네 명의 운명. 차기 대권이 걸렸다. 삼겹살 대신 한우를. “역사적 진실”, 이재명의 페이스북 글 논란. 의사들이 희생하라, 조선일보의 프레임. ‘이대남’과 ‘육대남’이 가른다. 더 깊게 읽기. 선거 보조금 두 번 받는 이유. 대통령실의 매파와 비둘기파. 다르게 읽기....\nThe post 역대급 총선, 3가지 시나리오와 4명의 운명: 슬로우레터 4월9일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106636",
          "publishedOn": "2024-04-08T22:07:42.000Z",
          "wordCount": null,
          "title": "역대급 총선, 3가지 시나리오와 4명의 운명: 슬로우레터 4월9일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106616",
          "author": "민주언론시민연합",
          "description": "요약 주요 이슈 1. 국민의힘 유세 기사 건수·노출시간 2위 2. 조국혁신당 보도량 급감 (3월 4째주, 3위 → 4월 1째주, 14위) 3. 판세-여론조사 노출시간 1위 4. 더불어민주당 후보 관련 네거티브 보도 급증 5. 대파 논란, 언론 보도 22건뿐 6. 국민의힘 부정적 이슈, 모두 10위권 밖 7. 여, 한동훈 비대위원장 One-Top 유세 보도 8. 사전 투표 이슈...\nThe post 조국혁신당 보도는 급감, 국민의힘 유세 보도는 급증: 2024 총선 포털뉴스 (4월 첫째 주, 마지막) appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106616",
          "publishedOn": "2024-04-08T03:03:04.000Z",
          "wordCount": null,
          "title": "조국혁신당 보도는 급감, 국민의힘 유세 보도는 급증: 2024 총선 포털뉴스 (4월 첫째 주, 마지막)",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106604",
          "author": "민주언론시민연합",
          "description": "3월 28일 22대 총선 공식 선거운동이 시작됐습니다. 한동훈 국민의힘 비상대책위원장과 이재명 더불어민주당 당대표의 지원 유세 관련 보도량이 늘었는데요. 지원 유세 중 막말에 가까운 말실수가 많아 논란이 일었습니다. 표심을 좌우할 공약이나 품격 있는 발언 대신 유권자의 기대치에 미치지 못하는 정치인들의 막말은 종편 시사대담프로그램의 대담 이슈로 자주 등장했는데요. 여야 정치인 발언을 다루는 시각과 논조는 차이가 있었습니다. 이재명...\nThe post 망언·막말도 사람 차별하는 종편 3사: “계모”는 키우고, “개같이”는 숨기고 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106604",
          "publishedOn": "2024-04-08T01:34:12.000Z",
          "wordCount": null,
          "title": "망언·막말도 사람 차별하는 종편 3사: “계모”는 키우고, “개같이”는 숨기고",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106581",
          "author": "이정환",
          "description": "사전 투표 장소에 의미가 있다. 민주당은 “120~150+알파.” 개헌 저지선 200석이 위태롭다고? 쟁점과 현안. 아킬레스건, 어디가 더 아플까. 사전 투표율 31.28%가 말하는 것. ‘호고영저’ 현상. ‘조나땡’? 조국이 정권 심판론 살렸다. 백두대간 전공의. 다르게 읽기. 사전 투표 조작설, 근거 없다. 탈원전 폐기해서 온실가스 줄었다고? 해법과 대안. 깜깜이 선거, 이대로 좋은가. 8명이 1600명분 밥하는 식당. 노인 무단횡단 사고...\nThe post 범야권 200석? 사전 투표 장소에 의미가 있다: 슬로우레터 4월8일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106581",
          "publishedOn": "2024-04-07T22:12:03.000Z",
          "wordCount": null,
          "title": "범야권 200석? 사전 투표 장소에 의미가 있다: 슬로우레터 4월8일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106538",
          "author": "양경규",
          "description": "[기고] 양경규 녹색정의당 의원, 조국혁신당을 정치적 ‘퇴행’으로 비판하는 다섯 가지 이유. 첫 번째 비판: 조국혁신당, 당명 자체가 한국 정치의 퇴행이다. 국민의 지지를 받기 위해 고투하는 녹색정의당의 당원과 의원 입장에서 남이 땅을 사서 배가 아파 이 글을 쓰는 것은 아니다. 조국혁신당이 양당 구조를 끝내고 불평등과 차별, 기후위기를 극복하는 새로운 정치를 열어가기보다는 민주주의를 퇴행시키고 시대적 과제를 방기하면서...\nThe post 친박연대와 뭐가 다른가… 조국혁신당은 퇴행이다. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106538",
          "publishedOn": "2024-04-06T12:12:08.000Z",
          "wordCount": null,
          "title": "친박연대와 뭐가 다른가… 조국혁신당은 퇴행이다.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106502",
          "author": "이정환",
          "description": "민주당이 보는 판세는 110곳 우세, 50곳 경합. “200석? 정치 모르는 사람들이 하는 소리.” 국민의힘은 “낙담 말라”, 민주당은 “안심 말라.” 국민의힘 100석 무너질 가능성은? ‘네임드’ 정치인들도 간당간당. 전공의들 윤석열 만난 뒤 “의료의 미래는 없다.” “2030이 미래를 선택해야 한다.” “선한 시민과 범죄자 세력의 전쟁.” 쟁점과 현안. 김준혁·양문석·공영운 버티는 이유 있다. 양문석 딸이 낸 거래 명세서는 대부분 허위....\nThe post 윤석열이 2년 동안 만든 사상 최초의 기록 몇 가지: 슬로우레터 4월5일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106502",
          "publishedOn": "2024-04-04T22:09:08.000Z",
          "wordCount": null,
          "title": "윤석열이 2년 동안 만든 사상 최초의 기록 몇 가지: 슬로우레터 4월5일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106491",
          "author": "민노씨",
          "description": "며칠 전 60대 중반의 전 논설위원이 “젊은이들이 망친 나라, 노인이 구한다. (이렇게) 호소를 해서 60대 이상의 투표율을 극적으로 높이는 방법밖에는 없다”고 공개방송에서 발언했다. 사실, 60대 이상 유권자의 투표율은 이미 아주 높다. 지난 제20대 대통령 선거에서 60~70대 유권자의 투표율은 87%에 가까웠으며, 제21대 총선에서도 80%를 넘겼다. 60대 이상 유권자의 투표율을 높이는 것은 그만큼 어려운 일이다. 그럼 ‘나라를...\nThe post 총선 결정하는 2030의 정치 무관심, 그런데 그게 누구 책임인데? appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106491",
          "publishedOn": "2024-04-04T09:13:03.000Z",
          "wordCount": null,
          "title": "총선 결정하는 2030의 정치 무관심, 그런데 그게 누구 책임인데?",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106470",
          "author": "이정환",
          "description": "[슬로우리포트] 정권 심판을 넘어, 조국혁신당 돌풍과 세대별 편향이 의미하는 것. 다음주 이 시간이면 완전히 다른 세상이 돼 있을 것 같다. 투표율이 관건이라는 이야기 많이 하지 않나. 첫 번째 질문: 왜 4050 세대에서 민주당 지지율이 높게 나타나나. 두 번째 질문: 나이가 들면 이들도 국민의힘을 지지하게 될까. 세 번째 질문: 386 세대는 보수화된 건가. 네 번째 질문:...\nThe post 젊은이가 망친 나라, 노인이 구한다고? appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106470",
          "publishedOn": "2024-04-04T08:19:11.000Z",
          "wordCount": null,
          "title": "젊은이가 망친 나라, 노인이 구한다고?",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106426",
          "author": "이정환",
          "description": "“예측은 늘 빗나갔다”, 조선일보의 마지막 기대. “쿨한 사과로 전화위복을”, 중앙일보의 조언. “그건 알겠고, 그래서 어떻게 풀려고?” 2030 무당층 30%가 변수. 젊은이가 망친 나라, 노인이 구한다? “투표율 71%면 세상 바뀐다.” “더 무서운 건 패배주의다.” 조국혁신당 지지율 25%. 부울경도 뒤집히나. 쟁점과 현안. 양문석 딸 대출 11억 원 회수한다. 재외 투표율 62.8%. 다르게 읽기. 여론 조사에 잡히지 않는...\nThe post “예측은 늘 빗나갔다”, D-6 총선에 거는 조선일보의 마지막 기대: 슬로우레터 4월4일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106426",
          "publishedOn": "2024-04-03T22:18:44.000Z",
          "wordCount": null,
          "title": "“예측은 늘 빗나갔다”, D-6 총선에 거는 조선일보의 마지막 기대: 슬로우레터 4월4일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106417",
          "author": "민주언론시민연합",
          "description": "위기는 곧 기회다!!!  전쟁 삐라 같은 제목의 문건이 세상에 드러났다. “對外祕”(대외비)라는 글자가 뚜렷이 찍힌 문건이다. 한 마디로 표현하자면 이 문건은 공영방송 KBS 장악 계획이라고 할 수 있다. 대통령과 관련된 사안에 대한 정당한 의혹 제기와 비판 보도뿐만 아니라 대통령 발언과 심지어는 대통령 부인에 대한 호칭까지도 심의 기구를 동원해 제재하는 언론 탄압을 보며 윤석열 정권은 그야말로 비판...\nThe post KBS 장악 시나리오: [위기는 곧 기회다] 문건 “우파 중심으로 조직 장악하라” appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106417",
          "publishedOn": "2024-04-03T07:54:13.000Z",
          "wordCount": null,
          "title": "KBS 장악 시나리오: [위기는 곧 기회다] 문건 “우파 중심으로 조직 장악하라”",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106395",
          "author": "이정환",
          "description": "“49곳이 1000표 이내로 결판.” 민주당은 ‘부자 몸조심’, 국민의힘은 ‘언더독’ 전략. 200석이 되면 할 수 있는 것. “전공의들 만나겠다.” 쟁점과 현안. “이대생 성 상납” 발언 논란, 김준혁도 버티기. “제가 이렇게 사라지게 두실 겁니까.” 다르게 읽기. 내일부터 여론조사 블랙아웃. 돈 풀어도 물가 안 잡히는 이유. 875원 대파 총선 끝나면 끝? 더 깊게 읽기. “다단계는 이종근이 전문.” 오늘의...\nThe post 선거 공보물에 윤석열과 이재명 사진이 사라진 이유: 슬로우레터 4월3일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106395",
          "publishedOn": "2024-04-02T22:02:22.000Z",
          "wordCount": 6814,
          "title": "선거 공보물에 윤석열과 이재명 사진이 사라진 이유: 슬로우레터 4월3일.",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/04/dGjH0WXqGKpg660bf2587ee591.05140533-1000x666.jpg"
        },
        {
          "id": "https://slownews.kr/?p=106379",
          "author": "민주언론시민연합",
          "description": "요약 주요 이슈 1. 박은정 후보 등 야권 후보 의혹 제기 본격화 2. 용산 촉발 의대 2천명 증원 논란 지속 3. 야, 지도부 유세… 여, 한동훈 개인 유세 4. 조국혁신당, 검찰 ‘디지털 캐비닛’ 국정조사 이슈화 5. 여야 총선 공약 보도량 증가 ① 공약 이슈, 보도량 5위 ② 논란 일으킨 공약 이슈는 급소멸 6. 판세-여론조사 보도...\nThe post 조선일보, 박은정에 집중 포화: 2024 총선 포털뉴스 (3월 넷째 주) appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106379",
          "publishedOn": "2024-04-02T15:22:27.000Z",
          "wordCount": null,
          "title": "조선일보, 박은정에 집중 포화: 2024 총선 포털뉴스 (3월 넷째 주)",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106346",
          "author": "이정환",
          "description": "“2000명은 그냥 나온 숫자가 아니다.” 꿈보다 해몽, 신문마다 포인트가 다르다. “의사들을 악마화했다.” 윤석열은 달라지지 않을 것이다. “날아오는 혜성 보며 멸종 예감하는 공룡들의 심정.” “쇠귀에 경읽기, 탈당해 달라.” “70 평생에 이렇게 못 하는 정부는 처음.” 쟁점과 현안. 양문석, “아파트 팔겠다.” 옷 색깔이 달라졌다. “제 책임이 아니지 않습니까.” 다르게 읽기. 아낌없이 주는 한동훈. 자영업자 육아휴직 가능할까. 더...\nThe post 국민의힘 의원들이 “멸종 예감하는 공룡들 심정”이라고 말한 이유: 슬로우레터 4월2일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106346",
          "publishedOn": "2024-04-01T22:07:00.000Z",
          "wordCount": null,
          "title": "국민의힘 의원들이 “멸종 예감하는 공룡들 심정”이라고 말한 이유: 슬로우레터 4월2일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106318",
          "author": "민노씨",
          "description": "오늘은 만우절. 거짓말 혹은 진실과 거짓에 관한 다섯 가지 이야기. 잔돈과 선행 거짓에 관한 첫 번째 기억은 초등학교 2학년이나 3학년 때의 일인 것 같다. 정확히 언제인지는 모르겠다. 아무튼 담임선생님이 불우이웃돕기인 걸까, 어떤 아름다운 목적으로 돈을 걷었다. 나에겐 십원짜리 몇 개와 백원짜리 한두 개 그리고 천원짜리 지폐가 한두 장 있었던 것 같다. 나는 마침 그 잔돈이...\nThe post 거짓말에 관한 다섯 가지 이야기 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106318",
          "publishedOn": "2024-04-01T13:10:13.000Z",
          "wordCount": null,
          "title": "거짓말에 관한 다섯 가지 이야기",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106306",
          "author": "정혜승",
          "description": "[마냐의 북라이딩] 북살롱 목요일 언니, 청와대 국민청원 기획자, 얼룩소 설립자, [정부가 없다] 저자 정혜승의 종횡무진 독서 탐험기…오늘 달려갈 책은 ‘가난한 아이들은 어떻게 어른이 되는가?’ 가난한 아이들에 대한 기억이 별로 없다. 어릴 적 살던 은마아파트는 31평, 34평 다들 비슷비슷 고만고만한 중산층 동네였다. 대학 졸업 후 나는 분명 사회적 약자의 목소리를 대변해야 할 기자가 됐는데, 만나는 이는 대부분 사회의...\nThe post 생존은 필수품, 꿈은 사치품: 가난한 아이들은 어떻게 어른이 되는가 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106306",
          "publishedOn": "2024-04-01T06:59:17.000Z",
          "wordCount": null,
          "title": "생존은 필수품, 꿈은 사치품: 가난한 아이들은 어떻게 어른이 되는가",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106276",
          "author": "이정환",
          "description": "사전 투표하겠단 사람 3분의 2가 민주당. “이대로 가면 대한민국 망한다.” 윤석열 오늘 대국민 담화. 2000명 증원 찬성은 29%뿐. 쟁점과 현안. 양문석 리스크, 10석 날아간다? ‘작업 대출’ 맞나. 공영운도 부동산 리스크. “전관예우라면 160억 원은 벌었어야.” 더 깊게 읽기. 2년은 너무 길었다. 이재명은 ‘경제’를, 한동훈은 ‘범죄’를 말했다. 세 살 아기의 죽음. 보수 과표집 아니라 진보 과표집? 오늘의...\nThe post 투표율 65%가 민주당의 ‘매직 넘버’? 과연 그럴까: 슬로우레터 4월1일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106276",
          "publishedOn": "2024-03-31T22:16:37.000Z",
          "wordCount": null,
          "title": "투표율 65%가 민주당의 ‘매직 넘버’? 과연 그럴까: 슬로우레터 4월1일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106237",
          "author": "참여연대 의정감시센터",
          "description": "이 모든 지표에서 한국이 OECD 국가 중 1위 또는 최상위권이라고 한다. GDP 순위만으로 선진국이라는 자부심을 가지기에는 우리의 삶이 참 버겁다. 저출생과 지방소멸의 가시화는 한국의 미래를 더욱 암담하게 만든다. 일자리가 없는 지방의 청년들이 떠나면서 지방소멸은 가속도를 내고 있고, 저출생에도 불구하고 인구가 오히려 늘어나고 있는 수도권 거주자들의 삶은 더 팍팍해지고 있다. 겨우 일자리를 잡는다 해도 끝이 안...\nThe post 미래가 사라진 총선, 괜찮으십니까? appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106237",
          "publishedOn": "2024-03-29T04:09:34.000Z",
          "wordCount": null,
          "title": "미래가 사라진 총선, 괜찮으십니까?",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106226",
          "author": "민주언론시민연합",
          "description": "제22대 국회의원 선거가 다가온다. 정치권에 대한 냉소가 하루 이틀 일은 아니지만 이쯤 되면 정말 정치권이 국민의 정치 혐오 정서를 부추겨 그들만의 왕국을 꾸려가고 있다는 음모론에 신뢰가 갈 지경이다. 기초적 검증도 제대로 하지 못해 제1야당이 후보 등록 이후 공천을 취소하고 후보를 제명한 일이 벌어졌다. 여야를 가리지 않고 후보로 확정된 인물들이 이런저런 과거의 부적절한 언행으로 공천이 취소되는...\nThe post 부적격 후보는 유권자가 걸러내라? 그건 정당과 언론이 해야죠! appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106226",
          "publishedOn": "2024-03-29T03:39:25.000Z",
          "wordCount": null,
          "title": "부적격 후보는 유권자가 걸러내라? 그건 정당과 언론이 해야죠!",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106176",
          "author": "이정환",
          "description": "출근길 대란, 퇴근길에 끝났다. 사전투표, 국민의힘에도 좋다? 쟁점과 현안. 의대 정원, 의-정 갈등에서 의-윤 갈등으로. “정치를 개같이 한다.” 민생 토론회에 세 가지가 없다. 다르게 읽기. 열흘 동안 판세가 바뀔 수도 있을까. 윤석열과 한동훈의 패착. ‘역내로남불’. 더 깊게 읽기. 금지팡이와 흙지팡이. 그들에게 채수근은 2등 시민이었다. 김앤장 네트워크. 재판받겠습니까. 오늘의 TMI. ‘노담’ 청소년 늘었다. 트럼프 500대 부자...\nThe post 양심을 찌른 사건, 그들에게 채수근은 2등 시민이었다: 슬로우레터 3월29일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106176",
          "publishedOn": "2024-03-28T21:59:13.000Z",
          "wordCount": null,
          "title": "양심을 찌른 사건, 그들에게 채수근은 2등 시민이었다: 슬로우레터 3월29일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106172",
          "author": "강형철",
          "description": "오늘 아침 갑작스러운(?) 서울 시내버스 파업으로 많은 시민이 당혹함 속에서 어려움을 겪었습니다. 어떻게 파업이 하룻밤 새에 실행될 수 있을까요? 언론의 환경감시 기능 부실 혐의가 짙습니다. 이미 노조는 협상 결렬 후 파업을 예고했고 어젯밤이 마지막 협상이었다고 하지요. 그런데 언론들은 시민들이 어떻게 해야 하는지 미리 알려주는 것은 언감생심이고 실제적인 파업 가능성 자체를 인지하기 어렵게 했습니다. 그리고 아침이...\nThe post 갑작스러운 버스 파업이요? 실은 총선에 밀려 구석에 처박혔죠 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106172",
          "publishedOn": "2024-03-28T09:22:50.000Z",
          "wordCount": null,
          "title": "갑작스러운 버스 파업이요? 실은 총선에 밀려 구석에 처박혔죠",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106126",
          "author": "이정환",
          "description": "8일 동안의 전쟁. 윤석열의 급식 봉사. 혐오 vs. 혐오. 국회를 세종으로. 쟁점과 현안. “대통령이 우리한테 쓴 약 먹여도.” 비동의 강간죄, 공약집에 넣었다 뺐다. 2000명=윤석열의 불통. 더 깊게 읽기. 한동훈의 화법. 삼성 노조 와해, 항소 포기. 다르게 읽기. 수업 시간 몰래 녹음, 크게 늘었다. 독점의 개념을 다시 써야 한다. 소선거구제의 모순, 보수의 자승자박. 해법과 대안. ‘더...\nThe post 보수 진영의 때늦은 후회, 완전 연동형이라면 어땠을까: 슬로우레터 3월28일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106126",
          "publishedOn": "2024-03-27T22:10:30.000Z",
          "wordCount": null,
          "title": "보수 진영의 때늦은 후회, 완전 연동형이라면 어땠을까: 슬로우레터 3월28일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106105",
          "author": "민주언론시민연합",
          "description": "요약 주요 이슈 1. ‘이종섭 호주 대사 논란’ 보도건수‧노출시간이 모두 1위 2. 윤석열-한동훈 갈등이 주요 이슈로 부상 3. 더불어민주당 강북을 공천 논란, 국민의힘 비례공천 논란 보도 압도 4. 한동훈 위원장 지원 유세 발언, 이재명 대표보다 많아 5. 판세-여론조사 보도 본격화 6. 공약-의제 이슈 10위권 밖 7. 조국혁신당 지속 보도 언론사별 주요 이슈 1. KBS 이종섭...\nThe post ‘런종섭’이 지배한 한 주: 2024 총선 포털뉴스 (3월 셋째 주) appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106105",
          "publishedOn": "2024-03-27T11:03:35.000Z",
          "wordCount": null,
          "title": "‘런종섭’이 지배한 한 주: 2024 총선 포털뉴스 (3월 셋째 주)",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105650",
          "author": "민노씨",
          "description": "[제네바 오전 8시] 이상헌(ILO 고용정책국장)이 전하는 노동과 세계 그리고 인간에 관한 이야기… 지난 3월 8일은 세계 여성의 날. 연례행사처럼 발표된 유리천장 지수는 12년째 꼴찌, 성별 임금 격차는 OECD 1위. 꼴찌와 1등: 유리천장 지수 꼴찌, 성별 임금 격차 1등 지난 3월 8일은 세계 여성의 날이었다. 이코노미스트가 유리천장 지수를 발표했다. 한국은 12년째 꼴찌다. 이제는 익숙한 연례행사. 거기에...\nThe post 한국에서 여성으로 노동한다는 것: 비혼과 저출산이라는 개인적 합리성과 사회적 실패 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105650",
          "publishedOn": "2024-03-27T08:25:21.000Z",
          "wordCount": null,
          "title": "한국에서 여성으로 노동한다는 것: 비혼과 저출산이라는 개인적 합리성과 사회적 실패",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106060",
          "author": "이정환",
          "description": "“총선 이후가 두렵다.” “대파는 문재인 때 더 비쌌다.” 한 단이냐 한 뿌리냐. ‘대파 게이트’, 국민의힘도 화들짝. 쟁점과 현안. 꼬이는 의정 갈등. 2000명 고집하지 말자는데. 조국 펀드, 1시간도 안 돼 200억 원 모았다. 더 깊게 읽기. 범야권 200석 불가능하지 않다. 결국 투표율이 변수. 다르게 읽기. 압수수색은 다 들고 가라는 치트키가 아니다. 해법과 대안. 다문화 학생 늘어나는데....\nThe post ‘대파 게이트’, 윤석열의 고집이 논란을 키우고 있다: 슬로우레터 3월27일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106060",
          "publishedOn": "2024-03-26T22:05:23.000Z",
          "wordCount": null,
          "title": "‘대파 게이트’, 윤석열의 고집이 논란을 키우고 있다: 슬로우레터 3월27일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=106025",
          "author": "이정환",
          "description": "학교판 ‘오징어 게임’이라고 불렸던 ‘피라미드 게임’이 끝났다. 같은 이름의 네이버 웹툰을 원작으로 스트리밍 서비스 티빙에서 만든 드라마다. 이게 왜 중요한가. 피라미드 게임의 구조. 오징어 게임과 피라미드 게임은 다르다. 명자은과 성수지의 전혀 다른 해법. 핵심은. 못 본 척하는 친구가 문제 해결의 핵심이다. 결론.\nThe post “나는 방관자였습니다”: 드라마 ‘피라미드 게임’으로 보는 학폭의 해법. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/106025",
          "publishedOn": "2024-03-26T08:45:09.000Z",
          "wordCount": null,
          "title": "“나는 방관자였습니다”: 드라마 ‘피라미드 게임’으로 보는 학폭의 해법.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105987",
          "author": "이정환",
          "description": "“하야도 방법일 수 있다.” “이름뿐인 대통령 자리에 앉아있을 수 없다.” 탄핵 저지선도 위태롭다. 낙동강 벨트 분위기가 심상치 않다. 쟁점과 현안. 한동훈 효과, 하루도 안 갔다. 책으로 정치 배웠나, 중앙일보의 불만. 아이 셋 낳으면 ‘대학 무료’ vs. ‘1억 원’. 더 깊게 읽기. 20대 투표율이 관건이다. 60대 이상이 20+30대보다 더 많다. 구호를 읽어보자. 다르게 읽기. ‘경비견’ 조중동이...\nThe post 조국과 조선일보가 같은 이야기를 한 날: 슬로우레터 3월26일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105987",
          "publishedOn": "2024-03-25T22:10:17.000Z",
          "wordCount": null,
          "title": "조국과 조선일보가 같은 이야기를 한 날: 슬로우레터 3월26일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105970",
          "author": "민주언론시민연합",
          "description": "2024년 3월 21일 제22대 국회의원선거 제11차 선거방송심의위원회 회의가 열렸습니다. 이날 안건은 총 18건으로 의견진술 2건, 의결보류 후 이번 회차로 넘어온 안건 8건, 일반 안건 5건, 재심청구 3건이었습니다. 이미나 위원(한국미디어정책학회 추천)이 불참하여 8명이 의결에 참여했고 이번 회의부터 권재홍 위원(공정언론국민연대 추천)이 부위원장으로 참여하게 되었습니다. 심의한 18건 대상과 결과는 아래 표와 같습니다. MBC라디오 [신장식의 뉴스하이킥]이 낸 3건의 재심청구는...\nThe post 선방심의위, [신장식의 뉴스하이킥]에 8번째 법정제재 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105970",
          "publishedOn": "2024-03-25T08:59:21.000Z",
          "wordCount": null,
          "title": "선방심의위, [신장식의 뉴스하이킥]에 8번째 법정제재",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105965",
          "author": "참여연대 의정감시센터",
          "description": "한국 민주주의 진로에 중요한 변곡점이 될 제22대 국회의원 선거가 이제 곧 치러진다. 두루 알듯이 민주주의 체제는 주권자인 시민이 선거를 통해서 선출한 대표자에게 주권을 일정 기간(대통령 5년, 국회의원 4년) 위임하여 실현하는 체제다. 주권자인 시민과 대리인인 대표자 사이에는 주인과 대리인의 문제가 내재하고 있다. 정보의 비대칭성(information asymmetry)으로 인해서 선거에서 최적의 대리인을 선택하지 못하는 경우가 종종 발생한다. 윤석열 정부...\nThe post 분노와 증오의 정치 사이클 반복: 윤석열과 이재명은 원인이 아니라 현상이다 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105965",
          "publishedOn": "2024-03-25T06:56:26.000Z",
          "wordCount": null,
          "title": "분노와 증오의 정치 사이클 반복: 윤석열과 이재명은 원인이 아니라 현상이다",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105958",
          "author": "민주언론시민연합",
          "description": "각 정당이 공천을 마무리하고 본격적인 정책 발표와 선거운동에 나서고 있다. 그러나 여야 정치권은 여전히 한국 사회 앞에 놓인 복합 위기에 대한 대책과 미래에 대한 진지한 토론보다는 총선용 개발 공약, 선심성 공약, 재원 마련 계획도 불투명한 공약을 쏟아내는 중이다. 이에 더해 윤석열 대통령은 선거를 100여 일 앞둔 지난 1월부터 전국을 순회하면서 21차례에 걸쳐 부처별 업무보고를 대신한...\nThe post 2024 총선, 대통령으로부터 민주주의를 구하는 방법 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105958",
          "publishedOn": "2024-03-25T05:17:16.000Z",
          "wordCount": null,
          "title": "2024 총선, 대통령으로부터 민주주의를 구하는 방법",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105927",
          "author": "이정환",
          "description": "벌써 졌나, ‘멘붕’에 빠진 조중동. “윤석열이 결단해야 한다.” “다시 대통령이 드러나고 말았다.” 쟁점과 현안. 뚜껑 열면 다르다? 전문가들도 전망 뒤집는다. 한강 벨트도 민주당 강세. “한국의 X세대는 변종”, 조선일보의 깊은 좌절. “그냥 셰셰하면 된다.” 더 깊게 읽기. D-16, 윤석열의 카드는? 다르게 읽기. 20대 조국혁신당 지지율 논란. 20대 무당층이 크게 늘었다. 한동훈 유학설도 나온다. “자기 장사만 한다.”...\nThe post “윤석열이 드러나고 말았다”, ‘멘붕’에 빠진 조중동: 슬로우레터 3월25일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105927",
          "publishedOn": "2024-03-24T21:57:00.000Z",
          "wordCount": null,
          "title": "“윤석열이 드러나고 말았다”, ‘멘붕’에 빠진 조중동: 슬로우레터 3월25일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105903",
          "author": "민주언론시민연합",
          "description": "3월 둘째 주 종합편성채널 시사대담프로그램은 국민의힘과 더불어민주당 공천 후보들의 ‘막말 논란’이 주요 이슈였습니다. 국민의힘 도태우·장예찬·조수연 후보와 더불어민주당 정봉주·양문석 후보의 과거 망언이 알려지자 종편 시사대담은 자극적 막말을 다루는데 시간을 할애했습니다. TV조선, 정봉주 50분 vs 장예찬 6분 TV조선 [시사쇼 정치다] (3월 14일)는 첫 주제로 더불어민주당 정봉주(강북을) 후보의 설화를 다뤘습니다. 정봉주 후보는 2017년 유튜브 [정봉주의 전국구]에서 발목 지뢰를...\nThe post TV조선의 막말 보도: 정봉주 50분 vs 장예찬 6분 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105903",
          "publishedOn": "2024-03-22T03:42:45.000Z",
          "wordCount": null,
          "title": "TV조선의 막말 보도: 정봉주 50분 vs 장예찬 6분",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105867",
          "author": "이정환",
          "description": "“민주개혁세력 200석도 가능.” “국민의힘 100석도 힘들다.” 보수 유튜버들의 한동훈 손절. 윤석열은 술래잡기 중. 윤석열의 손을 떠났다. “탄핵 불가능하지 않다.” 쟁점과 현안. 이종섭은 수사받으러 온 게 아니었다. 부르면 ‘맹탕’, 늦추자니 ‘맹공’. 조수진 사퇴. 이런 것도 변호인가. 더 깊게 읽기. ‘손해 연금’을 선택하는 이유. 선거에 노동 의제가 없다. 다르게 읽기. 하청 직원 정규직으로 뽑았더니 100억 원. 해법과...\nThe post 보수 유튜버들이 한동훈 손절을 요구하고 있다: 슬로우레터 3월22일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105867",
          "publishedOn": "2024-03-21T22:09:20.000Z",
          "wordCount": null,
          "title": "보수 유튜버들이 한동훈 손절을 요구하고 있다: 슬로우레터 3월22일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105850",
          "author": "참여연대 사법감시센터",
          "description": "[참여연대 사법감시센터 ‘광장에 나온 판결’] 손연재 선수 명예훼손 댓글 단 혐의로 기소유예처분을 받은 신 모 씨에 대해서, 헌법재판소가 기소유예처분 취소를 결정했습니다! 언론과 대중의 관심을 받는 것은 늘 자극적인 사건들이다. 충격적인 범죄, 대대적인 압수·수색, 피의자의 구속, 유무죄 판결들. 우리가 접하는 형사사건은 대부분 이렇게 다가온다. 복잡한 사회, 바쁜 일상 속에 평범한 사람의 속상한 이야기 정도는 주목을 끌기...\nThe post 내 글은 절대 악플이 아니야: 리듬체조 선수 명예훼손 댓글 기소유예 취소 사건 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105850",
          "publishedOn": "2024-03-21T08:40:18.000Z",
          "wordCount": null,
          "title": "내 글은 절대 악플이 아니야: 리듬체조 선수 명예훼손 댓글 기소유예 취소 사건",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105825",
          "author": "슬로우뉴스",
          "description": "조수진은 자신의 성범죄자 변호 이력이 논란이 되자 말도 안 되는 해명을 내놓았다. MBC 라디오에 출연해서는 “변호사로서 직업윤리와 법에 근거해 변론했다”면서 “공직자에게 바라는 국민 눈높이가 다르다는 걸 느꼈다”고 한다. 기자들에게 보낸 메시지에서는 “성범죄자 변론을 맡은 것과 블로그를 통해 이런 사실을 홍보한 것은 변호사로서 윤리 규범을 준수해 이뤄진 활동”이었다면서 앞으로 “국민 눈높이를 가치의 척도로 삼겠다”고 밝혔다. 즉,...\nThe post 조수진의 직업윤리는 틀렸다 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105825",
          "publishedOn": "2024-03-21T06:32:46.000Z",
          "wordCount": null,
          "title": "조수진의 직업윤리는 틀렸다",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105801",
          "author": "이정환",
          "description": "황상무 사퇴와 이종섭 귀국, 예상보다 빨랐다. 다 해결된 것 맞나. 쟁점과 현안. 의대 2000명 증원 강행. 지역 의료 강화 맞나. 조국혁신당 지지율 30%도 넘었다. “길에서 배지 주웠다.” 이재명의 자신감. 친윤-친한, 건널 수 없는 강을 건넜다. ‘한동훈의 시간’이 다시 올까. 다르게 읽기. 삼성이 삼성 같지 않다. “한국에서 RE100 하기 어렵다.” 더 깊게 읽기. 행동대장 윤석열, 게도...\nThe post “다 해결됐다”던 한동훈이 “내가 관둘게요”했던 이유: 슬로우레터 3월21일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105801",
          "publishedOn": "2024-03-20T22:04:14.000Z",
          "wordCount": null,
          "title": "“다 해결됐다”던 한동훈이 “내가 관둘게요”했던 이유: 슬로우레터 3월21일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105789",
          "author": "민주언론시민연합",
          "description": "요약 주요 이슈 1. 공천 윤곽 드러나자 공천취소 후보자 ‘막말’ 보도 급증 ① 국힘 역사왜곡 발언 잇딴 논란 ② 민주당 ‘목발 경품’ 정봉주 발언 이슈 2. ‘런종섭 사태’ 총선 주요 이슈로 급부상 3. ‘막말, 비리, 일탈’ 등 자극적 뉴스 급증 4. ‘민주당 공천+조국혁신당’ 보도량 1위 ① 불변의 ‘이재명+공천논란’ 프레임 ② 조국혁신당 보도량 2위 5. 정당...\nThe post 망언은 공천 취소를 남기고…: 2024 총선 포털뉴스 분석 (3월 둘째 주) appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105789",
          "publishedOn": "2024-03-20T08:13:32.000Z",
          "wordCount": 6856,
          "title": "망언은 공천 취소를 남기고…: 2024 총선 포털뉴스 분석 (3월 둘째 주)",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/03/433745441_8052578011475443_6355327764354809255_n.jpg"
        },
        {
          "id": "https://slownews.kr/?p=105782",
          "author": "자작나무",
          "description": "[파묘] (2024) 제작진은 [건국전쟁] 김덕영 감독에게 명절마다 한우선물세트를 보내야 한다. 그가 좌파 어쩌고저쩌고 흰소리한 덕분에 수많은 사람이 [파묘]에 더 관심을 품게 됐다. 권좌에서 쫓겨난다고 외국으로 도망간 한민족 역사상 전무후무한 최고 권력자였던 이승만을 ‘오구오구’ 하는 뇌 구조를 가진 분이 비난하는 영화라면 틀림없이 괜찮은 영화일 테니까. 그런 연유로 우리 가족도 오랜만에 주말에 극장에 갔다. 이 자리를 빌려...\nThe post [파묘], 진짜 쇠말뚝은 다른 곳에 있다 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105782",
          "publishedOn": "2024-03-20T06:50:50.000Z",
          "wordCount": 5468,
          "title": "[파묘], 진짜 쇠말뚝은 다른 곳에 있다",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/03/GettyImages-a12281942.jpg"
        },
        {
          "id": "https://slownews.kr/?p=105041",
          "author": "민노씨",
          "description": "[캡:콜드케이스] 미디어를 통해 반영·증폭·구성되는 문제적 현상과 사고방식을 ‘캡콜드’ 김낙호 교수가 명쾌하게 분석합니다. 오늘 케이스는 이강인 탁구 스캔들과 이슈 쏠림. ‘나는 무엇을 해야 하는가’라는 질문에 답하려면, ‘내가 어떤 이야기의 일부라고 생각하는가’라는 선행 질문에 답할 수 있어야만 한다. 제프리 R. 핼버슨, H.L. 구달 주니어. & 스티븐 R. 코먼., ‘마스터 내러티브란 무엇인가’, 마스터 내러티브와 이슬람 극단주의. 2011. “부처의 눈에는...\nThe post 이강인 탁구 스캔들과 이슈 쏠림: 어젠다 세팅에서 어젠다 키핑으로 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105041",
          "publishedOn": "2024-03-20T03:15:28.000Z",
          "wordCount": 8508,
          "title": "이강인 탁구 스캔들과 이슈 쏠림: 어젠다 세팅에서 어젠다 키핑으로",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/03/pic_014-2.jpg"
        },
        {
          "id": "https://slownews.kr/?p=105738",
          "author": "이정환",
          "description": "한동훈의 고백? 조선일보가 1면에 끌어올린 이유. 윤-한 갈등의 본질은 총선 주도권. 한동훈 ‘마이웨이’ 누가 말리겠나. “수도권 15석도 못 건질 판”, 국민의힘 후보들 아우성. 윤석열이 물러설까. 쟁점과 현안. 대통령 오는 날 대파 가격이 내려갔다. 박용진의 두 번째 좌절. 비슷한 공약에 재원은 ‘묻지 마’. 다르게 읽기. 대안도 없이 불쑥 던질 일인가. “이종섭 직권 남용 아니다”, 조선일보의 반격....\nThe post “남은 3년 동안 뭐할 건가”, 조선일보의 깊은 탄식: 슬로우레터 3월20일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105738",
          "publishedOn": "2024-03-19T22:08:23.000Z",
          "wordCount": 7140,
          "title": "“남은 3년 동안 뭐할 건가”, 조선일보의 깊은 탄식: 슬로우레터 3월20일.",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/03/0002681584_001_20240319221506594.jpg"
        },
        {
          "id": "https://slownews.kr/?p=105703",
          "author": "민주언론시민연합",
          "description": "억지 설정과 무리한 전개를 거듭하면 ‘막장드라마’가 된다. 과장된 캐릭터, 비약과 궤변, 황당한 결말이 반복되면 사람들은 ‘개연성 없는 막장드라마’라며 손가락질한다. 자극적이고 퇴폐적인 막장드라마의 단 하나 장점을 꼽는다면 그래도 결말은 권선징악이란 점이다. 그런데 2024년 현재, 서울시 목동 방송회관에서 매주 라이브로 펼쳐지는 장면들은 그 단 하나의 장점조차 갖추지 못했다. 제22대 총선을 앞두고 구성된 선거방송심의위원회(이하 선방심의위)는 1997년 선방심의위가 법정기구로...\nThe post 선거방송심의위, 초현실적인 막장드라마 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105703",
          "publishedOn": "2024-03-19T02:45:06.000Z",
          "wordCount": null,
          "title": "선거방송심의위, 초현실적인 막장드라마",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=104532",
          "author": "민노씨",
          "description": "[제네바 오전 8시] 이상헌(ILO 고용정책국장)이 전하는 노동과 세계 그리고 인간에 관한 이야기. ‘노동시간’ 본격 썰 3탄. 주4일제, 이름만큼 혁신적인가? 제오시 ‘노동시간’ 특집 현실성 있는 논의인가? 현재는 개별 기업과 노조 중심의 논의에 머물고 있다. 그것도 일부 대기업에 한정되는 주제다. 정부가 고민할 단계로 보기엔 시기상조다. 우선순위에서는 한참 후순위일 것으로 보이고, 현재 동력도 없으며, 동력을 만들어내기도 쉽지 않을...\nThe post 주4일제, 이름만큼 혁신적인 논의 아니다 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/104532",
          "publishedOn": "2024-03-19T01:16:26.000Z",
          "wordCount": null,
          "title": "주4일제, 이름만큼 혁신적인 논의 아니다",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105670",
          "author": "이정환",
          "description": "윤석열-한동훈의 2차 충돌. 8년 전 ‘옥새 파동’의 기시감. “대통령이 이상하다”, 조선일보의 불만. 박력만큼 넘치지 않는 정교함. 이러고도 선거 이기겠나. 한동훈도 지쳤나. 쟁점과 현안. ‘마사중’으로 가는 이준석. 조국혁신당 박은정이 1번. 조국혁신당 인기 이유는. 국민의미래 비례 두고 부글부글. 더 깊게 읽기. 윤석열은 요즘. 2000명 증원 변함없다. 푸틴 87% 득표로 5선. 다르게 읽기. 통계 조작, 검찰은 못 본...\nThe post “대통령이 이상하다”는 조선일보와 세상 평화로운 윤석열: 슬로우레터 3월19일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105670",
          "publishedOn": "2024-03-18T22:04:42.000Z",
          "wordCount": null,
          "title": "“대통령이 이상하다”는 조선일보와 세상 평화로운 윤석열: 슬로우레터 3월19일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105595",
          "author": "이정환",
          "description": "판이 기울었다. 윤석열 싫지만 지지 정당 없는 20%. ‘의-정’ 갈등 한 달, 여론이 식고 있다. 쟁점과 현안. 도태우-정봉주-장예찬-양문석. “임금 욕도 하는데.” 현역 물갈이, 민주당은 늘고 국민의힘은 줄었다. 더 깊게 읽기. ‘부르면 귀국’ 말고 ‘당장 귀국’해야 한다. 한동훈도 화들짝. 누가 먼저 움직일까. 윤석열은 왜 그랬을까. SWOT로 본 선거 판도. 다르게 읽기. 빛났던 민주당 영입 인재들. 하우스...\nThe post 다시 한동훈-윤석열 대결 구도, 조중동의 초조함이 느껴진다: 슬로우레터 3월18일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105595",
          "publishedOn": "2024-03-17T22:04:15.000Z",
          "wordCount": null,
          "title": "다시 한동훈-윤석열 대결 구도, 조중동의 초조함이 느껴진다: 슬로우레터 3월18일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105585",
          "author": "민주언론시민연합",
          "description": "2024년 3월 14일 제22대 국회의원선거 제10차 선거방송심의위원회 회의가 열렸습니다. 이날 안건은 총 15건으로 의견진술 4건, 의결보류 후 이번 회차로 넘어온 안건 1건, 일반 안건 10건이었습니다. 일반 안건은 3건만 심의하고 7건은 다음 회차로 미뤘습니다. 일신상 이유로 사퇴를 표명한 최창근 부위원장(한국방송기자클럽 추천) 후임 보궐로 위촉된 김문환(성신여대 미디어커뮤니케이션학과 초빙교수, 전 SBS 기자) 위원이 이날 참여했습니다. 김문환 위원이 세...\nThe post 신방과 교수 경력 33년 걸고 ‘MBC 미세먼지 1’ 비판한 백선기 선방심의위원장 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105585",
          "publishedOn": "2024-03-16T03:12:16.000Z",
          "wordCount": null,
          "title": "신방과 교수 경력 33년 걸고 ‘MBC 미세먼지 1’ 비판한 백선기 선방심의위원장",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105581",
          "author": "민주언론시민연합",
          "description": "중앙일보가 3월 첫째 주 포털 네이버 메인뉴스(6개)를 통해 가장 오래 보도한 선거, 정당 관련 기사는 무엇일까? 민언련 총선보도 모니터링 데이터에 따르면, [전여옥 “김신영, 문재인 시계 자랑해서 잘렸다? 황당”] (3월 6일 정시내 기자)가 가장 오래 보도되었다. 전여옥 전 새누리당 의원이 방송 관련 사안에 대해 좌파 커뮤니티 활동을 비판한 내용이다. 언론사는 중요한 뉴스일수록 해당 기사를 중요한 위치에...\nThe post 유동적 저널리즘: 보도 건수를 넘어 보도 시간이 중요하다 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105581",
          "publishedOn": "2024-03-15T11:12:35.000Z",
          "wordCount": null,
          "title": "유동적 저널리즘: 보도 건수를 넘어 보도 시간이 중요하다",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105574",
          "author": "민주언론시민연합",
          "description": "종합편성채널 시사대담프로그램에는 국민의힘과 더불어민주당의 선거유세 현장이 자주 등장합니다. 지원유세 보도량과 화면구성에서도 차이가 드러나지만, 보도 논조도 다른데요. 국민의힘의 경우 한동훈 비대위원장 지원유세 일정을 따라가며 현장의 긍정적인 분위기를 전하는 데 열심이지만, 더불어민주당에 대해서는 이재명대표 지원유세보다는 논란을 전하는 데 시간을 할애합니다. 특히 일부 종편엔 한동훈 비대위원장의 유년시절 사진까지 등장하며 ‘한동훈 띄우기’에 집중하고 있는데요. 여야 선거유세 현장을 전하는 종편...\nThe post 한동훈의 어린시절! 하하 너무 귀여워!! 한동훈과 사랑에 빠진 채널A appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105574",
          "publishedOn": "2024-03-15T10:41:04.000Z",
          "wordCount": null,
          "title": "한동훈의 어린시절! 하하 너무 귀여워!! 한동훈과 사랑에 빠진 채널A",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105428",
          "author": "정호재",
          "description": "[정호재의 아시안 퍼스펙티브] 가깝도고 먼 ‘동남아시아’를 통해 한국을 바라보고 아시아 시대를 꿈꿉니다. 한겨레 지금은 한국의 언론사에 규모의 차이만 남았지만, 1990년대 대학을 다닌 사람들에게 ‘한겨레’는 더 특별했고, 한겨레에 관한 애정과 심적 부채감이 상당했다. 그러니까 창간 직후 ‘한겨레 신문’이라는 건, 일종의 민주주의 운동 혹은 언론 운동의 개념이었고, 그것을 인지한 대학생들은 없는 쌈짓돈을 털어서, 적어도 학회실에서라도 한겨레를 구독해...\nThe post 정문태, 골든 트라이앵글의 고독한 취재기자 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105428",
          "publishedOn": "2024-03-15T09:31:44.000Z",
          "wordCount": null,
          "title": "정문태, 골든 트라이앵글의 고독한 취재기자",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105454",
          "author": "이상헌",
          "description": "[제네바 오전 8시] 이상헌(ILO 고용정책국장)이 전하는 노동과 세계 그리고 인간에 관한 이야기. 오늘은 한국은행 ‘돌봄노동’ 해법에 관한 이상헌 박사의 칼럼. 외국인 노동자 X 차등적 최저임금 문제 슬로우뉴스는 노동과 경제의 세계에서 개인과 공동체가 공존하는 조화로운 방법론을 고민하는 이상헌 박사(ILO 고용정책국장)와 ‘제네바 오전 8시(제오시)’ 연재를 진행하고 있습니다. 그런데 오늘은 좀 특별하게 인터뷰가 아닌 칼럼입니다. (^^) 주제는 이상헌...\nThe post 요술 방망이는 없다: ‘외국인 노동자 차등적 최저임금’으로 돌봄노동 해결은 불가능하다 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105454",
          "publishedOn": "2024-03-15T07:10:43.000Z",
          "wordCount": null,
          "title": "요술 방망이는 없다: ‘외국인 노동자 차등적 최저임금’으로 돌봄노동 해결은 불가능하다",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105185",
          "author": "박미숙",
          "description": "[박미숙의 새 필드] 한국학이 활발한 영국 셰필드에서 대중문화를 공부한 박미숙 박사와 함께 미디어에 비친 우리 자신의 모습을 이야기합니다. 오늘 추가할 새 필드는 KBS에서 사라진 여자들. [뉴스9], [역사저널 그날], [홍김동전], [옥탑방의 문제아들], [전국노래자랑]. 여성이 단독으로 혹은 주도적으로 진행했던 프로그램들이다. 그리고 지금은 폐지되거나 남성으로 진행자가 교체된 프로그램들이다. 사라진 여성들은 다음과 같다. 물론 사라지거나 교체된 프로그램이 이것들만 있는...\nThe post KBS 이별법: 이별에도 예의가 있다는데… appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105185",
          "publishedOn": "2024-03-15T02:08:08.000Z",
          "wordCount": null,
          "title": "KBS 이별법: 이별에도 예의가 있다는데…",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105504",
          "author": "이정환",
          "description": "도태우와 정봉주 둘 다 공천 취소. 그래도 박용진은 안 된다? 막말 퍼레이드. 쟁점과 현안. “MBC는 잘 들어.” 이종섭 리스크, 한동훈이 나설까. 색깔론에 휘둘리는 민주당. 다르게 읽기. “인권 외쳐왔던 민주당 맞나.” 의대 증원 80% 지역에 배분한다. 더 깊게 읽기. 부동산 통계 조작, 재판까지 간다. 선거제 개편, 국회에 맡겨서는 안 된다. 해법과 대안. 어촌계 진입 장벽 낮추자...\nThe post 그러다 칼 맞는다? 황상무 “MBC 잘 들어” 발언의 의미는: 슬로우레터 3월15일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105504",
          "publishedOn": "2024-03-14T22:04:48.000Z",
          "wordCount": null,
          "title": "그러다 칼 맞는다? 황상무 “MBC 잘 들어” 발언의 의미는: 슬로우레터 3월15일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105451",
          "author": "이정환",
          "description": "선거가 한 달도 남지 않았다. 오늘은 선거와 경제를 주제로 이야기해 보자. 한국은 원래 지역 구도가 강하다고 하지 않나. 이번 선거는 다를 거라고 보나. 지역 구도가 확고하다면 결국 수도권이 변수가 될 텐데, 지난 총선에서는 민주당이 압승하지 않았나. 서울과 경기도의 정치적 성향 차이를 뭐라고 봐야 하나. 한강벨트의 최대 현안은 결국 부동산이라고 봐야 하는 건가. 종부세 내는 사람들이...\nThe post 선거의 경제학: 우리는 왜 계급을 배반하는 투표를 하는가. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105451",
          "publishedOn": "2024-03-14T08:32:17.000Z",
          "wordCount": 6592,
          "title": "선거의 경제학: 우리는 왜 계급을 배반하는 투표를 하는가.",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/03/img_1707264070_AU7HM.jpg"
        },
        {
          "id": "https://slownews.kr/?p=105432",
          "author": "이장규",
          "description": "노동당 비례후보를 알리고자 지지 당부 글을 썼다. 두 가지 비판이 있었다. 그 비판에 답한다. 당장의 승패보다 더 중요한 것 첫 번째 비판 취지를 요약하면 다음과 같다: 내 글이 상당 정도 패배주의적이라는 데 동의한다. 원래 내가 강한 이상주의적 지향과 강한 현실주의적 판단을 동시에 지닌 좀 모순적인 사람이다. 하긴 사람은 누구나 일정 부분 모순적이니까 이게 나만 무슨...\nThe post 능력주의를 넘어서: 나를 대변해 주는 정당이 아니라 내가 함께하는 정당 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105432",
          "publishedOn": "2024-03-14T07:04:52.000Z",
          "wordCount": null,
          "title": "능력주의를 넘어서: 나를 대변해 주는 정당이 아니라 내가 함께하는 정당",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105400",
          "author": "이정환",
          "description": "“이종섭 임명 철회해 달라.” 이종섭은 윤석열 전화를 받았을까. 범죄 전문가 윤석열이 몰랐을까. 쟁점과 현안. 병역 기피냐 양심적 병역 거부냐. ‘수박 척결’ 양문석도 공천 안착. 또 시작된 의원 꿔주기 꼼수. 한동훈 한계론. 더 깊게 읽기. 시스템 공천에 숨은 ‘악마의 디테일’. 윤석열의 포퓰리즘 901조 원. 다르게 읽기. 도제식 의사 교육, 이대로 좋은가. 대형 병원의 박리다매식 경영. 해법과...\nThe post ‘런종섭’ 논란과 박근혜 탄핵의 공통점, 범죄 전문가 윤석열이 간과한 사실: 슬로우레터 3월14일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105400",
          "publishedOn": "2024-03-13T22:03:58.000Z",
          "wordCount": null,
          "title": "‘런종섭’ 논란과 박근혜 탄핵의 공통점, 범죄 전문가 윤석열이 간과한 사실: 슬로우레터 3월14일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105388",
          "author": "민주언론시민연합",
          "description": "종합편성채널 시사대담프로그램은 더불어민주당 ‘공천 논란’에 대해 적극 보도하고 있습니다. 3월 첫째 주에는 권향엽(순천·광양·곡성·구례을) 후보 사천 논란과 더불어민주당 중진 의원들의 컷오프와 탈당 소식이 주요하게 다뤄졌는데요. 반면, 국민의힘의 유영하(대구 달서갑) 후보 공천논란을 비롯해 시스템 공천이 아니라고 비판하며 컷오프에 반발한 국민의힘 의원들의 소식은 짧게 전하는 수준에 그쳤습니다. 민주당 253분 vs 국힘 56분 조용한 공천이라 평가받던 국민의힘에서도 공천에서 탈락한...\nThe post 민주당 ‘편애’하는 종편: 공천 논란 보도량, 국힘보다  4.5배 많았다 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105388",
          "publishedOn": "2024-03-13T13:04:26.000Z",
          "wordCount": null,
          "title": "민주당 ‘편애’하는 종편: 공천 논란 보도량, 국힘보다  4.5배 많았다",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105191",
          "author": "김훤주",
          "description": "[김훤주의 지역에서 본 세상] 베테랑 기자 김훤주가 잘 드러나지 않은 세상 이야기를 따뜻하고 담백한 시선으로 전합니다. 우리가 절에 가면 수많은 부처님을 만날 수 있다. 가장 손쉽게 볼 수 있는 것은 2500년 전에 룸비니에서 태어난 고타마 싯다르타 석가모니불(Gautama Buddha)이다. 부처님은 이 밖에도 많지만 보통 사람들에게 익숙한 것만 해도 미륵불·비로자나불·아미타불·약사여래불 등 여럿이 있다. 그런데 이들 부처님을 보면...\nThe post 수입 부처만 있나? 우리나라 토종 부처도 있다! appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105191",
          "publishedOn": "2024-03-13T11:39:43.000Z",
          "wordCount": null,
          "title": "수입 부처만 있나? 우리나라 토종 부처도 있다!",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105361",
          "author": "민주언론시민연합",
          "description": "요약 주요 이슈 1. 민주당 “비명횡사” VS 국힘 “조용한 공천” 2. 조국혁신당 돌풍 주목 3. 조중동, 성일종 친일발언·정우택 금품수수 의혹 외면 “(이토 히로부미에 관해) 한반도에 끔찍한 사태를 불러온 인물이고 그만큼 우리에게 불행한 역사이지만, (일본이) 우리보다 먼저 인재를 키웠던 선례” 성일종, 2024년 3월 3일 서산장학재단 장학금 전달식. 4. 공천확정 선거구 중심으로 ‘선거지역, 인물’ 부상 5. 선거운동...\nThe post ‘조국혁신당 누구?’ 악플보다 무서운 KBS의 무플: 2024 총선 포털뉴스 분석(3월 첫째 주) appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105361",
          "publishedOn": "2024-03-13T09:17:52.000Z",
          "wordCount": null,
          "title": "‘조국혁신당 누구?’ 악플보다 무서운 KBS의 무플: 2024 총선 포털뉴스 분석(3월 첫째 주)",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105337",
          "author": "이정환",
          "description": "한 놈만 팬다, 조국혁신당의 바람몰이. 조국이 ‘샤이 진보’를 불러낸다고? 쟁점과 현안. 5.18 망언 도태우를 안고 간다. 종북 논란 전지예‧정영이는 사퇴. 조국혁신당 비례 후보에 101명 몰렸다. 민주당은 비명횡사 넘어 비명궤멸로. 민주당 위성정당 비례 후보 확정. 더 깊게 읽기. 10대 공약 살펴보니. 의료 대란의 역습. 보수 언론의 경고. 의대 교수들도 합류한다. 의료 붕괴의 현장, 울산을 보라. 다르게...\nThe post 한 달은 길다, 국민의힘에 쏟아지는 악재: 슬로우뉴스 3월13일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105337",
          "publishedOn": "2024-03-12T22:03:51.000Z",
          "wordCount": null,
          "title": "한 달은 길다, 국민의힘에 쏟아지는 악재: 슬로우뉴스 3월13일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105292",
          "author": "참여연대 의정감시센터",
          "description": "최근 우리 사회의 정치적 진영 대립과 갈등 정도가 이만저만이 아니다. 정파적 대립과 양극화는 비단 정치 영역에만 국한된 것이 아니라 경계를 넘어 비정치적 영역의 일상까지도 파고들고 있다. 양극 정치 갈등…대한민국 역시나 1등 한국 사회의 이념 대립과 정치 양극화가 심각하다는 사실은 일반 국민의 인식 속에서도 잘 드러나고 있다. 지난 2022년에 미국의 대표적 조사기관인 퓨리서치 센터(Pew Research Center)가...\nThe post 우리가 저들을 이길 수 있다면 민주주의쯤이야? … 공동체 망치는 ‘정서적 양극화’ appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105292",
          "publishedOn": "2024-03-12T03:17:10.000Z",
          "wordCount": null,
          "title": "우리가 저들을 이길 수 있다면 민주주의쯤이야? … 공동체 망치는 ‘정서적 양극화’",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105268",
          "author": "이정환",
          "description": "조국혁신당 돌풍, 조선일보의 불안. 사이다에 목말랐던 민주당 지지층이 흔들린다. 반윤 포위 구도. 박용진의 좌절. 쟁점과 현안. 종북횡재? 이재명의 선택은? 서울대 의대 교수들도 18일 사직 예고. 다르게 읽기. 공보의 차출하면 농어촌은 어떻게 하나. 69cm 잘라냈는데 다른 3647개 건물은? 더 깊게 읽기. “이해했다고 말하세요.” 해법과 대안. 폐지 줍는 노인 수입은 월 15만 원. 집 한 채에 1유로....\nThe post 제로섬 게임일까, 반윤 결집일까, 조국 돌풍에 조선일보가 긴장하는 이유: 슬로우레터 3월12일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105268",
          "publishedOn": "2024-03-11T22:04:28.000Z",
          "wordCount": null,
          "title": "제로섬 게임일까, 반윤 결집일까, 조국 돌풍에 조선일보가 긴장하는 이유: 슬로우레터 3월12일.",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "꿈꾸는섬",
      "feedUrl": "https://happist.com/feed",
      "siteUrl": "https://happist.com",
      "articles": [
        {
          "id": "https://happist.com/?p=594303",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594303/%ec%9b%b0%ec%8a%a4%ed%8c%8c%ea%b3%a0-sp-500-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2024-04-08T19:16:14.000Z",
          "wordCount": null,
          "title": "웰스파고, S&P 500 전망을 5535로 상향, 월가 최고 전망치 제시",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594295",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594295/4-5-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-04-05T00:47:18.000Z",
          "wordCount": null,
          "title": "4/5, 월가의  투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594290",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594290/%ea%b8%88%eb%a6%ac-%ec%9d%b8%ed%95%98-%ec%8b%9c%ea%b8%b0",
          "publishedOn": "2024-04-04T13:09:51.000Z",
          "wordCount": null,
          "title": "배런스, 연준 관계자들은 금리 인하 시기를 놓고 긴밀한 줄타기를 하고 있다",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594279",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594279/%ed%94%bc%ec%94%a8%eb%94%94%eb%a0%89%ed%8a%b8",
          "publishedOn": "2024-04-04T09:49:11.000Z",
          "wordCount": null,
          "title": "피씨디렉트",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594272",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594272/4-4-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-04-04T03:01:58.000Z",
          "wordCount": null,
          "title": "4/4, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594256",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/594256/1%eb%b6%84%ea%b8%b0-%ed%85%8c%ec%8a%ac%eb%9d%bc-%ed%8c%90%eb%a7%a4%eb%9f%89-%ed%8f%89%ea%b0%80",
          "publishedOn": "2024-04-03T07:09:51.000Z",
          "wordCount": 7489,
          "title": "1분기 테슬라 판매량을 보는 월가의 시각, 재앙이다. 테슬라 주가는 지속 하락 가능성",
          "imageUrl": "https://happist.com/wp-content/uploads/2022/12/테슬라-디스플레이를-조작하는-여인-Tesla-Photo-by-jenny-ueberberg.jpg"
        },
        {
          "id": "https://happist.com/?p=594254",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594254/1%eb%b6%84%ea%b8%b0-%ed%85%8c%ec%8a%ac%eb%9d%bc-%ed%8c%90%eb%a7%a4%eb%9f%89",
          "publishedOn": "2024-04-01T06:24:47.000Z",
          "wordCount": null,
          "title": "배런스, 1분기 테슬라 판매량은 예상보다 나을 수 있다.",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594241",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594241/3-29-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-03-29T00:04:00.000Z",
          "wordCount": null,
          "title": "3/29, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594227",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594227/3-27-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-03-27T02:14:00.000Z",
          "wordCount": null,
          "title": "3/27, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594222",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594222/%ec%98%a4%ed%8e%9c%ed%95%98%ec%9d%b4%eb%a8%b8-sp-500-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2024-03-26T13:18:38.000Z",
          "wordCount": null,
          "title": "오펜하이머, 2024년 S&P 500 전망을 5500으로 상향",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594220",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594220/%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%9d%b8%ea%b3%b5%ec%a7%80%eb%8a%a5-%ec%a7%80%eb%b0%b0%eb%a0%a5-%eb%8f%84%ec%a0%84-%ea%b8%b0%ec%97%85",
          "publishedOn": "2024-03-26T12:21:13.000Z",
          "wordCount": null,
          "title": "로이터, 엔비디아 인공지능 지배력에 도전하는 테크 기업들",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594218",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594218/%eb%a7%88%ec%9d%b4%ed%81%ac%eb%a1%a0-%ec%8b%a4%ec%a0%81-%ed%8f%89%ea%b0%80-2",
          "publishedOn": "2024-03-26T00:28:03.000Z",
          "wordCount": null,
          "title": "23년 4분기 마이크론 실적을 읽는 월가의 시선",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594210",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594210/3-26-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-03-26T00:21:03.000Z",
          "wordCount": null,
          "title": "3/26, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594205",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594205/%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%a0%84%eb%a7%9d-2",
          "publishedOn": "2024-03-25T13:57:34.000Z",
          "wordCount": null,
          "title": "테크크런치 엔비디아 전망, 엔비디아는 차세대 AWS가 될 것",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594199",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594199/%ea%b5%ac%ea%b8%80%ec%9d%98-ai-%ec%a0%84%ec%9f%81-%ec%8a%b9%eb%a6%ac-%ea%b0%80%eb%8a%a5%ec%84%b1",
          "publishedOn": "2024-03-25T10:46:05.000Z",
          "wordCount": null,
          "title": "웨드부시, 구글의 AI 전쟁 승리 가능성으로  알파벳 주가 15% 상승 제시",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594174",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594174/3-19-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-03-18T23:28:33.000Z",
          "wordCount": null,
          "title": "3/19, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594172",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594172/ai-%ec%a0%84%ec%9f%81%ec%9d%98-%ec%8a%b9%ec%9e%90%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-amd",
          "publishedOn": "2024-03-18T17:47:01.000Z",
          "wordCount": null,
          "title": "엔비디아를 이기지 않아도 AMD는 AI 전쟁의 승자가 될 수 있다.",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594155",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594155/3-16-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-03-16T02:07:16.000Z",
          "wordCount": null,
          "title": "3/16, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594138",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594138/3-15-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-03-14T22:54:06.000Z",
          "wordCount": null,
          "title": "3/15, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594135",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594135/3-13-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-03-12T23:58:11.000Z",
          "wordCount": null,
          "title": "3/13, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594121",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594121/3-12-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-03-12T00:06:25.000Z",
          "wordCount": null,
          "title": "3/12, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594119",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594119/%eb%aa%a8%ea%b1%b4%ec%8a%a4%ed%83%a0%eb%a6%ac-%ed%85%8c%ec%8a%ac%eb%9d%bc-%ec%a3%bc%ea%b0%80-%ed%95%98%eb%9d%bd-4%ea%b0%80%ec%a7%80-%ec%9a%94%ec%9d%b8",
          "publishedOn": "2024-03-11T22:20:33.000Z",
          "wordCount": null,
          "title": "모건스탠리, 테슬라 주가 하락 4가지 요인",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "NewsPeppermint",
      "feedUrl": "https://newspeppermint.com/feed/",
      "siteUrl": "https://newspeppermint.com",
      "articles": [
        {
          "id": "https://newspeppermint.com/?p=78731",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 2월 19일 스프에 쓴 글입니다. 백악관 기밀문서를 불법으로 유출해 가지고 있던 혐의로 검찰의 수사를 받은 미국 대통령은 도널드 트럼프뿐이 아닙니다. 조 바이든 대통령도 부통령 시절 접근할 수 있던 문서 가운데 들고 나오지 말았어야 할 → 더 보기",
          "link": "https://newspeppermint.com/2024/04/08/npsp_bidenage/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_bidenage",
          "publishedOn": "2024-04-08T22:59:04.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] ‘대통령 건강 문제’ 외면하는 민주당은 금기를 깰 수 있을까?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79082",
          "author": "NewsPeppermint",
          "description": "인공지능(AI), 범용 인공지능(AGI) 같은 단어가 더는 낯설지 않은 용어가 된 요즘입니다. 인류의 삶을 근본적으로 바꿔놓을 수 있는 잠재력을 지닌 강력하고 새로운 기술인 만큼 인공지능 시대를 맞아 논의하고 대비해야 할 것들도 많습니다. 그 가운데 우선순위로 꼽히는 것이 일자리가 어떻게 바뀔지, 인간의 노동은 얼마만큼의 가치를 인정받을지일 겁니다. 뉴욕타임스 칼럼니스트 피터 코이가 인공지능 시대의 도래가 지금의 일자리가 모두 사라지는 걸 의미하지는 않는다고 지적한 경제학자들의 의견을 모아 정리했습니다. 칼럼을 번역하고, 인공지능이 일자리의 미래에 미칠 영향에 → 더 보기",
          "link": "https://newspeppermint.com/2024/04/07/npsp_aijobs/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_aijobs",
          "publishedOn": "2024-04-08T02:15:43.000Z",
          "wordCount": null,
          "title": "인간보다 로봇에 더 혜택이 많은 미국, 우리는?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=78695",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 2월 12일 스프에 쓴 글입니다. 오늘날 우리는 물질이 넘쳐나는 풍요로운 자본주의 사회를 살고 있습니다. 돈만 있으면 대개 뭐든지 살 수 있지만, 바꿔 말하면 돈으로도 살 수 없는 것, 돈이 아무리 많아도 할 수 없는 → 더 보기",
          "link": "https://newspeppermint.com/2024/04/04/npsp_wealthpower/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_wealthpower",
          "publishedOn": "2024-04-04T22:59:38.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 부자들에게 더욱 더 보장된 ‘표현의 자유’는 괜찮을까",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79059",
          "author": "NewsPeppermint",
          "description": "얼마 전 아르헨티나에 다녀올 일이 있었습니다. 처음 가보는 나라에 오래 머물지도 않았지만, 현지 화폐로 환전할 때부터 색다른 경험의 연속이었습니다. 아르헨티나 국민은 지난해 말 대선에서 정치 신인인 하비에르 밀레이를 대통령으로 뽑았는데요, 오랫동안 집권한 페론주의 계열 포퓰리즘 정당에 이골이 난 결과라는 분석이 많았습니다. 고질병이라고 부르기도 머쓱할 만큼 만성적인 심각한 인플레이션을 잠재우겠다며, 밀레이 대통령은 강도 높은 개혁안을 앞세워 취임했습니다. 종종 과격하고 극단적인 언사로 ‘아르헨티나의 트럼프’로 불리기도 하는 밀레이 대통령의 취임 첫 100일을 분석한 → 더 보기",
          "link": "https://newspeppermint.com/2024/04/03/npsp_javiermilei/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_javiermilei",
          "publishedOn": "2024-04-03T22:59:29.000Z",
          "wordCount": null,
          "title": "환율도 제각각, 음식값도 매일 달라지는 ‘메시의 나라’, “다시 위대”해질 수 있을까",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79039",
          "author": "NewsPeppermint",
          "description": "실리콘 밸리 테크 기업들이 코로나19 때 ‘재미를 본’ 대량 해고를 통한 단기적인 주가 극대화 전략을 계속해서 사용하고 있습니다. 주가가 올라 주주들에게 이익이 돌아가면 모두가 좋은 이상적인 상황처럼 보일 수 있지만, 이러한 과정에서 철저히 배제되는 집단을 생각하면 마냥 좋은 일이라고 부르기 어렵습니다. 그 대표적인 이해관계자가 회사를 위해 일하는 임금 노동자들입니다. 전문 번역: 인간을 ‘믹서기 속의 삶’으로 몰아넣는 테크업계의 또 다른 유행 해설: 자본주의가 가장 마지막에 줄여야 하는 비용은 이것",
          "link": "https://newspeppermint.com/2024/04/01/npsp_techlayoffs/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_techlayoffs",
          "publishedOn": "2024-04-01T22:59:25.000Z",
          "wordCount": null,
          "title": "자본주의가 가장 마지막에 줄여야 하는 비용은 이것",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=78667",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 2월 7일 스프에 쓴 글입니다. 긱(gig)이란 영어 단어의 첫 번째 뜻은 크지 않은 규모로, 때론 즉흥적으로 진행하는 음악 연주나 코미디 공연입니다. 이어 두 번째 뜻이 일 또는 직장인데, 정규직보다는 임시로, 부정기적으로 하는 계약직 일자리나 → 더 보기",
          "link": "https://newspeppermint.com/2024/03/27/npsp_gigworkers/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_gigworkers",
          "publishedOn": "2024-03-27T22:59:09.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 이것은 “혁신의 탈을 쓴 불평등”인가 아닌가",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79011",
          "author": "NewsPeppermint",
          "description": "올해 들어 프랑스 도서 베스트셀러 상위권을 꾸준히 지켜오고 있는 역사학자 엠마누엘 토드의 신간 “서구의 몰락(La Défaite de l’Occident)”은 실패 끝에 추락하고 있는 미국의 리더십을 다룬 책입니다. 21세기 들어 미국 중심의 세계 질서에 회의가 들 때마다, 문제가 지적될 때마다 중국은 대안으로 꼽히는 나라 중 하나였습니다. 과연 지금도 그렇다고 할 수 있을까요? 엠마누엘 토드의 통찰을 분석한 크리스토퍼 콜드웰의 칼럼을 번역하고 싱가포르 난양공대의 중국 정치 전문가 이종혁 교수가 해설을 썼습니다. 전문 번역: 예언마다 적중시켰던 → 더 보기",
          "link": "https://newspeppermint.com/2024/03/27/npsp_chinaandthewest/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_chinaandthewest",
          "publishedOn": "2024-03-27T04:05:00.000Z",
          "wordCount": null,
          "title": "중국이 ‘서구의 대안’? 아니라는 게 확실해지고 있다",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=78996",
          "author": "NewsPeppermint",
          "description": "경제 지표만 보면 미국 경제는 분명 호황인데, 미국 사람들이 느끼는 체감 경기는 왜 이렇게 나쁜 걸까? 지난해 말부터 이 질문에 대한 직·간접적인 답을 찾는 칼럼과 해설만 벌써 여러 번 소개해 드렸습니다. 그런데 뉴욕타임스에 코로나19 팬데믹 때 미국 정부가 미국 역사에선 근래에 유례를 찾기 어려운 수준의 강력한 사회보장제도를 구축했다가 팬데믹이 끝나자 언제 그랬냐는 듯이 안전망을 걷어내 버려서 사람들이 계속해서 불안해한다는 주장을 담은 칼럼이 실렸습니다. 복지국가 미국은 어떻게 신기루처럼 왔다 사라졌는지, 선거를 앞두고 다시 제도가 마련될 가능성은 → 더 보기",
          "link": "https://newspeppermint.com/2024/03/24/npsp_ussocialsafety/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_ussocialsafety",
          "publishedOn": "2024-03-25T03:00:21.000Z",
          "wordCount": null,
          "title": "잠시 찾아왔다가 금방 사라진 ‘복지국가’ 미국, 그리고 지금은?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=78643",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 1월 31일 스프에 쓴 글입니다. 지난해 12월 30일, 사우스캐롤라이나주의 부촌 키아와 아일랜드 지역 경찰에 다급한 신고 전화가 접수됐습니다. 전 주 UN 미국 대사이자, 그에 앞서 사우스캐롤라이나 주지사를 두 번 지냈으며, 현재 공화당 경선에 참여하고 → 더 보기",
          "link": "https://newspeppermint.com/2024/03/21/npsp_swatting/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_swatting",
          "publishedOn": "2024-03-21T22:59:06.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 포퓰리즘 시대 전쟁이 된 선거, 결국 그들 손에 달렸다",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=78954",
          "author": "NewsPeppermint",
          "description": "통상 ‘미국의 언어’라고 하면 영어가 떠오르지만, 놀랍게도 미국에는 정부가 지정한 공용어가 없습니다. 가장 널리 쓰이는 건 영어지만, ‘이민자의 나라’ 답게 다양한 언어가 존재합니다. 일각에선 “효율적인 소통을 위해 영어만 사용하자”는 주장도 나오지만, 미국 사회에서 언어의 문제는 다른 모든 사안과 마찬가지로 인종 문제, 소수자와 이민자에 대한 차별과 맞닿아 있으므로 쉽게 결정할 수 없는 일입니다. 언어의 다양성에 관해선 올해 대선에 나설 두 후보의 생각도 꽤 달라 보입니다. 멸종위기 언어 연합 소속 활동가 로스 펄린이 쓴 → 더 보기",
          "link": "https://newspeppermint.com/2024/03/20/npsp_englishofficial/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_englishofficial",
          "publishedOn": "2024-03-20T17:30:21.000Z",
          "wordCount": 1428,
          "title": "영어 아닌 외국어 사용이 문제라고? ‘효율적 소통’ 이면에도 문제가 있다",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=78631",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 1월 29일 스프에 쓴 글입니다. 아직 280일도 더 남은 미국 대선 열기가 벌써부터 뜨겁게 달아오르고 있습니다. 공식 선거운동 기간이 따로 없는 미국에선 대선이 있는 해는 일 년 내내 선거 뉴스가 끊이지 않습니다. 지난 23일 뉴햄프셔 → 더 보기",
          "link": "https://newspeppermint.com/2024/03/18/npsp_inflationsnickers/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_inflationsnickers",
          "publishedOn": "2024-03-18T22:59:38.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] ‘장바구니 물가 상승’이나 ‘손실 회피 성향’이라고만 넘길 수 없는 것들",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=78909",
          "author": "NewsPeppermint",
          "description": "인류는 이미 80억 명 가까운 전체 인구가 먹고도 남을 만한 식량을 생산하고 있습니다. 통계에 따라 다르지만, 100억 명이 먹을 수 있는 식량을 생산하고 있다는 통계도 있습니다. 실제로 생산하는 식량이 그 정도이고, 잠재적인 생산력을 고려하면 생산량은 얼마든지 더 늘릴 수도 있습니다. 그런데도 여전히 인류는 기아와 기근을 해결하지 못하고 있습니다. 8년 전 곧 인류가 기근을 해결할 수 있을 거란 낙관적인 전망을 내놓았던 사람이 자신의 예측이 틀렸다며 뉴욕타임스에 칼럼을 썼습니다. 칼럼을 번역하고, 능력이 있는데도 → 더 보기",
          "link": "https://newspeppermint.com/2024/03/17/npsp_famine/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_famine",
          "publishedOn": "2024-03-17T22:20:10.000Z",
          "wordCount": null,
          "title": "여긴 굶주리고 저긴 식량 남고…이 또한 ‘정치의 실패’다",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=78582",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 1월 24일 스프에 쓴 글입니다. “미국은 이민자의 나라”라는 말은 식상하지만, 엄연한 사실이기도 합니다. ‘원래 미국인’이란 표현은 아메리카 원주민이 아닌 한 성립하지 않습니다. 당장 조 바이든 대통령이 아일랜드계 가톨릭 집안에서 태어났고, 도널드 트럼프 전 대통령도 → 더 보기",
          "link": "https://newspeppermint.com/2024/03/16/npsp_2024electionimmigration/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_2024electionimmigration",
          "publishedOn": "2024-03-16T22:59:59.000Z",
          "wordCount": 2521,
          "title": "[뉴페@스프] 몰려드는 이민자들, 미국 정치권이 해결할 수 있을까",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=78864",
          "author": "NewsPeppermint",
          "description": "한국 사회의 출산율은 매번 최저치를 경신하고, 평균 수명은 꾸준히 늘어나고 있습니다. 이는 곧 (초)고령 사회의 도래를 피할 수 없다는 말이기도 합니다. 특히 66세 이상 은퇴 연령층의 상대적 빈곤율은 40.4%로 OECD 국가 가운데 가장 높은 수준이고, 노령층의 경제적 양극화도 갈수록 심화하고 있으며, 부실한 연금 제도 때문에 나이가 들수록 빈곤율이 높아지는 특징도 보입니다. 우리 사회는 급격히 바뀔 인구구조에 얼마나 대비하고 있을까요? 우리보다는 조금 사정이 나아 보이는 미국에서도 제대로 된 고령 사회 담론이 부족하다는 지적이 → 더 보기",
          "link": "https://newspeppermint.com/2024/03/13/npsp_agingsociety/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_agingsociety",
          "publishedOn": "2024-03-13T14:00:28.000Z",
          "wordCount": null,
          "title": "곧 닥칠 ‘고령 사회’, 우리가 던져야 할 질문은 따로 있다",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=78566",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 1월 22일 스프에 쓴 글입니다. *** 아이오와 코커스에서 낙승한 뒤 쓴 칼럼에서 예상했듯이 트럼프는 결국, 공화당 후보로 사실상 낙점됐습니다. 글에서 꼽은 후보 가운데 지난주까지 경선에서 물러나지 않고, 트럼프와 경쟁했던 니키 헤일리 후보는 절대로 부통령 → 더 보기",
          "link": "https://newspeppermint.com/2024/03/12/npsp_trumpveep/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_trumpveep",
          "publishedOn": "2024-03-12T22:59:40.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] ‘트럼프 대세론’ 굳혀줄 부통령 후보는 누구일까?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=78860",
          "author": "NewsPeppermint",
          "description": "현재 성인 가운데 가장 젊은이들은 Z세대에 속합니다. 최근 미국 Z세대 안에서 남녀 간에, 성별에 따라 정치적인 성향 차이가 두드러진다는 조사 결과가 있었습니다. 성별에 따라 어려서부터 경험하는 것이 달라서 가치관에도 차이가 벌어진 데는 부모들의 교육 방침이 적잖은 영향을 미쳤다고 할 수 있습니다. 이에 관해 Z세대의 부모들인 X세대의 과보호를 지적한 칼럼이 뉴욕타임스에 올라왔습니다. 칼럼을 번역하고, 단지 성향 차이를 넘어 젠더 갈등 양상까지 보이고 있는 한국 사회에 주는 함의가 무엇인지 짚어봤습니다. 전문 번역: 점점 → 더 보기",
          "link": "https://newspeppermint.com/2024/03/12/npsp_gendergapgeneration/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_gendergapgeneration",
          "publishedOn": "2024-03-12T04:00:11.000Z",
          "wordCount": null,
          "title": "Z세대 가치관에 문제 있다? 그런데 부모인 X세대가 더 문제다?",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "WALLFLOWER",
      "feedUrl": "http://rss.egloos.com/blog/wallflower",
      "siteUrl": "http://wallflower.egloos.com",
      "articles": []
    },
    {
      "title": "내 마음의 풍경",
      "feedUrl": "https://rss.blog.naver.com/sellars.xml",
      "siteUrl": "https://blog.naver.com/sellars?fromRss=true&trackingCode=rss",
      "articles": []
    },
    {
      "title": "The ZipCPU by Gisselquist Technology",
      "feedUrl": "https://zipcpu.com/feed",
      "siteUrl": "https://zipcpu.com/",
      "articles": [
        {
          "id": "https://zipcpu.com/blog/2024/04/01/chasing-resets.html",
          "author": null,
          "description": "A true story.\n\n\nSome years ago, given a customer’s honest need and request, I proposed a\nchange to a client’s ASIC\nIP.  Specifically, I wanted to add CRC\nchecking,\nbased upon a CRC\nkept in an out-of-band memory\nregion, to verify the ability\nto properly read memory regions error free.  I said the change shouldn’t take\nmore than about two weeks, and I’d clean up some other problems I was aware of\nin the mean time.  This change solved an urgent problem, so he agreed\nto it.\nBy the time I was done, my 80 hr proposal had turned into 270+ hrs of work.\nBuild it well\nI’d like to start my discussion of what went wrong with a list of good\npractices to follow.\nFig 1. Basic test bench components\n\n\nJust as a background, a general test bench follows the format shown in Fig. 1,\non the right.  The “test be…",
          "link": "https://zipcpu.com/blog/2024/04/01/chasing-resets.html",
          "publishedOn": "2024-04-01T04:00:00.000Z",
          "wordCount": 3451,
          "title": "Chasing resets",
          "imageUrl": null
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}