{
  "sources": [
    {
      "title": "Alex Edwards",
      "feedUrl": "https://www.alexedwards.net/static/feed.rss",
      "siteUrl": "https://www.alexedwards.net/blog",
      "articles": []
    },
    {
      "title": "Arjun Sreedharan",
      "feedUrl": "https://arjunsreedharan.org/rss",
      "siteUrl": "https://arjunsreedharan.org/",
      "articles": []
    },
    {
      "title": "Beningo Embedded Group",
      "feedUrl": "https://www.beningo.com/feed/",
      "siteUrl": "https://www.beningo.com",
      "articles": [
        {
          "id": "https://www.beningo.com/?p=13695",
          "author": "Jacob Beningo",
          "description": "The IoT Online Conference is back, and this time the core focus is on IoT embedded systems and edge computing. This post will explore what will be happening at this year’s conference and how teams and developers can benefit. The IoT Online Conference Overview The IoT Online Conference will be taking place December 8 – … Continue reading The IoT Online Conference (2021)\nThe IoT Online Conference (2021) first appeared on Beningo Embedded Group.",
          "link": "https://www.beningo.com/the-iot-online-conference-2022/",
          "publishedOn": "2021-10-28T14:54:49.000Z",
          "wordCount": null,
          "title": "The IoT Online Conference (2021)",
          "itunes": {}
        },
        {
          "id": "https://www.beningo.com/?p=13678",
          "author": "Jacob Beningo",
          "description": "Several years ago, I never would have believed that embedded developers would use a tool like Visual Studio Code. Using a Microsoft product to develop embedded software seems ridiculous. Yet, I find myself using Visual Studio Code for development more than I use any other integrated development environment! In this post, I’ll share a little … Continue reading Embedded Development using Visual Studio Code\nEmbedded Development using Visual Studio Code first appeared on Beningo Embedded Group.",
          "link": "https://www.beningo.com/embedded-development-using-visual-studio-code/",
          "publishedOn": "2021-10-21T15:31:13.000Z",
          "wordCount": null,
          "title": "Embedded Development using Visual Studio Code",
          "itunes": {}
        },
        {
          "id": "https://www.beningo.com/?p=13674",
          "author": "Jacob Beningo",
          "description": "How do you know that your software is working the way that it is supposed to? You test it! The real question, though, is “How do you test it?”. In the old days, developers used to just manually test their software. Unfortunately, manual testing is not a great way to test software. The sheer number … Continue reading 3 Tips for Unit Testing Embedded Software\n3 Tips for Unit Testing Embedded Software first appeared on Beningo Embedded Group.",
          "link": "https://www.beningo.com/3-tips-for-unit-testing-embedded-software/",
          "publishedOn": "2021-10-14T14:35:46.000Z",
          "wordCount": null,
          "title": "3 Tips for Unit Testing Embedded Software",
          "itunes": {}
        }
      ]
    },
    {
      "title": "The Clean Code Blog",
      "feedUrl": "https://blog.cleancoder.com/atom.xml",
      "siteUrl": "http://blog.cleancoder.com/atom.xml",
      "articles": [
        {
          "id": "http://blog.cleancoder.com/uncle-bob/2021/10/28/functional-duplication.html",
          "author": null,
          "description": "I broke out my old Space War game a few days ago and decided to make a few changes to speed the game up and make it more fun to play.  In so doing I discovered a very interesting bug.\nOne of the changes I made was to populate the initial space with a few random bases scattered here and there.  This would allow the player some extra resources with which to battle the Klingons while building up a network of more bases.\nWhile I was playing the modified game, it crashed.  Hard.\nNow I wrote this with TDD, and I was very disciplined about the cleanliness of the code, and the test coverage.  So this was unexpected.  So I dug up all my old debugging skills from the pit in which I had buried them, and started to work out what was going on.\nIt wasn't long before I realized that crash was occuring be…",
          "link": "http://blog.cleancoder.com/uncle-bob/2021/10/28/functional-duplication.html",
          "publishedOn": "2021-10-28T00:00:00.000Z",
          "wordCount": 1877,
          "title": "Functional Duplications"
        }
      ]
    },
    {
      "title": "C++ Stories",
      "feedUrl": "https://www.cppstories.com/index.xml",
      "siteUrl": "https://www.cppstories.com/",
      "articles": [
        {
          "id": "https://www.cppstories.com/2021/more-refactor-into-uniqueptr/",
          "author": null,
          "description": "In the first part of our refactoring series, we covered (smart) pointers inside a function body; today, I’d like to show you cases for return types, data members, and a few others.\nLet’s jump in and replace some new() and delete!\nSee the first part\nThis article is the second in the series about refactoring with unique_ptr. You can read the first part here:\n6 Ways to Refactor new/delete into unique ptr - C++ Stories\nBasic assumptions\nThe code presented here will usually contain explicit new and delete, and we’d like to reduce their use and wrap resources (pointers) into RAII.\nWe’ll try to follow the rule: R.11: Avoid calling new and delete explicitly from the Core C++ Guidelines:\nThe pointer returned by new should belong to a resource handle (that can call delete). If the pointer returned b…",
          "link": "https://www.cppstories.com/2021/more-refactor-into-uniqueptr/",
          "publishedOn": "2021-11-08T06:55:00.000Z",
          "wordCount": 2189,
          "title": "6 More Ways to Refactor new/delete into unique ptr"
        },
        {
          "id": "https://www.cppstories.com/2021/smartptr-array/",
          "author": null,
          "description": "Smart pointers are very versatile and can hold pointers not only to single instances but also to arrays. Is that only a theoretical use case? or maybe they might be handy in some cases? Let’s have a look.\nSmart pointers for T[]\nAt C++ Stories, you can find lots of information about smart pointers - see this separate tag for this area. For completeness, I’d like to mention an interesting issue on smart pointers and arrays.\nIf you want to create a unique_ptr, you can write:\nclass Object { };\n\n// unique_ptr\nauto ptr = std::make_unique<Object>();\nauto intPtr = std::make_unique<int>();\n\n// or shared_ptr\nauto shared = std::make_shared<Object>();\nauto intShared = std::make_shared<int>();\n\n\nIn the example, you see pointers to a single instance of Object or an integer.\nSimilarly, if you want to hav…",
          "link": "https://www.cppstories.com/2021/smartptr-array/",
          "publishedOn": "2021-10-25T05:55:00.000Z",
          "wordCount": 1601,
          "title": "C++ Smart Pointers and Arrays"
        },
        {
          "id": "https://www.cppstories.com/2021/refactor-into-uniqueptr/",
          "author": null,
          "description": "In legacy code, you can often spot explicit new and delete lurking in various places and waiting to produce pointer-related issues. This blog post shows six patterns to improve that erroneous style and rely on modern techniques, especially unique_ptr and other helper standard types.\nunique_ptr.\n\nBasic assumptions\nThe code presented here will usually contain explicit new and delete, and we’d like to reduce their use and wrap resources (usually for pointers to heap-allocated objects) into RAII.\nMost importantly, we’ll try to follow the rule: R.11: Avoid calling new and delete explicitly from the Core C++ Guidelines:\nThe pointer returned by new should belong to a resource handle (that can call delete). If the pointer returned by new is assigned to a plain/naked pointer, the object can be leak…",
          "link": "https://www.cppstories.com/2021/refactor-into-uniqueptr/",
          "publishedOn": "2021-10-18T05:55:00.000Z",
          "wordCount": 2426,
          "title": "6 Ways to Refactor new/delete into unique ptr"
        }
      ]
    },
    {
      "title": "Sticky Bits – Powered by Feabhas",
      "feedUrl": "https://blog.feabhas.com/feed/",
      "siteUrl": "https://blog.feabhas.com",
      "articles": []
    },
    {
      "title": "The LLVM Project Blog",
      "feedUrl": "https://blog.llvm.org/index.xml",
      "siteUrl": "https://blog.llvm.org/",
      "articles": [
        {
          "id": "https://blog.llvm.org/posts/2021-11-02-apt.llvm.org-moving-from-physical-server-to-the-cloud/",
          "author": null,
          "description": "In this blog post, I would like to explain how I migrated\napt.llvm.org from physical hardware hosted in\na datacenter to the Google cloud. This has resulted in better security\nand faster builds for LLVM Debian/Ubuntu nightly builds.\nPrevious infrastructure\nAbout 10 years ago, Nick Lewycky from Google offered to replace my mix\nof old and terrible servers with 16 blade servers in a chassis and a\ncontrol server. Below are pictures of the front and back of these\nservers, which have served us faithfully for 10 years:\n \nThe hosting was sponsored by IRILL, at\nInria, next to Versailles.\nThis setup was running using a PXE install with preseed to set up\neverything on the 16 blades.\nWhile it served us very well for years, it is now holding us back.\nSome of the blades are dying;\nOld hardware - it takes…",
          "link": "https://blog.llvm.org/posts/2021-11-02-apt.llvm.org-moving-from-physical-server-to-the-cloud/",
          "publishedOn": "2021-11-02T00:00:00.000Z",
          "wordCount": 726,
          "title": "apt.llvm.org - moving from physical server to the cloud"
        }
      ]
    },
    {
      "title": "Embedded in Academia",
      "feedUrl": "https://blog.regehr.org/feed",
      "siteUrl": "https://blog.regehr.org",
      "articles": [
        {
          "id": "https://blog.regehr.org/?p=2173",
          "author": "regehr",
          "description": "The spinlock is the most basic mutual exclusion primitive provided by a multiprocessor operating system. Spinlocks need to protect against preemption on the current CPU (typically by disabling interrupts, but we’ll ignore that aspect in this post) and also against attempts by other cores to concurrently access the critical section (by using atomic memory operations).… Continue reading A Close Look at a Spinlock",
          "link": "https://blog.regehr.org/archives/2173",
          "publishedOn": "2021-11-06T19:57:06.000Z",
          "wordCount": 2057,
          "title": "A Close Look at a Spinlock"
        }
      ]
    },
    {
      "title": "Siemens Blogs",
      "feedUrl": "https://blogs.sw.siemens.com/feed/",
      "siteUrl": "https://blogs.sw.siemens.com",
      "articles": []
    },
    {
      "title": "CPUU의 Daydreamin&#039;",
      "feedUrl": "https://cpuu.postype.com/rss",
      "siteUrl": "https://cpuu.postype.com",
      "articles": [
        {
          "id": "https://cpuu.postype.com/post/11085234",
          "author": "CPUU",
          "description": "Mach-O 는 macOS에서 사용하는 바이너리 형식 포맷이다. 기존에는 애플도 인텔 칩셋을 사용했기 때문에 바이너리도 인텔용 바이너리로 사용되었다.\n그러나 2020년 M1칩을 발표하면서부터 macOS는 ARM64로 전환되었고, 이에 따라 바이너리 형식 역시 ARM64를 따르게 되었다. 물론 원래부터 iOS를 구동하는 아이폰 및 아이패드가 ARM 디바이스였으므로 완전히 새로운 내용은 아니다. 다만 성능 차원에서 훨씬 뛰어난데다가 컴퓨터용 운영체제인 macOS가 ARM64를 지원하게 되었고, 2021년 계속해서 M1 Max 등 새로운 칩셋들을 계속 ARM64로 고수하고 있으므로 향후에는 결국 ARM64 기반의 Mach-O가 완전히 자리잡을 것으로 보인다.\n한편 M1 칩셋 환경을 대상으로 하는 M1 악성코드가 출현하고 있다(참고 : GoSearch22). 그러므로 M1 환경에서 악성코드 분석이라던지 취약점 분석을 하기 위해서는 M1용 바이너리를 역공학(reverse engineering) 하는 방법을 필수적으로 숙지해야 할 것이다.\n물론 리버싱 실무에서 사실상의 표준 도구로 사용되는 IDA Pro 같은 경우 이미 ARM64 macOS 에 대한 지원 업데이트를 출시했다. .. 역시 자본주의 사회에서는 돈이 .. 최고다..  이 글에서는 IDA를 사용하지 않고, 순수하게 디스어셈블 도구를 사용하여 어셈블리 언어 수준의 분석을 수행해보는 것으로 한다.\n\n\n1. C 언어로 Hello World 예제 작성하기\n2014년 애플은 swift 프로그래밍 언어를 발표했다. 원래 iOS 앱이나 macOS 앱은 Objective-C…",
          "link": "https://cpuu.postype.com/post/11085234",
          "publishedOn": "2021-11-01T05:16:20.000Z",
          "wordCount": 492,
          "title": "M1 Mach-O 바이너리 리버싱"
        }
      ]
    },
    {
      "title": null,
      "feedUrl": "https://danluu.com/atom.xml",
      "siteUrl": "https://danluu.com/atom/index.xml",
      "articles": [
        {
          "id": "https://danluu.com/culture/",
          "author": null,
          "description": "Three major tools that companies have to influence behavior are incentives, process, and culture. People often mean different things when talking about these, so I'll provide an example of each so we're on the same page (if you think that I should be using a different word for the concept, feel free to mentally substitute that word).\nGetting people to show up to meetings on time\nIncentive: dock pay for people who are late\nProcess: don't allow anyone who's late into the meeting\nCulture: people feel strongly about showing up on time\n\n\n\nGetting people to build complex systems\nIncentive: require complexity in promo criteria\nProcess: make process for creating or executing on a work item so heavyweight that people stop doing simple work\nCulture: people enjoy building complex systems and/or build…",
          "link": "https://danluu.com/culture/",
          "publishedOn": "2021-11-08T00:00:00.000Z",
          "wordCount": 4740,
          "title": "Culturally transmitted skills and values"
        },
        {
          "id": "https://danluu.com/look-stupid/",
          "author": null,
          "description": "People frequently1 think that I'm very stupid. I don't find this surprising, since I don't mind if other people think I'm stupid, which means that I don't adjust my behavior to avoid seeming stupid, which results in people thinking that I'm stupid. Although there are some downsides to people thinking that I'm stupid, e.g., failing interviews where the interviewer very clearly thought I was stupid, I think that, overall, the upsides of being willing to look stupid have greatly outweighed the downsides.\nI don't know why this one example sticks in my head but, for me, the most memorable example of other people thinking that I'm stupid was from college. I've had numerous instances where more people thought I was stupid and also where people thought the depths of my stupidity was greater, but t…",
          "link": "https://danluu.com/look-stupid/",
          "publishedOn": "2021-10-21T00:00:00.000Z",
          "wordCount": 4500,
          "title": "Willingness to look stupid"
        },
        {
          "id": "https://danluu.com/learn-what/",
          "author": null,
          "description": "It's common to see people advocate for learning skills that they have or using processes that they use. For example, Steve Yegge has a set of blog posts where he recommends reading compiler books and learning about compilers. His reasoning is basically that, if you understand compilers, you'll see compiler problems everywhere and will recognize all of the cases where people are solving a compiler problem without using compiler knowledge. Instead of hacking together some half-baked solution that will never work, you can apply a bit of computer science knowledge to solve the problem in a better way with less effort. That's not untrue, but it's also not a reason to study compilers in particular because you can say that about many different areas of computer science and math. Queuing theory, c…",
          "link": "https://danluu.com/learn-what/",
          "publishedOn": "2021-10-18T00:00:00.000Z",
          "wordCount": 4116,
          "title": "What to learn"
        },
        {
          "id": "https://danluu.com/productivity-velocity/",
          "author": null,
          "description": "A common topic of discussion among my close friends is where the bottlenecks are in our productivity and how we can execute more quickly. This is very different from what I see in my extended social circles, where people commonly say that velocity doesn't matter. In online discussions about this, I frequently see people go a step further and assign moral valence to this, saying that it is actually bad to try to increase velocity or be more productive or work hard (see appendix for more examples).\nThe top reasons I see people say that productivity doesn't matter (or is actually bad) fall into one of three buckets:\nWorking on the right thing is more important than working quickly\nSpeed at X doesn't matter because you don't spend much time doing X\nThinking about productivity is bad and you sh…",
          "link": "https://danluu.com/productivity-velocity/",
          "publishedOn": "2021-10-15T00:00:00.000Z",
          "wordCount": 5001,
          "title": "Some reasons to work on productivity and velocity"
        }
      ]
    },
    {
      "title": "Damien Katz",
      "feedUrl": "http://damienkatz.net/feed/",
      "siteUrl": "http://damienkatz.net",
      "articles": []
    },
    {
      "title": "The acme of foolishness",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "edykim.com 블로그 RSS 피드",
      "feedUrl": "https://edykim.com/ko/feed.xml",
      "siteUrl": "https://edykim.com",
      "articles": [
        {
          "id": "https://edykim.com/ko/post/debugging-behind-the-iron-curtain/",
          "author": null,
          "description": "Jake Poznanski의 글 Debugging Behind the Iron Curtain…",
          "link": "https://edykim.com/ko/post/debugging-behind-the-iron-curtain/",
          "publishedOn": "2021-11-04T16:15:55.000Z",
          "wordCount": 505,
          "title": "개발자 동무, 철의 장막 뒤에서 디버깅 하기"
        },
        {
          "id": "https://edykim.com/ko/post/defragment-sep-2021-to-oct/",
          "author": null,
          "description": "이제 앞으로 더 바빠질 예정이라서 9월, 1…",
          "link": "https://edykim.com/ko/post/defragment-sep-2021-to-oct/",
          "publishedOn": "2021-11-01T07:32:26.000Z",
          "wordCount": 307,
          "title": "조각모음: 2021년 9월, 10월"
        },
        {
          "id": "https://edykim.com/ko/post/blog-update-2021-fall/",
          "author": null,
          "description": "Gatsby v…",
          "link": "https://edykim.com/ko/post/blog-update-2021-fall/",
          "publishedOn": "2021-10-28T09:02:49.000Z",
          "wordCount": 297,
          "title": "블로그 업데이트"
        }
      ]
    },
    {
      "title": "Eli Bendersky's website",
      "feedUrl": "https://eli.thegreenplace.net/feeds/all.atom.xml",
      "siteUrl": "https://eli.thegreenplace.net/",
      "articles": [
        {
          "id": "https://eli.thegreenplace.net/2021/a-comprehensive-guide-to-go-generate/",
          "author": null,
          "description": "<p>Developers have strong tendencies to automate repetitive tasks, and this applies\nto writing code as well. Therefore, the topic of <em>metaprogramming</em> is a hot\narea of development and research, and hails back to Lisp in the 1960s. One\nspecific aspect of metaprogramming that has been particularly useful is\n<em>code-generation</em>, or …</p>",
          "link": "https://eli.thegreenplace.net/2021/a-comprehensive-guide-to-go-generate/",
          "publishedOn": "2021-10-27T03:02:00.000Z",
          "wordCount": 3386,
          "title": "A comprehensive guide to go generate"
        }
      ]
    },
    {
      "title": "Embedded Artistry",
      "feedUrl": "https://embeddedartistry.com/feed/",
      "siteUrl": "https://embeddedartistry.com",
      "articles": [
        {
          "id": "https://embeddedartistry.com/?p=16550",
          "author": "Phillip Johnston",
          "description": "25 October 2021 by Phillip JohnstonI want to come clean: I’ve spent most of my career to date manually testing the code I’ve written. This might surprise people who have known me or read my work for years, because I have spent the majority of my career extolling the benefits of CI pipelines and automated … \nContinue reading \"When Updating an Untested Module, Take the Opportunity to Add Tests\"\nThe post When Updating an Untested Module, Take the Opportunity to Add Tests appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2021/10/25/when-updating-an-untested-module-take-the-opportunity-to-add-tests/",
          "publishedOn": "2021-10-25T16:30:00.000Z",
          "wordCount": 1848,
          "title": "When Updating an Untested Module, Take the Opportunity to Add Tests"
        },
        {
          "id": "https://embeddedartistry.com/?p=16436",
          "author": "Phillip Johnston",
          "description": "18 October 2021 by Phillip JohnstonOne of the tragedies that we see in the world is the sheer amount of perfectly good hardware that is essentially bricked because it is no longer supported with software updates and cannot engage in the contemporary world. As quoted from an article in IEEE Spectrum: I recently did some … \nContinue reading \"Bricked for Want of Support\"\nThe post Bricked for Want of Support appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2021/10/18/bricked-for-want-of-support/",
          "publishedOn": "2021-10-18T16:00:00.000Z",
          "wordCount": 1602,
          "title": "Bricked for Want of Support"
        },
        {
          "id": "https://embeddedartistry.com/?p=16258",
          "author": "Matthias Schulte",
          "description": "11 October 2021 by Matthias SchulteToday we have a guest post from Mathias Schulte. Mathias is a member of the development team at YAKINDU. He likes trying out different tools and languages in order to improve his engineering skills. Implementing an IoT solution can easily become a complex task. IoT applications usually consist of three … \nContinue reading \"How to Get an IoT Project Quickly Off the Ground\"\nThe post How to Get an IoT Project Quickly Off the Ground appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2021/10/11/how-to-get-an-iot-project-quickly-off-the-ground/",
          "publishedOn": "2021-10-11T17:00:00.000Z",
          "wordCount": 1998,
          "title": "How to Get an IoT Project Quickly Off the Ground"
        }
      ]
    },
    {
      "title": "Embedded.com",
      "feedUrl": "https://www.embedded.com/feed/",
      "siteUrl": "https://www.embedded.com",
      "articles": [
        {
          "id": "https://www.embedded.com/?p=4471489",
          "author": "Nitin Dahad",
          "description": "A roundup of this week’s embedded news includes embedded edge with Nitin podcast featuring a brand new GPU, quantum computing developments and IoT for smart buildings, plus usual product news including automotive, tools and software.\nThe post embedded news week: podcast, new GPU, quantum IP, smart building IoT appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-news-week-podcast-new-gpu-quantum-ip-smart-building-iot/",
          "publishedOn": "2021-11-05T19:46:47.000Z",
          "wordCount": 2814,
          "title": "embedded news week: podcast, new GPU, quantum IP, smart building IoT"
        },
        {
          "id": "https://www.embedded.com/?p=4471482",
          "author": "Nitin Dahad",
          "description": "New flagship GPU from Imagination Technologies brings desktop-quality ray tracing to mobile for the first time and is industry’s first Level 4 RTLS ray tracing architecture.\nThe post Imagination launches first mobile GPU core with level 4 ray tracing appeared first on Embedded.com.",
          "link": "https://www.embedded.com/imagination-launches-first-mobile-gpu-core-with-level-4-ray-tracing/",
          "publishedOn": "2021-11-05T13:16:40.000Z",
          "wordCount": 2852,
          "title": "Imagination launches first mobile GPU core with level 4 ray tracing"
        },
        {
          "id": "https://www.embedded.com/?p=4471477",
          "author": "Nitin Dahad",
          "description": "Built on the industrial version of Nvidia’s Jetson AGX Xavier module, the AVA-RAGX provides a compact, rugged AI-enabled solution for both onboard and wayside railway applications that delivers reliability and performance in harsh operating environments.\nThe post ADLINK launches rugged AI-enabled video analytics platform for railway appeared first on Embedded.com.",
          "link": "https://www.embedded.com/adlink-launches-rugged-ai-enabled-video-analytics-platform-for-railway/",
          "publishedOn": "2021-11-05T11:38:42.000Z",
          "wordCount": 1678,
          "title": "ADLINK launches rugged AI-enabled video analytics platform for railway"
        },
        {
          "id": "https://www.embedded.com/?p=4471474",
          "author": "Nazneen A",
          "description": "Tuning an image pipeline for a particular camera system requires an understanding of each pipeline stage and how each stage can be optimized for a...\nThe post The fundamentals of image quality tuning appeared first on Embedded.com.",
          "link": "https://www.embedded.com/the-fundamentals-of-image-quality-tuning/",
          "publishedOn": "2021-11-03T22:40:06.000Z",
          "wordCount": 2748,
          "title": "The fundamentals of image quality tuning"
        },
        {
          "id": "https://www.embedded.com/?p=4471434",
          "author": "Nitin Dahad",
          "description": "A roundup of this week’s embedded news includes EEWeb design contest, low complexity video and audio, and UWB certification, plus acquisitions, funding, people and new products.\nThe post embedded news week: Arduino contest, LC3/MPEG 5 codecs, UWB appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-news-week-arduino-contest-lc3-mpeg-5-codecs-uwb/",
          "publishedOn": "2021-10-29T17:50:45.000Z",
          "wordCount": 3076,
          "title": "embedded news week: Arduino contest, LC3/MPEG 5 codecs, UWB"
        },
        {
          "id": "https://www.embedded.com/?p=4471432",
          "author": "David Katz",
          "description": "Low latency, real-time acoustic processing is a key factor in many embedded processing applications, among them voice preprocessing, speech recognition, and active noise cancellation (ANC)....\nThe post Successful real-time acoustic processing requires careful planning appeared first on Embedded.com.",
          "link": "https://www.embedded.com/successful-real-time-acoustic-processing-requires-careful-planning/",
          "publishedOn": "2021-10-29T14:52:19.000Z",
          "wordCount": 3090,
          "title": "Successful real-time acoustic processing requires careful planning"
        },
        {
          "id": "https://www.embedded.com/?p=4471422",
          "author": "Emily Newton",
          "description": "Medical devices have come a tremendously long way over the years, saving lives and helping people manage illnesses. However, one primary downside is that their...\nThe post Novel energy harvesting tech could reshape medical devices appeared first on Embedded.com.",
          "link": "https://www.embedded.com/novel-energy-harvesting-tech-could-reshape-medical-devices/",
          "publishedOn": "2021-10-29T14:20:37.000Z",
          "wordCount": 2230,
          "title": "Novel energy harvesting tech could reshape medical devices"
        },
        {
          "id": "https://www.embedded.com/?p=4471414",
          "author": "Nitin Dahad",
          "description": "Cadence introduces Tensilica HiFi 1 DSP to provide better voice and music processing performance with optimal neural network capability in a compact footprint with ultra-low energy.\nThe post New Cadence HiFi DSP targets always-on hearables and wearables appeared first on Embedded.com.",
          "link": "https://www.embedded.com/new-cadence-hifi-dsp-targets-always-on-hearables-and-wearables/",
          "publishedOn": "2021-10-28T18:09:52.000Z",
          "wordCount": 2089,
          "title": "New Cadence HiFi DSP targets always-on hearables and wearables"
        },
        {
          "id": "https://www.embedded.com/?p=4471448",
          "author": "Rehan Hameed",
          "description": "Unlike GPUs, which have established programming models and software toolchains, AI processors face a shortfall in software support.   While artificial intelligence (AI) advancements are...\nThe post Software tools determine edge AI accelerator success appeared first on Embedded.com.",
          "link": "https://www.embedded.com/software-tools-determine-edge-ai-accelerator-success/",
          "publishedOn": "2021-10-28T00:23:00.000Z",
          "wordCount": 2387,
          "title": "Software tools determine edge AI accelerator success"
        },
        {
          "id": "https://www.embedded.com/?p=4471454",
          "author": "Dan Jones",
          "description": "Why is the industrial IoT such a good fit for 5G? Here are some of the characteristics that make the two a match. When considering...\nThe post 5G fits needs of industrial IoT appeared first on Embedded.com.",
          "link": "https://www.embedded.com/5g-fits-needs-of-industrial-iot/",
          "publishedOn": "2021-10-27T18:43:00.000Z",
          "wordCount": 2260,
          "title": "5G fits needs of industrial IoT"
        },
        {
          "id": "https://www.embedded.com/?p=4471366",
          "author": "Nitin Dahad",
          "description": "A roundup of this week’s embedded news includes robotics, IoT security and onboarding, automotive wireless charging and building automation.\nThe post embedded news week: robotics, rainforests and IoT security appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-news-week-robotics-rainforests-and-iot-security/",
          "publishedOn": "2021-10-22T18:29:47.000Z",
          "wordCount": 2851,
          "title": "embedded news week: robotics, rainforests and IoT security"
        },
        {
          "id": "https://www.embedded.com/?p=4471363",
          "author": "Aaron Bauch",
          "description": "Synchronizing multiple cores on a single chip or in a system requires atomic operations and hardware that enforces these operations. Synchronization The motivation for atomic...\nThe post Accelerating atomic synchronization appeared first on Embedded.com.",
          "link": "https://www.embedded.com/accelerating-atomic-synchronization/",
          "publishedOn": "2021-10-22T14:06:43.000Z",
          "wordCount": 2825,
          "title": "Accelerating atomic synchronization"
        },
        {
          "id": "https://www.embedded.com/?p=4471356",
          "author": "Ludovic Rembert",
          "description": "Customers want assurance that their data is protected and being used in their best interests. \nThe post Staying data compliant in the IoT appeared first on Embedded.com.",
          "link": "https://www.embedded.com/staying-data-compliant-in-the-iot/",
          "publishedOn": "2021-10-22T13:34:39.000Z",
          "wordCount": 2054,
          "title": "Staying data compliant in the IoT"
        },
        {
          "id": "https://www.embedded.com/?p=4471349",
          "author": "Nitin Dahad",
          "description": "As Cascoda announced the first certified OCF-over-Thread module for secure IP-based mesh networks, we look at the why the technology is significant in addressing interoperability and security in smart building IoT.\nThe post Secure OCF-over-Thread is key to scalable IP based smart building IoT appeared first on Embedded.com.",
          "link": "https://www.embedded.com/secure-ocf-over-thread-is-key-to-scalable-ip-based-smart-building-iot/",
          "publishedOn": "2021-10-21T11:13:18.000Z",
          "wordCount": 2385,
          "title": "Secure OCF-over-Thread is key to scalable IP based smart building IoT"
        },
        {
          "id": "https://www.embedded.com/?p=4471345",
          "author": "Nitin Dahad",
          "description": "Imperas simulation models now available within TESSY environment for the automation of embedded software testing and regression management.\nThe post Software testing of Imperas models for Arm now in Razorcat’s TESSY appeared first on Embedded.com.",
          "link": "https://www.embedded.com/software-testing-of-imperas-models-for-arm-now-in-razorcats-tessy/",
          "publishedOn": "2021-10-20T12:53:45.000Z",
          "wordCount": 1648,
          "title": "Software testing of Imperas models for Arm now in Razorcat’s TESSY"
        },
        {
          "id": "https://www.embedded.com/?p=4471341",
          "author": "Haydn Povey",
          "description": "With applications rapidly transitioning from traditional embedded devices to cloud orientated edge compute nodes, this article looks at a growing need to integrate cloud connectivity into both the development and manufacturing processes, and to create a seamless secure supply chain for the IoT.\nThe post Embedded development must change to simplify IoT onboarding to cloud appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-development-must-change-to-simplify-iot-onboarding-to-cloud/",
          "publishedOn": "2021-10-18T19:19:44.000Z",
          "wordCount": 2441,
          "title": "Embedded development must change to simplify IoT onboarding to cloud"
        },
        {
          "id": "https://www.embedded.com/?p=4471336",
          "author": "Nitin Dahad",
          "description": "Crypto coprocessor IP core provides authenticated encryption between highly networked applications, for example in IoT or cloud computing, using Chacha20 stream cipher combined with the Poly1305 message authentication code (MAC).\nThe post Silex Insight achieves 100Gbps in FPGA for ChaCha20-Poly1305 IP core appeared first on Embedded.com.",
          "link": "https://www.embedded.com/silex-insight-achieves-100gbps-in-fpga-for-chacha20-poly1305-ip-core/",
          "publishedOn": "2021-10-18T18:02:31.000Z",
          "wordCount": 1387,
          "title": "Silex Insight achieves 100Gbps in FPGA for ChaCha20-Poly1305 IP core"
        },
        {
          "id": "https://www.embedded.com/?p=4471331",
          "author": "Nitin Dahad",
          "description": "Enables device manufacturers to reduce the time, cost and complexity of developing and deploying critical software for automotive, military, IoT and industrial solutions based on RISC-V processor architecture.\nThe post Green Hills Software adds RISC-V support to INTEGRITY RTOS appeared first on Embedded.com.",
          "link": "https://www.embedded.com/green-hills-software-adds-risc-v-support-to-integrity-rtos/",
          "publishedOn": "2021-10-18T16:27:22.000Z",
          "wordCount": 1715,
          "title": "Green Hills Software adds RISC-V support to INTEGRITY RTOS"
        },
        {
          "id": "https://www.embedded.com/?p=4471325",
          "author": "Nitin Dahad",
          "description": "Agreement addresses challenges involved with creating and deploying IoT solutions, including device design and development, enrollment with a cellular network, and connection to cloud services.\nThe post STMicroelectronics & Sierra Wireless simplify IoT device deployment appeared first on Embedded.com.",
          "link": "https://www.embedded.com/stmicroelectronics-sierra-wireless-simplify-iot-device-deployment/",
          "publishedOn": "2021-10-15T17:57:23.000Z",
          "wordCount": 1502,
          "title": "STMicroelectronics & Sierra Wireless simplify IoT device deployment"
        },
        {
          "id": "https://www.embedded.com/?p=4471317",
          "author": "Nitin Dahad",
          "description": "A roundup of this week’s embedded news includes a report on challenges for U.K. chip startups, a new open-source toolkit for quantum computing, and a new CEO interview podcast.\nThe post embedded news week: U.K. chip startups, natural language quantum appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-news-week-u-k-chip-startups-natural-language-quantum/",
          "publishedOn": "2021-10-15T17:07:49.000Z",
          "wordCount": 2367,
          "title": "embedded news week: U.K. chip startups, natural language quantum"
        },
        {
          "id": "https://www.embedded.com/?p=4471314",
          "author": "Paul Slattery",
          "description": "Technology is transforming the automotive industry to create a safer, more comfortable driving experience. Automotive camera connectivity is a key enabling technology with an average...\nThe post Cost-efficient camera connectivity with Car Camera Bus appeared first on Embedded.com.",
          "link": "https://www.embedded.com/cost-efficient-camera-connectivity-with-car-camera-bus/",
          "publishedOn": "2021-10-15T13:50:23.000Z",
          "wordCount": 2301,
          "title": "Cost-efficient camera connectivity with Car Camera Bus"
        },
        {
          "id": "https://www.embedded.com/?p=4471301",
          "author": "Nitin Dahad",
          "description": "Open-source software toolkit, lambeq, turns sentences into quantum circuits, ready to be implemented on existing quantum hardware, hence enabling both professionals and enthusiasts to linguistically interact with quantum computers.\nThe post Cambridge Quantum toolkit converts natural language to quantum circuits appeared first on Embedded.com.",
          "link": "https://www.embedded.com/cambridge-quantum-toolkit-converts-natural-language-to-quantum-circuits/",
          "publishedOn": "2021-10-15T10:16:02.000Z",
          "wordCount": 2410,
          "title": "Cambridge Quantum toolkit converts natural language to quantum circuits"
        },
        {
          "id": "https://www.embedded.com/?p=4471289",
          "author": "Nitin Dahad",
          "description": "New RA2E2 MCUs, based on Arm Cortex-M23 core, offer a combination of low power consumption, a set of peripherals targeted at IoT endpoint applications, and space-saving packaging options.\nThe post New Renesas MCUs for IoT endpoints like wearables and medical devices appeared first on Embedded.com.",
          "link": "https://www.embedded.com/new-renesas-mcus-for-iot-endpoints-like-wearables-and-medical-devices/",
          "publishedOn": "2021-10-13T20:35:21.000Z",
          "wordCount": 1569,
          "title": "New Renesas MCUs for IoT endpoints like wearables and medical devices"
        },
        {
          "id": "https://www.embedded.com/?p=4471280",
          "author": "Luka Mustafa and Chris Coleman",
          "description": "The Linux Foundation Zephyr Open Source Project has grown into the backbone of many IoT projects. Zephyr offers a best-in-class small, scalable, real-time operating system...\nThe post Best practices for debugging Zephyr-based IoT applications appeared first on Embedded.com.",
          "link": "https://www.embedded.com/best-practices-for-debugging-zephyr-based-iot-applications/",
          "publishedOn": "2021-10-13T13:24:41.000Z",
          "wordCount": 3176,
          "title": "Best practices for debugging Zephyr-based IoT applications"
        },
        {
          "id": "https://www.embedded.com/?p=4471212",
          "author": "Mohammed Billoo",
          "description": "Continuing a two-part-series looking at how a visual trace diagnostics tool such as Percepio Tracealyzer can help in evaluating an embedded Linux system, from analyzing the driver and interrupt handler to examining the userspace applications and compiler options.\nThe post Evaluating the performance of a Yocto-based Linux system – part 2 appeared first on Embedded.com.",
          "link": "https://www.embedded.com/evaluating-the-performance-of-a-yocto-based-linux-system-part-2/",
          "publishedOn": "2021-10-13T13:02:00.000Z",
          "wordCount": 2728,
          "title": "Evaluating the performance of a Yocto-based Linux system – part 2"
        },
        {
          "id": "https://www.embedded.com/?p=4471309",
          "author": "Bill Schweber",
          "description": "Will standardization on USB-C for small-device chargers bring benefits or will there be unexpected downsides? I suspect that many of you have a drawer or...\nThe post A universal charger connector or a tangled mess? appeared first on Embedded.com.",
          "link": "https://www.embedded.com/a-universal-charger-connector-or-a-tangled-mess/",
          "publishedOn": "2021-10-12T12:56:00.000Z",
          "wordCount": 2014,
          "title": "A universal charger connector or a tangled mess?"
        }
      ]
    },
    {
      "title": "Better Embedded System SW",
      "feedUrl": "https://feeds.feedburner.com/BetterEmbeddedSystemSw",
      "siteUrl": "http://betterembsw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Google Developers Blog",
      "feedUrl": "https://feeds.feedburner.com/GDBcode",
      "siteUrl": "http://developers.googleblog.com/",
      "articles": [
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/Nop4lSh5mzA/iamagde-katerina-skroumpelou-athens.html",
          "author": null,
          "description": "The Google Developers Experts program is a global network of highly experienced technology experts, influencers, and thought leaders who actively support developers, companies, and tech communities by speaking at events and publishing content.\n  \nKaterina Skroumpelou, who is based in Athens, Greece, is a Senior Software Engineer at Narwhal Technologies, a consulting firm whose product Nx lets developers build multiple full-stack applications and share code among them in the same workspace. She is a Google Developer Expert in Maps and Angular.  \n   \n Becoming a Google Maps Platform developer\nSkroumpelou has always had a deep love of maps. \n“My father used to have old maps books, and I’ve always been obsessed with knowing where I am and having an understanding of my surroundings, so I’ve alw…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/Nop4lSh5mzA/iamagde-katerina-skroumpelou-athens.html",
          "publishedOn": "2021-11-04T16:08:00.006Z",
          "wordCount": 3402,
          "title": "#IamaGDE: Katerina Skroumpelou (Athens, Greece)"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/sACFMd3VPww/machine-learning-communities-q3-21.html",
          "author": null,
          "description": "Posted by HyeJung Lee, DevRel Community Manager and Soonson Kwon, DevRel Program Manager\n Let’s explore highlights and achievements of vast Google Machine Learning communities by region for the last quarter. Activities of experts (GDE, professional individuals), communities (TFUG, TensorFlow user groups), students (GDSC, student clubs), and developers groups (GDG) are presented here. \nKey highlights\n     \n     30 days of ML with Kaggle is designed to help beginners study ML using Kaggle Learn courses as well as a competition specifically for the participants of this program. Collaborated with the Kaggle team so that +30  the ML GDEs and TFUG organizers participated as volunteers as online mentors as well as speakers for this initiative.  \n     Total 16 of the GDE/GDSC/TFUGs run community o…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/sACFMd3VPww/machine-learning-communities-q3-21.html",
          "publishedOn": "2021-11-03T17:02:00.000Z",
          "wordCount": 4155,
          "title": "Machine Learning Communities: Q3 ‘21 highlights and achievements"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/x3Eu7IlBdIc/announcing-kotlin-support-for-protocol.html",
          "author": null,
          "description": "Posted by Deanna Garcia and Louis Wasserman - Software Developers, and Developer Advocate, James Ward\n      \nGoogle’s commitment to Kotlin\n  \nAt Google, we’re investing deeply in the Kotlin language and ecosystem. Android development is now Kotlin first, our engineering teams work on language evolution through the Kotlin Foundation, and inside of Google we’re using Kotlin more and more to build our backend services. We love Kotlin for its expressiveness, safety, simple async support through coroutines, and easy bidirectional interoperability with the Java programming language. \nKotlin for protocol buffers\n  \nLast year, we open sourced Kotlin support for gRPC, the open source Remote Procedure Call (RPC) framework that powers thousands of microservices at Google. We’re excited to deepen our …",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/x3Eu7IlBdIc/announcing-kotlin-support-for-protocol.html",
          "publishedOn": "2021-11-01T18:21:00.001Z",
          "wordCount": 3278,
          "title": "Announcing Kotlin support for protocol buffers"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/YZS5SSgmgUE/easily-connect-google-pay.html",
          "author": null,
          "description": "Posted by Stephen McDonald, Developer Relations Engineer, Google Pay\n  \n\n  \nEasily connect Google Pay with your preferred payment processor\n  \nAdding Google Pay as a payment method to your website or Android application provides a secure and fast checkout option for your users. To enable Google Pay, you will first need a Payment Service Provider (PSP). For the integration this means understanding how your payments processing stack works with Google Pay APIs.  \nEnd-to-end PSP samples\n To make integration easier, we’ve launched a new open source project containing end-to-end samples for a range of PSPs, demonstrating the entire integration process - from client-side configuration, to server-side integration with the PSPs, using their respective APIs and client libraries where applicable. The…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/YZS5SSgmgUE/easily-connect-google-pay.html",
          "publishedOn": "2021-10-29T17:00:00.008Z",
          "wordCount": 2911,
          "title": "Easily connect Google Pay with your preferred payment processor"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/44sEoBU2PGs/iamagde-martin-kleppe.html",
          "author": null,
          "description": "#IamaGDE series presents: Google Maps Platform\n The Google Developers Experts program is a global network of highly experienced technology experts, influencers, and thought leaders who actively support developers, companies, and tech communities by speaking at events and publishing content.\n    \nMartin Kleppe is a co-founder of Ubilabs, a Google Cloud partner since 2012. He is the head of development, responsible for R&D and technical strategy. He talks with customers to understand their challenges and which location technologies will best serve them. He also works with partners like Google to determine the best ways to combine the latest technologies. \nUbilabs – a data and location technology consultancy specializing in product and software development, visualization, implementation, and …",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/44sEoBU2PGs/iamagde-martin-kleppe.html",
          "publishedOn": "2021-10-28T19:19:00.002Z",
          "wordCount": 3964,
          "title": "#IamaGDE: Martin Kleppe"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/pPSsd5yxtl4/iamagde-bhavesh-bhatt.html",
          "author": null,
          "description": "Welcome to #IamaGDE - a series of spotlights presenting Google Developer Experts (GDEs) from across the globe. Discover their stories, passions, and highlights of their community work.\nBhavesh Bhatt is a data scientist and a YouTuber based in Mumbai, India. He began his career as an engineer and transitioned to machine learning and data science. Now, he trains other data scientists to be successful in their careers. Bhavesh is known for his popular YouTube videos and an open source app he created to help Indian citizens locate vaccination appointments near them in the spring of 2021. He has been a GDE since 2019. \nMeet Bhavesh Bhatt, Google Developer Expert in Machine Learning and Data Science.\n    \nThe Early Days\nBhavesh Bhatt has always been technical and has always enjoyed experimenting…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/pPSsd5yxtl4/iamagde-bhavesh-bhatt.html",
          "publishedOn": "2021-10-26T17:00:00.007Z",
          "wordCount": 3604,
          "title": "#IamaGDE: Bhavesh Bhatt"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/c-9G_vB9cnQ/chloe--toronto-diversity-inclusion.html",
          "author": null,
          "description": "Posted by Kyle Paul, Google Developer Student Club Regional Lead CA & US\n          \nWhen Chloe Quijano arrived at the University of Toronto to study Applied Sciences, she immediately noticed that few of the professors or teaching assistants in the program looked like her. She noticed a lack of relatable role models online and on social media as well. \nChloe felt strongly about the importance of representation.  Whether based on race, gender, ethnicity, sexual orientation or disability status, she understood the importance of being able to find relatable role models in her field--and the implications of a lack of diversity.  \"It holds back the students wishing to go into the field,\" she says.   \n   \nBureau of Labor Statistics findings on women in computing occupations\n  \nWorse, she points o…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/c-9G_vB9cnQ/chloe--toronto-diversity-inclusion.html",
          "publishedOn": "2021-10-25T17:00:00.003Z",
          "wordCount": 3296,
          "title": "How a Developer Student Lead Increased Representation in Campus Clubs Through Community"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/cpS96IrO_Bc/extend-google-apps-script-with-your-api.html",
          "author": null,
          "description": "Posted by Keith Einstein, Product Manager\n   \nGoogle is proud to announce the availability of the DocuSign API library for Google Apps Script. This newly created library gives all Apps Script users access to the more than 400 endpoints DocuSign has to offer so they can build digital signatures into their custom solutions and workflows within Google Workspace. \nThe Google Workspace Ecosystem\n  \nLast week at Google Cloud Next ‘21, in the session “How Miro, DocuSign, Adobe and Atlassian are helping organizations centralize their work”, we showcased a few partner integrations called add-ons, found on Google Workspace Marketplace. The Google Workspace Marketplace helps developers connect with the more than 3 billion people who use Google Workspace—with a stunning 4.8 billion apps installed to d…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/cpS96IrO_Bc/extend-google-apps-script-with-your-api.html",
          "publishedOn": "2021-10-21T20:59:00.002Z",
          "wordCount": 3228,
          "title": "Extend Google Apps Script with your API library to empower users"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/blM5_heJVBc/google-smart-home-developer-summit-new-tools-and-features-to-grow-with-Google.html",
          "author": null,
          "description": "Posted by Michele Turner, Senior Director of Product for Google’s Smart Home Ecosystem \n  \nEarlier this year at Google I/O, we told you that our goal is to make Google the best place for smart home developers like you to build, innovate, and grow. Today, I'm excited to show you all the new ways we're improving the tools and opportunities you'll have to build you best experiences with Google, by:  \n \nExpanding our platform and tools to make it easier for you to learn and build devices that do more with Google.  \nProviding a site where you can preview the new tools that are coming over the next year to help you build your devices, apps, and integrations.  \nSupporting Matter & Thread across our entire ecosystem, including Nest and Android.  \nDeveloping more automation capabilities, including …",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/blM5_heJVBc/google-smart-home-developer-summit-new-tools-and-features-to-grow-with-Google.html",
          "publishedOn": "2021-10-21T17:04:00.001Z",
          "wordCount": 4130,
          "title": "Google Smart Home Developer Summit – New tools and features to build, innovate, and grow with Google"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/m398YK28ykk/migrating-app-engine-push-queues-to.html",
          "author": null,
          "description": "Posted by Wesley Chun (@wescpy), Developer Advocate, Google Cloud\n   \nIntroduction\n The previous Module 7 episode of Serverless Migration Station gave developers an idea of how App Engine push tasks work and how to implement their use in an existing App Engine ndb Flask app. In this Module 8 episode, we migrate this app from the App Engine Datastore (ndb) and Task Queue (taskqueue) APIs to Cloud NDB and Cloud Tasks. This makes your app more portable and provides a smoother transition from Python 2 to 3. The same principle applies to upgrading other legacy App Engine apps from Java 8 to 11, PHP 5 to 7, and up to Go 1.12 or newer. \nOver the years, many of the original App Engine services such as Datastore, Memcache, and Blobstore, have matured to become their own standalone products, for exa…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/m398YK28ykk/migrating-app-engine-push-queues-to.html",
          "publishedOn": "2021-10-20T19:52:00.001Z",
          "wordCount": 2988,
          "title": "Migrating App Engine push queues to Cloud Tasks"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/pcKB09gX9aU/announcing-devfest-2021.html",
          "author": null,
          "description": "Posted by Erica Hanson, Global Program Manager for Google Developer Communities\n   \nDevFest season has officially started! From now through the end of the year, developers from all around the world are coming together for DevFest 2021, the biggest global event for developers, focusing on community-led learning on Google technologies. Hosted by Google Developer Groups (GDG) all across the globe, DevFest events are uniquely curated by their local GDG organizers to fit the needs and interests of the local community. \nThe mission\nThis year, DevFest 2021 inspires local developers to learn and connect as a community by exploring how to use Google technology to accelerate economic impact. In light of COVID-19, the global economy has shrunk and millions of jobs have been lost. Developers are the b…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/pcKB09gX9aU/announcing-devfest-2021.html",
          "publishedOn": "2021-10-20T17:01:00.001Z",
          "wordCount": 3004,
          "title": "Announcing DevFest 2021"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/7cP8ojeOP2g/Bowling-automatic-disapproved-ads-remover.html",
          "author": null,
          "description": "Posted by Elad Ben-David, Nir Kalush, Dvir Kalev, Chen Yogev, Tzahi Zilberstein, Eliran Drucker\n          \nTagline:\nIn light of the new policy that might cause accounts suspension, Bowling is a mitigation tool allowing clients to act and remove disapproved ads before risking account suspension.\nThe tool audits (and offers the option to delete) disapproved ads that may lead eventually to account suspension in perpetuity. The tool audits (and offers the option to delete) disapproved ads that may lead eventually to account suspension in perpetuity. \nBusiness Challenge:\nStarting Oct 2021 Google is introducing a new strike-based system to enforce against advertisers who repeatedly violate Google Ads policies (read more about the change here). \nAn advertiser’s first policy violation will result …",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/7cP8ojeOP2g/Bowling-automatic-disapproved-ads-remover.html",
          "publishedOn": "2021-10-18T18:00:00.001Z",
          "wordCount": 2800,
          "title": "“Bowling” automatic disapproved ads remover"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/28gnKuS9ZLA/learn-flutter-for-free-with-flutter-apprentice.html",
          "author": null,
          "description": "Posted by Shams Zakhour\n    \nWe’ve heard from many folk that they want to learn Flutter, but don’t know where to start. So we have some great news for you — we’re giving away a free book for the next three months, along with a book club to help track your progress and answer questions. \nFlutter Apprentice is written to build on mobile development fundamentals. It takes you through your first fully-featured Flutter app, including designing a complex UI, as well as more advanced concepts such as persistence, state management, and cloud storage with Firebase. The book even covers publishing on both iOS and Android platforms. \nFlutter Apprentice comes from Razeware, the team behind the raywenderlich.com books, videos and tutorials. The book normally costs $60 to purchase, but you’ll have free …",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/28gnKuS9ZLA/learn-flutter-for-free-with-flutter-apprentice.html",
          "publishedOn": "2021-10-15T17:00:00.002Z",
          "wordCount": 2796,
          "title": "Learn Flutter for free with Flutter Apprentice!"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/9E8vUFjPOcI/app-pricing-update-details-and-editors.html",
          "author": null,
          "description": "Posted by Mike Rhemtulla, Product Manager\n      \nGoogle Workspace Marketplace is proud to announce the availability for developers to display pricing for their applications published in the Google Workspace Marketplace, and the date their application listing was last updated. \nLaunched over 11 years ago, Google Workspace Marketplace has been helping developers connect with the more than 3 billion people who use Google Workspace—with a stunning 4.8 billion apps installed to date. That incredible demand is fueling innovation in the ecosystem, and we now have more than 5300 public apps available in the Google Workspace Marketplace, plus thousands more private apps that customers have built for themselves.   \nApp Pricing \n  \nFor developers, you can now specify the app pricing choosing from Fre…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/9E8vUFjPOcI/app-pricing-update-details-and-editors.html",
          "publishedOn": "2021-10-13T17:02:00.000Z",
          "wordCount": 2873,
          "title": "App pricing, update details, and Editor’s choice now available on Google Workspace Marketplace."
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/ekr77vIqd6c/announcing-google-forms-api_01768004272.html",
          "author": null,
          "description": "Posted by Christian Schalk, Developer Advocate\n   \n    Announcing the Google Forms API \n    Google is proud to announce the Google Forms API! The Forms API is     currently available in Restricted Beta, with Open Beta expected to follow     in Q4. \n\n    Launched in 2008, Google Forms enables easy creation and distribution of     forms, surveys, and quizzes. Forms is used for a wide variety of use cases     across business operations, customer management, event planning and     logistics, education, and more. \n    Bringing Automation to Google Forms \n  \n    The new Google Forms API provides programmatic access for managing forms     and acting on responses, empowering developers to build powerful     integrations on top of Forms. The API supports two key use cases: \n\n    \n        \n         …",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/ekr77vIqd6c/announcing-google-forms-api_01768004272.html",
          "publishedOn": "2021-10-12T19:33:00.000Z",
          "wordCount": 3490,
          "title": "Announcing the Google Forms API"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/x0yMKXME5vY/granular-google-account-update.html",
          "author": null,
          "description": "Posted by Vikrant Rana, Product Manager, and Badi Azad, Group Product Manager\n   \nSummary\n  \nGoogle Identity strives to be the best stewards for Google Account users who entrust us to protect their data. At the same time, we want to help our developer community build apps that give users amazing experiences. Together, Google and developers can provide users three important ways to manage sharing their data: \n \nGive users control in deciding who has access to their account data  \nMake it easier and safer for users to share their Google Account data with your app when they choose to do so  \nMake it clear to users the specific data they are sharing with apps\n\n\nWhat we are doing today\n\nIn service of that stewardship, today we are announcing an OAuth consent experience that simplifies how users…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/x0yMKXME5vY/granular-google-account-update.html",
          "publishedOn": "2021-10-11T19:34:00.001Z",
          "wordCount": 2848,
          "title": "Google OAuth incremental authorization improvement"
        }
      ]
    },
    {
      "title": "Many But Finite",
      "feedUrl": "https://feeds.feedburner.com/GustavoDuarte",
      "siteUrl": "https://manybutfinite.com/",
      "articles": []
    },
    {
      "title": "Krister Walfridsson’s old blog",
      "feedUrl": "http://feeds.feedburner.com/KristerWalfridssonsBlog",
      "siteUrl": "https://kristerw.blogspot.com/",
      "articles": [
        {
          "id": "https://kristerw.blogspot.com/2021/10/this-blog-has-moved.html",
          "author": null,
          "description": "I have started blogging again!\nBut I am too annoyed at Blogger, so the new posts will be published in my new blog: https://kristerw.github.io/.",
          "link": "https://kristerw.blogspot.com/2021/10/this-blog-has-moved.html",
          "publishedOn": "2021-10-19T22:27:00.001Z",
          "wordCount": 371,
          "title": "This blog has moved"
        }
      ]
    },
    {
      "title": "Python Insider",
      "feedUrl": "https://feeds.feedburner.com/PythonInsider",
      "siteUrl": "https://pythoninsider.blogspot.com/",
      "articles": [
        {
          "id": "http://feedproxy.google.com/~r/PythonInsider/~3/uo3G1CE85vk/python-398-and-3110a2-are-now-available.html",
          "author": null,
          "description": "Tcl/Tk updates\n\r\nWith the recent release of macOS 12 Monterey, we noticed that tkinter\r\n file dialogs are failing to show up on this new operating system, \r\nincluding in our built-in IDLE. Thanks to rapid help from the Tk team, \r\nand Marc Culler in particular, we were able to fix the issue by bundling\r\n Python 3.9.8 and Python 3.11.0a2 with a fixed Tcl/Tk version. In 3.9.8 \r\nit’s a patched 8.6.11 release while 3.11.0a2 is rocking the \r\nbleeding-edge 8.6.12rc1.\n\r\nSince the issue also affected our latest stable version, 3.10.0, an \r\nupdated macOS installer for this version was issued. You can recognize \r\nit by the post2 version appendix: python-3.10.0post2-macos11.pkg.\r\n We didn’t have to bump the version number of Python itself since there \r\nare no Python source differences between this pac…",
          "link": "http://feedproxy.google.com/~r/PythonInsider/~3/uo3G1CE85vk/python-398-and-3110a2-are-now-available.html",
          "publishedOn": "2021-11-05T23:09:00.000Z",
          "wordCount": 1138,
          "title": "Python 3.9.8 and 3.11.0a2 are now available"
        }
      ]
    },
    {
      "title": "from www.viva64.com",
      "feedUrl": "http://feeds.feedburner.com/viva64-blog-en",
      "siteUrl": "https://pvs-studio.com",
      "articles": [
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0883/",
          "author": null,
          "description": "Imagine: something in code goes wrong, you start searching for a bug and then it turns out that there was another bug behind this. Have you ever been in this situation? Searching for bugs is cool. It's almost like you're Sherlock Holmes and it's a detective story. Something from an extensive list of seemingly harmless classes and functions causes a program's unexpected and undefined behavior. And you, with your sharp eyes and experiments, are trying to find the \"criminal\".  We published and translated this article with the copyright holder's permission. The author is Eugene Zakharov (fnc12@me.com). The article was originally published on Habr.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/ilNokXp9iio/",
          "publishedOn": "2021-11-07T21:00:00.000Z",
          "wordCount": 3469,
          "title": "Undefined behavior, carried through the years"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0882/",
          "author": null,
          "description": "Protocol Buffers is a very popular, cool, and high-quality product that is mostly developed by Google. This is a good challenge for the PVS-Studio static code analyzer. Finding at least something is already an achievement. Let's give it a shot. I am writing about Protocol Buffers (protobuf) as part of a long-term series of articles about checking open-source projects. The library implements a protocol for structured data serialization. This is an effective binary alternative to the XML text format. The project seemed like an intriguing challenge for the PVS-Studio analyzer, because Google takes a very serious approach to the quality of the C++ code it produces. Take, for example, the \"Safer Usage of C++\" document that has been actively discussed recently. Additionally, many developers use protobuf in their projects - which means the protobuf product is well-tested. Finding at least a couple of mistakes in this project is a challenge that we have taken upon us. So what are we waiting for? Time to find out what PVS-Studio can do!",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/5M9qvLkHmTo/",
          "publishedOn": "2021-11-04T21:00:00.000Z",
          "wordCount": 2462,
          "title": "Protocol Buffers, a brutal protocol from Google, vs. PVS-Studio, a static code analyzer"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0881/",
          "author": null,
          "description": "We often check retro games. In our company, many developers like to find interesting projects for themselves. They feel nostalgic when they're studying these projects. But we need to run retro games on something, right? This time we checked a project that helps to run old games on modern hardware. DuckStation is an emulator of the Sony PlayStation console. The emulator, according to its website, has a version for Windows, Linux, and for Android smartphones. And recently it was launched on Xbox Series X and S. The project itself contains slightly less than a million lines of C and C++ code. DuckStation doesn't release updates. Its developers regularly commit changes. So, we had to fixate the SHA of the commit: 13c5ee8. We checked the project and found a lot of warnings - 170 of the High level and 434 of the Medium level. Let's look at the 10 most exciting of them.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/7dHRJ63N0bg/",
          "publishedOn": "2021-11-02T21:00:00.000Z",
          "wordCount": 2781,
          "title": "PVS-Studio searches for bugs in the DuckStation project"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0880/",
          "author": null,
          "description": "The PVS-Studio developers often check open-source projects and write articles about that. Sometimes, when writing an article, we come across interesting situations or epic errors. Of course, we want to write a small note about it. This is one of those cases. At the moment I'm writing an article about checking the DuckStation project. This is an emulator of the Sony PlayStation console. The project is quite interesting and actively developing. I found some interesting bugs and want to share a story about one with you. This article demonstrates: PVS-Studio has issued a warning: V726 An attempt to free memory containing the 'wbuf' array by using the 'free' function. This is incorrect as 'wbuf' was created on stack. log.cpp 216",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/wHV5QmHUnyk/",
          "publishedOn": "2021-10-31T21:00:00.000Z",
          "wordCount": 1956,
          "title": "How a PVS-Studio developer defended a bug in a checked project"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/0879/",
          "author": null,
          "description": "Everyone who runs the static analyzer on a project for the first time is slightly shocked by hundreds, thousands or even tens of thousands of warnings. It may be frustrating. Is my code so terrible? Or is the analyzer lying? In any case, filtering by the severity changes the situation, not completely though. That's why we thought about how we could improve the first experience with the analyzer. Let me show you the new feature step by step... What does a person, who runs code through a static analyzer for the first time, encounter? When run on large projects, a static analyzer produces a huge number of warnings for various code fragments. Yes, it may be an enormous number of warnings. Of course, there will be false positives among them. Alas, static analysis cannot exist without false positives. Therefore, it was necessary to create a new approach that would simplify the process when one is just starting out with the analyzer.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/lCLSrYO4bWo/",
          "publishedOn": "2021-10-28T21:00:00.000Z",
          "wordCount": 1980,
          "title": "Best Warnings of Static Analyzer"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/0878/",
          "author": null,
          "description": "On August 10th, 2021, Microsoft announced the .NET 6 Preview 7 release. We published and translated this article with the copyright holder's permission. The author is DistortNeo. The article was originally published on Habr. [The link to the .NET 6 Preview 7 announcement.]",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/tZ4oqKXP0uY/",
          "publishedOn": "2021-10-26T21:00:00.000Z",
          "wordCount": 2270,
          "title": "Generic Math: C# super feature available in .NET 6 Preview 7"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0877/",
          "author": null,
          "description": "On the stackoverflow.com website, we frequently see questions about how to look for bugs of a certain type. We know that PVS-Studio can solve the problem. Unfortunately, we have to keep silent. Otherwise, StackOverflow moderators may consider it as an obvious attempt to promote our product. This article describes a particular case of such a situation that makes us suffer deeply. The following question: \"Scan-Build for clang-13 not showing errors\" asked by kratos from India, made me write this article. This person asks how to look for patterns of the following type: Here's the code cited as an example:",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/2tQM9cNHJgo/",
          "publishedOn": "2021-10-24T21:00:00.000Z",
          "wordCount": 1758,
          "title": "How we sympathize with a question on StackOverflow but keep silent"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/0876/",
          "author": null,
          "description": "The OWASP Top Ten 2017 category A9 (which became A6 in OWASP Top Ten 2021) is dedicated to using components with known vulnerabilities. To cover this category in PVS-Studio, developers have to turn the analyzer into a full SCA solution. How will the analyzer look for vulnerabilities in the components used? What is SCA? Let's try to find the answers in this article! One of the priority areas for PVS-Studio development is to cover categories from the OWASP Top Ten 2017 in the C# analyzer. We also plan to cover the Top Ten 2021 in the future. The most unusual for us is the A9:2017 category - Using Components with Known Vulnerabilities. This category has the A6 position in the preliminary version of OWASP 2021. The rule implementation for this category is an important task for our analyzer. It allows us to classify PVS-Studio as an SCA (Software Composition Analysis) tool. Which approach to implementation should we choose? Let's figure it out! The A9 threat category (It turned into A6 in the preliminary OWASP 2021 version) is dedicated to using components with known vulnerabilities. These are the components that have the corresponding entries in the CVE database. CVE (Common Vulnerabilities and Exposures) is a database of records about real-life vulnerabilities in software, hardware, service components, etc.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/TMrecqc_OYg/",
          "publishedOn": "2021-10-21T21:00:00.000Z",
          "wordCount": 3650,
          "title": "OWASP Top Ten and Software Composition Analysis (SCA)"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/0875/",
          "author": null,
          "description": "This article covers the new version of the C# language - C# 10. Compared to C# 9, C# 10 includes a short list of enhancements. Below we described the enhancements and added explanatory code fragments. Let's look at them. Now you can set initialization of fields and properties in structures: Beginning with C# 10, you can declare a parameterless constructor in structures:",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/GhghmXeQfhs/",
          "publishedOn": "2021-10-19T21:00:00.000Z",
          "wordCount": 2641,
          "title": "What's new in C# 10: overview"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/0874/",
          "author": null,
          "description": "The PVS-Studio static analyzer allows you to automatically find various problems in the source code. It can also detect code fragments that do not comply with the OWASP Application Security Verification Standard. By default, this feature is disabled due to the specificity of some diagnostic rules. However, you can easily enable it and check your code. This note describes various ways of checking the code for compliance with OWASP ASVS using PVS-Studio.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/85OySUVvKno/",
          "publishedOn": "2021-10-13T21:00:00.000Z",
          "wordCount": 3234,
          "title": "How to check code for compliance with OWASP ASVS using PVS-Studio"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0873/",
          "author": null,
          "description": "Modern applications have lots of code. And the C++ language doesn't get easier. Nowadays, code reviews are not enough to fully analyze program code. Here's where static code analysis comes in.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/Xgk3xjidb8E/",
          "publishedOn": "2021-10-11T21:00:00.000Z",
          "wordCount": 4313,
          "title": "C++ tools evolution: static code analyzers"
        }
      ]
    },
    {
      "title": "Future",
      "feedUrl": "https://future.a16z.com/feed/",
      "siteUrl": "https://future.a16z.com",
      "articles": [
        {
          "id": "https://future.a16z.com/?p=2385",
          "author": "Keith Schacht",
          "description": "Ninety-eight percent of American kids under the age of 10 have access to a smartphone or tablet in their home; 45 percent even have their own device. Over the past decade, modern touchscreen devices have become both intuitive and affordable enough that they’ve gone mainstream among children around the world. But despite this high usage... Read More\nThe post The Future of Kidtech: A Web Browser for the Under-10 Set appeared first on Future.",
          "link": "https://future.a16z.com/web-browser-for-kids/",
          "publishedOn": "2021-11-04T15:00:39.000Z",
          "wordCount": 2080,
          "title": "The Future of Kidtech: A Web Browser for the Under-10 Set"
        },
        {
          "id": "https://future.a16z.com/?p=2352",
          "author": "Tarun Chitra",
          "description": "As DeFi and NFT communities grow enormously in size, how to govern decentralized protocols takes on added importance. Now and over the next few years, one of the most immediate challenges facing these communities is to figure out governance — the act of managing collective decision-making in order to optimize funds and operations. Governance requires... Read More\nThe post Building and Running a DAO: Why Governance Matters appeared first on Future.",
          "link": "https://future.a16z.com/building-and-running-a-dao-why-governance-matters/",
          "publishedOn": "2021-11-03T14:00:39.000Z",
          "wordCount": 4608,
          "title": "Building and Running a DAO: Why Governance Matters"
        },
        {
          "id": "https://future.a16z.com/?p=2268",
          "author": "Nathan Baschez",
          "description": "If there’s one main idea driving excitement in the “creator economy,” it’s this: Creators with large audiences on platforms like Instagram, TikTok, Twitter, and YouTube could generate orders of magnitude increases in revenue if they had better ways to charge fans for content directly, rather than relying on ads or merch sales.  A wave of... Read More\nThe post What’s Next for Creator Platforms? Learning to Sell appeared first on Future.",
          "link": "https://future.a16z.com/creator-platforms-neglect-the-sell/",
          "publishedOn": "2021-10-28T15:00:42.000Z",
          "wordCount": 2528,
          "title": "What’s Next for Creator Platforms? Learning to Sell"
        },
        {
          "id": "https://future.a16z.com/?post_type=podcast&p=2264",
          "author": "Jonathan Lai, Eddy Lazzarin, Vineeta Agarwala, Jay Rughani, Eliezer Van Allen and Zoran Basich",
          "description": "Welcome to 16 Minutes, our show where we talk about tech trends in the news! We have two segments today: 1) The announcement recently that Valve Software, which operates the massive gaming platform Steam, added a rule barring games that use blockchain technologies or that allow users to exchange cryptocurrencies or NFTs – this rule... Read More\nThe post 16 Minutes: Steam Halts Web3 Games; FDA Approves Prostate Cancer AI appeared first on Future.",
          "link": "https://future.a16z.com/podcasts/16-minutes-steam-halts-web3-games-fda-approves-prostate-cancer-ai/",
          "publishedOn": "2021-10-26T19:12:21.000Z",
          "wordCount": 841,
          "title": "16 Minutes: Steam Halts Web3 Games; FDA Approves Prostate Cancer AI"
        },
        {
          "id": "https://future.a16z.com/?p=2241",
          "author": "Rui Ma",
          "description": "How do Chinese tech companies grow so big so fast? Beyond the obvious historic factors — a large market, lax regulations (at least until recently), and the late mover advantage — there’s one key, strategic difference among large Chinese companies: a willingness to aggressively experiment with their core products. The most interesting thing about Chinese... Read More\nThe post The Brazen Strategy Behind China Tech’s Growth appeared first on Future.",
          "link": "https://future.a16z.com/strategy-behind-china-tech/",
          "publishedOn": "2021-10-19T15:00:19.000Z",
          "wordCount": 2208,
          "title": "The Brazen Strategy Behind China Tech’s Growth"
        },
        {
          "id": "https://future.a16z.com/?post_type=podcast&p=2229",
          "author": "Eddy Lazzarin and Zoran Basich",
          "description": "Today’s episode is all about crypto security — that is, the new mindsets and the new strategies for storing crypto assets safely while also allowing holders control and access.  (As a reminder, none of the following should be taken as investment advice, please see a16z.com/disclosures for more important information.)  We’ve covered security trends more broadly... Read More\nThe post Crypto Security and the New Web3 Mindsets for Users appeared first on Future.",
          "link": "https://future.a16z.com/podcasts/crypto-security-and-the-new-web3-mindsets-for-users/",
          "publishedOn": "2021-10-15T20:30:09.000Z",
          "wordCount": 741,
          "title": "Crypto Security and the New Web3 Mindsets for Users"
        },
        {
          "id": "https://future.a16z.com/?p=2191",
          "author": "Angela Strange",
          "description": "Open source will catalyze the financial services industry’s biggest evolution to date. This evolution will shift the power in this $25 trillion industry from business executives to developers, not just in fintech companies, but in centuries-old incumbents, as well.    Until very recently, financial services were notoriously hard and expensive to build. Incumbents and startups alike... Read More\nThe post Open Source Is Finally Coming to Financial Services appeared first on Future.",
          "link": "https://future.a16z.com/open-source-financial-services/",
          "publishedOn": "2021-10-15T15:00:59.000Z",
          "wordCount": 2583,
          "title": "Open Source Is Finally Coming to Financial Services"
        },
        {
          "id": "https://future.a16z.com/?p=2202",
          "author": "Chris Dixon",
          "description": "Major computing waves generally have two eras: the skeuomorphic era and the native era. In the skeuomorphic era, the design thinking is largely adapted from older domains. For example, the early web was mostly digital adaptations of pre-internet activities like letter writing and mail-order shopping. Websites back then were mostly read-only. It took about a... Read More\nThe post Tokens are a New Digital Primitive, Analogous to the Website appeared first on Future.",
          "link": "https://future.a16z.com/tokens-are-a-new-digital-primitive-analogous-to-the-website/",
          "publishedOn": "2021-10-13T15:00:55.000Z",
          "wordCount": 1133,
          "title": "Tokens are a New Digital Primitive, Analogous to the Website"
        },
        {
          "id": "https://future.a16z.com/?p=2193",
          "author": "Parag Khanna",
          "description": "Excerpted from MOVE: The Forces Uprooting Us, by Parag Khanna. Copyright © 2021 by Parag Khanna. Excerpted with permission by Scribner, a division of Simon & Schuster Inc., for Future by a16z.  The Great Lockdown of 2020 was also a Great Reset. Thousands of entrepreneurs chose to become digital nomads, ditching San Francisco for Costa... Read More\nThe post The World Needs a New Protocol for Global Travel appeared first on Future.",
          "link": "https://future.a16z.com/the-world-needs-a-new-protocol-for-global-travel/",
          "publishedOn": "2021-10-12T16:07:14.000Z",
          "wordCount": 2351,
          "title": "The World Needs a New Protocol for Global Travel"
        }
      ]
    },
    {
      "title": "Two Cents",
      "feedUrl": "https://hur.substack.com/feed",
      "siteUrl": "https://hur.substack.com",
      "articles": []
    },
    {
      "title": "Interrupt",
      "feedUrl": "https://interrupt.memfault.com/feed.xml",
      "siteUrl": "https://interrupt.memfault.com/",
      "articles": [
        {
          "id": "https://interrupt.memfault.com/blog/events-and-jobs-pages",
          "author": null,
          "description": "Interrupt now has a community-curated Events and Jobs page! We’ve pre-populated it a bit and we invite and welcome you to submit job listings and events that you believe are relevant to the embedded engineering space.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/events-and-jobs-pages",
          "publishedOn": "2021-11-03T00:00:00.000Z",
          "wordCount": 603,
          "title": "New Events and Jobs Pages on Interrupt"
        },
        {
          "id": "https://interrupt.memfault.com/blog/october-2021-roundup",
          "author": null,
          "description": "Here are the articles, videos, and tools that we’ve been excited about this\nOctober.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/october-2021-roundup",
          "publishedOn": "2021-11-02T00:00:00.000Z",
          "wordCount": 1157,
          "title": "What we've been reading in October"
        },
        {
          "id": "https://interrupt.memfault.com/blog/pre-commit",
          "author": null,
          "description": "This article provides some background and guidelines for using pre-commit to\nautomatically format and lint C-language firmware codebases. We’ll cover general\nguidelines and go over an example set of checks that can be helpful when working\non firmware code.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/pre-commit",
          "publishedOn": "2021-10-27T00:00:00.000Z",
          "wordCount": 2524,
          "title": "Automatically format and lint code with pre-commit"
        },
        {
          "id": "https://interrupt.memfault.com/blog/september-2021-roundup",
          "author": null,
          "description": "Here are the articles, videos, and tools that we’ve been excited about this\nSeptember.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/september-2021-roundup",
          "publishedOn": "2021-10-12T00:00:00.000Z",
          "wordCount": 948,
          "title": "What we've been reading in September"
        }
      ]
    },
    {
      "title": "News & Blog – IoT Security Foundation",
      "feedUrl": "https://www.iotsecurityfoundation.org/blog/feed",
      "siteUrl": "https://www.iotsecurityfoundation.org",
      "articles": [
        {
          "id": "https://www.iotsecurityfoundation.org/?p=21363",
          "author": "-",
          "description": "We are delighted to announce the finalists for the 3rd IoT Security Foundation Champion Award. This award seeks to celebrate organisations which demonstrate stewardship when it comes to IoT security. In alphabetical order, they are: Angoka CENSIS Crypto Quantique EXPLIoT We would also like to thank all other organisations which",
          "link": "https://www.iotsecurityfoundation.org/shortlist-announced-for-the-iot-security-champion-award-2021/",
          "publishedOn": "2021-11-04T09:05:09.000Z",
          "wordCount": 237,
          "title": "Shortlist Announced for the IoT Security Champion Award 2021"
        },
        {
          "id": "https://www.iotsecurityfoundation.org/?p=21344",
          "author": "John",
          "description": "November 4th, 2021: New Report on Industry Adoption of Vulnerability Disclosure Practice Published. The IoT Security Foundation has published its 4th report which examines the practice of vulnerability disclosure in Consumer IoT - with an extension into enterprise and the B2B model. The report is seen as a cybersecurity progress barometer of the sector",
          "link": "https://www.iotsecurityfoundation.org/consumer-iot-sector-basic-hygiene-practice-still-not-happening/",
          "publishedOn": "2021-11-04T09:00:45.000Z",
          "wordCount": 517,
          "title": "Consumer IoT sector – basic cybersecurity hygiene practice still not happening"
        }
      ]
    },
    {
      "title": "james hunt (.us)",
      "feedUrl": "https://jameshunt.us/feed/",
      "siteUrl": "https://jameshunt.us",
      "articles": [
        {
          "id": "https://jameshunt.us/?p=424",
          "author": "jhunt",
          "description": "One of my earliest memory of computers starts on an airplane.",
          "link": "https://jameshunt.us/writings/early-memories-of-computers/",
          "publishedOn": "2021-11-08T18:40:21.000Z",
          "wordCount": 556,
          "title": "Early Memories of Computers"
        },
        {
          "id": "https://jameshunt.us/?p=419",
          "author": "jhunt",
          "description": "Today, I start a new chapter in my career as a technologist and problem-solver, as I officially join Vivanti as a founding member and Principal Consultant. In honor of the occasion, I want to tell you a story about one of my earliest consulting screw-ups",
          "link": "https://jameshunt.us/writings/joining-vivanti/",
          "publishedOn": "2021-11-01T16:20:49.000Z",
          "wordCount": 897,
          "title": "Consulting: Empowerment & Championing"
        }
      ]
    },
    {
      "title": "Jay Carlson",
      "feedUrl": "https://jaycarlson.net/feed",
      "siteUrl": "https://jaycarlson.net",
      "articles": []
    },
    {
      "title": "Kwang Yul Seo",
      "feedUrl": "https://kwangyulseo.com/feed/",
      "siteUrl": "https://kwangyulseo.com",
      "articles": []
    },
    {
      "title": "LimitedResults",
      "feedUrl": "https://limitedresults.com/feed/",
      "siteUrl": "https://limitedresults.com",
      "articles": []
    },
    {
      "title": "Lucky Resistor",
      "feedUrl": "https://luckyresistor.me/feed/",
      "siteUrl": "https://luckyresistor.me",
      "articles": [
        {
          "id": "https://luckyresistor.me/?p=11623",
          "author": "Lucky Resistor",
          "description": "Sometimes I like to have rounded corners in my woodworking projects. It seems many people like to soften the spiky ends of their panels because there is a huge range of templates for routing. If you own a 3d printer, it is handy you can print just the template with the size you actually need....",
          "link": "https://luckyresistor.me/2021/10/29/round-corner-template-set-for-woodworking/",
          "publishedOn": "2021-10-29T17:21:21.000Z",
          "wordCount": 1793,
          "title": "Round Corner Template Set for Woodworking"
        }
      ]
    },
    {
      "title": "LWN.net",
      "feedUrl": "https://lwn.net/headlines/rss",
      "siteUrl": "https://lwn.net",
      "articles": [
        {
          "id": "https://lwn.net/Articles/875367/rss",
          "author": "jake",
          "description": "The Julia programming language has\nits roots in high-performance scientific computing, so it is no surprise\nthat it has facilities for concurrent processing. Those features are not\nwell-known outside of the Julia community, though, so it is interesting to\nsee the different types of parallel and concurrent computation that the\nlanguage supports. In addition, the upcoming release of Julia\nversion 1.7 brings an improvement to the language's\nconcurrent-computation palette, \nin the form of \"task \nmigration\".",
          "link": "https://lwn.net/Articles/875367/rss",
          "publishedOn": "2021-11-09T18:04:06.000Z",
          "wordCount": null,
          "title": "[$] Concurrency in Julia"
        },
        {
          "id": "https://lwn.net/Articles/875531/rss",
          "author": "ris",
          "description": "Security updates have been issued by Arch Linux (firefox, grafana, jenkins, opera, and thunderbird), Debian (botan1.10 and ckeditor), openSUSE (chromium, kernel, qemu, and rubygem-activerecord-5_1), SUSE (qemu and rubygem-activerecord-5_1), and Ubuntu (docker.io, kernel, linux, linux-aws, linux-aws-5.11, linux-azure, linux-azure-5.11, linux-gcp, linux-gcp-5.11, linux-hwe-5.11, linux-kvm, linux-oem-5.13, linux-oracle, linux-oracle-5.11, linux, linux-aws, linux-aws-5.4, linux-azure, linux-azure-5.4, linux-gcp, linux-gcp-5.4, linux-gke, linux-gkeop, linux-gkeop-5.4, linux-hwe-5.4, linux-ibm, linux-kvm, and linux, linux-aws, linux-aws-hwe, linux-azure, linux-azure-4.15, linux-dell300x, linux-gcp-4.15, linux-hwe, linux-kvm, linux-oracle, linux-raspi2, linux-snapdragon).",
          "link": "https://lwn.net/Articles/875531/rss",
          "publishedOn": "2021-11-09T15:43:05.000Z",
          "wordCount": 143,
          "title": "Security updates for Tuesday"
        },
        {
          "id": "https://lwn.net/Articles/875447/rss",
          "author": "ris",
          "description": "The LXD team has announced\nthe release of version 4.20 of the LXD system container and virtual\nmachine manager.\n\nThis is one very busy release with a lot of new features.\n\nVM users will be happy to see the initial implementation of live migration and core scheduling support. Container users are getting new configuration keys to set sysctls.\n\nThen the bulk of the new features are all network related with peer network relationships, network zones for auto-generated DNS and SR-IOV accelerated OVN networks.\n\nAnd lastly, on the clustering front, it’s now possible to better control what servers will be receiving new workloads.",
          "link": "https://lwn.net/Articles/875447/rss",
          "publishedOn": "2021-11-08T17:52:28.000Z",
          "wordCount": 177,
          "title": "LXD 4.20 released"
        },
        {
          "id": "https://lwn.net/Articles/874846/rss",
          "author": "corbet",
          "description": "The x86 instruction set is large, but that doesn't mean it can't get bigger\nyet.  Upcoming Intel processors will feature a new set of instructions\nunder the name of \"Advanced Matrix Extensions\" (AMX) that can be used to\noperate on matrix data.  After a somewhat bumpy development\nprocess, support for AMX has found its way into the upcoming 5.16 kernel.\nUsing it will, naturally, require some changes by application developers.",
          "link": "https://lwn.net/Articles/874846/rss",
          "publishedOn": "2021-11-08T16:25:34.000Z",
          "wordCount": null,
          "title": "[$] Intel AMX support in 5.16"
        },
        {
          "id": "https://lwn.net/Articles/875420/rss",
          "author": "jake",
          "description": "Security updates have been issued by Debian (containerd, redis, and sqlalchemy), Fedora (kernel, radeontop, rpki-client, and webkit2gtk3), openSUSE (java-1_8_0-openj9, libvirt, mailman, transfig, and webkit2gtk3), Oracle (thunderbird), SUSE (libvirt), and Ubuntu (icu).",
          "link": "https://lwn.net/Articles/875420/rss",
          "publishedOn": "2021-11-08T13:58:05.000Z",
          "wordCount": 104,
          "title": "Security updates for Monday"
        },
        {
          "id": "https://lwn.net/Articles/875297/rss",
          "author": "corbet",
          "description": "The\n5.15.1,\n5.14.17,\n5.10.78,\n5.4.158, and\n4.19.216\nstable kernel updates have all been released; each contains another set of\nimportant fixes.",
          "link": "https://lwn.net/Articles/875297/rss",
          "publishedOn": "2021-11-06T20:30:58.000Z",
          "wordCount": 102,
          "title": "Some weekend stable kernel updates"
        },
        {
          "id": "https://lwn.net/Articles/875239/rss",
          "author": "corbet",
          "description": "Konstantin Ryabitsev introduces\nthe \"local email interface\" (lei) functionality for the lore archive of\nkernel mailing lists.\n\n\n\tEven though it started out as merely a list archival service, it\n\tquickly became obvious that lore could be used for a lot more. Many\n\tdevelopers ended up using its search features to quickly locate\n\temails of interest, which in turn raised a simple question — what\n\tif there was a way to “save a search” and have it deliver all new\n\tincoming mail matching certain parameters straight to the\n\tdevelopers' inbox?\n\n\tYou can now do this with lei.",
          "link": "https://lwn.net/Articles/875239/rss",
          "publishedOn": "2021-11-05T18:21:08.000Z",
          "wordCount": 180,
          "title": "Ryabitsev: lore+lei: part 1, getting started"
        },
        {
          "id": "https://lwn.net/Articles/874643/rss",
          "author": "corbet",
          "description": "Back in September, LWN reported on a series\nof block-layer optimizations that enabled a suitably equipped system to\nsustain 3.5 million I/O operations per second (IOPS).  That\noptimization work has continued since then, and those 3.5 million IOPS\nwould be a deeply disappointing result now.  A recent disagreement over the\naddition of a new feature has highlighted the potential cost of a heavily\noptimized block layer, though; when is a feature deemed important enough to\noutweigh the drive for maximum performance?",
          "link": "https://lwn.net/Articles/874643/rss",
          "publishedOn": "2021-11-05T14:47:23.000Z",
          "wordCount": null,
          "title": "[$] The balance between features and performance in the block layer"
        },
        {
          "id": "https://lwn.net/Articles/875212/rss",
          "author": "jake",
          "description": "Security updates have been issued by Debian (python3.5, redis, and udisks2), Fedora (rust), openSUSE (binutils, java-1_8_0-openj9, and qemu), Oracle (firefox and httpd), Red Hat (thunderbird), Scientific Linux (thunderbird), and SUSE (binutils, qemu, and systemd).",
          "link": "https://lwn.net/Articles/875212/rss",
          "publishedOn": "2021-11-05T14:26:34.000Z",
          "wordCount": 107,
          "title": "Security updates for Friday"
        },
        {
          "id": "https://lwn.net/Articles/875189/rss",
          "author": "corbet",
          "description": "Ariadne Conill shares\nsome experience of working in the online advertising industry.\n\n\n\tThe cycle of patching on both sides is ongoing to this day. A\n\tfriend of mine on Twitter referred to this tug-of-war as “core\n\twar,” which is an apt description: all of the involved actors are\n\ttrying to patch each other out of being able to commit or detect\n\tsubterfuge, and your browser gets slower and slower as more\n\tmitigations and countermeasures are layered on. If you’re not using\n\tan ad blocker yet, stop reading this, and install one: your browser\n\twill suddenly be a lot more performant.",
          "link": "https://lwn.net/Articles/875189/rss",
          "publishedOn": "2021-11-05T14:16:23.000Z",
          "wordCount": 193,
          "title": "Conill: an inside look into the illicit ad industry"
        },
        {
          "id": "https://lwn.net/Articles/875154/rss",
          "author": "corbet",
          "description": "The Record is reporting\non massive exploitation of an oldish vulnerability in GitLab instances.\n\n\n\tWhile the purpose of these attacks remained unclear for HN\n\tSecurity, yesterday, Google’s Menscher said the hacked servers were\n\tpart of a botnet comprising of “thousands of compromised GitLab\n\tinstances” that was launching large-scale DDoS attacks.\n\n\nThe vulnerability was fixed\nin April, but evidently a lot of sites have not updated.",
          "link": "https://lwn.net/Articles/875154/rss",
          "publishedOn": "2021-11-05T02:27:27.000Z",
          "wordCount": 161,
          "title": "GitLab servers are being exploited in DDoS attacks (The Record)"
        },
        {
          "id": "https://lwn.net/Articles/875132/rss",
          "author": "jake",
          "description": "Over at the SAMBA+ blog, the performance of the new ksmbd kernel SMB server and Samba in user space are compared:\n\nksmbd claims performance improvements on a wide range of benchmarks: the graphs on this page show a doubling of performance on some tests. There was also the notion that an in-kernel server is likely an easier place to support SMB Direct, which uses RDMA to transfer data between systems.\n\nClearly, those number are impressive, but at the same time recent improvements in Samba's IO performance put this into perspective: by leveraging the new \"io_uring\" Linux API Samba is able to provide roughly 10x the throughput compared to ksmbd.\n\nTime will tell whether it's better to reside in kernel-space like ksmbd or in user-space like Samba in order to squeeze the last bit of performance out of the available hardware.\n\n\nThere are two graphs that show some impressive results for Samba.",
          "link": "https://lwn.net/Articles/875132/rss",
          "publishedOn": "2021-11-04T17:59:12.000Z",
          "wordCount": 241,
          "title": "ksmbd: a new in-kernel SMB server (SAMBA+ blog)"
        },
        {
          "id": "https://lwn.net/Articles/875108/rss",
          "author": "corbet",
          "description": "Patrick Horgan explains\nthe process of starting a program on Linux in great detail.\n\n\n\n\tWell, __libc_start_main calls __libc_init_first,\n\twho immediately uses secret inside information to find the\n\tenvironment variables just after the terminating null of the\n\targument vector and then sets a global variable __environ\n\twhich __libc_start_main uses thereafter whenever it needs\n\tit including when it calls main. After the envp\n\tis established, then __libc_start_main uses the same trick\n\tand surprise! Just past the terminating null at the end of the\n\tenvp array, there's another vector, the ELF auxiliary\n\tvector the loader uses to pass some information to the process. An\n\teasy way to see what's in there is to set the environment variable\n\tLD_SHOW_AUXV=1 before running the program.",
          "link": "https://lwn.net/Articles/875108/rss",
          "publishedOn": "2021-11-04T14:51:04.000Z",
          "wordCount": 203,
          "title": "Horgan: Linux x86 Program Start Up"
        },
        {
          "id": "https://lwn.net/Articles/874683/rss",
          "author": "corbet",
          "description": "As of this writing, Linus Torvalds has pulled exactly 6,800 non-merge\nchangesets into the mainline repository for the 5.16 kernel release.  That\nis probably a little over half of what will arrive during this merge\nwindow, so this is a good time to catch up on what has been pulled so far.\nThere are many significant changes and some large-scale restructuring of\ninternal kernel code, but relatively few ground-breaking new\nfeatures.",
          "link": "https://lwn.net/Articles/874683/rss",
          "publishedOn": "2021-11-04T14:43:11.000Z",
          "wordCount": null,
          "title": "[$] 5.16 Merge window, part 1"
        },
        {
          "id": "https://lwn.net/Articles/875106/rss",
          "author": "jake",
          "description": "Security updates have been issued by Fedora (ansible, chromium, kernel, mupdf, python-PyMuPDF, rust, and zathura-pdf-mupdf), openSUSE (qemu and webkit2gtk3), Red Hat (firefox and kpatch-patch), Scientific Linux (firefox), SUSE (qemu, tomcat, and webkit2gtk3), and Ubuntu (firefox and thunderbird).",
          "link": "https://lwn.net/Articles/875106/rss",
          "publishedOn": "2021-11-04T14:17:47.000Z",
          "wordCount": 110,
          "title": "Security updates for Thursday"
        },
        {
          "id": "https://lwn.net/Articles/874214/rss",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for November 4, 2021 is available.",
          "link": "https://lwn.net/Articles/874214/rss",
          "publishedOn": "2021-11-04T01:45:39.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for November 4, 2021"
        },
        {
          "id": "https://lwn.net/Articles/874951/rss",
          "author": "jake",
          "description": "A new security vulnerability that was disclosed\non November 1 has some interesting properties.  \"Trojan Source\", as it has been\ndubbed, is effectively an attack on human perceptions, especially as they\nare filtered through the tools used for source-code review.  While the\nspecifics of the flaw are new, this kind of trickery is not completely\nnovel, but Trojan Source finds another way to confuse the humans who are\nin the loop.",
          "link": "https://lwn.net/Articles/874951/rss",
          "publishedOn": "2021-11-03T22:21:26.000Z",
          "wordCount": null,
          "title": "[$] Trojan Source: tricks (no treats) with Unicode"
        },
        {
          "id": "https://lwn.net/Articles/874980/rss",
          "author": "ris",
          "description": "Security updates have been issued by Fedora (CuraEngine, curl, firefox, php, and vim), openSUSE (apache2, pcre, salt, transfig, and util-linux), Oracle (.NET 5.0, curl, kernel, libsolv, python3, samba, and webkit2gtk3), and Red Hat (flatpak).",
          "link": "https://lwn.net/Articles/874980/rss",
          "publishedOn": "2021-11-03T15:31:44.000Z",
          "wordCount": 107,
          "title": "Security updates for Wednesday"
        },
        {
          "id": "https://lwn.net/Articles/874642/rss",
          "author": "jake",
          "description": "While it is often relatively straightforward to determine what package\nprovided a binary that is misbehaving—crashing for instance—on Fedora and\nother Linux distributions, there are situations where it may be harder to\ndo so.  A feature recently proposed for Fedora 36—currently\nscheduled for the end of April 2022—would embed information into the\nbinaries themselves to show where they came from.  It is part of a\nmulti-distribution effort to standardize how this information is stored in\nthe binaries (and the libraries they use) to assist crash-reporting and other tools.",
          "link": "https://lwn.net/Articles/874642/rss",
          "publishedOn": "2021-11-02T23:09:24.000Z",
          "wordCount": null,
          "title": "[$] Adding package information to ELF objects"
        },
        {
          "id": "https://lwn.net/Articles/874850/rss",
          "author": "ris",
          "description": "Stable kernels 5.14.16, 5.10.77, 5.4.157, 4.19.215, 4.14.254, 4.9.289, and 4.4.291 have been released.  They contain\nimportant fixes and users should upgrade.",
          "link": "https://lwn.net/Articles/874850/rss",
          "publishedOn": "2021-11-02T20:10:35.000Z",
          "wordCount": 96,
          "title": "Stable kernel updates"
        },
        {
          "id": "https://lwn.net/Articles/874832/rss",
          "author": "ris",
          "description": "Firefox 94.0 has been\nreleased. Linux users should see improved\nWebGL performance and reduced power consumption for many workloads. The\nabout:unloads\npage shows the user information about open tabs and allows them to release\nsystem resources by unloading tabs without closing them.  Site\nIsolation provides better protection against side-channel attacks. See\nthe announcement for more new features in this release.\n\nFirefox ESR\n91.3 is also available, with various stability, functionality,  and security\nfixes.",
          "link": "https://lwn.net/Articles/874832/rss",
          "publishedOn": "2021-11-02T17:34:40.000Z",
          "wordCount": 162,
          "title": "Firefox 94.0 and Firefox ESR 91.3.0"
        },
        {
          "id": "https://lwn.net/Articles/873334/rss",
          "author": "corbet",
          "description": "Since the early days, Unix-like systems have implemented the concept of\nprocess priorities, where higher-priority processes are given more\nCPU time to get their work done.  Implementations have changed, and\nalternatives (such as deadline scheduling)\nare available for specialized situations, but the core priority (or, in an\ninverted sense, \"niceness\") concept \nremains essentially the same.  What should happen, though, in a world where\nincreasing amounts of computing work is done outside of the CPU?  Tvrtko\nUrsulin has put together a\npatch set showing how the nice mechanism can be extended to GPUs as\nwell.",
          "link": "https://lwn.net/Articles/873334/rss",
          "publishedOn": "2021-10-22T14:59:12.000Z",
          "wordCount": null,
          "title": "[$] Synchronized GPU priority scheduling"
        },
        {
          "id": "https://lwn.net/Articles/873746/rss",
          "author": "jake",
          "description": "Security updates have been issued by Arch Linux (apache, chromium, nodejs, nodejs-lts-erbium, nodejs-lts-fermium, and virtualbox), Fedora (vsftpd and watchdog), Oracle (java-1.8.0-openjdk, java-11-openjdk, and redis:6), and Ubuntu (libcaca, linux-aws, linux-aws-5.4, linux-azure, linux-azure-5.4, linux-gke, linux-gke-5.4, linux-gkeop, linux-gkeop-5.4, linux-oracle, linux-oracle-5.4, linux-raspi, linux-raspi-5.4, linux-azure-5.8, and mailman).",
          "link": "https://lwn.net/Articles/873746/rss",
          "publishedOn": "2021-10-22T13:34:31.000Z",
          "wordCount": 115,
          "title": "Security updates for Friday"
        },
        {
          "id": "https://lwn.net/Articles/873675/rss",
          "author": "corbet",
          "description": "The Jalopnik automotive site has posted an\narticle on a\n(relatively) new set\nof open-source tools that can extract log data from Tesla cars.\n\n\n\tSince Tesla cars run a Debian-based operating system, navigating\n\tthrough their file systems is somewhat trivial to anyone who’s\n\tspent a weekend messing with virtual Linux machines (or watching\n\tMr. Robot). Actually accessing the car’s memory, however, is\n\tconsiderably harder: all cases require at least partially\n\tdisassembling the dashboard, and some even require disassembly of\n\tthe car’s media control unit.\n\n\tOnce that’s done, however, the data trove is incredible.",
          "link": "https://lwn.net/Articles/873675/rss",
          "publishedOn": "2021-10-21T23:24:35.000Z",
          "wordCount": 192,
          "title": "You Can Now Directly Read Data Logs From Tesla Vehicles (Jalopnik)"
        },
        {
          "id": "https://lwn.net/Articles/873655/rss",
          "author": "jake",
          "description": "The Rust language project has announced the release of stable version 1.56.0 and the Rust 2021 edition. \n\nWe wrote about plans for the Rust 2021 Edition in May. Editions are a mechanism for opt-in changes that may otherwise pose backwards compatibility risk. See the edition guide for details on how this is achieved. This is a smaller edition, especially compared to 2018, but there are still some nice quality-of-life changes that require an edition opt-in to avoid breaking some corner cases in existing code.\n\n\nSee the detailed \nrelease notes for 1.56.0 for lots more information on the release.",
          "link": "https://lwn.net/Articles/873655/rss",
          "publishedOn": "2021-10-21T19:35:17.000Z",
          "wordCount": 182,
          "title": "Announcing Rust 1.56.0 and Rust 2021"
        },
        {
          "id": "https://lwn.net/Articles/873629/rss",
          "author": "corbet",
          "description": "For those who are curious about where the development of Git is headed:\nJohannes Schindelin has posted an\nextensive set of notes from the just-concluded Git Contributors'\nSummit.\n\n\nWe held our second all-virtual Summit over the past two days. It was the\ntraditional unconference style meeting, with topics being proposed and\nvoted on right before the introduction round. It was really good to see\nthe human faces behind those email addresses.\n\n32 contributors participated, and we spanned the timezones from PST to\nIST.\n\n\nBe sure to go into the thread for the full notes.",
          "link": "https://lwn.net/Articles/873629/rss",
          "publishedOn": "2021-10-21T15:04:13.000Z",
          "wordCount": 181,
          "title": "Notes from the 2021 Git Contributors' Summit"
        },
        {
          "id": "https://lwn.net/Articles/873244/rss",
          "author": "corbet",
          "description": "While the BPF virtual machine has been supported by Linux for most of\nthe kernel's existence, its role for much of that time was limited to, as\nits full\nname (Berkeley packet filter) would suggest, filtering packets.  That began to change in 2012 with the introduction\nof seccomp() filtering, and the pace picked up in 2014 with the arrival\nof the extended BPF virtual machine.  At this point, BPF hooks have found their\nway into many kernel subsystems.  One area that has remained BPF-free,\nthough, is the CPU scheduler; that could change if some version of\nthis patch\nset from Roman Gushchin finds its way into the mainline.",
          "link": "https://lwn.net/Articles/873244/rss",
          "publishedOn": "2021-10-21T14:15:45.000Z",
          "wordCount": null,
          "title": "[$] Controlling the CPU scheduler with BPF"
        },
        {
          "id": "https://lwn.net/Articles/873601/rss",
          "author": "jake",
          "description": "Security updates have been issued by Debian (python-babel, squashfs-tools, and uwsgi), Fedora (gfbgraph and rust-coreos-installer), Mageia (aom, libslirp, redis, and vim), openSUSE (fetchmail, go1.16, go1.17, mbedtls, ncurses, python, squid, and ssh-audit), Red Hat (java-1.8.0-openjdk and java-11-openjdk), Scientific Linux (java-1.8.0-openjdk and java-11-openjdk), SUSE (fetchmail, git, go1.16, go1.17, ncurses, postgresql10, python, python36, and squid), and Ubuntu (linux, linux-aws, linux-aws-hwe, linux-azure, linux-azure-4.15, linux-dell300x, linux-gcp, linux-gcp-4.15, linux-hwe, linux-kvm, linux-raspi2, linux-snapdragon, linux, linux-bluefield, linux-gcp-5.4, linux-hwe-5.4, linux-kvm, linux-oem-5.10, and linux-oem-5.13).",
          "link": "https://lwn.net/Articles/873601/rss",
          "publishedOn": "2021-10-21T14:00:06.000Z",
          "wordCount": 147,
          "title": "Security updates for Thursday"
        },
        {
          "id": "https://lwn.net/Articles/872946/rss",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for October 21, 2021 is available.",
          "link": "https://lwn.net/Articles/872946/rss",
          "publishedOn": "2021-10-21T00:41:01.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for October 21, 2021"
        },
        {
          "id": "https://lwn.net/Articles/873415/rss",
          "author": "jake",
          "description": "A new style of GPL-enforcement lawsuit was\nfiled on October 19 by Software Freedom Conservancy (SFC)\nagainst television maker Vizio.  Unlike previous GPL-enforcement suits, which\nhave been pursued on behalf of the developers and copyright holders of\nGPL-licensed code, this suit has been filed on behalf of owners of the TVs\nin question.  The idea that owners of devices that contain code under the\nGPL have the right to access that code seems clearly embodied in the\nlicense, but it remains to be seen if the courts will decide that those\nowners have the legal standing to sue for relief.",
          "link": "https://lwn.net/Articles/873415/rss",
          "publishedOn": "2021-10-20T21:59:10.000Z",
          "wordCount": null,
          "title": "[$] Empowering users of GPL software"
        },
        {
          "id": "https://lwn.net/Articles/873463/rss",
          "author": "ris",
          "description": "Stable kernels 5.14.14, 5.10.75, 5.4.155, 4.19.213, and 4.14.252 have been released.  They all contain\nimportant fixes and users of those series should upgrade.",
          "link": "https://lwn.net/Articles/873463/rss",
          "publishedOn": "2021-10-20T15:35:52.000Z",
          "wordCount": 98,
          "title": "Stable kernel updates"
        },
        {
          "id": "https://lwn.net/Articles/873462/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (ffmpeg, smarty3, and strongswan), Fedora (udisks2), openSUSE (flatpak, strongswan, util-linux, and xstream), Oracle (redis:5), Red Hat (java-1.8.0-openjdk, java-11-openjdk, openvswitch2.11, redis:5, redis:6, and rh-redis5-redis), SUSE (flatpak, python-Pygments, python3, strongswan, util-linux, and xstream), and Ubuntu (linux, linux-aws, linux-aws-5.11, linux-azure, linux-azure-5.11, linux-gcp, linux-gcp-5.11, linux-hwe-5.11, linux-kvm, linux-raspi and strongswan).",
          "link": "https://lwn.net/Articles/873462/rss",
          "publishedOn": "2021-10-20T15:26:55.000Z",
          "wordCount": 125,
          "title": "Security updates for Wednesday"
        },
        {
          "id": "https://lwn.net/Articles/873410/rss",
          "author": "jake",
          "description": "Over at the Project Zero blog, Jann Horn has a lengthy post on a kernel bug, ways to exploit it, and various ideas on mitigation.  While the exploitation analysis is highly detailed, more than half of the post looks at various defenses to this kind of bug.\n\n\nThis blog post describes a straightforward Linux kernel locking bug and how I exploited it against Debian Buster's 4.19.0-13-amd64 kernel. Based on that, it explores options for security mitigations that could prevent or hinder exploitation of issues similar to this one.\n\nI hope that stepping through such an exploit and sharing this compiled knowledge with the wider security community can help with reasoning about the relative utility of various mitigation approaches.\n\nA lot of the individual exploitation techniques and mitigation options that I am describing here aren't novel. However, I believe that there is value in writing them up together to show how various mitigations interact with a fairly normal use-after-free exploit.",
          "link": "https://lwn.net/Articles/873410/rss",
          "publishedOn": "2021-10-20T13:20:04.000Z",
          "wordCount": 278,
          "title": "How a simple Linux kernel memory corruption bug can lead to complete system compromise (Project Zero)"
        },
        {
          "id": "https://lwn.net/Articles/873255/rss",
          "author": "jake",
          "description": "On October 11, the first release candidate for Qubes OS version 4.1 was announced. Qubes OS\nis a security-oriented desktop operating system that uses multiple virtual\nmachines (VMs or \"qubes\") to isolate\nvarious types of functionality.  The idea is to compartmentalize different\napplications and operating-system subsystems to protect them from each\nother and to limit access to the user's data if an application is\ncompromised.  Version 4.1 will bring several important enhancements to\nhelp Qubes OS continue to live up to its motto: \"A reasonably secure operating\nsystem\".",
          "link": "https://lwn.net/Articles/873255/rss",
          "publishedOn": "2021-10-20T00:35:01.000Z",
          "wordCount": null,
          "title": "[$] Moving toward Qubes OS 4.1"
        },
        {
          "id": "https://lwn.net/Articles/873338/rss",
          "author": "jake",
          "description": "Software Freedom Conservancy has announced that it filed suit against TV maker Vizio over \"repeated failures to fulfill even the basic requirements of the General Public License (GPL)\".  The organization raised the problems with Vizio in August 2018, but the company stopped responding in January 2020, according to the announcement. \n\n\"We are asking the court to require Vizio to make good on its obligations under copyleft compliance requirements,\" says [Software Freedom Conservancy executive director Karen] Sandler. She explains that in past litigation, the plaintiffs have always been copyright holders of the specific GPL code. In this case, Software Freedom Conservancy hopes to demonstrate that it's not just the copyright holders, but also the receivers of the licensed code who are entitled to rights.\n\nThe lawsuit suit seeks no monetary damages, but instead seeks access to the technical information that the copyleft licenses require Vizio to provide to all customers who purchase its TVs (specifically, the plaintiff is asking for the technical information via \"specific performance\" rather than \"damages\").\n\n\nThe complaint is also available.",
          "link": "https://lwn.net/Articles/873338/rss",
          "publishedOn": "2021-10-19T17:50:05.000Z",
          "wordCount": 263,
          "title": "SFC files suit against Vizio over GPL violations"
        },
        {
          "id": "https://lwn.net/Articles/873307/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (redmine and strongswan), Fedora (containerd, fail2ban, grafana, moby-engine, and thunderbird), openSUSE (curl, firefox, glibc, kernel, libqt5-qtsvg, rpm, ssh-audit, systemd, and webkit2gtk3), Red Hat (389-ds:1.4, curl, kernel, kernel-rt, redis:5, and systemd), SUSE (util-linux), and Ubuntu (ardour, linux-azure, linux-azure-5.11, and strongswan).",
          "link": "https://lwn.net/Articles/873307/rss",
          "publishedOn": "2021-10-19T14:54:19.000Z",
          "wordCount": 119,
          "title": "Security updates for Tuesday"
        },
        {
          "id": "https://lwn.net/Articles/873066/rss",
          "author": "corbet",
          "description": "Differences of opinion over which kernel symbols should be exported to\nloadable modules have been anything but uncommon over the years.  Often,\nthese disagreements relate to which kernel capabilities should be available\nto proprietary modules.  Sometimes, though, it hinges on the disagreements\nover the best way to solve a problem.  The recent discussion around the\nremoval of an export for a core kernel function is a case in point.",
          "link": "https://lwn.net/Articles/873066/rss",
          "publishedOn": "2021-10-18T14:45:42.000Z",
          "wordCount": null,
          "title": "[$] A disagreement over get_mm_exe_file()"
        },
        {
          "id": "https://lwn.net/Articles/873210/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (amd64-microcode, libreoffice, linux-4.19, and nghttp2), Fedora (chromium, libopenmpt, vim, and xen), openSUSE (firefox, kernel, krb5, libaom, and opera), Oracle (thunderbird), SUSE (firefox, firefox, rust-cbindgen, iproute2, javapackages-tools, javassist, mysql-connector-java, protobuf, python-python-gflags, and krb5), and Ubuntu (nginx).",
          "link": "https://lwn.net/Articles/873210/rss",
          "publishedOn": "2021-10-18T14:26:30.000Z",
          "wordCount": 115,
          "title": "Security updates for Monday"
        },
        {
          "id": "https://lwn.net/Articles/873176/rss",
          "author": "corbet",
          "description": "The 5.15-rc6 kernel prepatch is out.\n\"I'd love to say that it's all looking average, but rc6 is actually\nbigger than rc5 was, and larger than normal for this time in the\nrelease cycle.\n\nIt's not _enormously_ larger than normal, and it's not the largest rc6\nwe've had, but it's still slightly worrisome.\"",
          "link": "https://lwn.net/Articles/873176/rss",
          "publishedOn": "2021-10-18T13:46:18.000Z",
          "wordCount": 128,
          "title": "Kernel prepatch 5.15-rc6"
        },
        {
          "id": "https://lwn.net/Articles/873150/rss",
          "author": "corbet",
          "description": "Greg Kroah-Hartman has released the\n5.14.13,\n5.10.74,\n5.4.154,\n4.19.212,\n4.14.251,\n4.9.287, and\n4.4.289\nstable kernel updates.  Each contains another set of important fixes.",
          "link": "https://lwn.net/Articles/873150/rss",
          "publishedOn": "2021-10-18T01:09:20.000Z",
          "wordCount": 104,
          "title": "A set of stable kernels"
        },
        {
          "id": "https://lwn.net/Articles/872710/rss",
          "author": "corbet",
          "description": "The name Debian brings to mind a Linux\ndistribution, but the Debian project is far more than that; it is an\nongoing experiment in democratic project governance.  Debian's processes\ncan result in a lot of public squabbling; one should not lose track,\nthough, of the fact that those processes have enabled a large community to\nmaintain and grow a complex distribution for decades without the benefit of\nan overseeing corporate overlord.  Processes can be improved, though; a\nrecent proposal\nfrom Russ Allbery gives an interesting picture of where the pain points\nare and what can be made better.",
          "link": "https://lwn.net/Articles/872710/rss",
          "publishedOn": "2021-10-15T14:35:27.000Z",
          "wordCount": null,
          "title": "[$] Possible changes to Debian's decision-making processes"
        },
        {
          "id": "https://lwn.net/Articles/873056/rss",
          "author": "jake",
          "description": "Security updates have been issued by Debian (squashfs-tools, tomcat9, and wordpress), Fedora (openssh), openSUSE (kernel, mbedtls, and rpm), Oracle (httpd, kernel, and kernel-container), SUSE (firefox, kernel, and rpm), and Ubuntu (linux-azure, linux-azure-5.4).",
          "link": "https://lwn.net/Articles/873056/rss",
          "publishedOn": "2021-10-15T14:14:27.000Z",
          "wordCount": 105,
          "title": "Security updates for Friday"
        },
        {
          "id": "https://lwn.net/Articles/872970/rss",
          "author": "jake",
          "description": "The latest release of the Ubuntu Linux distribution is out: Ubuntu 21.10, code named \"Impish Indri\".  The release notes fills in all of the details for the new features in this version, but the announcement lists some as well:\n\n\nUbuntu Desktop 21.10 makes wayland sessions available while using the \nNvidia proprietary driver. PulseAudio 15 introduces support for Bluetooth\nLDAC and AptX codecs, as well as HFP Bluetooth profiles providing better\naudio quality. The recovery key feature at installation time has been\nimproved, with the recovery key now optional, stronger and editable.\nUbuntu Desktop 21.10 includes GNOME version 40, with a new and\nimproved Activities Overview design. Workspaces are now arranged\nhorizontally, and the overview and app grid are accessed vertically.\nEach direction has accompanying keyboard shortcuts, touchpad gestures\nand mouse actions.\n\nUbuntu Server 21.10 integrates recent innovations from key open\ninfrastructure projects like OpenStack Xena, QEMU 6.0, PHP8, libvirt 7.6,\nKubernetes, and Ceph with advanced life-cycle management tools for\nmulti-cloud and on-prem operations from bare metal, VMWare and\nOpenStack, to every major public cloud.",
          "link": "https://lwn.net/Articles/872970/rss",
          "publishedOn": "2021-10-14T17:32:52.000Z",
          "wordCount": 250,
          "title": "Ubuntu 21.10 (Impish Indri) released"
        },
        {
          "id": "https://lwn.net/Articles/872963/rss",
          "author": "corbet",
          "description": "Version 4.0 of the Devuan distribution has been released; it is code-named\nChimaera.  This release is based on Debian Bullseye, has improved desktop\nsupport, and benefits from more accessibility work.  See the\nrelease notes for details.",
          "link": "https://lwn.net/Articles/872963/rss",
          "publishedOn": "2021-10-14T16:20:49.000Z",
          "wordCount": 109,
          "title": "Devuan 4.0 (Chimaera) released"
        },
        {
          "id": "https://lwn.net/Articles/872869/rss",
          "author": "corbet",
          "description": "Concerns over the performance of programs written in Python are often\noverstated — for some use cases, at least.  But there is no getting around\nthe problem imposed by the infamous global interpreter lock (GIL), which\nseverely limits the concurrency of multi-threaded Python code.  Various\nefforts to remove the GIL have been made\nover the years, but none have come anywhere near the point where they would\nbe considered for inclusion into the CPython interpreter.  Now, though, Sam\nGross has entered\nthe arena with a proof-of-concept implementation that may solve the\nproblem for real.",
          "link": "https://lwn.net/Articles/872869/rss",
          "publishedOn": "2021-10-14T14:31:12.000Z",
          "wordCount": null,
          "title": "[$] A viable solution for Python concurrency"
        },
        {
          "id": "https://lwn.net/Articles/872952/rss",
          "author": "corbet",
          "description": "The KDE project is celebrating its 25th anniversary with a special release\nof the Plasma desktop.\n\n\n\tThis time around, Plasma renews its looks and, not only do you get\n\ta new wallpaper, but also a gust of fresh air from an updated\n\ttheme: Breeze - Blue Ocean. The new Breeze theme makes KDE apps and\n\ttools not only more attractive, but also easier to use both on the\n\tdesktop and your phone and tablet.\n\n\tOf course, looks are not the only you can expect from Plasma 25AE:\n\textra speed, increased reliability and new features have also found\n\ttheir way into the app launcher, the software manager, the Wayland\n\timplementation, and most other Plasma tools and utilities.\n\n\nLots of details can be found in the\nchangelog.",
          "link": "https://lwn.net/Articles/872952/rss",
          "publishedOn": "2021-10-14T14:03:38.000Z",
          "wordCount": 206,
          "title": "Plasma 25th Anniversary Edition released"
        },
        {
          "id": "https://lwn.net/Articles/872945/rss",
          "author": "jake",
          "description": "Security updates have been issued by Mageia (golang, grilo, mediawiki, plib, python-flask-restx, python-mpmath, thunderbird, and xstream/xmlpull/mxparser), Oracle (389-ds-base, grafana, httpd:2.4, kernel, libxml2, and openssl), Red Hat (httpd), and SUSE (kernel).",
          "link": "https://lwn.net/Articles/872945/rss",
          "publishedOn": "2021-10-14T13:48:18.000Z",
          "wordCount": 103,
          "title": "Security updates for Thursday"
        },
        {
          "id": "https://lwn.net/Articles/872157/rss",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for October 14, 2021 is available.",
          "link": "https://lwn.net/Articles/872157/rss",
          "publishedOn": "2021-10-14T00:50:58.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for October 14, 2021"
        },
        {
          "id": "https://lwn.net/Articles/872649/rss",
          "author": "jake",
          "description": "The syzbot\nkernel-fuzzing system finds an enormous number of bugs, but, since many \nof them may seem to be of a relatively low severity, they have a lower priority\nwhen contending for the attention of developers.  A talk\nat the recent Linux \nSecurity Summit North America reported on some research that\ndug further into the bugs that syzbot has\nfound; the results are rather worrisome.  Rather than a pile of\ndifficult- or impossible-to-exploit bugs, there are numerous, more serious\nproblems lurking within.",
          "link": "https://lwn.net/Articles/872649/rss",
          "publishedOn": "2021-10-13T21:22:06.000Z",
          "wordCount": null,
          "title": "[$] Scrutinizing bugs found by syzbot"
        },
        {
          "id": "https://lwn.net/Articles/872845/rss",
          "author": "ris",
          "description": "Stable kernels 5.14.12, 5.10.73, 5.4.153, and 4.19.211 have been released with important\nfixes. Users of those series should upgrade.",
          "link": "https://lwn.net/Articles/872845/rss",
          "publishedOn": "2021-10-13T14:57:37.000Z",
          "wordCount": 94,
          "title": "Four stable kernels"
        },
        {
          "id": "https://lwn.net/Articles/871490/rss",
          "author": "jake",
          "description": "We recently looked at\nsome of the changes and new features arriving with the upcoming\nversion 1.7 release of the Julia programming language.\nThe package system provided by the language makes it easier to\nexplore new language versions, while still preserving \nmultiple versions of various parts of the ecosystem.  This flexible system\ntakes care of dependency management, both \nfor writing exploratory code in the REPL and for\ndeveloping projects or libraries.",
          "link": "https://lwn.net/Articles/871490/rss",
          "publishedOn": "2021-10-13T14:55:19.000Z",
          "wordCount": null,
          "title": "[$] Digging into Julia's package system"
        },
        {
          "id": "https://lwn.net/Articles/872843/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (flatpak and ruby2.3), Fedora (flatpak, httpd, mediawiki, redis, and xstream), openSUSE (kernel, libaom, libqt5-qtsvg, systemd, and webkit2gtk3), Red Hat (.NET 5.0, 389-ds-base, httpd:2.4, kernel, kernel-rt, libxml2, openssl, and thunderbird), Scientific Linux (389-ds-base, kernel, libxml2, and openssl), SUSE (apache2-mod_auth_openidc, curl, glibc, kernel, libaom, libqt5-qtsvg, systemd, and webkit2gtk3), and Ubuntu (squashfs-tools).",
          "link": "https://lwn.net/Articles/872843/rss",
          "publishedOn": "2021-10-13T14:50:37.000Z",
          "wordCount": 129,
          "title": "Security updates for Wednesday"
        },
        {
          "id": "https://lwn.net/Articles/872321/rss",
          "author": "jake",
          "description": "There are many barriers to producing software that is reliable and\nmaintainable over the long term.  One of those is software complexity.  At\nthe recently concluded 2021 KVM\nForum, Paolo Bonzini\nexplored\nthis topic, using QEMU, the open source emulator\nand virtualizer, as a case study.  Drawing on his experience as\na maintainer of several QEMU subsystems, he made some concrete\nsuggestions on how to defend against undesirable complexity.  Bonzini\nused QEMU as a running example throughout the talk, hoping to make it\neasier for future contributors to modify QEMU.  However, the\nlessons he shared are equally applicable to many other projects.",
          "link": "https://lwn.net/Articles/872321/rss",
          "publishedOn": "2021-10-12T18:34:10.000Z",
          "wordCount": null,
          "title": "[$] A QEMU case study in grappling with software complexity"
        },
        {
          "id": "https://lwn.net/Articles/872696/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (firefox-esr, hiredis, and icu), Fedora (kernel), Mageia (libreoffice), openSUSE (chromium, firefox, git, go1.16, kernel, mbedtls, mupdf, and nodejs8), Oracle (firefox and kernel), Red Hat (firefox, grafana, kernel, kpatch-patch, and rh-mysql80-mysql), and SUSE (apache2, containerd, docker, runc, curl, firefox, kernel, libqt5-qtsvg, and squid).",
          "link": "https://lwn.net/Articles/872696/rss",
          "publishedOn": "2021-10-12T15:21:13.000Z",
          "wordCount": 122,
          "title": "Security updates for Tuesday"
        },
        {
          "id": "https://lwn.net/Articles/872639/rss",
          "author": "corbet",
          "description": "A group of researchers at Trinity College in Dublin has released the\nresults of a study into the data collected by a number of Android\nvariants.  There are few surprises here, but the picture is still\ndiscouraging.\n\n\n\tWe find that the Samsung, Xiaomi, Huawei and Realme Android\n\tvariants all transmit a substantial volume of data to the OS\n\tdeveloper (i.e. Samsung etc) and to third-party parties that have\n\tpre-installed system apps (including Google, Microsoft, Heytap,\n\tLinkedIn, Facebook). LineageOS sends similar volumes of data to\n\tGoogle as these proprietary Android variants, but we do not observe\n\tthe LineageOS developers themselves collecting data nor\n\tpre-installed system apps other than those of Google. Notably,\n\t/e/OS sends no information to Google or other third parties and\n\tsends essentially no information to the /e/OS developers.",
          "link": "https://lwn.net/Articles/872639/rss",
          "publishedOn": "2021-10-12T14:00:14.000Z",
          "wordCount": 220,
          "title": "A study of data collection by Android devices"
        },
        {
          "id": "https://lwn.net/Articles/872209/rss",
          "author": "corbet",
          "description": "One does not normally expect a lot of controversy around a patch series\nthat makes  changes to platform-specific configurations and drivers.\nThe furor over some work on the Samsung Exynos platform may thus be\nsurprising.  When one looks into the discussion, things become more clear;\nit mostly has to do with disagreements over the best ways to get hardware\nvendors to cooperate with the kernel development community.",
          "link": "https://lwn.net/Articles/872209/rss",
          "publishedOn": "2021-10-11T15:24:50.000Z",
          "wordCount": null,
          "title": "[$] The intersection of modules, GKI, and rocket science"
        },
        {
          "id": "https://lwn.net/Articles/872547/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (apache2, mediawiki, neutron, and tiff), Fedora (chromium, dr_libs, firefox, and grafana), Mageia (apache), openSUSE (chromium and rabbitmq-server), Oracle (kernel), Red Hat (firefox and httpd24-httpd), SUSE (rabbitmq-server), and Ubuntu (libntlm).",
          "link": "https://lwn.net/Articles/872547/rss",
          "publishedOn": "2021-10-11T15:00:57.000Z",
          "wordCount": 109,
          "title": "Security updates for Monday"
        },
        {
          "id": "https://lwn.net/Articles/872489/rss",
          "author": "corbet",
          "description": "Jörg Schilling, a longtime free-software developer, has passed on.  Most\npeople will remember him from his work on cdrtools and the seemingly endless drama that surrounded that\nwork.  He was a difficult character to deal with, but he also contributed\nsome important code that, for a period, almost all of us depended on.  Rest\nwell, Jörg.",
          "link": "https://lwn.net/Articles/872489/rss",
          "publishedOn": "2021-10-11T14:28:00.000Z",
          "wordCount": 129,
          "title": "Jörg Schilling is gone"
        }
      ]
    },
    {
      "title": "M0AGX",
      "feedUrl": "https://m0agx.eu/feed/",
      "siteUrl": "https://m0agx.eu",
      "articles": []
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://martinfowler.com/articles/devops-compliance.html",
          "author": null,
          "description": "Integrating the necessary security controls and audit capabilities to\n      satisfy compliance requirements within a DevOps culture can capitalize on\n      CI/CD pipeline automation, but presents unique challenges as an\n      organization scales. Understanding the second order implications and\n      unintended consequences caused by the chosen implementation is key to\n      building an effective, secure, and scalable solution. My colleague Carl\n      Nygard describes how to think of these choices through a\n      series of four patterns for handling compliance.\nmore…",
          "link": "https://martinfowler.com/articles/devops-compliance.html",
          "publishedOn": "2021-11-02T13:39:00.000Z",
          "wordCount": 5732,
          "title": "Compliance in a DevOps Culture"
        },
        {
          "id": "https://martinfowler.com/articles/art-agile-foreword.html",
          "author": null,
          "description": "James Shore has revised his book \"The Art of Agile Development\". I'm\n      pleased to write a foreword for this book as it is solid guide to learning\n      how to get past faux-agile and develop the skills you need to get the\n      benefits of the agile way of work. \nmore…",
          "link": "https://martinfowler.com/articles/art-agile-foreword.html",
          "publishedOn": "2021-10-26T14:24:00.000Z",
          "wordCount": 624,
          "title": "Foreword to \"The Art of Agile Development\""
        },
        {
          "id": "https://martinfowler.com/photos/127.html",
          "author": null,
          "description": "Bromley Mtn, VT (2021)",
          "link": "https://martinfowler.com/photos/127.html",
          "publishedOn": "2021-10-14T18:29:00.000Z",
          "wordCount": 24,
          "title": "photostream 127"
        }
      ]
    },
    {
      "title": "MCU on Eclipse",
      "feedUrl": "https://mcuoneclipse.com/feed/",
      "siteUrl": "https://mcuoneclipse.com",
      "articles": [
        {
          "id": "http://mcuoneclipse.com/?p=33750",
          "author": "Erich Styger",
          "description": "I’m using debug probes on a daily base. They have to be functional, and I value functionality over aesthetics. For cost reasons many debug probe vendors either only provide a bare PCB without enclosure, or the enclosure is made of … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/11/07/adding-rgbw-wings-and-enclosure-to-a-debug-probe/",
          "publishedOn": "2021-11-07T12:18:29.000Z",
          "wordCount": 2189,
          "title": "Adding RGBW Wings and Enclosure to a Debug Probe"
        },
        {
          "id": "http://mcuoneclipse.com/?p=33769",
          "author": "Erich Styger",
          "description": "One thing to create with a desktop CNC are boxes: wooden boxes with inlays: Of course there are many other useful things you can o with a CNC and wood. But creating some nice boxes, suitable as a gift or … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/11/02/cnc-elm-wood-boxes-with-v-carving-and-inlays/",
          "publishedOn": "2021-11-02T19:55:00.000Z",
          "wordCount": 984,
          "title": "CNC Elm Wood Boxes with V-Carving and Inlays"
        },
        {
          "id": "http://mcuoneclipse.com/?p=33727",
          "author": "Erich Styger",
          "description": "The Microsoft Visual Studio Code is a great IDE, but does not (yet?) implement features for true embedded usage. Or things are there to some level, but hard to use. One of these things is how to step in the … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/10/23/visual-studio-code-for-c-c-with-arm-cortex-m-part-10-assembly-stepping/",
          "publishedOn": "2021-10-23T09:33:55.000Z",
          "wordCount": 1072,
          "title": "Visual Studio Code for C/C++ with ARM Cortex-M: Part 10 – Assembly Stepping"
        },
        {
          "id": "http://mcuoneclipse.com/?p=33707",
          "author": "Erich Styger",
          "description": "One of the great things in Eclipse is that it can be customized down to the bits. The downside (pun intended) is that it might not be obvious how to do this. So here is how you can create your … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/10/18/custom-c-c-headers-with-eclipse/",
          "publishedOn": "2021-10-18T21:35:00.000Z",
          "wordCount": 870,
          "title": "Custom C/C++ Headers with Eclipse"
        },
        {
          "id": "http://mcuoneclipse.com/?p=33546",
          "author": "Erich Styger",
          "description": "After the release of the NXP MCU-Link debug probe, there have been hints in the Eclipse based MCUXpresso IDE that there must be another one coming. And indeed: another and more powerful debug probe is now available: the MCU-Link Pro. … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/10/17/new-mcu-link-pro-debug-probe-with-energy-measurement/",
          "publishedOn": "2021-10-17T13:28:58.000Z",
          "wordCount": 1991,
          "title": "New “MCU-Link Pro”: Debug Probe with Energy Measurement"
        },
        {
          "id": "http://mcuoneclipse.com/?p=33592",
          "author": "Erich Styger",
          "description": "It is interesting to see that some aspects (mostly unintended) can stimulate lots of good and fruitful discussions. So this happened with “Spilling the Beans: Endless Loops” (recommended to read 🙂 where using (or not using) volatile for inline assembly created … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/10/12/spilling-the-beans-volatile-qualifier/",
          "publishedOn": "2021-10-12T05:35:47.000Z",
          "wordCount": 1765,
          "title": "Spilling the Beans: volatile Qualifier"
        }
      ]
    },
    {
      "title": "The ESP Journal - Medium",
      "feedUrl": "https://medium.com/feed/the-esp-journal",
      "siteUrl": "https://blog.espressif.com?source=rss----d5414d5dee73---4",
      "articles": [
        {
          "id": "https://medium.com/p/1ebb97d9e53b",
          "author": "ESP BOT",
          "description": "Hi everyone,",
          "link": "https://blog.espressif.com/october-2021-1ebb97d9e53b?source=rss----d5414d5dee73---4",
          "publishedOn": "2021-11-08T03:34:50.000Z",
          "wordCount": 496,
          "title": "October 2021"
        },
        {
          "id": "https://medium.com/p/63d16d437db5",
          "author": "ESP BOT",
          "description": "Hi everyone,",
          "link": "https://blog.espressif.com/september-2021-63d16d437db5?source=rss----d5414d5dee73---4",
          "publishedOn": "2021-11-08T03:34:30.000Z",
          "wordCount": 543,
          "title": "September 2021"
        },
        {
          "id": "https://medium.com/p/92beee7951b3",
          "author": "Scott Mabin",
          "description": "Now I am working at Espressif I plan on publishing updates roughly every quarter just to keep the community in the loop around the esp…",
          "link": "https://blog.espressif.com/rust-on-espressif-chips-18-10-2021-92beee7951b3?source=rss----d5414d5dee73---4",
          "publishedOn": "2021-10-18T10:18:27.000Z",
          "wordCount": 1117,
          "title": "Rust on Espressif chips — 18–10–2021"
        }
      ]
    },
    {
      "title": "/* the devil is in the detail */",
      "feedUrl": "https://minjang.github.io/feed.xml",
      "siteUrl": "http://minjang.github.io/",
      "articles": []
    },
    {
      "title": "mingrammer's note",
      "feedUrl": "https://mingrammer.com/index.xml",
      "siteUrl": "https://mingrammer.com/",
      "articles": []
    },
    {
      "title": "Novel Bits",
      "feedUrl": "https://www.novelbits.io/feed",
      "siteUrl": "https://www.novelbits.io",
      "articles": []
    },
    {
      "title": "null program",
      "feedUrl": "https://nullprogram.com/feed/",
      "siteUrl": "https://nullprogram.com",
      "articles": []
    },
    {
      "title": "Preshing on Programming",
      "feedUrl": "http://preshing.com/feed",
      "siteUrl": "https://preshing.com/feed",
      "articles": []
    },
    {
      "title": "research!rsc",
      "feedUrl": "https://research.swtch.com/feed.atom",
      "siteUrl": "http://research.swtch.com/feed.atom",
      "articles": [
        {
          "id": "http://research.swtch.com/trojan",
          "author": null,
          "description": "Code review is the answer to this and many other problems.",
          "link": "http://research.swtch.com/trojan",
          "publishedOn": "2021-11-02T03:33:00.000Z",
          "wordCount": 1198,
          "title": "On “Trojan Source” Attacks"
        }
      ]
    },
    {
      "title": "AEP코리아네트",
      "feedUrl": "https://rss.blog.naver.com/aepkoreanet.xml",
      "siteUrl": "https://blog.naver.com/aepkoreanet",
      "articles": []
    },
    {
      "title": "애자일 이야기",
      "feedUrl": "http://rss.egloos.com/blog/agile",
      "siteUrl": "http://agile.egloos.com",
      "articles": []
    },
    {
      "title": "Embedded Rambling",
      "feedUrl": "http://shadetail.com/blog/feed/",
      "siteUrl": "http://shadetail.com/blog",
      "articles": []
    },
    {
      "title": "Stacey on IoT | Internet of Things news and analysis",
      "feedUrl": "https://staceyoniot.com/feed/",
      "siteUrl": "https://staceyoniot.com",
      "articles": [
        {
          "id": "https://staceyoniot.com/?p=9252",
          "author": "Stacey Higginbotham",
          "description": "I’m pretty sure that, for most people, 2021 isn’t going to be one of fond remembrances. For Kevin and I, it has been a year of reckoning, as people continue to lose trust in technology and the companies that sell consumer gadgets. Add to that the ongoing pandemic and the in-your-face reality of climate change, […]\nThe post Happy holidays! Here’s our 2021 gift guide! appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/happy-holidays-heres-our-2021-gift-guide/",
          "publishedOn": "2021-11-08T14:00:03.000Z",
          "wordCount": 2417,
          "title": "Happy holidays! Here’s our 2021 gift guide!"
        },
        {
          "id": "https://staceyoniot.com/?p=9182",
          "author": "Kevin C. Tofel",
          "description": "Note: This story was published in the newsletter on October 22, but never made it to the site. So we updated the headline and published it here two weeks later. Slightly more than a year ago, I shared what was in my smart home. I started out by saying, “Wow, what a difference three years […]\nThe post What’s in my smart home: November 2021 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/whats-in-my-smart-home-november-2021/",
          "publishedOn": "2021-11-07T14:00:24.000Z",
          "wordCount": 1058,
          "title": "What’s in my smart home: November 2021"
        },
        {
          "id": "https://staceyoniot.com/?p=9266",
          "author": "Kevin C. Tofel",
          "description": "On our most recent IoT Podcast, Sean called in to the voicemail hotline with a HomeKit question. He appreciates the ability to add HomeKit devices to his smart home directly through Apple’s Home app. He wants to know if the device maker’s applications are required to upgrade the firmware on those devices. Unfortunately, the answer […]\nThe post Do you need third-party apps to update HomeKit device firmware? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/do-you-need-third-party-apps-to-update-homekit-device-firmware/",
          "publishedOn": "2021-11-06T16:25:13.000Z",
          "wordCount": 626,
          "title": "Do you need third-party apps to update HomeKit device firmware?"
        },
        {
          "id": "https://staceyoniot.com/?p=9263",
          "author": "Stacey Higginbotham",
          "description": "Phyn launches a smaller, cheaper leak detection system: Phyn, which makes devices that can scan for leaks and even shut off water in case of leak detection, has launched a new product. The Phyn Plus, Smart Water Assistant + Shutoff, is a smaller, cheaper version of the original Phyn water monitor and shutoff device that sold for […]\nThe post IoT news of the week for Nov. 5, 2021 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-nov-5-2021/",
          "publishedOn": "2021-11-05T18:00:32.000Z",
          "wordCount": 1284,
          "title": "IoT news of the week for Nov. 5, 2021"
        },
        {
          "id": "https://staceyoniot.com/?p=9258",
          "author": "Stacey Higginbotham",
          "description": "The big news in IoT this week was the announced acquisition of Ecobee by Generac, so Kevin and I share our thoughts on the deal and what it means for the smart home. After that, we were excited to see Amazon launching a smart air quality monitoring device for $70 as well as publically state […]\nThe post Podcast: Ecobee’s big deal and climate-friendly chips appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-ecobees-big-deal-and-climate-friendly-chips/",
          "publishedOn": "2021-11-04T13:00:27.000Z",
          "wordCount": 635,
          "title": "Podcast: Ecobee’s big deal and climate-friendly chips"
        },
        {
          "id": "https://staceyoniot.com/?p=9253",
          "author": "Stacey Higginbotham",
          "description": "Regular newsletter readers know that I am beyond excited about machine learning (ML) at the edge. Running algorithms on gateways — or even on sensors — instead of sending data to the cloud to be analyzed can save time, bandwidth costs, and energy, and can protect people’s privacy. So far, ML at the edge has […]\nThe post Qualcomm is researching machine learning at the edge appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/qualcomm-is-researching-machine-learning-at-the-edge/",
          "publishedOn": "2021-11-03T14:12:59.000Z",
          "wordCount": 1320,
          "title": "Qualcomm is researching machine learning at the edge"
        },
        {
          "id": "https://staceyoniot.com/?p=9234",
          "author": "Stacey Higginbotham",
          "description": "At long last, the Wi-Fi Alliance has certified the new Wi-Fi HaLow standard designed to provide connectivity for the internet of things. Chips and evaluation kits that meet the standard are already ready from Morse Micro, and we can expect devices next year. But does the IoT need a new connectivity standard? About five and […]\nThe post Wi-Fi HaLow is now certified and ready for action appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/wi-fi-halow-is-now-certified-and-ready-for-action/",
          "publishedOn": "2021-11-02T15:13:23.000Z",
          "wordCount": 1553,
          "title": "Wi-Fi HaLow is now certified and ready for action"
        },
        {
          "id": "https://staceyoniot.com/?p=9223",
          "author": "Kevin C. Tofel",
          "description": "On our most recent IoT Podcast, Michael called in to our voicemail hotline with a question about his under cabinet light strips. He’s looking for a switch or other option to add some smarts to them, although he’s using a set of smart LIFX light strips. If Michael is going to use a switch, it […]\nThe post How to add some smarts to your under cabinet lights appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/how-to-add-some-smarts-to-your-under-cabinet-lights/",
          "publishedOn": "2021-11-02T14:18:02.000Z",
          "wordCount": 1224,
          "title": "How to add some smarts to your under cabinet lights"
        },
        {
          "id": "https://staceyoniot.com/?p=9218",
          "author": "Stacey Higginbotham",
          "description": "LEGO inspired Volvo to make a smart, modular wheel loader: Volvo Construction Equipment has built a 5-ton electric wheel loader that was inspired by a LEGO Technic model. Volvo and LEGO created a partnership back in 2018 to help design LEGO Technic kits. But the engineers at both companies saw the LEGOs as an inspiration […]\nThe post IoT news of the week for October 29, 2021 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-october-29-2021/",
          "publishedOn": "2021-10-29T18:00:08.000Z",
          "wordCount": 1627,
          "title": "IoT news of the week for October 29, 2021"
        },
        {
          "id": "https://staceyoniot.com/?p=9215",
          "author": "Stacey Higginbotham",
          "description": "As the urgency of the climate crisis becomes increasingly clear, technology firms are pushing harder toward solutions designed to boost electrification and the use of renewable energy. Solar panels have become more common, for example, as have smart thermostats and a focus on energy-saving services, in both homes and offices. But there are generations of aging […]\nThe post Span is tackling our outdated grid one breaker box at a time appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/span-is-tackling-our-outdated-grid-one-breaker-box-at-a-time/",
          "publishedOn": "2021-10-29T16:18:34.000Z",
          "wordCount": 1342,
          "title": "Span is tackling our outdated grid one breaker box at a time"
        },
        {
          "id": "https://staceyoniot.com/?p=9212",
          "author": "Stacey Higginbotham",
          "description": "This week’s show kicks off with news from many of the big smart home players offering their plans for the Matter smart home protocol. First, we discuss Google’s plans, before focusing on Samsung’s latest announcements and then a surprise update from Eero, which is owned by Amazon. Sticking with Amazon, we also cover the news […]\nThe post Podcast: Energy harvesting sensors are finally real appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-energy-harvesting-sensors-are-finally-real/",
          "publishedOn": "2021-10-28T13:00:36.000Z",
          "wordCount": 628,
          "title": "Podcast: Energy harvesting sensors are finally real"
        },
        {
          "id": "https://staceyoniot.com/?p=9198",
          "author": "Kevin C. Tofel",
          "description": "Given the smart home successes of Amazon, Apple, and Google, I’ve generally considered Samsung to be an also-ran in the consumer IoT space. Yes, I used Samsung SmartThings hardware and software to power my smart home in the past. Yes, it worked. But Samsung’s innovation levels seemed to lag and then it got out of […]\nThe post Samsung SmartThings is making all the right moves when it comes to the IoT appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/samsung-smartthings-is-making-all-the-right-moves-when-it-comes-to-the-iot/",
          "publishedOn": "2021-10-27T14:58:58.000Z",
          "wordCount": 2179,
          "title": "Samsung SmartThings is making all the right moves when it comes to the IoT"
        },
        {
          "id": "https://staceyoniot.com/?p=9177",
          "author": "Stacey Higginbotham",
          "description": "When it comes to the Matter smart home interoperability standard, there’s so much we don’t know. But thanks to news this week from Amazon and Google, it’s clear that two of the biggest players in the smart home are approaching the protocol with varying degrees of enthusiasm. On Thursday at its Smart Home Summit event, Google […]\nThe post Google and Amazon speak very differently about Matter appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/google-and-amazon-speak-very-differently-about-matter/",
          "publishedOn": "2021-10-26T14:27:50.000Z",
          "wordCount": 1371,
          "title": "Google and Amazon speak very differently about Matter"
        },
        {
          "id": "https://staceyoniot.com/?p=9186",
          "author": "Stacey Higginbotham",
          "description": "The ioXt Alliance certifies 60 new devices: The ioXt Alliance, which is a nascent security standard for connected devices including handsets and smart TVs, has certified 60 Android devices. The devices range from Pixel smartphones from Google to rugged handsets from Zebra Technologies. The ioXt Alliance standard tries to do away with both the “nutrition-style […]\nThe post IoT news of the week for October 22, 2021 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-october-22-2021/",
          "publishedOn": "2021-10-22T17:05:28.000Z",
          "wordCount": 1392,
          "title": "IoT news of the week for October 22, 2021"
        },
        {
          "id": "https://staceyoniot.com/?p=9173",
          "author": "Stacey Higginbotham",
          "description": "We kick off this week’s podcast with a focus on chips and hardware starting with an explainer on Arm’s new Total Solutions for IoT and why it will help developers and device makers speed up time-to-market for connected products. We then talk about plans to put Linux on Arduino devices that were outed in a […]\nThe post Podcast: Return of the connected bunny! appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-return-of-the-connected-bunny/",
          "publishedOn": "2021-10-21T13:00:33.000Z",
          "wordCount": 667,
          "title": "Podcast: Return of the connected bunny!"
        },
        {
          "id": "https://staceyoniot.com/?p=9165",
          "author": "Stacey Higginbotham",
          "description": "It seems like this week’s newsletter is all about networks. For this story, I’m returning once again to talk about Helium’s low-power wide-area (LPWAN) LoRaWAN network. I can’t help but be impressed by the speed at which Helium has managed to build out network coverage using a cryptocurrency as a way to prove coverage and […]\nThe post Helium built a network and now it has customers appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/helium-built-a-network-and-now-it-has-customers/",
          "publishedOn": "2021-10-20T13:00:29.000Z",
          "wordCount": 1031,
          "title": "Helium built a network and now it has customers"
        },
        {
          "id": "https://staceyoniot.com/?p=9162",
          "author": "Stacey Higginbotham",
          "description": "Several IoT startups that have built business plans around combined terrestrial and satellite networks have given up on the satellite portion of their dreams. Most recently, Hiber, a European satellite IoT provider, said this week that it will partner with Inmarsat’s new Elera network for the space-based portion of its network, using LoRaWAN for the […]\nThe post Satellite IoT dreams are crashing into reality appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/satellite-iot-dreams-are-crashing-into-reality/",
          "publishedOn": "2021-10-19T16:06:18.000Z",
          "wordCount": 1115,
          "title": "Satellite IoT dreams are crashing into reality"
        },
        {
          "id": "https://staceyoniot.com/?p=9154",
          "author": "Stacey Higginbotham",
          "description": "Arm, the company behind the semiconductor design for much of the IoT (and all of the worlds’ smartphones) has announced three projects to help make developing for the internet of things faster, easier, and potentially more secure. It’s announcing all three under the grand name of Arm Total Solutions for IoT. First, Arm will provide a […]\nThe post ARM tries to solve the IoT’s fragmentation problem … again appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/arm-tries-to-solve-the-iots-fragmentation-problem-again/",
          "publishedOn": "2021-10-18T15:00:18.000Z",
          "wordCount": 1219,
          "title": "ARM tries to solve the IoT’s fragmentation problem … again"
        },
        {
          "id": "https://staceyoniot.com/?p=9147",
          "author": "Stacey Higginbotham",
          "description": "Want a Wi-Fi 6e router? That’ll be $1,500, please: The newest Netgear Orbi router mesh Wi-Fi system arrived this week and while it boasts faster wireless speeds, you’ll pay a pretty penny for them. The Orbi Quad-band Mesh WiFi 6E System costs a whopping $1,500 for a router and two mesh access points. Each additional access […]\nThe post IoT news of the week for Oct. 15, 2021 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-oct-15-2021/",
          "publishedOn": "2021-10-15T20:58:23.000Z",
          "wordCount": 1494,
          "title": "IoT news of the week for Oct. 15, 2021"
        },
        {
          "id": "https://staceyoniot.com/?p=9131",
          "author": "Kevin C. Tofel",
          "description": "Nanoleaf introduced its latest smart lighting product on Thursday with a slightly different departure from its existing products. The new Nanoleaf Lines are light bars that attach to each other at various angles, leaving wall space between the lights. A starter kit with 9 Lines will cost $199.99, while expansion packs that add 3 Lines […]\nThe post Nanoleaf Lines review: The first Nanoleafs my wife actually wants to buy appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/nanoleaf-lines-review-the-first-nanoleafs-my-wife-actually-wants-to-buy/",
          "publishedOn": "2021-10-14T17:00:42.000Z",
          "wordCount": 1402,
          "title": "Nanoleaf Lines review: The first Nanoleafs my wife actually wants to buy",
          "enclosure": {
            "url": "https://staceyoniot.com/wp-content/uploads/2021/10/IMG_0727.mp4",
            "length": "4614391",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://staceyoniot.com/?p=9127",
          "author": "Stacey Higginbotham",
          "description": "The industrial automation world got a jolt of news with Emerson combining some of its industrial IoT software businesses with AspenTech in an $11 billion transaction. We explain why the deal matters and what it means, before hopping over to discuss Best Buy’s acquisition of Current Health. Then we review large funding rounds for Plume […]\nThe post Podcast: Explaining the IoT’s latest $11B deal appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-explaining-the-iots-latest-11b-deal/",
          "publishedOn": "2021-10-14T13:00:08.000Z",
          "wordCount": 746,
          "title": "Podcast: Explaining the IoT’s latest $11B deal"
        },
        {
          "id": "https://staceyoniot.com/?p=9112",
          "author": "Stacey Higginbotham",
          "description": "Most IoT platform businesses focus on providing the connectivity and data pipeline to a cloud service. Generally, they focus on features such as device management, device provisioning, basic security, data transfer, and maybe a container strategy. Some provide hardware in the form of pre-built boards full of silicon, while others start with a software development […]\nThe post Mason will build IoT hardware so businesses don’t have to appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/mason-will-build-iot-hardware-so-businesses-dont-have-to/",
          "publishedOn": "2021-10-12T13:00:55.000Z",
          "wordCount": 982,
          "title": "Mason will build IoT hardware so businesses don’t have to"
        },
        {
          "id": "https://staceyoniot.com/?p=9116",
          "author": "Kevin C. Tofel",
          "description": "On our most recent IoT Podcast, Derrick called in with a question about retiring smart home devices. He’s wondering how we dispose of ours since we do go through more connected products than most people. Derrick wants to replace his current Ring devices with Nest products since he uses Google Home as his smart home […]\nThe post Where are the best places to sell your used smart home devices? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/where-are-the-best-places-to-sell-your-used-smart-home-devices/",
          "publishedOn": "2021-10-11T16:56:40.000Z",
          "wordCount": 660,
          "title": "Where are the best places to sell your used smart home devices?"
        },
        {
          "id": "https://staceyoniot.com/?p=9109",
          "author": "Stacey Higginbotham",
          "description": "This week, Arlo launched what I generously think of as its pay-for-customer-service enticement for its smart home camera products. As of Oct. 4, customers without a subscription who’ve had their devices for more than 90 days no longer get phone support. And after one year, they lose access to live chat support. Those non-subscription customers will […]\nThe post Arlo’s search for subscriptions gets desperate appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/arlos-search-for-subscriptions-gets-desperate/",
          "publishedOn": "2021-10-11T13:00:05.000Z",
          "wordCount": 971,
          "title": "Arlo’s search for subscriptions gets desperate"
        }
      ]
    },
    {
      "title": "IT의 중심에서",
      "feedUrl": "https://subokim.wordpress.com/feed/",
      "siteUrl": "https://subokim.wordpress.com",
      "articles": [
        {
          "id": "http://subokim.wordpress.com/?p=10999",
          "author": "subokim",
          "description": "(그림)”유선 통신망은 보안망이라 인터넷에 공개된 무선망 구성도만 추가해봅니다.” 이 글은 이제 갓 입문한 초보개발자들이 읽었으면 해서 정리해 보았습니다. 2021.10.25일.큰 장애가 있었습니다.KT 에서 네트워크 작업을 하다 오류가 났죠.모바일인터넷, 유선인터넷이 모두 안되었습니다. 피해범위는 전국 규모였습니다.인터넷 결제가 되지 않으니 음식점이 난리 났구요.인터넷이 되지 않으니, 카톡도 쓸 수 없었습니다. 다행히 은행은 동작했습니다.은행은 이런 경우를 대비해서 이중화된 회선을 운영합니다.대금결제가 안되면 […]",
          "link": "https://subokim.wordpress.com/2021/10/31/core_point_for_kt_fail_over/",
          "publishedOn": "2021-10-31T12:10:43.000Z",
          "wordCount": 912,
          "title": "KT 장애, 개발자가 읽어야 할 포인트"
        }
      ]
    },
    {
      "title": "Vivonomicon's Blog",
      "feedUrl": "https://vivonomicon.com/feed/",
      "siteUrl": "https://vivonomicon.com",
      "articles": []
    },
    {
      "title": "zserge's blog",
      "feedUrl": "https://zserge.com/rss.xml",
      "siteUrl": "https://zserge.com/",
      "articles": []
    },
    {
      "title": "Big Picture",
      "feedUrl": "https://www.bostonglobe.com/rss/bigpicture",
      "siteUrl": null,
      "articles": []
    },
    {
      "title": "이바닥늬우스",
      "feedUrl": "https://ebadak.news/feed",
      "siteUrl": "https://ebadak.news",
      "articles": [
        {
          "id": "https://ebadak.news/?p=2785",
          "author": "Rick Kim",
          "description": "앞으로 우리는 페이스북 퍼스트가 아닌, 메타버스 퍼스트 회사가 될 것입니다. 앞으로 우리의 새로운 서비스들을 활용하는데 있어 페이스북 계정의 활용이 강제가 되지 않을 것이라는 뜻입니다. 우리의 새로운 브랜드가 서비스들에 녹아들때, 더 많은 분들이 ‘메타’라는 브랜드의 의미와 우리가 지향하는 미래에 대해 공감해주실 수 있다면 좋겠습니다.",
          "link": "https://ebadak.news/2021/10/30/founders-letter-meta/",
          "publishedOn": "2021-10-30T05:02:48.000Z",
          "wordCount": 1653,
          "title": "‘메타’를 소개합니다 – 마크 주커버그(번역)"
        },
        {
          "id": "https://ebadak.news/?p=2762",
          "author": "Rick Kim",
          "description": "‘메타버스’는 요즘 가장 핫한 유행어입니다. 하지만 화이트보드에 붙은 포스트잇에 쓴 개념과 같지, 실제로 존재하는 것은 아닙니다. 메타버스가 하겠다고 하는 아이디어들은 말로만 그칠 수도 있습니다. 어쩌면 진짜 새로운 ‘IT’일 수도 있을 것입니다. 하지만 그것이 어떻게 동작을 하든, 완전히 새로운 종류의 기기, 경험, 새로운 콘텐츠가 필요하다는 것은 당연한 이야기겠죠.",
          "link": "https://ebadak.news/2021/10/11/metaverse-metaverse-metaverse/",
          "publishedOn": "2021-10-11T13:42:18.000Z",
          "wordCount": 1333,
          "title": "메타버스! 메타버스? 메타버스!! (번역)"
        }
      ]
    },
    {
      "title": "economic view",
      "feedUrl": "http://feeds.feedburner.com/Economic_View",
      "siteUrl": "http://economicview.net",
      "articles": []
    },
    {
      "title": "슬로우뉴스",
      "feedUrl": "https://feeds.feedburner.com/slownews",
      "siteUrl": "https://slownews.kr",
      "articles": [
        {
          "id": "https://slownews.kr/?p=82537",
          "author": "임명묵",
          "description": "[궁극의 군대]는 1945년 핵 혁명부터 2000년 무렵의 정보혁명까지 미군과 기술 발전의 상호관계를 다룬 책이다. 저자인 토머스 G. 맨켄은 기술사를 다루는 정석적인 서술 방법을 취하는데, 기술’결정론’ 혹은 기술결정론의 무의미함을 논하기보다는 미 미군과 기술 발전의 상호관계  핵무기나 컴퓨터가 전장을 완전히 바꾸어놓았다는 서술이나, 핵무기나 컴퓨터의 등장과 관계 없이 전장은 항상 똑같다는 반론보다 중요한 것은, 육해공군이라는 개별 조직이 그런 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/QpvqTbuFw_8/82537",
          "publishedOn": "2021-11-09T05:46:01.000Z",
          "wordCount": 1490,
          "title": "테크놀로지는 어떻게 미군을 변화시켰나"
        },
        {
          "id": "https://slownews.kr/?p=82517",
          "author": "윤영삼",
          "description": "제1원칙 이야기 속 행위자를 짧고 구체적인 명사에 담아 문장의 주어로 삼아라. 살아 움직이는 생명체가 주어가 되면 더 좋다. “행위자가 없으면 아무것도 없는 것이다.” (무명)    제2원칙 행위자의 주요 행동을 묘사하는 구체적인 동사를 서술어로 삼아라. 우리는 ‘누가 무엇을 한다’는 스토리텔링을 가장 잘 이해한다. “나는 생각한다. 고로 존재한다.” (데카르트)   제3원칙 주어와 동사를 최대한 문장 앞부분에 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/72cjtKQBXd4/82517",
          "publishedOn": "2021-11-08T07:41:12.000Z",
          "wordCount": 867,
          "title": "글쓰기 십계명: 명확한 글쓰기 10가지 원칙"
        },
        {
          "id": "https://slownews.kr/?p=82499",
          "author": "민주언론시민연합",
          "description": "북한과 관계가 악화하던 2015년 5월, 세계 여성·평화 운동가들은 걸어서 비무장지대(DMZ)를 통과하는 ‘위민클로스DMZ(WomenCrossDMZ)’를 기획했습니다. 당시 퍼포먼스엔 반세기 넘게 미국 여성운동을 이끌어 온 클로리아 스타이넘, 노벨평화상 수상자 메어리드 코리건 매과이어(1976년 수상), 리마 보위(2011년 수상)뿐만 12개국 30명의 여성·평화운동가가 참여했습니다. 평화운동가를 ‘종북’으로 낙인찍다  일부 정치세력이 자신과 반대되는 의견을 가진 집단을 매도하고 고립시키기 위해 사용한 말이 있습니다. 2010년대 유행한 말은 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/yHT6DHo-5fw/82499",
          "publishedOn": "2021-11-05T08:57:52.000Z",
          "wordCount": 1053,
          "title": "블루투데이, 여성·평화운동가 ‘종북’ 낙인 사건 (2017)"
        },
        {
          "id": "https://slownews.kr/?p=82487",
          "author": "참여연대 사법감시센터",
          "description": "우리 사회는 한창 ‘가짜뉴스’로 인해 골머리를 앓았다. 일부의 목적을 위해 생산·가공된 거짓과 그로인한 피해는 시민의 진실을 향한 사회적 열망을 키워갔다. 최근 크게 논의됐던 ‘언론중재법’ 역시 진실을 추구하고자 하는 시민의 바람을 엿볼 수 있는 대목이었다. 그러나 우리 법체계에서는 진실을 말하는 것조차 조심스러울 수밖에 없는 현실이다. 형법 제307조 제1항에 명시된 이른바 ‘사실적시 명예훼손’이 존재하기 때문이다. 형법 제307조 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/F9m_I5YIMyY/82487",
          "publishedOn": "2021-11-04T08:05:35.000Z",
          "wordCount": 1240,
          "title": "‘사실적시 명예훼손’ 합헌 유감: 민주적 대안이 필요하다"
        },
        {
          "id": "https://slownews.kr/?p=82479",
          "author": "민주언론시민연합",
          "description": "제13대 대통령 노태우 씨가 10월 26일 병세 악화로 사망했습니다. 노태우 씨는 12·12군사쿠데타를 주도하고, 5.18민주화운동을 무력으로 진압했으며 전두환 씨와 함께 군부독재시대를 이끈 인물입니다. 6·10민주항쟁이 이뤄낸 직선제 개헌을 통해 제13대 대선에서 대통령에 당선된 노 씨는 재임 기간 서울올림픽 개최, 남북한 유엔 동시 가입, 한반도 비핵화 공동선언 등 성과를 남겼습니다. 그러나 내란죄, 수천억 원 대 비자금 조성 등으로 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/jP7ry5dsnR8/82479",
          "publishedOn": "2021-11-03T08:55:25.000Z",
          "wordCount": 1827,
          "title": "노태우 사망, 그리고 대충 잊고 화해하자는 언론"
        },
        {
          "id": "https://slownews.kr/?p=82461",
          "author": "씨앗(CEART)",
          "description": "정부 기관이나 기업 조직의 모든 리더는 데이터가 중요하다는 사실을 알고 있다. 그것이 없이는 조직을 경쟁에서 앞서 나가게 할 디지털 혁신이 있을 수 없다. 새로운 수익원을 창출하는 분석도 할 수 없을 뿐만 아니라 기본적인 사업 운영도 어렵다. 그러나 데이터가 이러한 이니셔티브에 힘을 실어주려면 그 자체가 고품질화되고 및 관련성을 쉽게 이용할 수 있는 분석이 뒷받침되어야 한다. 우수한 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/7HosanKydoI/82461",
          "publishedOn": "2021-11-03T08:22:51.000Z",
          "wordCount": 2209,
          "title": "데이터 거버넌스와 분석 거버넌스 (ft. 여섯 가지 선행과제)"
        },
        {
          "id": "https://slownews.kr/?p=82447",
          "author": "민주언론시민연합",
          "description": "2000년대 중반, MBC [불만제로UP]과 KBS [소비자 고발] 등을 시작으로 이른바 ‘예능형 소비자 고발 프로그램’이 잇따라 등장하며 상품 평가에 대한 자세한 정보를 알고 싶어하던 시청자 수요를 충족시키며 큰 인기를 끌었습니다. 이들 프로그램은 실제로 소비자 권익 향상에 긍정적인 영향을 주었는데요. 반면 ‘황토팩 사건’처럼 사실을 과장하거나 전문성이 떨어지는 접근으로 멀쩡한 업체에 막대한 피해를 주기도 했습니다. 채널A [먹거리 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/Vy58z_r-s60/82447",
          "publishedOn": "2021-11-02T09:26:25.000Z",
          "wordCount": 1662,
          "title": "웬만하면 ‘먹거리 X파일’을 이길 수 없다: 벌집 아이스크림(’14), 정육식당(’15), 대왕 카스텔라 (’17)"
        },
        {
          "id": "https://slownews.kr/?p=82430",
          "author": "민주언론시민연합",
          "description": "여기 두 사건이 있습니다. 빚진 돈 때문에 친동생을 죽였다고 누명 쓴 형이 있고, 동료 목사와의 다툼 중에 칼부림했다고 ‘칼부림 목사’로 낙인 찍힌 목사가 있습니다. 당사자에게는 사회적 인격이 파괴되는 중대한 사건이었습니다. 하지만 몇몇 언론에게는 그저 경찰 보도자료를 받아쓰기하면서 아직 혐의에 불과함에도 불구하고 ‘범인으로 단정’해버리고, 자기 신분도 밝히지 않고 형사과장에게 전화 걸어 받은 부정확한 답변을 그저 기사로 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/tQyDyqczdao/82430",
          "publishedOn": "2021-10-29T00:15:49.000Z",
          "wordCount": 1176,
          "title": "너무 쉬운 낙인: 친동생 살해 누명 사건 (2003), 칼부림 목사 누명 사건 (2015)"
        },
        {
          "id": "https://slownews.kr/?p=82414",
          "author": "한상기",
          "description": "구글 클라우드 넥스트는 구글이 매년 개최하는 클라우드 분야 전문 컨퍼런스다. 2021년에는 10월 12일에서 14일까지 개최됐다. 오프닝 키노트에서 선다 피차이(구글&알파벳 CEO)와 토마스 쿠리안(구글 클라우드 CEO)은 새로운 제품과 기능, 확장 계획 및 파트너십 등을 주제로 광범위하게 발표했다. 선다 피차이는 현재 구글 클라우드가 28개 리전에 있는데 향후 10개를 더 늘릴 예정이고, 19개의 해저 케이블을 통해 모두 연결할 것이라고 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/7kkFpcvtpRY/82414",
          "publishedOn": "2021-10-28T19:53:42.000Z",
          "wordCount": 1552,
          "title": "구글 클라우드 넥스트 ’21: 구글이 강조한 세 가지"
        },
        {
          "id": "https://slownews.kr/?p=82394",
          "author": "임명묵",
          "description": "“위대한 정신은 숭배받기보다는 비판받기를 원한다.” (니체)   요즘 토론은 점점 더 귀한 멸종위기동물처럼 느껴집니다. 서로 치열하게 싸우더라도 상대를 존중하는 미덕은 사라진지 오랩니다. 오직 승리만이 목적이고, 증오만이 동력인 전장터만 여기저기 흩어져 있습니다. ‘스트리트 우먼 파이터’의 멋진 배틀은 많은 이에게 감동을 주었습니다. ‘배틀 필드’에는 댄서들의 열정과 투쟁심이 넘쳤습니다. 하지만 모든 싸움이 끝나고, 댄서들은 마치 따뜻한 자매처럼, […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/-BpsSZSTAEw/82394",
          "publishedOn": "2021-10-28T10:41:12.000Z",
          "wordCount": 3825,
          "title": "[K를 생각한다] 서평에 답하며"
        },
        {
          "id": "https://slownews.kr/?p=82382",
          "author": "민주언론시민연합",
          "description": "한국 저널리즘이 통째로 흔들리고 있다는 진단은 새롭지 않다. 심각한 위기에 놓였다는 경고마저 진부한 소리로 들린다. 디지털과 모바일로 옮겨간 미디어 환경 변화와 기민하지 못한 언론사 수익구조는 ‘저널리즘 품질 저하’로 이어지고 있다는 탄식이 시도 때도 없이 나온다. 지난 한 주 “1.5룸 청소하고 100만원 받았다”는 온라인 커뮤니티 출처 ‘복붙(복사하여 붙여쓰기)’기사는 뉴스 생산에서 비가시적이지만 영향력을 행사하는 디지털 대응 전략이 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/9mGsaepeRBA/82382",
          "publishedOn": "2021-10-27T08:56:21.000Z",
          "wordCount": 1124,
          "title": "3년째 같은 기사: 클릭 저널리즘의 현주소"
        },
        {
          "id": "https://slownews.kr/?p=82370",
          "author": "민주언론시민연합",
          "description": "10월 18일 국회 행정안전위원회 경기도 국정감사에서 김용판 국민의힘 의원이 ‘이재명 지사가 받은 돈뭉치’라며 제보받은 사진을 공개했습니다. 5만 원 권과 1만 원 권 돈다발이 렌터카, 라운지 바 명함 등과 함께 놓인 사진입니다. 김 의원은 성남지역 폭력조직 국제마피아파 측근들로부터 이재명 더불어민주당 대선 후보가 20억 원가량을 받았다고 주장하며 그 근거로 국제마피아파 출신 박철민 씨에게서 받았다는 진술서와 사실확인서, 돈다발 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/nf8IyOiaYD8/82370",
          "publishedOn": "2021-10-27T07:55:26.000Z",
          "wordCount": 1676,
          "title": "김용판의 ‘허위’ 돈다발 사진, 조선일보의 ‘박철민’ 받아쓰기 (ft. 무책임 선동 끝판왕)"
        },
        {
          "id": "https://slownews.kr/?p=82350",
          "author": "참여연대 사법감시센터",
          "description": "“피고(육군참모총장)가 망 변희수에 대하여 한 2020. 1. 23.자 전역 처분을 취소한다.”   10월 7일 법정에서 재판장이 위 주문 낭독을 들으며 정말로 여러 가지 생각이 들었다. 당연히 이루어져야 할 판단이 이루어졌다는 안도감, 그럼에도 그 판결이 나오기까지 너무나 오랜 시간이 걸리고, 그 과정에서 당사자가 함께 하지 못했다는 슬픔, 이후에 남겨진 과제에 대한 고민 등이 복합적으로 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/rnfqfeuMbio/82350",
          "publishedOn": "2021-10-26T07:27:44.000Z",
          "wordCount": 1434,
          "title": "늦게 도착한 정의: 고(故) 변희수 하사 전역처분 취소 판결"
        },
        {
          "id": "https://slownews.kr/?p=82344",
          "author": "언론인권센터",
          "description": "바쁜 독자를 위한 요약:  미국 연방대법원은 명예훼손 소송의 원고가 누구인가(국가, 공무원 등 ‘공인’인가, 아니면 그냥 개인, 즉 ‘사인’인가)에 따라 명예훼손의 입증책임을 달리 부과합니다. 즉, 국가기관이나 공인이 명예훼손 소송을 제기한 경우에 그 원고가 “현실적 악의”를 입증할 책임을 집니다. (대표 사례: 뉴욕타임스 vs. 설리번 사건, 1964) 하지만 반대로 개인, ‘사인’이 명예훼손 소송을 제기한 경우에는 명예훼손의 “현실적 악의”를 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/vCp3UBjZbAQ/82344",
          "publishedOn": "2021-10-25T08:13:37.000Z",
          "wordCount": 1402,
          "title": "미국 명예훼손 소송의 입증책임: ‘공인’이면 YES, ‘사인’이면 NO"
        },
        {
          "id": "https://slownews.kr/?p=82337",
          "author": "진보넷",
          "description": "법무부와 과학기술정보통신부가 출입국 심사와 공항 보안을 이유로 얼굴 인식 및 행동 인식 기술을 활용한 실시간 원격 감시시스템을 개발하고, 이 과정에서 1억 7천만 건이 넘는 내·외국인의 얼굴 사진과 출입국 심사 정보를 정보 주체의 아무런 동의 없이 국가와 민간기업의 인공지능 학습용 데이터로 이용한 것으로 드러났습니다. 우리는 위법할 뿐만 아니라 국제 인권규범에도 현저히 위배되는 생체인식 감시시스템의 구축을 즉각 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/emHwlhQTFbI/82337",
          "publishedOn": "2021-10-22T07:18:16.000Z",
          "wordCount": 1415,
          "title": "법무부와 과기부의 ‘얼굴 도둑질’, 그 규모는 1억 7천만 건"
        },
        {
          "id": "https://slownews.kr/?p=82331",
          "author": "민주언론시민연합",
          "description": "오늘도 당신은 습관적으로 페이스북 타임라인을 훑어 내리면서 수많은 ‘좋아요’ 버튼을 눌렀을 것이다. 미국 스탠퍼드대학교 미할 코신스키 교수에 따르면 당신이 누른 페이스북 ‘좋아요’ 70개만 살펴보면 당신 친구들이 당신에 관해 알고 있는 것보다 더 많은 것을 알 수 있다고 한다. 150개면 부모보다 더 많이 알 수 있고, 300개 이상이면 내가 나를 아는 것보다 더 많은 걸 알 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/GCP99op5_-A/82331",
          "publishedOn": "2021-10-21T06:12:41.000Z",
          "wordCount": 1178,
          "title": "페이스북 알고리즘이 분열과 폭력을 조장하는 이유"
        },
        {
          "id": "https://slownews.kr/?p=82312",
          "author": "민주언론시민연합",
          "description": "2014년 12월 5일 일명 ‘땅콩 회항’ 사건이 있었습니다. 부도덕한 대기업 창업자 일가의 갑질에 많은 사람이 분노했습니다. 당시 대한항공이 국토교통부 조사 과정에서 사건을 목격한 승무원들과 갑질 피해자 박창진 사무장을 회유하고, 거짓 진술을 종용했다는 사실이 밝혀져 더 공분을 샀습니다. 그러나 회유 의혹이 드러나는 과정에서, 잘못된 보도로 한 승무원이 ‘대한항공 측 회유를 받고 박창진 사무장에게 불리한 진술을 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/idiRfwo0iTE/82312",
          "publishedOn": "2021-10-20T09:15:38.000Z",
          "wordCount": 1358,
          "title": "땅콩회항과 악마의 미소: ‘그알’ 승무원 마녀사냥 사건 (2015)"
        },
        {
          "id": "https://slownews.kr/?p=82298",
          "author": "경실련",
          "description": "대장동 개발을 둘러싼 권력자들의 토건 부패 실체가 계속 드러나며 온 국민이 분노하고 있다. 하지만 국민의 분노에도 검찰과 경찰 수사는 2021년 2월 LH 임직원 부동산 투기 사건처럼 감추고 덮어주는데 머무는 것으로 보인다. 6개월 전부터 자금 세탁과 불법이 노출되었음에도 눈치만 보던 경찰과 검찰의 수사는 언론 보도를 확인하는 수준에도 미치지 못하고 있다. 시행 주체가 된 ‘성남의 뜰’과 설립자본금이 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/vHZ9h5fC7cs/82298",
          "publishedOn": "2021-10-19T06:18:06.000Z",
          "wordCount": 1320,
          "title": "대장동 사업의 개발이익 (추정): 김만배 일가 6,500억 수익"
        },
        {
          "id": "https://slownews.kr/?p=82285",
          "author": "민주언론시민연합",
          "description": "전남 여수의 한 선착장에서 10월 6일 현장 실습을 하던 특성화고 3학년 홍정운 군이 숨졌습니다. 여수해경 등에 따르면, 홍 군은 7톤 요트 바닥에 붙은 따개비 등을 제거하는 수중 작업 중 사망했습니다. 홍 군은 잠수 작업을 하다가 장비를 정비하기 위해 잠시 수면 위로 올라왔고, 산소통과 오리발을 잇따라 벗어 업주에 건넸습니다. 그러나 기초교육 없이 잠수 작업에 내몰렸던 홍 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/FnWJrDYJv98/82285",
          "publishedOn": "2021-10-18T05:28:21.000Z",
          "wordCount": 1548,
          "title": "요트 따개비 따다 숨진 고3 실습생 홍정운 (ft. 매경, 한경, SBS, 채널A 무보도)"
        },
        {
          "id": "https://slownews.kr/?p=82275",
          "author": "민주언론시민연합",
          "description": "이재용 삼성전자 부회장이 10월 12일 향정신성 마취제 프로포폴을 불법 투약한 혐의로 가석방된 지 두 달 만에 법정에 섰습니다. 이 부회장은 2015년 1월 31일부터 2020년 5월 10일까지 서울 강남의 한 성형외과에서 의사 등 직원과 공모해 피부미용 시술을 빙자하거나 허위로 41회에 걸쳐 프로포폴을 상습 투약한 혐의를 받고 있습니다. 민주언론시민연합은 이 부회장의 마약류관리법 위반 혐의 사건에 대한 첫 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/TPdwpMQVF64/82275",
          "publishedOn": "2021-10-15T08:04:30.000Z",
          "wordCount": 1428,
          "title": "삼성 앞에선 작아지는 언론: ‘이재용 프로포폴’ 관련 보도 분석"
        },
        {
          "id": "https://slownews.kr/?p=82262",
          "author": "참여연대 사법감시센터",
          "description": "2017년 3월 압구정 현대아파트 경비노동자들이 이 아파트 입주자대표회의를 상대로 휴게시간에 제대로 쉬지 못하고 일한 것에 대하여 이는 근로시간에 해당하므로 임금을 지급해야 한다면서 제기한 임금체불 진정(서울고용노동부 강남지청) 사건을 시작한 지 4년여만인 2021년 8월, 대법원은 원고 경비노동자들의 청구를 대부분 인정하는 판결을 내렸고, 이로써 당사자 간의 법적 공방은 종결되었다. 1심 서울중앙지방법원 2019. 09.19. 선고 2018가합512483 2심 서울고등법원 2021. […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/3IqpXQF_sZ8/82262",
          "publishedOn": "2021-10-15T06:45:29.000Z",
          "wordCount": 1718,
          "title": "압구정 현대아파트의 경비원 착취법 (ft. 휴게시간 노동)"
        },
        {
          "id": "https://slownews.kr/?p=82206",
          "author": "씨앗(CEART)",
          "description": "오늘날 IT 인프라스트럭처(infrastructure: 기반시설)와 아키텍처(architecture: 서비스 설계)는 베어 메탈(Bare Metal: 어떤 소프트웨어도 설치돼 있지 않은 하드웨어 상태)에서 가상화를 거쳐 최근에는 컨테이너 기술로 발전하고 있다. 가상화 기술이 출현하기 전에는 하나의 물리적 서버에서 다양한 애플리케이션을 올려 사용하는 획일화된 모놀리식(Monolithic) 시대였다. 장기간 코로나 전염병 대유행의 발병은 기업에 큰 영향을 미치고 혁신과 수익성을 억제하며 현금 흐름과 회사 재정을 고갈시켰다. […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/1gzmQHkv330/82206",
          "publishedOn": "2021-10-14T05:43:15.000Z",
          "wordCount": 2518,
          "title": "클라우드 PC, 하이브리드 클라우드컴퓨팅 시대를 열다"
        },
        {
          "id": "https://slownews.kr/?p=82232",
          "author": "민주언론시민연합",
          "description": "2012년 조선일보가 일부 지역에 배달된 신문 1면에 엉뚱한 사람의 사진을 싣고 성폭행범으로 지목한 사건이 있었습니다(‘조선일보-고종석 초상 오보 사건’). 이 사건은 소송으로까지 이어지진 않았지만, 언론의 ‘중대한’ 실수가 일반 시민에게 어떤 피해를 가져올 수 있는지 여실히 보여줍니다. 유사한 사건으로 언론사에 손해배상을 청구하면 얼마나 피해를 구제받을 수 있을까요? KBS, 막 개업한 병원을 문닫게 하다  2013년 KBS의 부주의로 개업 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/NUoV8rzrTsE/82232",
          "publishedOn": "2021-10-13T05:53:53.000Z",
          "wordCount": 844,
          "title": "KBS ‘보험사기 병원’ 오인 유도 사건 (2013)"
        },
        {
          "id": "https://slownews.kr/?p=82220",
          "author": "민주언론시민연합",
          "description": "2014년은 서럽고 아픈 해로 기억된다. 그해 4월 세월호 참사라는 믿을 수 없는 비극을 겪었다. 떠올릴수록 아픔은 커지지만, 아파도 기억해야 한다. 우리들 몫이다. 그리고 그해 10월 성유보 이사장이 우리 곁을 떠났다. 감당할 수 없는 슬픔이기에 인정하고 싶지 않았다. 지금도 같은 마음이다. 이사장이 떠났다는 사실을 인정하려니 목이 메어온다. 세상 모든 일이 서럽고, 부끄럽다. 그래서 이번 추모 글도 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/HR7TFehnl14/82220",
          "publishedOn": "2021-10-13T04:04:14.000Z",
          "wordCount": 979,
          "title": "못다 이룬 꿈도 아름답다: 성유보 이사장을 기리며"
        },
        {
          "id": "https://slownews.kr/?p=82212",
          "author": "언론인권센터",
          "description": "여야 8인 협의체 협상결렬 후에도 오는 12. 31.까지 언론미디어제도개선특별위원회에서 논의키로 합의한 뒤 철회된 국회의안번호 ‘2112222’호’ 언론중재및피해구제등에관한법률일부개정법률안(대안)는 다양한 별칭을 갖고 있다. 관점의 차이: 징벌이냐, 구제냐 이렇게 긴 이름을 가진 법률은 보통 ‘언론중재법'(앞부분) 또는 ‘언론피해구제법'(뒷부분)과 같이 약칭으로 부른다. 그런데 의안2112222호는 법률 명칭을 줄인 ‘언론중재법개정안’, ‘언론피해구제법개정안’이라는 이름 대신 ‘언론징벌법’, ‘언론재갈법’, ‘언론겁박법’ 등의 이름으로 변주되어 사용됐다. 체감하기로는 언론징벌법이라는 명칭이 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/pM2Fv2EOca8/82212",
          "publishedOn": "2021-10-12T05:40:36.000Z",
          "wordCount": 1108,
          "title": "징벌 vs. 피해구제: 또 다시 멈춘 언론중재법"
        }
      ]
    },
    {
      "title": "꿈꾸는섬",
      "feedUrl": "https://happist.com/feed",
      "siteUrl": "https://happist.com",
      "articles": [
        {
          "id": "https://happist.com/?p=584459",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584459/%ec%8a%a4%ed%8f%ac%ed%8b%b0%ed%8c%8c%ec%9d%b4-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d-%ec%8a%a4%ed%8f%ac%ed%8b%b0%ed%8c%8c%ec%9d%b4-%eb%b3%b4%ea%b3%a0%ec%84%9c",
          "publishedOn": "2021-11-02T10:49:08.000Z",
          "wordCount": 1119,
          "title": "스포티파이 주가 전망, 뮤직 스트리밍 전망과   스포티파이 비즈 모델 확장은 장기 성장성 증명 & 목표주가 ⬆️"
        },
        {
          "id": "https://happist.com/?p=584453",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584453/%ec%9d%b8%ec%8a%a4%ed%83%80%ea%b7%b8%eb%9e%a8-%ea%b4%91%ea%b3%a0-%eb%a7%a4%ec%b6%9c",
          "publishedOn": "2021-11-02T10:10:24.000Z",
          "wordCount": 1155,
          "title": "급증하는 인스타그램 광고 매출, 페이스북 광고 매출의 절반을 차지하면서 페이스북 핵심 사업군으로 등장"
        },
        {
          "id": "https://happist.com/?p=584444",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584444/%ed%8e%98%ec%9d%b4%ec%8a%a4%eb%b6%81-%eb%a6%ac%eb%b8%8c%eb%9e%9c%eb%94%a9-%eb%a9%94%ed%83%80%eb%a1%9c-%eb%b3%80%ea%b2%bd%ec%9d%98%ed%8e%98%ec%9d%b4%ec%8a%a4%eb%b6%81-%ec%a0%84%eb%9e%b5",
          "publishedOn": "2021-11-02T03:06:20.000Z",
          "wordCount": 1013,
          "title": "페이스북 리브랜딩, 메타로 변경은 ‘대담하며 위험한 도박’으로 진지한 메타버스 전략과 소셜 미디어 논쟁에서 벗어나려는 전략"
        },
        {
          "id": "https://happist.com/?p=584188",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584188/11-1-%ec%9b%94%ea%b0%80-%ec%95%a0%eb%84%90%eb%a6%ac%ec%8a%a4%ed%8a%b8%eb%93%a4%ec%9d%98-%ed%88%ac%ec%9e%90-%ec%9d%98%ea%b2%ac%ec%9d%84-%eb%aa%a8%ec%95%84%eb%b3%b4%eb%8b%a4",
          "publishedOn": "2021-11-01T23:56:57.000Z",
          "wordCount": 2055,
          "title": "[11/1] 월가 애널리스트 투자 의견을 모아보다"
        },
        {
          "id": "https://happist.com/?p=584435",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584435/%ec%9d%b8%ed%85%94%ea%b3%bc-amd-%eb%b9%84%ea%b5%90-amd-%ed%88%ac%ec%9e%90-vs-%ec%9d%b8%ed%85%94-%ed%88%ac%ec%9e%90",
          "publishedOn": "2021-11-01T19:05:10.000Z",
          "wordCount": 689,
          "title": "맞수 인텔과 AMD 비교, 이제 AMD 투자보다 인텔 투자가 낫다는 주장이 제기되다"
        },
        {
          "id": "https://happist.com/?p=584427",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584427/bnpl-%ec%84%a0%eb%8f%84%ec%9e%90-%ec%96%b4%ed%8e%8c-%ec%a0%90%ec%9c%a0%ec%9c%a8-%ed%95%98%eb%9d%bd",
          "publishedOn": "2021-11-01T17:26:51.000Z",
          "wordCount": 747,
          "title": "BNPL 선도자 어펌, 파트너 증가 정체로 어펌 점유율이 하락하고 있다 by 모건스탠리"
        },
        {
          "id": "https://happist.com/?p=584422",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584422/21%eb%85%84-10%ec%9b%94-%ec%88%98%ec%b6%9c-%eb%b6%84%ec%84%9d-%ec%88%98%ec%b6%9c-%ed%94%bc%ed%81%ac%ec%95%84%ec%9b%83-%ec%a3%bc%ec%9e%a5%ec%9d%80-%ed%83%80%eb%8b%b9%ed%95%a0%ea%b9%8c-%ec%88%98",
          "publishedOn": "2021-11-01T13:46:37.000Z",
          "wordCount": 3287,
          "title": "21년 10월 수출 분석, 수출 피크아웃 주장은 타당할까?  수출증가율 전망 27% vs 수출증가율 24%"
        },
        {
          "id": "https://happist.com/?p=584412",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584412/%ed%8f%ac%eb%93%9c-%ec%a3%bc%ea%b0%80-%ec%83%81%ec%8a%b9-%ec%9d%b4%ec%9c%a0",
          "publishedOn": "2021-11-01T09:45:56.000Z",
          "wordCount": 1134,
          "title": "같은 실적인데 GM 주가보다 포드 주가가 더 오르는 이유"
        },
        {
          "id": "https://happist.com/?p=584393",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584393/%ed%85%8c%ec%8a%ac%eb%9d%bc-%ea%b2%bd%ec%9f%81%eb%a0%a5%ea%b3%bc-%ed%85%8c%ec%8a%ac%eb%9d%bc-%eb%aa%a9%ed%91%9c%ec%a3%bc%ea%b0%80-%ec%83%81%ed%96%a5",
          "publishedOn": "2021-10-31T13:15:37.000Z",
          "wordCount": 933,
          "title": "기존 업체외 질적으로 다른 테슬라 경쟁력 세가지, Piper Sandler의 테슬라 목표주가 상향 이유"
        },
        {
          "id": "https://happist.com/?p=584372",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584372/3%eb%b6%84%ea%b8%b0-%ec%95%a0%ed%92%80-%ec%8b%a4%ec%a0%81-%ed%9b%84-%ec%95%a0%ed%94%8c-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%ec%95%a0%ed%94%8c-%eb%aa%a9%ed%91%9c%ec%a3%bc%ea%b0%80",
          "publishedOn": "2021-10-31T07:53:28.000Z",
          "wordCount": 7554,
          "title": "3분기 애플 실적을 읽는 월가 IB들의 애플 투자의견 및 애플 주가 전망"
        },
        {
          "id": "https://happist.com/?p=584126",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584126/21%eb%85%84-3%eb%b6%84%ea%b8%b0-%ec%8a%a4%eb%83%85-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-10-22T16:03:47.000Z",
          "wordCount": 1400,
          "title": "애플 개인정보보호 정책 변화의 직격탄을 맞은 3분기 스냅 실적과 향후 스냅 전망"
        },
        {
          "id": "https://happist.com/?p=584120",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584120/21%eb%85%84-3%eb%b6%84%ea%b8%b0-%eb%9e%a8%eb%a6%ac%ec%84%9c%ec%b9%98-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-10-22T11:48:13.000Z",
          "wordCount": 1490,
          "title": "3분기 램리서치 실적, 빼어난 이익과 부진한 매출은 향후 전망을 불안케 한다"
        },
        {
          "id": "https://happist.com/?p=584106",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584106/%ed%85%8c%ec%8a%ac%eb%9d%bc-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac%ea%b3%bc-%ed%85%8c%ec%8a%ac%eb%9d%bc-%eb%aa%a9%ed%91%9c%ec%a3%bc%ea%b0%80",
          "publishedOn": "2021-10-21T16:30:43.000Z",
          "wordCount": 1937,
          "title": "3분기 테슬라 실적을 보는 월가의 시선, 테슬라 투자의견과 테슬라 목표주가는 어떻게 변하고 있을까?"
        },
        {
          "id": "https://happist.com/?p=584060",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584060/%ed%85%8c%ec%8a%ac%eb%9d%bc-%eb%b0%b1%eb%a7%8c%eb%8c%80-%ec%83%9d%ec%82%b0%ec%b2%b4%ec%a0%9c-%ea%b5%ac%ec%b6%95",
          "publishedOn": "2021-10-21T10:44:12.000Z",
          "wordCount": 943,
          "title": "테슬라 백만대 생산체제 구축 성공, 자동차 업계 정복이란 놀라운 이정표가 꿈만은 아니다"
        },
        {
          "id": "https://happist.com/?p=584064",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584064/21%eb%85%84-3%eb%b6%84%ea%b8%b0-%ed%85%8c%ec%8a%ac%eb%9d%bc-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-10-21T00:25:11.000Z",
          "wordCount": 1764,
          "title": "매출과 이익 최고 기록을 갈아치운 3분기 테슬라 실적, 어디까지 새로운 기록을 쓸까?"
        },
        {
          "id": "https://happist.com/?p=584058",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584058/3%eb%b6%84%ea%b8%b0-%eb%84%b7%ed%94%8c%eb%a6%ad%ec%8a%a4-%ec%8b%a4%ec%a0%81-%eb%b0%9c%ed%91%9c-%ed%9b%84-%eb%84%b7%ed%94%8c%eb%a6%ad%ec%8a%a4-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2021-10-20T15:08:58.000Z",
          "wordCount": 1100,
          "title": "넷플릭스 실적 발표 후 넷플릭스 투자의견과 넷플릭스 목표주가 추이(10월 19일)"
        },
        {
          "id": "https://happist.com/?p=584031",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584031/%eb%84%b7%ed%94%8c%eb%a6%ad%ec%8a%a4-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%eb%84%b7%ed%94%8c%eb%a6%ad%ec%8a%a4-%eb%aa%a9%ed%91%9c%ec%a3%bc%ea%b0%80",
          "publishedOn": "2021-10-19T23:59:40.000Z",
          "wordCount": 1363,
          "title": "[넷플릭스 투자의견] 월가 애널리스트들의 넷플릭스 투자의견 및 넷플릭스 목표주가를 알아보자"
        },
        {
          "id": "https://happist.com/?p=583995",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583995/21%eb%85%84-3%eb%b6%84%ea%b8%b0-%eb%84%b7%ed%94%8c%eb%a6%ad%ec%8a%a4-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-10-19T23:47:38.000Z",
          "wordCount": 1274,
          "title": "견실한 구독자 증가와 83% 증가 순익의 3분기 넷플릭스 실적 분석과 전망"
        },
        {
          "id": "https://happist.com/?p=584019",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584019/%eb%94%94%ec%a6%88%eb%8b%88-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%eb%94%94%ec%a6%88%eb%8b%88-%ec%a3%bc%ea%b0%80-%eb%aa%a9%ed%91%9c",
          "publishedOn": "2021-10-19T12:10:19.000Z",
          "wordCount": 1057,
          "title": "[디즈니 투자의견], Moffett, 디즈니플러스 구독자당 평균 수익(ARPU) 하락, 디즈니 주가 목표 하향"
        },
        {
          "id": "https://happist.com/?p=583947",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583947/10%ec%9b%94-18%ec%9d%bc-ib-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2021-10-19T10:46:52.000Z",
          "wordCount": 4919,
          "title": "[월가 리포트] IB 투자의견을 모아보다(10월 18일)"
        },
        {
          "id": "https://happist.com/?p=584011",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/584011/21%eb%85%84-3%eb%b6%84%ea%b8%b0-%ec%a4%91%ea%b5%ad-%ea%b2%bd%ec%a0%9c%ec%84%b1%ec%9e%a5%eb%a5%a0",
          "publishedOn": "2021-10-18T13:53:15.000Z",
          "wordCount": 563,
          "title": "3분기 중국 경제성장률 4.9%로 둔화세 지속, 4분기 전망치는 계속 하향 조정 중"
        },
        {
          "id": "https://happist.com/?p=583990",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583990/%ec%9b%94%ea%b0%80-ib-tsmc-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-tsmc-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2021-10-18T00:46:24.000Z",
          "wordCount": 2373,
          "title": "삼성 파운드리가 TSMC를 앞설 수 있을까? TSMC 투자의견을 살펴보다"
        },
        {
          "id": "https://happist.com/?p=583983",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583983/2030%eb%85%84-gm-%eb%aa%a9%ed%91%9c-%eb%b0%8f-gm-%ec%a0%84%eb%9e%b5",
          "publishedOn": "2021-10-17T11:32:40.000Z",
          "wordCount": 2727,
          "title": "[월가 리포트] Tigress, 2030년 목표 달성 가능성이 높은 GM 전략 평가"
        },
        {
          "id": "https://happist.com/?p=583983",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583983/2030%eb%85%84-gm-%eb%aa%a9%ed%91%9c-%eb%b0%8f-gm-%eb%9e%b5",
          "publishedOn": "2021-10-17T11:32:40.000Z",
          "wordCount": 2727,
          "title": "[월가 리포트] Tigress, 2030년 목표 달성 가능성이 높은 GM 전략 평가"
        },
        {
          "id": "https://happist.com/?p=583965",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583965/21%eb%85%84-3%eb%b6%84%ea%b8%b0-%eb%8f%84%eb%af%b8%eb%85%b8%ed%94%bc%ec%9e%90-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-10-16T20:13:00.000Z",
          "wordCount": 1420,
          "title": "기대 이하 매출과 기대 이상의 이익, 3분기 도미노피자 실적 및 도미노피자 전망"
        },
        {
          "id": "https://happist.com/?p=583950",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583950/%ec%95%a0%ed%94%8c-%ea%b4%91%ea%b3%a0-%ec%82%ac%ec%97%85-%ec%a7%84%ec%b6%9c-%ea%b0%80%eb%8a%a5%ec%84%b1",
          "publishedOn": "2021-10-16T15:25:44.000Z",
          "wordCount": 5746,
          "title": "[애플 리포트] 에버코어, 막대한 아이폰 사용자 기반 애플 광고 사업 진출 가능성 증대"
        },
        {
          "id": "https://happist.com/?p=583948",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583948/%ec%95%a0%ed%94%8c-%eb%a6%ac%ed%8f%ac%ed%8a%b8-%ec%95%84%ec%9d%b4%ed%8f%b0-13-%eb%8c%80%ea%b8%b0%ec%8b%9c%ea%b0%84-%ec%a6%9d%ea%b0%80-%ec%9d%b4%ec%9c%a0",
          "publishedOn": "2021-10-16T15:06:10.000Z",
          "wordCount": 5855,
          "title": "[애플 리포트] 골드만 삭스, 아이폰 13 대기시간 증가는 공급 부족 탓, 팬데믹 이후 애플 매출 감소 가능성"
        },
        {
          "id": "https://happist.com/?p=583929",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583929/tsmc-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2021-10-15T06:14:44.000Z",
          "wordCount": 2726,
          "title": "TSMC 실적 분석과 월가의 TSMC 주가 평가(21년 3분기 업뎃)"
        },
        {
          "id": "https://happist.com/?p=583923",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583923/21%eb%85%84-3%eb%b6%84%ea%b8%b0-tsmc-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-10-15T04:41:02.000Z",
          "wordCount": 1436,
          "title": "성장과 비전을 확인한 3분기 TSMC 실적과 향후 전망"
        },
        {
          "id": "https://happist.com/?p=583919",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583919/%ea%b7%bc%ec%9b%90-%ec%9d%b8%ed%94%8c%eb%a0%88%ec%9d%b4%ec%85%98-vs-%ed%97%a4%eb%93%9c%eb%9d%bc%ec%9d%b8-%ec%9d%b8%ed%94%8c%eb%a0%88%ec%9d%b4%ec%85%98",
          "publishedOn": "2021-10-15T00:51:35.000Z",
          "wordCount": 380,
          "title": "[경제용어] 근원 인플레이션(근원물가진수) vs 헤드라인 인플레이션"
        },
        {
          "id": "https://happist.com/?p=583906",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583906/%ea%b5%ad%ec%a0%9c%ed%86%b5%ed%99%94%ea%b8%b0%ea%b8%88-imf-%ec%a3%bc%ec%8b%9d%ec%8b%9c%ec%9e%a5-%eb%b0%8f-%ec%a3%bc%ed%83%9d%ec%8b%9c%ec%9e%a5-%ed%8f%ad%eb%9d%bd-%ea%b0%80%eb%8a%a5%ec%84%b1%ec%9d%84",
          "publishedOn": "2021-10-14T19:43:27.000Z",
          "wordCount": 501,
          "title": "국제통화기금, IMF  주식시장 및 주택시장 폭락 가능성을 경고하다"
        },
        {
          "id": "https://happist.com/?p=583908",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583908/imf-2021%eb%85%84-%ec%84%b8%ea%b3%84-%ea%b2%bd%ec%a0%9c%ec%a0%84%eb%a7%9d",
          "publishedOn": "2021-10-14T12:34:55.000Z",
          "wordCount": 1193,
          "title": "21년 10월, IMF 2021년 세계 경제전망 보고서를 읽는 시사점"
        }
      ]
    },
    {
      "title": "NewsPeppermint",
      "feedUrl": "https://newspeppermint.com/feed/",
      "siteUrl": "https://newspeppermint.com",
      "articles": [
        {
          "id": "https://newspeppermint.com/?p=73694",
          "author": "malecon",
          "description": "자동차가 점점 디지털 기기로 바뀌면서 두 산업이 협력했을 때 얻을 수 있는 과실이 커지고 있습니다. “테크 기업은 자동차 기업이, 자동차 기업은 테크 기업이 필요합니다.” 전문가들은 반도체 산업과 자동차 산업이 서로 의존하는 관계를 넘어 경계가 모호해지고 있다고 평가합니다. 포드자동차는 애플과 테슬라 출신의 임원을 영입하고, 인텔과 퀄컴은 자동차 산업에 진출하고 있습니다. 과연 두 산업의 미래는 어떻게 될까요? 월스트리트저널의 기사를 소개합니다.",
          "link": "https://newspeppermint.com/2021/11/04/semiconductorcartech/?utm_source=rss&utm_medium=rss&utm_campaign=semiconductorcartech",
          "publishedOn": "2021-11-04T22:59:21.000Z",
          "wordCount": 757,
          "title": "반도체 부족 사태가 불러온 자동차 기업과 테크 기업 간 협업"
        },
        {
          "id": "https://newspeppermint.com/?p=73680",
          "author": "ingppoo",
          "description": "월스트리트저널이 지난 주말판에 \"소셜미디어, 어떻게 고칠 수 있을까?(How to Fix Social Media)\"라는 제목아래 여러 전문가의 칼럼을 한데 실었습니다. 메타(Meta)로 이름을 바꾼 (구) 페이스북의 글로벌 사업 부사장 닉 클레그의 글을 소개합니다.",
          "link": "https://newspeppermint.com/2021/11/01/wsjclegg/?utm_source=rss&utm_medium=rss&utm_campaign=wsjclegg",
          "publishedOn": "2021-11-01T22:59:19.000Z",
          "wordCount": 694,
          "title": "닉 클레그 “페이스북 혼자서는 문제를 풀 수 없습니다”"
        },
        {
          "id": "https://newspeppermint.com/?p=73673",
          "author": "ingppoo",
          "description": "월스트리트저널이 지난 주말판에 \"소셜미디어, 어떻게 고칠 수 있을까?(How to Fix Social Media)\"라는 제목아래 여러 전문가의 칼럼을 한데 실었습니다. 지난해 미국 대선 민주당 경선에 참여했던 에이미 클로부샤르 상원의원의 글을 소개합니다.",
          "link": "https://newspeppermint.com/2021/11/01/wsjklobuchar/?utm_source=rss&utm_medium=rss&utm_campaign=wsjklobuchar",
          "publishedOn": "2021-11-01T22:55:53.000Z",
          "wordCount": 699,
          "title": "에이미 클로부샤르 “이제는 도무지 못 미더워진 빅테크”"
        },
        {
          "id": "https://newspeppermint.com/?p=73647",
          "author": "veritaholic",
          "description": "(Brendan Mackie, 리얼라이프) 원문 보기 인류는 소속감의 위기가 올 때마다 새로운 기술을 이용해 여기에 대응해 왔습니다. 르네상스 시대에는 손편지가 있었습니다. 초기 산업 사회는 클럽이 그 역할을 했습니다. 1950년대에는 TV가 있었고, 이제 사람들은 스마트폰에서 소속감을 찾고 있습니다. 1950년대 유행한 친밀감 쇼처럼, 오늘날의 준사회적 미디어 역시 친밀감을 목적으로 만들어집니다. 방송인은 대화하듯 말하며, 자신의 사적인 삶에 관해 이야기하고, 자신의 설정된 약점을 밝힙니다. 침실이나 컴퓨터 앞에서 이야기하며, 때로 자신의 가족이나 친구들과 같이 나타나는 등 → 더 보기",
          "link": "https://newspeppermint.com/2021/10/28/m-friends2/?utm_source=rss&utm_medium=rss&utm_campaign=m-friends2",
          "publishedOn": "2021-10-28T22:55:29.000Z",
          "wordCount": 1160,
          "title": "우리가 친구가 될 수 없는 이유(2/2)"
        },
        {
          "id": "https://newspeppermint.com/?p=73646",
          "author": "veritaholic",
          "description": "팟캐스트와 같은 “준사회적(parasocial)” 미디어들은 친구 관계와 물질적인 관계를 뒤섞고 있다. (Brendan Mackie, 리얼라이프) 원문 보기   지난 10년 동안 인터넷의 유명인에게 일방적인 친밀감을 느끼는 현상은 매우 흔해졌습니다. 이는 준사회적(parasocial) 관계라는 것으로, 사회적 관계와 거의 비슷하지만 다른 관계, 혹은 다소 뒤틀린 사회적 관계라는 뜻입니다. 예를 들어 미국의 코미디언 존 멀레이니의 팬들은 그의 농담에 웃을 때 만큼이나 그가 겪은 최근의 힘든 일을 걱정\u001d합니다. 블랙핑크나 트와이스와 같은 K팝 그룹의 팬들(각각 Blinks 와 Onces)은 → 더 보기",
          "link": "https://newspeppermint.com/2021/10/28/m-friends1/?utm_source=rss&utm_medium=rss&utm_campaign=m-friends1",
          "publishedOn": "2021-10-28T22:54:57.000Z",
          "wordCount": 1071,
          "title": "우리가 친구가 될 수 없는 이유(1/2)"
        },
        {
          "id": "https://newspeppermint.com/?p=73573",
          "author": "NewsPeppermint",
          "description": "원문보기 뉴스페퍼민트 에디터이기도 했던 정신과 전문의 나종호 님이 오랜만에 글을 번역해 자신의 브런치에 올렸습니다. 환자 본인들의 이야기를 실어 질병에 대한 낙인을 해소하는 걸 목표로 하는 사이트 themighty.com의 기사입니다. 역자의 허락을 구해 뉴스페퍼민트에도 글을 싣습니다. 나종호 님이 전에 뉴스페퍼민트에 소개했던 글은 여기서 볼 수 있습니다. 원문에 있는 편집자의 말을 보면, “자살을 생각해본 적이 있는 사람은 이 글을 읽고 자살에 관한 생각이 다시 들 수 있다.”는 경고와 함께 급한 도움을 청하고 싶을 때 → 더 보기",
          "link": "https://newspeppermint.com/2021/10/21/suicidalthoughts/?utm_source=rss&utm_medium=rss&utm_campaign=suicidalthoughts",
          "publishedOn": "2021-10-21T22:59:59.000Z",
          "wordCount": 1135,
          "title": "내가 죽고 싶었을 때, 아버지가 내게 해준 말 한마디"
        },
        {
          "id": "https://newspeppermint.com/?p=73565",
          "author": "veritaholic",
          "description": "지난주 뉴욕타임스 오피니언란은 인스타그램이 10대 소녀들에게 끼치는 영향에 대한 논의로 뜨거웠습니다. 먼저 10월 8일, 뉴욕타임스의 에디터이자 영화감독인 린지 크라우스는 “10대 소녀에게 인스타그램은 악의 소굴(cesspool)”이라는 제목의 글을 올렸습니다. 논의를 촉발한 건 우리 모두 알고 있는 페이스북 내부고발자 프랜시스 하우건의 폭로였습니다. 하우건은 페이스북이 10대 소녀들의 정신건강에 인스타그램이 미치는 해악을 알면서도 그 연구 결과를 일부러 숨겼다고 주장했습니다. 사실 소셜미디어가 10대 청소년의 정신 건강에 나쁜 영향을 미친다는 주장은 그리 새로운 것이 아닙니다. 소셜미디어는 그 자체로 → 더 보기",
          "link": "https://newspeppermint.com/2021/10/21/npc_instagrammentalhealth/?utm_source=rss&utm_medium=rss&utm_campaign=npc_instagrammentalhealth",
          "publishedOn": "2021-10-21T20:00:30.000Z",
          "wordCount": 705,
          "title": "인스타그램과 청소년의 정신건강"
        },
        {
          "id": "https://newspeppermint.com/?p=73529",
          "author": "ingppoo",
          "description": "뉴욕타임스 참고기사 뉴욕타임스 관련 팟캐스트   조 바이든 미국 대통령은 요즘 행정부가 추진 중인 인프라 지원 법안을 의회와 국민에게 설득하고 홍보하고 다니느라 바쁩니다. 법안은 크게 두 부분으로 나뉘는데, 하나는 우리가 아는, 전통적인 인프라를 확충하고 이를 통해 일자리도 창출하는 법안입니다. 다른 하나는 미국이 특히 유럽을 비롯한 다른 주요 선진국과 비교했을 때 턱없이 부족하다고 여겨지는 사회보장제도를 대폭 확대하는 법안입니다. 야당인 공화당이 정부 지출이 늘어나는 일이라면 대개 덮어놓고 반대하는 성향인데다 정치적 양극화 추세가 → 더 보기",
          "link": "https://newspeppermint.com/2021/10/13/uschildcare/?utm_source=rss&utm_medium=rss&utm_campaign=uschildcare",
          "publishedOn": "2021-10-13T22:59:49.000Z",
          "wordCount": 1093,
          "title": "육아를 사회와 정부가 책임지는 나라 VS 개인과 시장에 맡기는 나라"
        },
        {
          "id": "https://newspeppermint.com/?p=73513",
          "author": "malecon",
          "description": "몇 년 전부터 각국 금융규제 기관은 기후 변화가 금융 시스템의 안정성에 미치는 위협을 경고하기 시작했습니다. 기후 리스크는 세 가지 경로를 통해 금융 시스템에 충격을 가합니다. 기업의 재무 상태를 악화시키고, 금융 기관의 비용 부담을 높이고, 자연재해, 난민 등 경제적 충격을 일으키는 것입니다. 그러나 대부분의 연구에서 기후 리스크가 금융 시스템을 붕괴시키는 수준으로 나가지는 않으리라 평가합니다. 물론 테스트의 기준이 지나치게 낙관적이라는 비판도 있습니다. 과연 기후 리스크가 금융 시스템에 어떤 경로를 통해, 얼마나 영향을 미칠까요? 이코노미스트의 기사를 소개합니다.",
          "link": "https://newspeppermint.com/2021/10/12/climatechangefinancialcrisis/?utm_source=rss&utm_medium=rss&utm_campaign=climatechangefinancialcrisis",
          "publishedOn": "2021-10-12T22:59:26.000Z",
          "wordCount": 963,
          "title": "기후 변화가 글로벌 금융 위기를 불러올 것인가?"
        }
      ]
    },
    {
      "title": "WALLFLOWER",
      "feedUrl": "http://rss.egloos.com/blog/wallflower",
      "siteUrl": "http://wallflower.egloos.com",
      "articles": [
        {
          "id": "http://wallflower.egloos.com/4202872",
          "author": "이택광",
          "description": "<오징어 게임>을 본 미국의 지인은 고도로 발전한 자본주의를 영위하는 한국에서 이런 자본주의 비판 드라마가 제작된다는 것이 아이러니하다고 전했다. 나에게 취재를 요청한 미국 방송의 기자는 드라마에서 그려지는 게임이 얼마나 실제의 한국과 닮아 있는지 물었다. .... 글 전체보기",
          "link": "http://wallflower.egloos.com/4202872",
          "publishedOn": "2021-11-06T19:13:37.000Z",
          "wordCount": 761,
          "title": "드라마와 현실"
        },
        {
          "id": "http://wallflower.egloos.com/4202693",
          "author": "이택광",
          "description": "십 여년 전 일본에 가면 인상적이었던 장면이 바로 지하철에서 너도 나도 책을 읽고 있는 모습이었다. 아담한 문고본을 펼쳐 들고 주위를 아랑곳하지 않고 책에 눈을 박고 있는 노인들의 모습도 심심찮게 볼 수 있었다. 나만 그 장면들을 기억에 새겼던 것은 아니었을 것이.... 글 전체보기",
          "link": "http://wallflower.egloos.com/4202693",
          "publishedOn": "2021-10-31T00:59:52.000Z",
          "wordCount": 768,
          "title": "책을 읽는다는 것"
        },
        {
          "id": "http://wallflower.egloos.com/4202692",
          "author": "이택광",
          "description": "<오징어 게임>에 대한 비평은 아니고, \"영업용\" 칼럼이다. 중앙선데이에 실렸다. 많은 이들이 \"한국적 이야기\" 덕분에 <오징어 게임>이 성공했다고 주장하지만, 내 생각은 다르다. 이미 <킹덤>이나 <반도>의 사례에서 확인했듯이, <오징.... 글 전체보기",
          "link": "http://wallflower.egloos.com/4202692",
          "publishedOn": "2021-10-31T00:53:23.000Z",
          "wordCount": 945,
          "title": "오징어 게임 신드롬"
        },
        {
          "id": "http://wallflower.egloos.com/4202164",
          "author": "이택광",
          "description": "신고",
          "link": "http://wallflower.egloos.com/4202164",
          "publishedOn": "2021-10-12T01:03:26.000Z",
          "wordCount": 218,
          "title": "팬데믹과 기계 감시"
        }
      ]
    },
    {
      "title": "내 마음의 풍경",
      "feedUrl": "https://rss.blog.naver.com/sellars.xml",
      "siteUrl": "https://blog.naver.com/sellars",
      "articles": [
        {
          "id": "https://blog.naver.com/sellars/222563292829",
          "author": "sellars",
          "description": "* 전제와 결론을 가진 논증으로 요약해 보라. 신탁은 내가 가장 현명하다고 이야기했습니다. 이 이야기를 들었을 때, 나는 신의 말은 무엇을 뜻하는가? 신의 수수께끼를 어떻게 해석할 것인가? 하고 자문해 보았습니다. 왜냐하면 나는 크든 작든 간에 지혜가 없다는 것을 알고 있기 때문입니다. 신이 내가 가장 현명한 사람이라고 말할 때 그는 무슨 말을 하려고 한 것일까? 그는 신이고, 따라서 거짓말을 할 수는 없는 일입니다. 거짓말을 한다는 것은 신에게는 어울리지 않는 일입니다. 오랫동안 숙고한 끝에 이 문제를 푸는 방법을 생각해 냈습니다. 만일 나 자신보다 더 현명한 사람을 찾아내기만 한다면 나는 신탁의 소리를 반박할 수 있을.......",
          "link": "https://blog.naver.com/sellars/222563292829",
          "publishedOn": "2021-11-09T09:36:26.000Z",
          "wordCount": 8,
          "title": "7 논증적으로 생각하기"
        },
        {
          "id": "https://blog.naver.com/sellars/222559991054",
          "author": "sellars",
          "description": "사이먼 크리츨리(Simon Critchley), 혹은 사이몬 크리칠리의 작은 책 <대륙철학>(2001)이 <유럽 대륙철학>(2016)이라는 제목으로 번역되어 있다. 데리다와 레비나스 학자라고 할 수 있는, 그러나 이제는 아주 폭넓은 저술가라고 할 수 있는 그의 책들이 제법 우리말로 번역되어 있다. <죽은 철학자들의 서(書)>, <믿음 없는 믿음의 정치>, <데이비드 보위>, <자살에 대하여> 등이다. <유럽 대륙철학>은 대륙 철학을 분석철학과의 관련에서 해명하고 있다. 특히 분석철학적, 혹은 ‘영국적’이라는 부를 수 있는 요소에 대립되는 대륙철학적, 유럽적 요소들이 어떻게 서로를 존중하면서 함께 있을 수 있.......",
          "link": "https://blog.naver.com/sellars/222559991054",
          "publishedOn": "2021-11-05T21:45:21.000Z",
          "wordCount": 8,
          "title": "유럽 대륙철학 1"
        },
        {
          "id": "https://blog.naver.com/sellars/222557750248",
          "author": "sellars",
          "description": "<서발턴은 말할 수 있는가>(2016)에 실려 있는 로절린드 모리스의 <서문>을 읽는다. 그런데 잘 이해되지 않는다. 혹은 읽기가 매우 불편하다. 아마 이 책이 서 있는 맥락에 대한 배경 지식이 부족하기 때문일 것이다. 그러나 그런 측면도 분명히 있겠지만, 설명하는 방식이나 문체, 글쓰기가 내 취향이 아니다. 로절란드 모리스는 인류학과에 소속되어 있는 학자이다. 그녀는 매스 미디어, 근대성, 문화 정치, 시각성과 재현, 폭력의 의미화, 젠더 등에 대한 에세이를 썼다고 한다. 이상하게 이런 주제들을 다루고 있는 글에 대해서 거의 읽기 힘들었다는 인상을 가지고 있다. 따라서 나에게 철학적으로 직접 도움이 되지 않는 이런.......",
          "link": "https://blog.naver.com/sellars/222557750248",
          "publishedOn": "2021-11-03T12:35:08.000Z",
          "wordCount": 8,
          "title": "읽기 불편한 글"
        },
        {
          "id": "https://blog.naver.com/sellars/222555932439",
          "author": "sellars",
          "description": "철학 전공자의 논문이 마치 역사학자가 쓴 역사 논문 같다는 것을 어떻게 평가해야 하는가? 역사적 탐구는 있지만, 철학적 탐구는 실종되어 역사적 고찰로 대체되어 있다. 그 결과, 논문이 주장하는 바가 분명치 않거나 혹은 주장하는 바가 없거나, 당연하지만 그저 막연한 제안으로 끝나고 있다. 처음 글을 읽었을 때, 나는 당연하게 저자가 철학에 관심이 있는 역사학자인지 알았다. 그런데 한국철학 전공이다. 한국철학 혹은 동양철학은 철학개념이나 철학적 탐구를 역사나 개념의 고고학으로, 기원과 발생에 대한 탐구로 대체하면서 바로 그것이 진정한 <철학>이라고 주장하는 것인가? 과거를 서술하고 설명하는 과정에서 주장이나 논.......",
          "link": "https://blog.naver.com/sellars/222555932439",
          "publishedOn": "2021-11-01T20:48:03.000Z",
          "wordCount": 8,
          "title": "철학적 탐구와 역사적 탐구"
        },
        {
          "id": "https://blog.naver.com/sellars/222555485515",
          "author": "sellars",
          "description": "개인적으로 <논어>에서 중요한 것이 충서(忠恕) 혹은 서(恕)라고 생각한다. 공자가 증자에게 말한다. 내 도는 하나로 관통되어 있다. 다른 이들이 증자에게 묻는다. 그것이 무엇인가? 바로 충서(忠恕)이다. 그런데 이 충서에 대해서 공자는 더 이상 명백하게 말하지 않는다. 반면에 서(恕)는 아니다. 공자는 서(恕)에 대해서 분명하게 말한다. 그것은 우리가 평생토록 추구할 만한 것이다. 己所不欲(기소불욕) 勿施於人(물시어인), 즉 자기가 원하는 것이 아니면 남에게 베풀지 마라. 한자사전을 찾아보면 서(恕)는 ‘용서’, ‘어질다’, ‘동정(同情)’, ‘남의 처지에 서서 동정(同情)하는 마음’ 등의 뜻이다. 공자가 말한 서(恕), 혹.......",
          "link": "https://blog.naver.com/sellars/222555485515",
          "publishedOn": "2021-11-01T10:10:05.000Z",
          "wordCount": 8,
          "title": "서(恕) 혹은 배려"
        },
        {
          "id": "https://blog.naver.com/sellars/222554309798",
          "author": "sellars",
          "description": "유사성보다는 차이성에 주목하는 것이 철학적으로 더 생산적이라고 지적했다. https://blog.naver.com/sellars/222533344369 차이성을 무시할 때, 우리 근대철학에서 볼 수 있듯이 모든 것이 하나가 되는 현상을 목도할 수 있다. 이렇게 지적할 때, 그냥 떠오른 인물이 유영모와 함석헌이었다. 진짜 그들이 그런 주장을 하는지 그들 저술을 차분하게 읽어보아야 하지만, 사실 읽어보고 싶은 마음은 거의 없다. 노자에 대한 논문 하나를 읽다가 다음과 같은 구절을 발견한다. <20세기 한국의 현실에서 노자는 분명 하나의 전통이자 상식이 되었다. 그 출발은 오히려 대학의 ‘철학’이 아닌 다른 공간에서 싹터 나왔다. 1958년 최초의 한글 노.......",
          "link": "https://blog.naver.com/sellars/222554309798",
          "publishedOn": "2021-10-31T09:03:48.000Z",
          "wordCount": 8,
          "title": "유영모의 노자"
        },
        {
          "id": "https://blog.naver.com/sellars/222537401095",
          "author": "sellars",
          "description": "https://www.youtube.com/watch?v=Fd-FW3GeKk4 인간적 존재와 인간의 탈을 쓴 존재, 이것이 내가 멍청이 30%들, 혹은 <친애하는> 서울, 부산, 대구 시민들을 인간으로 간주하지 않는 이유이다. + 그런데 대구 시장, 이 작자는 왜 백신 사기 맞은 것에 대해서 여전히 책임을 지지 않는가? 곧 백신을 도입할 수 있다고 잘난 척 하면서 기자회견 하던 꼬라지가 아주 생생하다. 인간이 되라. 혹은 품격을 지닌 인간 존재가 되라. 그러나 아마 그대에게는 불가능한 사건일 것이다. ++ 그가 다시 서울시장에 당선되었을 때, <친애하는 서울 시민들>에게 다음 사진을 보여주고 싶었다.",
          "link": "https://blog.naver.com/sellars/222537401095",
          "publishedOn": "2021-10-14T21:04:41.000Z",
          "wordCount": 8,
          "title": "사과와 성찰"
        },
        {
          "id": "https://blog.naver.com/sellars/222537002282",
          "author": "sellars",
          "description": "<그러나 이 개념들에 대해서도 (즉 공간과 시간의 개념, 지성 개념인 범주에 대해서) 여느 인식에 대해서와 마찬가지로, 그 개념들의 가능성의 원리가 아니라면, 그것들을 산출하는 기회원인들이라도 경험에서 찾아낼 수 있다. 경험에서 감각 인상은 그 개념들과 관련해서 전 인식능력이 발동하고, 그 경험이 성립하도록 하는 최초의 계기를 제공한다.> 이러한 개념을 산출하는 원인, 즉 발생적 원인을 경험에서 찾아낼 수 있다. 경험론자들이 주장한 것처럼 이런 인과적 차원에서, 즉 발생적 차원에서 감각 인상이 경험이 성립할 수 있는 최초의 계기를 준다. 사실 경험론자의 철학적 작업은 이런 감각 인상으로부터 우리의 지식이 어떻게.......",
          "link": "https://blog.naver.com/sellars/222537002282",
          "publishedOn": "2021-10-14T09:59:31.000Z",
          "wordCount": 8,
          "title": "2 발생적 설명과 초월적 연역"
        },
        {
          "id": "https://blog.naver.com/sellars/222535305983",
          "author": "sellars",
          "description": "(가) 사단은 리에서 발(發)하고, 칠정은 기에서 발(發)한다. 퇴계는 (가)를 다음처럼 고친다. (나) 사단은 리의 발(發)이고, 칠정은 기의 발(發)이다. 무슨 차이가 있는가? (나)는 사단의 발생 혹은 발현의 주체가 리임을 분명하게 보여주고 있다. 그런데 사단은 무엇이고 칠정은 무엇인가? 때로 사단을 도덕적 감정으로, 칠정을 감정, 혹은 자연적 감정을 지시한다. 이렇게 본다면, 사단칠정론은 도덕적 감정과 (자연적) 감정의 구분, 유래, 근거에 대한 철학적 문제이다. 그렇지만 사단을 <도덕적 감정>이라고 할 수 있는가? 측은한 마음, 사양하는 마음, 창피해 하는 마음은 감정이라고 할 수 있지만, (그럼에도 이 감정이 자연적 감정.......",
          "link": "https://blog.naver.com/sellars/222535305983",
          "publishedOn": "2021-10-12T20:32:00.000Z",
          "wordCount": 8,
          "title": "사단칠정의 문제 혹은 해체"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}