{
  "sources": [
    {
      "title": "ACM Queue - All Queue Content",
      "feedUrl": "https://queue.acm.org/rss/feeds/queuecontent.xml",
      "siteUrl": "http://queue.acm.org/Curmudgeon",
      "articles": [
        {
          "id": "3595862",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3595862",
          "publishedOn": "2023-05-24T12:51:51.000Z",
          "wordCount": null,
          "title": "You Don't know Jack about Application Performance",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Arjun Sreedharan",
      "feedUrl": "https://arjunsreedharan.org/rss",
      "siteUrl": "https://arjunsreedharan.org/",
      "articles": []
    },
    {
      "title": "The Clean Code Blog",
      "feedUrl": "https://blog.cleancoder.com/atom.xml",
      "siteUrl": "http://blog.cleancoder.com/atom.xml",
      "articles": []
    },
    {
      "title": "C++ Stories",
      "feedUrl": "https://www.cppstories.com/index.xml",
      "siteUrl": "https://www.cppstories.com/",
      "articles": [
        {
          "id": "https://www.cppstories.com/2023/h1-cpp-papers23/",
          "author": null,
          "description": "Last week the ISO committee met in Varna to discuss some of the first batch of C++26 features. It’s an excellent occasion to shed some light on the latest status and interesting C++ proposals.\nLet’s start!\nBy the way: This will be my first blog post with the #cpp26 tag!\nDisclaimer: The views expressed in this article are my own and do not represent the opinion of the ISO C++ Committee.\n\n\nReturn to In-Person ISO Meetings \n  \n\n\n\n\n     \n    \n\n\nWith the pandemic largely behind us, we’re left adapting to a blend of virtual and in-person meetings. The ISO Committee held its first “post-pandemic” in-person meeting in Kona, HI, USA, in November 2022, followed by another one in Issaquah, USA, in February 2023. These meetings predominantly follow a hybrid format.\nBoth meetings served to complete the…",
          "link": "https://www.cppstories.com/2023/h1-cpp-papers23/",
          "publishedOn": "2023-06-19T00:00:00.000Z",
          "wordCount": 1895,
          "title": "Five Awesome C++ Papers for the H1 2023 - C++26, Varna and More",
          "imageUrl": "https://www.cppstories.com/2023/images/papersh123.png"
        },
        {
          "id": "https://www.cppstories.com/2023/ub-factory-constinit/",
          "author": null,
          "description": "A few years ago (see here, I showed an interesting implementation for self-registering classes in factories. It works, but one step might be at the edge of Undefined behavior. Fortunately, with C++20, its new constinit keyword, we can update the code and ensure it’s super safe.\n\n\n\n     \n    \n\n\nLet’s bring back the topic:\nHere’s a typical factory function. It creates unique_ptr with ZipCompression or BZCompression based on the passed name/filename:\nstatic unique_ptr<ICompressionMethod> Create(const string& fileName) {\n    auto extension = GetExtension(filename);\n    if (extension == \"zip\")\n        return make_unique<ZipCompression>();\n    else if (extension = \"bz\")\n        return make_unique<BZCompression>();\n\n    return nullptr;\n}\n\n\nHere are some issues with this approach:\nEach time you wr…",
          "link": "https://www.cppstories.com/2023/ub-factory-constinit/",
          "publishedOn": "2023-06-12T00:00:00.000Z",
          "wordCount": 2596,
          "title": "Solving Undefined Behavior in Factories with constinit from C++20",
          "imageUrl": "https://www.cppstories.com/2023/images/ub_constinit.png"
        }
      ]
    },
    {
      "title": "Sticky Bits – Powered by Feabhas",
      "feedUrl": "https://blog.feabhas.com/feed/",
      "siteUrl": "https://blog.feabhas.com/",
      "articles": []
    },
    {
      "title": "The LLVM Project Blog",
      "feedUrl": "https://blog.llvm.org/index.xml",
      "siteUrl": "https://blog.llvm.org/",
      "articles": []
    },
    {
      "title": "Embedded in Academia",
      "feedUrl": "https://blog.regehr.org/feed",
      "siteUrl": "https://blog.regehr.org",
      "articles": []
    },
    {
      "title": "Siemens Blog Network",
      "feedUrl": "https://blogs.sw.siemens.com/feed/",
      "siteUrl": "https://blogs.sw.siemens.com",
      "articles": []
    },
    {
      "title": "Embedded Software Insights | Latest Embedded Technology News",
      "feedUrl": "https://www.bluefruit.co.uk/blog/feed",
      "siteUrl": "https://www.bluefruit.co.uk/blog/",
      "articles": []
    },
    {
      "title": "Bartosz Ciechanowski",
      "feedUrl": "https://ciechanow.ski/atom.xml",
      "siteUrl": "https://ciechanow.ski/",
      "articles": []
    },
    {
      "title": "Architectures and Processors blog",
      "feedUrl": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog/rss",
      "siteUrl": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog",
      "articles": [
        {
          "id": "dd9e70c8-6d3c-4c71-b136-2456382a7b5c:fca1d668-9e0d-419e-8c0d-f53ad51afe5d",
          "author": "Jamie Cunliffe",
          "description": "A quick look at Neon intrinsics in Rust. This will explain the status of the intrinsics in the Rust compiler. We will also show how they differ from C.(read more)",
          "link": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog/posts/rust-neon-intrinsics",
          "publishedOn": "2023-06-17T12:00:00.000Z",
          "wordCount": 4206,
          "title": "Neon Intrinsics in Rust",
          "imageUrl": "https://community.arm.com:443/cfs-file/__key/communityserver-blogs-components-weblogfiles/00-00-00-21-42/GettyImages_2D00_157313793.jpg"
        }
      ]
    },
    {
      "title": "CPUU의 Daydreamin&#039;",
      "feedUrl": "https://cpuu.postype.com/rss",
      "siteUrl": "https://cpuu.postype.com",
      "articles": [
        {
          "id": "https://cpuu.postype.com/post/14721490",
          "author": "CPUU",
          "description": "간만에 제이펍 출판사에서 해킹/리눅스 관련 책이 출시되었다. \n원서 정보는 OccupyTheWeb, \"Linux Basics for Hackers: Getting Started with Networking, Scripting, and Security in Kali\", NoStarch, 2018 이다.\n한국어판 정보는 다음과 같다.\n김세영, 정윤선 옮김, \"초보 해커를 위한 칼리 리눅스 입문\", 제이펍, 2023\n이 책은 해커들이 Linux를 어떻게 활용할 수 있는지를 다룬 책으로, Kali Linux 배포판을 교육 도구로 사용한다. 이 책에서는 Linux 명령 줄 기본 사항, 파일 시스템, 네트워킹, BASH 스크립팅, 패키지 관리, 로깅, 그리고 Linux 커널과 드라이버 등 다양한 주제에 대해 깊이 있게 다룬다.\n만약 해킹, 사이버 보안, 모의 침투와 같은 스릴 넘치는 분야에 도전하고자 한다면, 이 책은 훌륭한 출발점이 될 것이다. 고급 모의 해킹용 Linux 배포판인 Kali Linux를 활용하여 Linux 운영 체제의 기본 원리를 익히고, Linux 환경을 제어하기 위해 필요한 도구와 기술을 습득할 수 있다.\n먼저 책을 시작하기 전에 가상머신을 사용하여 칼리 리눅스를 설치하는 방법부터 친절하게 알려준다. 이 책의 원서는 2018년에 출간되었으므로 원서에서는 VirtualBox의 5.2 버전과 칼리 리눅스 2018.2 버전으로 설명하고 있으나, 한국어판의 경우 2023년에 출간되었는데 역자분께서 최신 버전으로 업데이트 된 내용을 반영해주셨다. 그래서 VirtualBox 7.0 과 칼리 리눅스 2022.4…",
          "link": "https://cpuu.postype.com/post/14721490",
          "publishedOn": "2023-06-13T07:54:04.000Z",
          "wordCount": null,
          "title": "[북리뷰] 초보 해커를 위한 칼리 리눅스 입문",
          "imageUrl": null
        },
        {
          "id": "https://cpuu.postype.com/post/14685824",
          "author": "CPUU",
          "description": "우선 이 포스트를 쓰는데에는 오랜시간동안 실험이 필요했다. \n앞서 volatility3에서 macOS 메모리 덤프를 분석하는 과정을 소개했다.\nhttps://cpuu.postype.com/post/13424833\n메모리 포렌식을 하려면 3박자가 갖추어져 있어야 한다. \n\n메모리 덤프를 추출하는 방법\n메모리에 알맞은 프로파일 (또는 ISF)을 생성하는 방법\nvolatility2 또는 volatility3 을 이용하여 분석하기\n\n그런데 기존 포스트에서는 이미 기존에 출제된 CTF를 기반으로 3번째 분석과정을 수행하는 것에만 초점을 두었기 때문에 1과 2 과정을 사실상 생략했었다. 그래서 그게 계속 마음의 짐이었는데, 이번에 반드시 성공시키고 싶었다.\n그러나 여러가지 방해물들이 있었는데, 일단 신형 macOS 에 대해서는 메모리 덤프 추출 자체가 불가능했고, 구형 macOS ISO 파일을 겨우겨우 찾아서 설치해보았으나 이에 알맞는 ISF 파일을 만드는게 불가능했다. 그래서 정말 정말 많은 시도 끝에 겨우 성공을 해서 그 과정을 기록해둔다.\n\n\n1. 실험을 위한 macOS 가상환경 준비\n일단 진짜 맥이 있음에도 불구하고, 실제 맥에서 물리 메모리 덤프를 추출하는 방법이 공식적으로 존재하지 않기 때문에 가상머신을 이용해야 한다. 그리고 ARM64 환경인 애플 실리콘 M1, M2 에 대해서도 메모리 덤프에 관한 사례가 존재하지 않기 때문에 의도적으로 인텔 64비트 환경을 선택해야 했다. \n인터넷 검색을 해보면 요즘에는 VMware나 Virtual Box 를 이용해서 인텔 윈도우에서 맥 운영체제를 가상머신으로 구동하는 방…",
          "link": "https://cpuu.postype.com/post/14685824",
          "publishedOn": "2023-06-12T07:54:51.000Z",
          "wordCount": null,
          "title": "macOS 메모리 분석을 위한 volatility3 ISF 생성하기",
          "imageUrl": null
        },
        {
          "id": "https://cpuu.postype.com/post/14601764",
          "author": "CPUU",
          "description": "애플 macOS가 M1, M2 시리즈로 출시되면서 이제 iPhone과 똑같은 ARM64 아키텍처를 사용한다. 그렇기 때문에 내부적으로 구현할 때 ARM 64bit assembly 언어를 그대로 사용할 수 있다.\n이 방법에 대해서 Stephen Smith, \"Programming with 64-Bit ARM Assembly Language\", Apress, 2020 책에서 다루고 있으나 설명이 다소 불친절하여, 직접 따라해보면서 과정을 기록해둔다.\n먼저 Xcode를 실행하여 새로운 프로젝트를 만든다. 참고로 Xcode version은 14.3이다.\n현재 Swift를 이용한 iOS앱 개발은 Storyboard 또는 SwiftUI 방식이 있다. 여기에서는 Storyboard 기준으로 설명한다.\n관련한 정보를 입력하고 저장된 폴더를 지정한다.\n이제 스토리보드 화면에서 Main 파일을 아래와 같이 디자인한다.\n기본적으로 단순한 TextField, Button, Label 을 배치했으며 각각의 변수명을 적당히 enterText, convertBtn, convertedText로 설정했고, 이를 뷰 컨트롤러에 IBOutlet으로 연결한다.\nViewController의 전체 소스코드는 다음과 같다.\n//\n//  ViewController.swift\n//  ToUpper\n//\n//  Created by CPUU on 2023/05/24.\n//\n\nimport UIKit\n\nclass ViewController: UIViewController {\n    @IBOutlet weak var enterText: UITextField!\n …",
          "link": "https://cpuu.postype.com/post/14601764",
          "publishedOn": "2023-05-26T01:17:14.000Z",
          "wordCount": null,
          "title": "iOS에서 ARM64 어셈블리로 구현된 함수 호출하기",
          "imageUrl": null
        }
      ]
    },
    {
      "title": null,
      "feedUrl": "https://danluu.com/atom.xml",
      "siteUrl": "https://danluu.com/atom/index.xml",
      "articles": []
    },
    {
      "title": "Dave Cheney",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "Red Hat Developer",
      "feedUrl": "https://developers.redhat.com/blog/feed",
      "siteUrl": "https://developers.redhat.com/",
      "articles": [
        {
          "id": "4b429401-f69f-41e5-b61f-556a73419c6d",
          "author": "Yashwanth Maheshwaram",
          "description": "Modernizing Java workloads bare-metal to containers running on the cloud is becoming critical for organizations. Cryostat is a container-native Java Virtual Machine (JVM) that helps you analyze the performance of these modernized workloads running as containers to offer your users a better experience. \nCryostat bridges other containerized JVMs and exposes a secure API for producing, analyzing, and retrieving JDK Flight Recorder (JFR) data from your cloud workloads. It can help fine-tune applications and troubleshoot performance using JVM metrics such as thread dump analysis, memory/heap consumption, garbage collection characteristics, etc. This article summarizes enhancements in Cryostat 2.3.\nWhat’s new in Cryostat 2.3? \nCryostat agent: Cryostat agent facilitates application discovery and JFR operations over HTTP API and can be included in your deployment. \nCross-namespace target discovery: A ClusterCryostat Custom Resource that can be configured to communicate with applications deployed across multiple namespaces.\nWeb interface enhancements:\n\t\nQuick start and guided tour: Short tutorials on how to navigate and perform basic functions in Cryostat.\nTopology view with bulk actions: View your deployed applications in an OpenShift-like topology view and create JFR recordings in bulk.\nCustomizable dashboards: View and configure cards displaying your JVM metrics on a dashboard.\n\n\nHow to use Cryostat for your Java workloads\nYou can install the Red Hat build of Cryostat using our OpenShift operator, available in Red Hat OpenShift's Operator Hub. \nFor non-production usage, you can also try our Helm chart, included as part of OpenShift’s Helm chart repository.\nWhat's new in Red Hat build of Cryostat 2.3 appeared first on Red Hat Developer.",
          "link": "https://developers.redhat.com/articles/2023/06/21/whats-new-red-hat-build-cryostat-23",
          "publishedOn": "2023-06-21T07:00:00.000Z",
          "wordCount": 2274,
          "title": "What's new in Red Hat build of Cryostat 2.3",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/2020_Java_ContainerJFR_Featured_Article__A-01.png?itok=N_594VC9"
        },
        {
          "id": "0f8eb019-7e52-4ecf-9eac-a7e573abcde8",
          "author": "Marek Polacek",
          "description": "The latest major version of the GNU Compiler Collection (GCC), 13.1, was released in April 2023. Like every major GCC release, this version brings many additions, improvements, bug fixes, and new features. GCC 13 is already the system compiler in Fedora 38. Red Hat Enterprise Linux (RHEL) users will get GCC 13 in the Red Hat GCC Toolset (RHEL 8 and RHEL 9). It's also possible to try GCC 13 on godbolt.org and similar web pages.\nLike the article I wrote about GCC 10 and GCC 12, this article describes only new features implemented in the C++ front end; it does not discuss developments in the C++ language itself. Interesting changes in the standard C++ library that comes with GCC 13 are described in a separate blog post: New C features in GCC 13\nThe default dialect in GCC 13 is -std=gnu++17.  …",
          "link": "https://developers.redhat.com/articles/2023/06/21/new-c-features-gcc-13",
          "publishedOn": "2023-06-21T07:00:00.000Z",
          "wordCount": 4915,
          "title": "New C++ features in GCC 13",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2021/04/gcc_1x.png?itok=6l1b8Lo9"
        },
        {
          "id": "247ee026-f7f8-4c21-a5fb-5ed669d1a29f",
          "author": "Sandhya Dasu",
          "description": "Hybrid clouds are mixed computing environments that allow applications to use a combination of compute, networking, storage, and services in public clouds and private clouds, including clouds running on-premise or at a plethora of edge locations.\nTo accomplish this, hybrid cloud platforms must be designed to expose the best of the public clouds they support and present the advantages of private clouds while presenting a cohesive interface to the application developer—and preferably the cloud admin, too. A cloud admin can install a cloud instance called a cluster, consisting of a control plane (at least one instance) to manage the cluster and multiple compute instances that run applications on them.\nIn the rest of this article, \"developer\" specifically refers to a hybrid cloud platform deve…",
          "link": "https://developers.redhat.com/articles/2023/06/19/tips-designing-features-hybrid-cloud",
          "publishedOn": "2023-06-19T07:00:00.000Z",
          "wordCount": 2748,
          "title": "My advice for designing features for the hybrid cloud",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/GC_cloud1_2x.png?itok=7OTSzwEN"
        },
        {
          "id": "d52965e3-51a4-4e11-944a-2debbc572c40",
          "author": "Valentina Rodriguez Sosa",
          "description": "MongoDB offers different operator types to utilize MongoDB with Red Hat OpenShift. MongoDB provides two certified operator products, MongoDB Enterprise Operator and MongoDB Atlas Operator. This article will cover how to set up and configure MongoDB Atlas on OpenShift.\nPrerequisites\nRead the overview to help you get started with Atlas.\nCreate an Atlas account.\nAdd your IP address to your account to ensure the OpenShift cluster will have connectivity with Atlas. \nHow to install MongoDB Atlas on OpenShift\nTo install the operators in your OpenShift cluster, access your OperatorHub.\nFilter by MongoDB in the field selector.\nSelect Certified as Source.\nSelect the MongoDB Atlas Operator, as shown in Figure 1.\n\n\n  \n\nFigure 1: Select the MongoDB Atlas Operator tile.\n\n\nClick Install. By default, it w…",
          "link": "https://developers.redhat.com/articles/2023/06/19/how-set-mongodb-atlas-openshift",
          "publishedOn": "2023-06-19T07:00:00.000Z",
          "wordCount": 2995,
          "title": "How to set up MongoDB Atlas on OpenShift",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2021/04/SP-openshift_2x-2.png?itok=BKoDbPZp"
        },
        {
          "id": "f4a12a1f-cd63-4f30-bf77-f0781606e23b",
          "author": "Robin Bobbitt",
          "description": "As an Ansible Lightspeed engineer, my team works on the cloud service that interacts with Watson Code Assistant large language models for Ansible task generation. Curious to learn more about the mechanics of training such a model, I set out to create my own, very basic Ansible tasks model. I decided to do this using Red Hat OpenShift Data Science, which made it easy to configure and launch an environment pre-configured with everything I needed to train my model. I’ll walk through the steps I took here.\nTraining a basic Ansible tasks model for fun over a weekend on a single GPU would be an impossible task if not for the concept of “transfer learning.” Thanks to transfer learning, we can take an existing pre-trained model and fine-tune it on something new. In this case, we will use the Huggi…",
          "link": "https://developers.redhat.com/articles/2023/06/19/fine-tune-large-language-models-using-openshift-data-science",
          "publishedOn": "2023-06-19T07:00:00.000Z",
          "wordCount": 3036,
          "title": "Fine-tune large language models using OpenShift Data Science",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/Red_Hat_OpenShift_Data_Science_0.png?itok=C0m7jk_F"
        },
        {
          "id": "1b158985-49f8-4ef2-8f7a-afa95cad693f",
          "author": "Andrew Burgess",
          "description": "In this article, we will walk through the process of creating a custom stack unwinder for the GNU Project Debugger (GDB) using GDB's Python API. We'll first explore when writing such an unwinder might be necessary, then create a small example application that demonstrates a need for a custom unwinder before finally writing a custom unwinder for our application inside the debugger.\nBy the end of this tutorial, you'll be able to use our custom stack unwinder to allow GDB to create a full backtrace for our application.\nWhat is an unwinder?\nAn unwinder is how GDB figures out the call stack of an inferior, for example, GDB's backtrace command:\nBreakpoint 1, woof () at stack.c:4 4 return 0; \n\n(gdb) backtrace\n#0 woof () at stack.c:4\n#1 0x000000000040111f in bar () at stack.c:10\n#2 0x0000000000401…",
          "link": "https://developers.redhat.com/articles/2023/06/19/debugging-gdb-create-custom-stack-winders",
          "publishedOn": "2023-06-19T07:00:00.000Z",
          "wordCount": 6091,
          "title": "Debugging in GDB: Create custom stack winders",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2021/05/2021_GNU_GDB-Developer_tutorial_Featured_Article__A-1.png?itok=uV-N2sMd"
        },
        {
          "id": "c2388c55-04e2-4f1e-9aec-49ebd79b5021",
          "author": "Deepankar Jain",
          "description": "In our previous article, we demonstrated how to use the Red Hat Ansible Automation Platform to create a virtual machine (VM) in Microsoft Azure. Ansible Automation Platform streamlines the process of deploying VMs in Azure, making it more efficient and less error-prone.\nIn this article, we will demonstrate how to simplify the process of creating VMs in Azure by using workflow templates with Ansible Automation Platform. Workflow templates can help standardize the process of creating VMs and reduce the amount of manual intervention required. We will dive into the details for using workflow templates with Ansible Automation Platform to further optimize our infrastructure management in Azure.\nIf you're following along with this series, you may recall that we previously discussed the importance…",
          "link": "https://developers.redhat.com/articles/2023/06/15/how-use-ansible-create-vm-azure-workflow",
          "publishedOn": "2023-06-15T18:00:00.000Z",
          "wordCount": 2840,
          "title": "How to use Ansible to create a VM on Azure via workflow",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/SP-ansible1_2x.png?itok=StIQEumS"
        },
        {
          "id": "32865531-f2b4-4927-ab77-8d80f69d9656",
          "author": "Deepankar Jain",
          "description": "In our previous article, we explored how to use the Red Hat Ansible Automation Platform's CLI to create a virtual machine (VM) in Microsoft Azure. This time, we'll take things a step further and leverage the power of the Ansible Automation Platform to automate the process. The Ansible Automation Platform is a powerful tool that enables you to manage your infrastructure more efficiently, with less manual intervention.\nFollow the series:\nPart 1: How to automate VM creation on Azure with Ansible CLI\nPart 2: How to use Ansible to create a VM on Azure\nPart 3: How to use Ansible to create a VM on Azure via workflow\nBy using the Ansible Automation Platform, we can create a streamlined process for deploying VMs in Azure, reducing errors and saving time. In this article, we'll dive into the details…",
          "link": "https://developers.redhat.com/articles/2023/06/15/how-use-ansible-create-vm-azure",
          "publishedOn": "2023-06-15T18:00:00.000Z",
          "wordCount": 3037,
          "title": "How to use Ansible to create a VM on Azure",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/SP-ansible1_2x.png?itok=StIQEumS"
        },
        {
          "id": "54f40aea-f407-4a04-a9c5-da85ffe5427a",
          "author": "Deepankar Jain",
          "description": "In this article, we will demonstrate how to use the Red Hat Ansible Automation Platform command-line interface (CLI) to create a virtual machine on Microsoft Azure. We will walk you through the steps required to get started with Ansible Automation Platform and Azure, including setting up the necessary resources and creating a VM using the Azure module and Ansible Automation Platform.\nThis series covers the end-to-end process of creating a Virtual Machine(VM) on Azure using Ansible Automation Platform. This 3-part series includes:\nPart 1: How to automate VM creation on Azure with Ansible CLI\nPart 2: How to use Ansible to create a VM on Azure\nPart 3: How to use Ansible to create a VM on Azure via workflow\nBy the end of this article, you'll have a better understanding of how to use Ansible Au…",
          "link": "https://developers.redhat.com/articles/2023/06/15/how-automate-vm-creation-azure-ansible-cli",
          "publishedOn": "2023-06-15T07:00:00.000Z",
          "wordCount": 3061,
          "title": "How to automate VM creation on Azure with Ansible CLI",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/SP-ansible1_2x.png?itok=StIQEumS"
        },
        {
          "id": "390e0dec-5d39-4230-a055-30564a5bf23a",
          "author": "Robert Toyonaga",
          "description": "This article will explain how to profile and monitor Quarkus native executables using JDK Flight Recorder (JFR). It will provide a step-by-step guide through building, running, and inspecting a Quarkus-native executable with JFR. You will also learn about the current features available, depending on your GraalVM/Mandrel version and how you can start using them.\nPrerequisites\nThis article is meant for those already somewhat familiar with Quarkus native executables and who want to know the extent of JFR support in native mode and how to enable it.\nTo get the most out of this article, you should already be familiar with building Quarkus native applications. If you're just getting started, you can learn how to build Quarkus Java applications and Quarkus native applications. This article will w…",
          "link": "https://developers.redhat.com/articles/2023/06/13/how-monitor-quarkus-native-executables-jfr",
          "publishedOn": "2023-06-13T07:00:00.000Z",
          "wordCount": 3449,
          "title": "How to monitor Quarkus native executables with JFR",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/openJDK-featured-image.png?itok=8yOsjC-y"
        },
        {
          "id": "cadfd7a6-afc0-41dd-af7f-cd88a02ab360",
          "author": "Robert Toyonaga",
          "description": "This article describes the improvements to the Native Image JFR support in GraalVM JDK 20. This is a follow up to a previous article's section, Implementing JDK Flight Recorder support for GraalVM Native Image. JDK Flight Recorder (JFR) is a powerful tool that assists the profiling, debugging, and monitoring of Java applications. We will discuss the new developments available in GraalVM for JDK 17 and JDK 20.\n3 steps to build a native image with JFR\nThese steps illustrate the simplest way to use JFR with Native Image. You can also start a JFR recording over a JMX connection as described in the sections that follow, or by using the jdk.jfr.Recording API from within your application code.\nCompile your application to byte code as follows:\n\t\n$JAVA_HOME/bin/javac YourApplication.java\nUse the --…",
          "link": "https://developers.redhat.com/articles/2023/06/13/improvements-native-image-jfr-support-graalvm-jdk-20",
          "publishedOn": "2023-06-13T07:00:00.000Z",
          "wordCount": 3082,
          "title": "Improvements to Native Image JFR support in GraalVM for JDK 20",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/openJDK-featured-image.png?itok=8yOsjC-y"
        },
        {
          "id": "167e48b2-9b2d-4670-b698-b7d752c59e6d",
          "author": "Cedric Clyburn",
          "description": "Podman Desktop (now generally available) is an amazing tool for building, running, and managing containerized applications locally—but in a real-world environment, you need to deploy your applications on container orchestration platforms such as Kubernetes. If you’re looking for an enterprise-grade Kubernetes, look no further than Red Hat OpenShift. \nLet’s deploy and test a containerized application from your desktop to the free Developer Sandbox for Red Hat OpenShift using Podman Desktop’s Developer Sandbox for Red Hat OpenShift extension.\nGetting started\nIf you haven’t already installed Podman Desktop (Figure 1), head to podman-desktop.io to download the latest release to your machine, compatible with Windows, macOS, or Linux.\n\n  \n\n\n      \nFigure 1: The Podman Desktop dashboard.\nThis tut…",
          "link": "https://developers.redhat.com/articles/2023/06/09/deploy-and-test-kubernetes-containers-using-podman-desktop",
          "publishedOn": "2023-06-09T07:00:00.000Z",
          "wordCount": 3261,
          "title": "Deploy and test Kubernetes containers using Podman Desktop",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/intro_podman_2x.png?itok=j7UCP4h6"
        },
        {
          "id": "c88a158b-a832-4077-bd5c-6612dbf33401",
          "author": "Yashwanth Maheshwaram",
          "description": "Quarkus is a Kubernetes-native Java framework that offers a great developer experience, providing extensions for most modern development and management needs while enabling you to write imperative and reactive code. Red Hat OpenShift is a unified platform to run your applications at scale while offering a great developer experience for managing applications and their infrastructure. Quarkus and OpenShift are a great combination. Simply put, the combination of OpenShift and Quarkus helps application engineering teams to become highly productive and have a reliable runtime for their applications at scale.\nThis article shows how you can quickly deploy your applications to OpenShift without worrying about build configs, pipelines, YAML, and deployment configs. We'll use the Source2Image (S2I) …",
          "link": "https://developers.redhat.com/articles/2023/06/07/deploy-quarkus-applications-openshift-s2i",
          "publishedOn": "2023-06-07T07:00:00.000Z",
          "wordCount": 2446,
          "title": "Deploy Quarkus applications directly to OpenShift using S2I",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/java%2Bquarkus_2x.png?itok=saprke5a"
        },
        {
          "id": "2ed97795-689e-4631-b19c-299eb22a888f",
          "author": "Deepankar Jain",
          "description": "In our previous article, we demonstrated how to automate the process of creating an EC2 instance on AWS using the Red Hat Ansible Automation Platform. We demonstrated how Ansible Automation Platform can streamline the process of deploying virtual machines (VMs) in AWS, making it more efficient and less error-prone. In this final installment, we will take things a step further by exploring how to simplify the process of creating EC2 instances in AWS using workflow templates.\nWorkflow templates can help standardize the process of creating instances and reduce the amount of manual intervention. In this article, we will dive into the details of how to use a workflow template to further optimize our infrastructure management in AWS.\nIf you are following along with our series, you may recall tha…",
          "link": "https://developers.redhat.com/articles/2023/06/05/how-create-ec2-instance-aws-using-ansible-workflow",
          "publishedOn": "2023-06-05T07:00:00.000Z",
          "wordCount": 2962,
          "title": "How to create an EC2 instance in AWS using Ansible workflow",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/SP-ansible1_2x.png?itok=StIQEumS"
        },
        {
          "id": "fe4d0d0a-ead0-4bfc-b2f1-9cadb2af5b98",
          "author": "Deepankar Jain",
          "description": "In our previous article, we explored how to use the Red Hat Ansible Automation Platform CLI to create an Elastic Compute Cloud (EC2) in Amazon Web Services (AWS). This time, we will take things a step further and leverage the power of the Ansible Automation Platform to automate the process. Ansible Automation Platform is a powerful tool that enables you to manage your infrastructure more efficiently with less manual intervention.\nFollow the series:\nPart 1: How to create an EC2 instance on AWS using Ansible CLI\nPart 2: How to create an EC2 instance in AWS using Ansible Automation\nPart 3: How to create EC2 instance on AWS using Ansible workflow\nBy using Ansible Automation Platform, we can create a streamlined process for deploying EC2s in AWS, reducing errors and saving time. In this article…",
          "link": "https://developers.redhat.com/articles/2023/06/05/how-create-ec2-instance-aws-using-ansible-automation",
          "publishedOn": "2023-06-05T07:00:00.000Z",
          "wordCount": 2862,
          "title": "How to create an EC2 instance in AWS using Ansible automation",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/SP-ansible1_2x.png?itok=StIQEumS"
        },
        {
          "id": "5ddcb81a-a6ef-4bb8-8049-2af1a4f347d5",
          "author": "Deepankar Jain",
          "description": "This is the first article in a series that covers the end-to-end process of creating an Elastic Compute Cloud (EC2) instance on Amazon Web Services (AWS) using Red Hat Ansible Automation Platform. This tutorial demonstrates the steps required to set up the necessary resources to create an EC2 instance using the AWS module in Ansible Automation Platform.\nFollow our 3-part series:\nPart 1: How to create an EC2 instance in AWS using Ansible CLI\nPart 2: How to create an EC2 instance in AWS using Ansible Automation \nPart 3: How to create an EC2 instance in AWS using Ansible workflow\nBy the end of this article, you will have a better understanding of how to use the Ansible Automation Platform CLI to manage an EC2 instance and how it can help to streamline your infrastructure management workflows.…",
          "link": "https://developers.redhat.com/articles/2023/06/05/how-create-ec2-instance-aws-using-ansible-cli",
          "publishedOn": "2023-06-05T07:00:00.000Z",
          "wordCount": 2826,
          "title": "How to create an EC2 instance in AWS using Ansible CLI",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/SP-ansible1_2x.png?itok=StIQEumS"
        },
        {
          "id": "cbfaee4f-4228-4187-82cf-4c09c931095f",
          "author": "Serena Chechile Nichols",
          "description": "Red Hat OpenShift Container Platform 4.13 brings key features and enhancements to the developer experience in the Red Hat OpenShift console. Here’s a quick overview of the 4.13 features and improvements based on customer requests:\nEasily identify which pods are receiving traffic.\nCreate serverless functions from the Developer perspective when using Red Hat OpenShift Serverless.\nImport from Git flow now supports pipeline-as-code.\nImproved user experience around Helm charts:\n\t\nThe creation and deletion process is now performed asynchronously, so you don’t have to wait for those actions to complete before performing your next task in the console.\nThe Helm Release list now includes a Status column.\nNew terminology: users now Create and Delete Helm Releases.  \n\n\t\nNavigation improvements to the …",
          "link": "https://developers.redhat.com/articles/2023/06/01/openshift-413-serverless-functions-and-more",
          "publishedOn": "2023-06-01T07:00:00.000Z",
          "wordCount": 2497,
          "title": "OpenShift 4.13: Create serverless functions and more",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/openshift-serverless-fucntions_2x.png?itok=ZLkCIlew"
        },
        {
          "id": "0e1a45d5-12ee-44f5-9e84-7181a36393b2",
          "author": "Romain Pelisse",
          "description": "In this article, we’ll explain how to use Ansible to build and deploy a Quarkus application. Quarkus is an exciting, lightweight Java development framework designed for cloud and Kubernetes deployments, and Red Hat Ansible Automation Platform  is one of the most popular automation tools and a star product from Red Hat.\nSet up your Ansible environment\nBefore discussing how to automate a Quarkus application deployment using Ansible, we need to ensure the prerequisites are in place. First, you have to install Ansible on your development environment. On a Fedora or a Red Hat Enterprise Linux machine, this is achieved easily utilizing the dnf package manager:\n$ dnf install ansible-core\nThe only other requirement is to install the Ansible collection dedicated to Quarkus:\n$ ansible-galaxy collect…",
          "link": "https://developers.redhat.com/articles/2023/06/01/automate-your-quarkus-deployment-using-ansible",
          "publishedOn": "2023-06-01T07:00:00.000Z",
          "wordCount": 3486,
          "title": "Automate your Quarkus deployment using Ansible",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/java%2Bquarkus_2x.png?itok=saprke5a"
        },
        {
          "id": "9fcab65e-5911-46ef-862f-4e4d1c3b4504",
          "author": "David Malcolm",
          "description": "I work at Red Hat on GCC, the GNU Compiler Collection. For the last four releases of GCC, I've been working on -fanalyzer, a static analysis pass that tries to identify various problems at compile-time, rather than at runtime. It performs \"symbolic execution\" of C source code—effectively simulating the behavior of the code along the various possible paths of execution through it (with some caveats that we'll discuss).\nThis article summarizes what's new with -fanalyzer in GCC 13, which has just been released.\n[ Learn more: New C features in GCC 13 ] \nNew warnings\nI first added the analyzer to GCC in GCC 10, with 15 new warnings for the compiler, and we've added more in each subsequent release (Table 1).\n\n\t\nTable 1: GCC warnings controlled by -fanalyzer by release\nRelease\n\t\t\tNew warnings\n\t\t\t…",
          "link": "https://developers.redhat.com/articles/2023/05/31/improvements-static-analysis-gcc-13-compiler",
          "publishedOn": "2023-05-31T07:00:00.000Z",
          "wordCount": 3680,
          "title": "Improvements to static analysis in the GCC 13 compiler",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2021/04/gcc_1x.png?itok=6l1b8Lo9"
        },
        {
          "id": "8ef5986f-2a99-48a5-afe1-33e4654381e5",
          "author": "Nikhil Mungale",
          "description": "Red Hat Enterprise Linux (RHEL) for SAP Solutions is a secure and scalable platform tailored to the needs of SAP workloads, such as SAP NetWeaver, SAP S/4HANA, and the SAP HANA platform. As SAP Business Suite will be out of standard support by 2027, it is essential for developers and administrators to plan for a smooth migration to the SAP S/4 HANA platform. \nIn this article, we'll explore what RHEL for SAP Solutions is and the features and functionalities it provides to developers and administrators.\nWhat is Red Hat Enterprise Linux for SAP Solutions?\nRed Hat Enterprise Linux for SAP Solutions is tailored for SAP workloads such as the SAP HANA platform and S/4HANA. The SAP environment can be standardized on Red Hat Enterprise Linux. By standardizing the SAP environment on RHEL, businesses…",
          "link": "https://developers.redhat.com/articles/2023/05/30/why-use-rhel-sap-solutions",
          "publishedOn": "2023-05-30T13:30:00.000Z",
          "wordCount": 2874,
          "title": "Why use RHEL for SAP Solutions?",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/SP_RHEL2-2x%20%281%29.png?itok=Cc5q7Npe"
        },
        {
          "id": "8727de2f-875d-4381-ae3d-638c2c1a1da1",
          "author": "Benjamin Schmaus, Josh Swanson",
          "description": "Red Hat OpenShift includes an abundance of technologies out of the box that are necessary for effectively managing a fleet of devices at the edge. One of those components, the scheduler, enables these services to be efficiently co-located onto a single platform.\nIn addition, OpenShift manages many of these services via an Operator, meaning a non-technical team doesn’t need to understand all the specific details about the service. OpenShift, in a sense, helps make managing devices at the edge simpler and cost-effective.\nThis article details how to go about building this configuration on a single-node OpenShift cluster. Keep in mind that you can apply these same concepts to a 3-node compact and full OpenShift cluster as well.\nWhy use OpenShift on a single node?\nBefore we begin, let us step b…",
          "link": "https://developers.redhat.com/articles/2023/05/30/build-edge-manager-single-node-openshift",
          "publishedOn": "2023-05-30T07:00:00.000Z",
          "wordCount": 5672,
          "title": "Build an all-in-one edge manager with single-node OpenShift",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/GC-edgecomputing_2x.png?itok=cSNl9gix"
        },
        {
          "id": "4a01d27b-963d-45a3-829f-8260b8fb2496",
          "author": "Taiseer Hussein",
          "description": "This article discusses how to use Red Hat OpenShift GitOps to automate application deployment. With a specific pattern, you will be able to deploy multiple applications to different environments once the app is committed to a Git repo. Follow this semi-guided demo to set up an automated method to deploy your application to Red Hat OpenShift clusters using the GitOps approach.\nIn this article, we will demonstrate the following processes:\nAutomating continuous delivery with Red Hat OpenShift Pipelines and continuous deployment with OpenShift GitOps.\nDeploying an application to different environments.\nPromoting from lower to upper environments.\nPrerequisites\nThe following prerequisites are required to replicate this demo:\nRed Hat OpenShift 4.9 or later\nOpenShift GitOps Operator\nOpenShift Pipe…",
          "link": "https://developers.redhat.com/articles/2023/05/29/how-use-openshift-gitops-deploy-applications",
          "publishedOn": "2023-05-29T07:00:00.000Z",
          "wordCount": 4032,
          "title": "How to use OpenShift GitOps to deploy applications",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/openshift-pipelines_2x_0.png?itok=iJC9fF3B"
        }
      ]
    },
    {
      "title": "edykim.com 블로그 RSS 피드",
      "feedUrl": "https://edykim.com/ko/feed.xml",
      "siteUrl": "https://edykim.com",
      "articles": []
    },
    {
      "title": "Eli Bendersky's website",
      "feedUrl": "https://eli.thegreenplace.net/feeds/all.atom.xml",
      "siteUrl": "https://eli.thegreenplace.net/",
      "articles": [
        {
          "id": "https://eli.thegreenplace.net/2023/plugins-case-study-envoy-wasm-extensions/",
          "author": null,
          "description": "<p><a class=\"reference external\" href=\"https://www.envoyproxy.io/\">Envoy</a> is a configurable proxy that serves\na prominent role in modern cloud-native projects; for example, it's\nused in many k8s deployments to provide inter-service communication (through\nIstio). In this post, I'd like to describe Envoy's extension mechanism as a case\nstudy of using WebAssembly for plugins.</p>\n<div class=\"section\" id=\"some-background\">\n<h2>Some background</h2>\n<p>Imagine …</p></div>",
          "link": "https://eli.thegreenplace.net/2023/plugins-case-study-envoy-wasm-extensions/",
          "publishedOn": "2023-06-03T22:14:00.000Z",
          "wordCount": null,
          "title": "Plugins case study: Envoy WASM extensions",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Embedded Artistry",
      "feedUrl": "https://embeddedartistry.com/feed/",
      "siteUrl": "https://embeddedartistry.com/",
      "articles": [
        {
          "id": "https://embeddedartistry.com/?p=30462",
          "author": "Phillip Johnston",
          "description": "12 June 2023 by Phillip JohnstonHere’s a question I answered via email from the From Concept to Launch: What It Takes to Build and Ship a New Device panel discussion. We’re sharing the answer on our blog to make it available to a wider audience. For context, during the discussion, I pointed out that a … \nContinue reading \"Q&A: How Do You Stay on the Path and Make it to “Done”?\"\nThe post Q&A: How Do You Stay on the Path and Make it to “Done”? appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2023/06/12/qa-how-do-you-stay-on-the-path-and-make-it-to-done/",
          "publishedOn": "2023-06-12T17:39:44.000Z",
          "wordCount": null,
          "title": "Q&A: How Do You Stay on the Path and Make it to “Done”?",
          "imageUrl": null
        },
        {
          "id": "https://embeddedartistry.com/?p=30292",
          "author": "Phillip Johnston",
          "description": "8 June 2023 by Phillip JohnstonHere’s a question we answered in the Interrupt Slack channel after the From Concept to Launch: What It Takes to Build and Ship a New Device panel discussion. We’re sharing the answer on our blog to make it available to a wider audience. ““ Quote  Starting from “I have a … \nContinue reading \"Q&A: How Many Iterations Do You Recommend for Scaling From a Prototype to Mass Production?\"\nThe post Q&A: How Many Iterations Do You Recommend for Scaling From a Prototype to Mass Production? appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2023/06/08/qa-how-many-iterations-do-you-recommend-for-scaling-from-a-prototype-to-mass-production/",
          "publishedOn": "2023-06-08T22:42:17.000Z",
          "wordCount": null,
          "title": "Q&A: How Many Iterations Do You Recommend for Scaling From a Prototype to Mass Production?",
          "imageUrl": null
        },
        {
          "id": "https://embeddedartistry.com/?p=30201",
          "author": "Phillip Johnston",
          "description": "7 June 2023 by Phillip JohnstonHere’s a question we answered in the Interrupt Slack channel after the From Concept to Launch: What It Takes to Build and Ship a New Device panel discussion. We’re sharing the answer on our blog to make it available to a wider audience. First, I want to provide context for … \nContinue reading \"Q&A: To What Degree Should We Understand Other Disciplines?\"\nThe post Q&A: To What Degree Should We Understand Other Disciplines? appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2023/06/07/qa-to-what-degree-should-we-understand-other-disciplines/",
          "publishedOn": "2023-06-07T23:08:52.000Z",
          "wordCount": null,
          "title": "Q&A: To What Degree Should We Understand Other Disciplines?",
          "imageUrl": null
        },
        {
          "id": "https://embeddedartistry.com/?p=30086",
          "author": "Phillip Johnston",
          "description": "5 June 2023 by Phillip JohnstonAs mentioned in the article, Develop in a Monorepo and Distribute to Standalone Repositories Develop in a Monorepo and Distribute to Standalone Repositories, we’ve merged many of our repos into a monorepo setup, but we’re going to continue to distribute changes to the existing standalone repositories. To support this model, … \nContinue reading \"Meson Pattern: Monorepo that Supports Individual Subproject Builds\"\nThe post Meson Pattern: Monorepo that Supports Individual Subproject Builds appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2023/06/05/meson-pattern-monorepo-that-supports-individual-subproject-builds/",
          "publishedOn": "2023-06-05T17:47:37.000Z",
          "wordCount": null,
          "title": "Meson Pattern: Monorepo that Supports Individual Subproject Builds",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Embedded.com",
      "feedUrl": "https://www.embedded.com/feed/",
      "siteUrl": "https://www.embedded.com/",
      "articles": [
        {
          "id": "https://www.embedded.com/?p=4479699",
          "author": "Nitin Dahad",
          "description": "Startup Embedl offers a deep learning optimization engine to deploy models with reduced execution time and hence to improve performance and reduce power consumption when deploying AI on embedded devices.\nThe post Deep learning model optimization reduces embedded AI inference time appeared first on Embedded.com.",
          "link": "https://www.embedded.com/deep-learning-model-optimization-reduces-embedded-ai-inference-time/",
          "publishedOn": "2023-06-21T16:42:05.000Z",
          "wordCount": 3595,
          "title": "Deep learning model optimization reduces embedded AI inference time",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/embedl-image.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479696",
          "author": "Ricardo Camacho",
          "description": "What’s new in MISRA C 2023 — the third edition and second revision of the MISRA C standard? MISRA C 2023 has been released! As...\nThe post MISRA C 2023 consolidates guidelines for embedded developers appeared first on Embedded.com.",
          "link": "https://www.embedded.com/misra-c-2023-consolidates-guidelines-for-embedded-developers/",
          "publishedOn": "2023-06-20T12:16:36.000Z",
          "wordCount": 4128,
          "title": "MISRA C 2023 consolidates guidelines for embedded developers",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/2306misra_f1_thumb.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479689",
          "author": "Miro Samek",
          "description": "This lesson focuses on resource sharing among concurrent threads and the mutual exclusion mechanisms available in the RTOS for protecting such shared resources. The subject...\nThe post Programming embedded systems: RTOS – mutual exclusion appeared first on Embedded.com.",
          "link": "https://www.embedded.com/programming-embedded-systems-rtos-mutual-exclusion/",
          "publishedOn": "2023-06-19T21:32:04.000Z",
          "wordCount": 3881,
          "title": "Programming embedded systems: RTOS – mutual exclusion",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/embedded_thumbnail-22.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479672",
          "author": "Nitin Dahad",
          "description": "The latest embedded survey is out for 2023, and it shows not just burgeoning workloads and how engineers deal with it, but also most used design tools, OS’es and processors.\nThe post embedded survey 2023: more IP reuse as workloads surge appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-survey-2023-more-ip-reuse-as-workloads-surge/",
          "publishedOn": "2023-06-19T18:57:11.000Z",
          "wordCount": 4372,
          "title": "embedded survey 2023: more IP reuse as workloads surge",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/Embedded-Market-Study-Report-2023-reuse-data.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479656",
          "author": "Bill Lamie, Rafael Taubinger",
          "description": "PX5 RTOS with a native implementation of the industry standard POSIX pthreads aims at developers working on demanding embedded applications. What makes this new RTOS so attractive – and why is test driven development still the best approach to create high-quality code?\nThe post RTOS with standard POSIX pthreads API: a complement to embedded Linux appeared first on Embedded.com.",
          "link": "https://www.embedded.com/rtos-with-standard-posix-pthreads-api-a-complement-to-embedded-linux/",
          "publishedOn": "2023-06-15T18:51:15.000Z",
          "wordCount": 5081,
          "title": "RTOS with standard POSIX pthreads API: a complement to embedded Linux",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/PX5-image04_code_coverage.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479645",
          "author": "Angelo Corsaro",
          "description": "Autonomous car crashes can often be the result of erroneous perception of the environment, so examining car data can give some idea of the cause. But we need digital witnesses to help build a true reconstruction of the environment. The Zenoh protocol can help.\nThe post Getting data from digital witnesses appeared first on Embedded.com.",
          "link": "https://www.embedded.com/getting-data-from-digital-witnesses/",
          "publishedOn": "2023-06-15T16:56:56.000Z",
          "wordCount": 4594,
          "title": "Getting data from digital witnesses",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/Picture1.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479594",
          "author": "Elad Baram",
          "description": "Ubiquitous ML-based vision processing at the edge is advancing as hardware costs decrease, computation capability increases significantly, and new methodologies make it easier to train and deploy models. This leads to fewer barriers to adoption and increased use of computer vision AI at the edge.\nThe post TinyML computer vision is turning into reality with microNPUs (µNPUs) appeared first on Embedded.com.",
          "link": "https://www.embedded.com/tinyml-computer-vision-is-turning-into-reality-with-micronpus-%c2%b5npus/",
          "publishedOn": "2023-06-14T04:42:44.000Z",
          "wordCount": 5504,
          "title": "TinyML computer vision is turning into reality with microNPUs (µNPUs)",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/Synaptics-key-points-model-on-micro-NPU.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479605",
          "author": "Marcel Beemster",
          "description": "Automated use-case analysis could revolutionise functional-safety software development and remove many of the risks of errors and the potentially high costs and delays incurred to fix them.\nThe post De-risking functional-safety compiler and library qualification appeared first on Embedded.com.",
          "link": "https://www.embedded.com/de-risking-functional-safety-compiler-and-library-qualification/",
          "publishedOn": "2023-06-13T23:13:00.000Z",
          "wordCount": null,
          "title": "De-risking functional-safety compiler and library qualification",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4479558",
          "author": "Jacob Beningo",
          "description": "Rust’s memory safety capabilities make it an exciting language, but there are some significant roadblocks that will slow adoption in embedded systems. Rust has been...\nThe post 5 roadblocks to Rust adoption in embedded systems appeared first on Embedded.com.",
          "link": "https://www.embedded.com/5-roadblocks-to-rust-adoption-in-embedded-systems/",
          "publishedOn": "2023-06-13T10:23:23.000Z",
          "wordCount": 5192,
          "title": "5 roadblocks to Rust adoption in embedded systems",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4479552",
          "author": "Sam Bocetta",
          "description": "If your company is among those adopting or already using open-source software, you’ll need to make sure you’ve got the necessary tools to ensure security...\nThe post Tools for managing SBOM security appeared first on Embedded.com.",
          "link": "https://www.embedded.com/tools-for-managing-sbom-security/",
          "publishedOn": "2023-06-13T10:16:06.000Z",
          "wordCount": 4089,
          "title": "Tools for managing SBOM security",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/software-security-tools.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479550",
          "author": "Brian Condell and Michael Jackson",
          "description": "The old saying “if it ain’t broke, don’t fix it” cautions against tampering with something that performs reliably, but as factories become smarter, many current...\nThe post Redesigning RTD-Based Temperature Sensors for Smart Factories appeared first on Embedded.com.",
          "link": "https://www.embedded.com/redesigning-rtd-based-temperature-sensors-for-smart-factories/",
          "publishedOn": "2023-06-12T19:56:57.000Z",
          "wordCount": 5083,
          "title": "Redesigning RTD-Based Temperature Sensors for Smart Factories",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/23026adi-rtd_f04_thumb.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479463",
          "author": "Ole Dreessen",
          "description": "In this first in a series on convolutional neural networks (CNNs), we discuss the advantages of CNNs vs. classic linear programming describe the CNN modeling...\nThe post Understanding convolutional neural networks appeared first on Embedded.com.",
          "link": "https://www.embedded.com/understanding-convolutional-neural-networks/",
          "publishedOn": "2023-06-06T15:57:30.000Z",
          "wordCount": 5252,
          "title": "Understanding convolutional neural networks",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/23026adi-cnn1_f03_thumb.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479451",
          "author": "Dave Betts",
          "description": "Software engineers understand the importance of testing their code during development, but the unique nature of audio means it presents special testing challenges for engineers....\nThe post How to assess audio software to enhance sound quality appeared first on Embedded.com.",
          "link": "https://www.embedded.com/how-to-assess-audio-software-to-enhance-sound-quality/",
          "publishedOn": "2023-06-05T21:49:50.000Z",
          "wordCount": 5466,
          "title": "How to assess audio software to enhance sound quality",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/AudioTelligence-Audio-Assessment.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479467",
          "author": "Bryan Christiansen",
          "description": "Using a computerized maintenance management system (CMMS) provides near real-time results, supporting insight, and data-driven decisions to enhance business efficiency and effectiveness. Computerized maintenance management...\nThe post How CMMS is transforming maintenance data management appeared first on Embedded.com.",
          "link": "https://www.embedded.com/how-cmms-is-transforming-maintenance-data-management/",
          "publishedOn": "2023-06-05T21:48:50.000Z",
          "wordCount": 3960,
          "title": "How CMMS is transforming maintenance data management",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/industrial-data-management-.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479448",
          "author": "Miro Samek",
          "description": "In this lesson, you learn about semaphores as the historically first inter-thread synchronization mechanism. So far, in this segment of lessons about the real time...\nThe post Programming embedded systems: RTOS – inter-thread synchronization appeared first on Embedded.com.",
          "link": "https://www.embedded.com/programming-embedded-systems-rtos-inter-thread-synchronization/",
          "publishedOn": "2023-06-05T21:45:59.000Z",
          "wordCount": 3664,
          "title": "Programming embedded systems: RTOS – inter-thread synchronization",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/embedded_thumbnail-21.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479438",
          "author": "Peter Pöchmüller",
          "description": "A reflection on the history of DRAM as it reaches its 55th anniversary, plus what’s next for DRAM.\nThe post Happy birthday DRAM! appeared first on Embedded.com.",
          "link": "https://www.embedded.com/happy-birthday-dram/",
          "publishedOn": "2023-06-05T13:55:01.000Z",
          "wordCount": 4572,
          "title": "Happy birthday DRAM!",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/DRAM-Timeline.png"
        },
        {
          "id": "https://www.embedded.com/?p=4479421",
          "author": "Nitin Dahad",
          "description": "Arm’s Total Compute Solutions are intended to deliver a complete package of IP designed and optimized for specific workloads to work seamlessly together as a complete system. TCS23 is the latest, targeting premium smartphones.\nThe post Arm launches Total Compute Solution 2023 for premium smartphones appeared first on Embedded.com.",
          "link": "https://www.embedded.com/arm-launches-total-compute-solution-2023-for-premium-smartphones/",
          "publishedOn": "2023-06-02T15:29:13.000Z",
          "wordCount": 4599,
          "title": "Arm launches Total Compute Solution 2023 for premium smartphones",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/Arm-TCS23-image.png"
        },
        {
          "id": "https://www.embedded.com/?p=4479416",
          "author": "Nitin Dahad",
          "description": "RISC-V Software Ecosystem (RISE) project brings together key players in the ecosystem with a governing board that includes Andes, Google, Intel, Imagination Technologies, MediaTek, Nvidia, Qualcomm Technologies, Red Hat, Rivos, Samsung, SiFive, T-Head, and Ventana.\nThe post RISE project gives RISC-V an open source software lift appeared first on Embedded.com.",
          "link": "https://www.embedded.com/rise-project-gives-risc-v-an-open-source-software-lift/",
          "publishedOn": "2023-06-02T01:26:01.000Z",
          "wordCount": 4014,
          "title": "RISE project gives RISC-V an open source software lift",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/06/Software_shutterstock_1676060566.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479389",
          "author": "Kaue Morcelles",
          "description": "This articles discusses how differences between real-world and ideal signals in software-defined radios (SDRs) for simulations can significantly impact GPS/GNSS testing. It is not a...\nThe post Real world vs ideal signals in SDR-based simulations appeared first on Embedded.com.",
          "link": "https://www.embedded.com/real-world-vs-ideal-signals-in-sdr-based-simulations/",
          "publishedOn": "2023-05-30T17:42:42.000Z",
          "wordCount": 5263,
          "title": "Real world vs ideal signals in SDR-based simulations",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/05/2305PerVices-sig_f04.png"
        },
        {
          "id": "https://www.embedded.com/?p=4479364",
          "author": "Jacob Beningo",
          "description": "The sheer number of devices connected to the grid may be responsible for wasting between 10-15% of the power generated in the United States each...\nThe post 5 practical tips for low-power design appeared first on Embedded.com.",
          "link": "https://www.embedded.com/5-practical-tips-for-low-power-design/",
          "publishedOn": "2023-05-26T19:04:41.000Z",
          "wordCount": 4720,
          "title": "5 practical tips for low-power design",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/05/low-power-.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4479353",
          "author": "Nitin Dahad",
          "description": "Meeting cloud compute and AI needs a new approach to processor architectures. Ampere has a new 192 custom core processor to address this. \nThe post Cloud compute and AI demand requires new approach to processors appeared first on Embedded.com.",
          "link": "https://www.embedded.com/cloud-compute-and-ai-demand-requires-new-approach-to-processors/",
          "publishedOn": "2023-05-26T19:00:41.000Z",
          "wordCount": 3907,
          "title": "Cloud compute and AI demand requires new approach to processors",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2023/05/Ampereone.jpg"
        }
      ]
    },
    {
      "title": "EmbeddedRelated.com Blogs",
      "feedUrl": "https://www.embeddedrelated.com/blogs_rss.php",
      "siteUrl": "https://www.embeddedrelated.com/blogs.php",
      "articles": [
        {
          "id": "https://www.embeddedrelated.com/showarticle/1534.php",
          "author": null,
          "description": "Artificial Intelligence (AI) and Machine Learning (ML) are taking the world by storm. I know that many embedded systems teams are often slow to adopt new technologies, and so far, the use of AI/ML is no different. However, to keep up in today’s competitive landscape, you must experiment, learn, and understand where and when to apply AI models to your work. If used correctly, they can remove...",
          "link": "https://www.embeddedrelated.com/showarticle/1534.php",
          "publishedOn": "2023-06-19T15:53:56.000Z",
          "wordCount": 5018,
          "title": "An Iterative Approach to USART HAL Design using ChatGPT",
          "imageUrl": "https://www.embeddedrelated.com/new2/images/blog_generic_image.png"
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1532.php",
          "author": null,
          "description": "While C is still the language of choice for embedded development, accounting for up to 65% of embedded projects, the adoption of C++ has grown steadily. With an estimated usage of 20% - 30% in the embedded development field, C++ offers classes, improved type safety, and quality of life features such as range-based for loops, the auto keyword, and lambdas. \n<p style=\"text-align:...",
          "link": "https://www.embeddedrelated.com/showarticle/1532.php",
          "publishedOn": "2023-06-13T22:53:01.000Z",
          "wordCount": 3837,
          "title": "Modern C++ in Embedded Development: (Don't Fear) The ++",
          "imageUrl": "https://www.embeddedrelated.com/new2/images/blog_generic_image.png"
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1524.php",
          "author": null,
          "description": "Probably you have already heard about Apache NuttX RTOS, a small RTOS but very powerful in resources and features, but never stopped to look deeper into it. So let us start by raising a question: What separates NuttX from other RTOSes like FreeRTOS, Mbed, VxWorks, uC/OS-II, Contiki, Zephyr, RT-Thread, ThreadX, RIOT-OS, ChibiOS/RT and many others?\r\n\r\n\r\n\r\nWell, first of all, NuttX is really...",
          "link": "https://www.embeddedrelated.com/showarticle/1524.php",
          "publishedOn": "2023-06-02T21:05:02.000Z",
          "wordCount": null,
          "title": "Getting Started with (Apache) NuttX RTOS - Part 1",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1519.php",
          "author": null,
          "description": "In this post, by Embedded I’m generally referring to deeply embedded/bare-metal systems as opposed to Linux-based embedded systems.\n\r\nEmbedded systems and strings\r\nHistorically, the need for and thus the use of strings in embedded systems was fairly limited. However, this has changed with the advent of cheaper, full graphic displays and the growth of the ‘Internet of Things’...",
          "link": "https://www.embeddedrelated.com/showarticle/1519.php",
          "publishedOn": "2023-06-01T14:07:23.000Z",
          "wordCount": null,
          "title": "Working with Strings in Embedded C++",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1518.php",
          "author": null,
          "description": "Quiz questions are not only fun and interactive but also a cool way to learn and test your knowledge.  We are inviting you to join us in building a comprehensive quiz bank by contributing your own embedded systems quiz questions. \r\n\r\nIf your quiz question ends up being one of the first 5 selected for publication, you'll win a <a...",
          "link": "https://www.embeddedrelated.com/showarticle/1518.php",
          "publishedOn": "2023-05-31T16:32:32.000Z",
          "wordCount": 3376,
          "title": "Get Involved: Contribute Quiz Questions for the Embedded Systems Community for a Chance to Win a LAP-C Pro!",
          "imageUrl": "https://www.embeddedrelated.com/new2/images/blogs/Quiz_Questions_Raffle.jpg"
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1517.php",
          "author": null,
          "description": "About a decade ago, I wrote two articles:\n\r\n\r\nModulation Alternatives for the Software Engineer (November 2011)\n\r\nIsolated Sigma-Delta Modulators, Rah Rah Rah! (April 2013)\n\r\n\r\nEach of these are about delta-sigma modulation, but they’re short and sweet, and not very in-depth. And the 2013 article was really more about analog-to-digital converters. So we’re going to revisit the...",
          "link": "https://www.embeddedrelated.com/showarticle/1517.php",
          "publishedOn": "2023-05-28T16:04:50.000Z",
          "wordCount": null,
          "title": "Return of the Delta-Sigma Modulators, Part 1: Modulation",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1515.php",
          "author": null,
          "description": "In our last post, C to C++: Proven Techniques for Embedded Systems Transformation, we started to discuss the different ways that C++ can be used to write embedded software. You saw that there is no reason to be overwhelmed by trying to adopt complex topics like metaprogramming out of the gate. An important concept to understand is that you can make the transition gradually into C++ while still...",
          "link": "https://www.embeddedrelated.com/showarticle/1515.php",
          "publishedOn": "2023-05-23T15:41:33.000Z",
          "wordCount": null,
          "title": "C to C++: Bridging the Gap from C Structures to Classes",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Evans Library",
      "feedUrl": "https://evan-moon.github.io/feed.xml",
      "siteUrl": "https://evan-moon.github.io",
      "articles": []
    },
    {
      "title": "Better Embedded System SW",
      "feedUrl": "https://feeds.feedburner.com/BetterEmbeddedSystemSw",
      "siteUrl": "http://betterembsw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Google for Developers Blog - News about Web, Mobile, AI and Cloud",
      "feedUrl": "https://feeds.feedburner.com/GDBcode",
      "siteUrl": "http://developers.googleblog.com/",
      "articles": [
        {
          "id": "http://developers.googleblog.com/2023/06/la-techweek-one-google-panel-building-a-startup-using-generative-ai.html",
          "author": null,
          "description": "Posted by Alexandra Dumas, Head of VC & Startup Partnerships, West Coast, Google\n\n\n\n\n\n\nEarlier this month, LA TechWeek hosted an array of thought leaders and innovative minds in the tech industry. As the Head of VC & Startup Partnerships West Coast at Google, I had the privilege of curating and facilitating an insightful panel event, supported by Google Cloud for Startups, on the topic of  \"Building with Generative AI\" with representatives from:\n\nGoogle Cloud: Josh Gwyther, Global AI Lead\nAndreessen Horowitz: Andrew Chen, General Partner\nGradient Ventures: Darian Shirazi, General Partner\nAlphabet’s X: Clarence Wooten, Director & Entrepreneur in Residence\n\n\n\n\n\n\n\n\n\nOur conversation was as rich in depth as it was in diversity; heightening the LA community's collective excitement for the futur…",
          "link": "http://developers.googleblog.com/2023/06/la-techweek-one-google-panel-building-a-startup-using-generative-ai.html",
          "publishedOn": "2023-06-20T21:00:00.002Z",
          "wordCount": null,
          "title": "A Look Back at LA #TechWeek OneGoogle Panel: Building a Startup Using Generative AI",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2023/06/weareplay-meet-people-creating-apps-and-games-in-europe.html",
          "author": null,
          "description": "Posted by Leticia Lago, Developer Marketing\n\n\n\n\n\n\nLast summer #WeArePlay went on a virtual tour of the U.S. to spotlight the stories of app and game founders from every state, and earlier this year we visited India sharing stories from across the country. Today, we’re continuing our tour across the world with our next stop: Europe. From an app increasing independence for the elderly to a game for children with neurodevelopmental disorders, meet the founders of 126 apps and games companies building growing businesses on Google Play.\nLet’s take a quick road trip across the region, with stories of founders that were inspired to create their company to help others around them.\n\n\nGeert, cofounder of Cubigo\n\n\n\n\n\nIncreasing independence for elderly people\nFirst up is Geert from Belgium, who is th…",
          "link": "http://developers.googleblog.com/2023/06/weareplay-meet-people-creating-apps-and-games-in-europe.html",
          "publishedOn": "2023-06-14T09:00:00.001Z",
          "wordCount": null,
          "title": "#WeArePlay | Meet the people creating apps and games in Europe",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2023/06/google-for-startups-accelerator-4th-annual-women-and-black-founders-cohorts-apply-now.html",
          "author": null,
          "description": "Posted by Iran Karimian, Startup Ecosystem Lead, Canada & Matt Ridenour, Head of Startup Ecosystem, U.S.\n\n\n\n\nApplications for the 2023 Google for Startups Accelerator: Women Founders and Google for Startups Accelerator: Black Founders are now open. Check out what our alumni founders had to say about past programs: \n\n\nAs tech entrepreneurs continue to drive innovation with fresh ideas and new applications of AI and machine-learning technologies, it’s an exciting time for the tech startup ecosystem. But the headwinds of the 2022 investment climate have created a steep uphill climb for founders looking for funding, and underrepresented founders continue to face even greater structural barriers to getting their businesses off the ground.\nWhile the recent economic downturn has impacted startups…",
          "link": "http://developers.googleblog.com/2023/06/google-for-startups-accelerator-4th-annual-women-and-black-founders-cohorts-apply-now.html",
          "publishedOn": "2023-06-13T12:00:00.002Z",
          "wordCount": null,
          "title": "Apply now: Google for Startups Accelerator launches applications for 4th Annual Women Founders and Black Founders cohorts",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2023/06/project-gameface.html",
          "author": null,
          "description": "Posted by Avneet Singh, Product Manager and Sisi Jin, UX Designer, Google PI, and Lance Carr, Collaborator\n\n\n\n\n\n\nAt I/O 2023, Google launched Project Gameface, an open-source, hands-free gaming ‘mouse’ enabling people to control a computer's cursor using their head movement and facial gestures. People can raise their eyebrows to click and drag, or open their mouth to move the cursor, making gaming more accessible.\nThe project was inspired by the story of quadriplegic video game streamer Lance Carr, who lives with muscular dystrophy, a progressive disease that weakens muscles. And we collaborated with Lance to bring Project Gameface to life. The full story behind the product is available on the Google Keyword blog here. \nIt’s been an extremely interesting experience to think about how a mou…",
          "link": "http://developers.googleblog.com/2023/06/project-gameface.html",
          "publishedOn": "2023-06-12T17:00:00.003Z",
          "wordCount": null,
          "title": "Project GameFace makes gaming accessible to everyone",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2023/06/google-io-extended-watch-parties-and-upcoming-meetups.html",
          "author": null,
          "description": "Posted by Komal Sandhu - Global Program Manager, Google Developer Groups \n\n\n\n\n\n\nOn May 10, 2023, Google developer communities around the world gathered virtually and in person at watch parties to watch the live streamed Google I/O flagship event, where Google shares its latest developer solutions, products, and technology. The excitement continues during Google I/O Extended season, happening now.\n\n\nGDG Zurich\n\n\n\nGoogle I/O Extended is the community-led counterpart to Google I/O–a series of community-led watch parties and tech meetups, in which developers around the globe connect in their local communities to learn about new releases, share thoughts, and celebrate. At Google I/O Extended events, city-based groups of developers celebrate together, discuss their expectations and the opportuni…",
          "link": "http://developers.googleblog.com/2023/06/google-io-extended-watch-parties-and-upcoming-meetups.html",
          "publishedOn": "2023-06-06T16:00:00.001Z",
          "wordCount": null,
          "title": "Google I/O Extended watch parties & upcoming meetups",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2023/06/how-google-enables-experts-to-innovate.html",
          "author": null,
          "description": "Posted by Lyanne Alfaro, DevRel Program Manager, Google Developer Studio\n\n\n\n\n\n\nDeveloper Journey is a monthly series highlighting diverse and global developers sharing relatable challenges, opportunities, and wins in their journey. Every month, we will spotlight developers around the world, the Google tools they leverage, and the kind of products they are building.\n\n\n\nThis month we hear from developers who are Google Developer Experts and former Google Developer Student Clubs members building tools to enhance food delivery, developer playgrounds, and even real-time BPM counters for DJs. We also ask our community members about the role of allyship during Pride Month.\nYves Kalume\n\n\n\n\n\n\nLubumbashi, Democratic Republic of Congo\nGoogle Developer Expert, Android\nGDSC Alumni\nAndroid Developer\nTwi…",
          "link": "http://developers.googleblog.com/2023/06/how-google-enables-experts-to-innovate.html",
          "publishedOn": "2023-06-05T17:30:00.002Z",
          "wordCount": null,
          "title": "How Google Enables Experts To Innovate Developer Tools From Food To Music",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2023/06/weareplay-meet-tessa-and-saasha-from-uk.html",
          "author": null,
          "description": "Posted by Leticia Lago, Developer Marketing\n\n\n\nIn our latest #WeArePlay film, we’re spotlighting Tessa and Saasha - best friends turned co-founders of Olio. They’ve been on a mission to help people reduce waste by encouraging communities to share, sell or give-away what they no longer need - from leftover food to household items. The app now helps millions take one big step closer to living in a zero waste world.\n\n\n\n\n\nGrowing up on a farm, Tessa quickly learned how much hard work goes into producing food. Meanwhile, Saasha spent her childhood helping her family make ends meet through scavenging items that others threw away. When they eventually met in college, they bonded over their passion to help to save the environment through recycling and reducing waste.\n\n\nBut it wasn’t until Tessa was one day moving countries when the idea for Olio came - she couldn’t pack leftover food in air-freight, and couldn’t easily find anyone to take it. Feeling like this was a missed opportunity, she told Saasha about the idea for a food-sharing app. Saasha instantly knew she wanted to help make this app a reality, and so Olio was born. Tessa believes that “if no one else is taking action then we have to take action”.\n\n\nOriginally developed to encourage people to give away their surplus food, over time Olio has evolved so that people can give away any items that could have a second life. It’s now used in 62 countries, and Olio also partners with supermarkets and restaurants with the help of Food Waste Heroes - volunteers who collect and redistribute surplus food – saving an estimated 1 million meals per week. Looking to the future, Saasha says their ambition is “to create a world in which sharing becomes the new normal”.\n\n\nYou can read more inspiring stories, including those featuring LGTBQ+ apps celebrating Pride Month, at g.co/play/weareplay.\n  \n  \n\nHow useful did you find this blog post?\n★ \n  \n  ★ \n  \n  ★ \n  \n  ★ \n  \n  ★",
          "link": "http://developers.googleblog.com/2023/06/weareplay-meet-tessa-and-saasha-from-uk.html",
          "publishedOn": "2023-06-01T12:00:00.001Z",
          "wordCount": null,
          "title": "#WeArePlay | Meet Tessa and Saasha from the UK, founders of waste-fighting app Olio",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2023/05/aapi-heritage-month-how-web-gde-vickie-li-views-the-importance-of-diversity.html",
          "author": null,
          "description": "Posted by Kevin Hernandez, Developer Relations Community Manager\n\n\n\n\n\n\n\nFor AAPI Heritage Month, we are celebrating Vickie Li, Web GDE\n\n\n\n\n\n\n\n\nVickie Li, Web GDE, is a Senior Security Engineer at Instacart where she works on a range of security tasks such as bug bounty reports and building internal security tooling. Although she went to school with the goal of becoming a developer, she discovered computer systems and started working on bug bounties as a way of exploring the security industry. From there, her interest in security blossomed and eventually inspired her to blog about security. As Vickie started to become more involved in blogging and sharing what she’s working on or learning, she started to realize that she really enjoyed the sense of community - both in the developer and AAPI…",
          "link": "http://developers.googleblog.com/2023/05/aapi-heritage-month-how-web-gde-vickie-li-views-the-importance-of-diversity.html",
          "publishedOn": "2023-05-25T14:00:00.003Z",
          "wordCount": null,
          "title": "AAPI Heritage Month: How Web GDE Vickie Li views the importance of diversity",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2023/05/celebrate-googles-coding-competitions.html",
          "author": null,
          "description": "Posted by the Coding Competitions team\n\n\n\nAfter 20 years, Google's Coding Competitions come to a close with a final round.\nCode Jam, which challenged programmers of all levels to test and hone their skills by racing to solve algorithmic problems.\n\n\nFrom there, our coding competition lineup continued to grow. Kick Start began as a contest for recent graduates in China and quickly spread around the world. Hash Code, Google's first team-based challenge, started in Europe. And a first-in-class Distributed Code Jam asked participants to build solutions that could scale when run on multiple machines.\n\n\nThroughout our coding competitions' 20-year history, you've generated billions of lines of code across millions of submissions. You've gone through hundreds of rounds for thousands of problems and…",
          "link": "http://developers.googleblog.com/2023/05/celebrate-googles-coding-competitions.html",
          "publishedOn": "2023-05-23T22:30:00.004Z",
          "wordCount": null,
          "title": "Celebrate Google’s Coding Competitions with a final round of programming fun",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2023/05/whats-new-in-google-pay.html",
          "author": null,
          "description": "Posted by Jose Ugia – Developer Relations Engineer\n\n\n\n\n\n\nDuring Google I/O 2023, we shared some of the new features we’re adding to Google Pay and discussed how you can use them to simplify and strengthen your integrations, and add value to your customers making payments in your application or website.\nRead on for a summary of what we covered during the event, or check out the recording of our session on YouTube: What's new in Google Pay and Google Wallet.\n\n\n\nLiability shift on eligible transactions with Google Pay\nGoogle Pay is expanding its zero fraud liability protection on Android devices  for eligible transactions leveraging leading payment network security capabilities. Before today, online payments made with a Mastercard were guaranteed by this protection. Today, we are announcing t…",
          "link": "http://developers.googleblog.com/2023/05/whats-new-in-google-pay.html",
          "publishedOn": "2023-05-23T21:00:00.002Z",
          "wordCount": null,
          "title": "What’s new in Google Pay",
          "imageUrl": null
        },
        {
          "id": "http://developers.googleblog.com/2023/05/how-web-gde-erick-wendel-forever-changed-nodejs-open-source-community.html",
          "author": null,
          "description": "Posted by Kevin Hernandez, Developer Relations Community Manager\n\n\n\n\n\n\nHave you ever faced bugs on technologies known worldwide? What did you do? \nIf you are Erick Wendel, Web GDE, you roll up your sleeves and find a solution to a bug that has been plaguing big tech companies. \nErick is a community-driven developer who got his start in the field through a software community that used to offer free courses in his home country of Brazil. This experience sparked a passion for open-source projects and collaboration that helped him solve an issue within Node.js that affected how subprocesses work in the runtime. Erick continued with his spirit of sharing knowledge by outlining exactly how he solved the bug in a detailed YouTube video (in Portuguese).\n\n\nErick Wendel, Web GDE, speaking at the Fro…",
          "link": "http://developers.googleblog.com/2023/05/how-web-gde-erick-wendel-forever-changed-nodejs-open-source-community.html",
          "publishedOn": "2023-05-23T18:00:00.001Z",
          "wordCount": null,
          "title": "How web GDE Erick Wendel forever changed Node.js with the support of the open-source community",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Many But Finite",
      "feedUrl": "https://feeds.feedburner.com/GustavoDuarte",
      "siteUrl": "https://manybutfinite.com/feed.xml",
      "articles": []
    },
    {
      "title": "Krister Walfridsson’s old blog",
      "feedUrl": "http://feeds.feedburner.com/KristerWalfridssonsBlog",
      "siteUrl": "http://kristerw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Python Insider",
      "feedUrl": "https://feeds.feedburner.com/PythonInsider",
      "siteUrl": "https://pythoninsider.blogspot.com/",
      "articles": [
        {
          "id": "https://pythoninsider.blogspot.com/2023/06/python-3120-beta-3-released.html",
          "author": null,
          "description": "I'm pleased to announce the release of Python 3.12 beta 3.\nhttps://www.python.org/downloads/release/python-3120b3/\nThis is a beta preview of Python 3.12\n\n\nPython 3.12 is still in development. This release, 3.12.0b3, is the third of four planned beta release previews of 3.12.\n\nBeta release previews are intended to give the wider community the opportunity to test new features and bug fixes and to prepare their projects to support the new feature release.\n\nWe strongly encourage maintainers of third-party Python projects to test with 3.12 during the beta phase and report issues found to [the Python bug tracker (https://github.com/python/cpython/issues) as soon as possible. While the release is planned to be feature complete entering the beta phase, it is possible that features may be modified …",
          "link": "https://pythoninsider.blogspot.com/2023/06/python-3120-beta-3-released.html",
          "publishedOn": "2023-06-20T18:52:00.000Z",
          "wordCount": 1872,
          "title": "Python 3.12.0 beta 3 released",
          "imageUrl": null
        },
        {
          "id": "https://pythoninsider.blogspot.com/2023/06/python-3114-31012-3917-3817-3717-and.html",
          "author": null,
          "description": "Greetings! Time for another combined release of six separate versions of Python!\nBefore you scroll away to the download links\nPlease test the 3.12 beta! Downloading it and trying it out helps us a\n lot in ensuring Python 3.12.0 will be as polished as possible.\nWe welcome 3.10 to the prestigious club of security-only releases. \nIt’s officially an old version of Python now! If you haven’t rewritten \nall your if:elif:else:s with pattern matching yet, are you even still writing Python?\nAt the same time, it looks like 3.7 is reaching end-of-life. Unless \nanother security release happens in June, 3.7.17 will be the final \nrelease of Python 3.7. I mean, now that I typed it out for all you to \nread, I’m sure I jinxed it. But in case I didn’t, I would like to thank \nNed Deily for serving as the rel…",
          "link": "https://pythoninsider.blogspot.com/2023/06/python-3114-31012-3917-3817-3717-and.html",
          "publishedOn": "2023-06-07T06:56:00.001Z",
          "wordCount": 2048,
          "title": "Python 3.11.4, 3.10.12, 3.9.17, 3.8.17, 3.7.17, and 3.12.0 beta 2 are now available",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "from pvs-studio.com",
      "feedUrl": "http://feeds.feedburner.com/viva64-blog-en",
      "siteUrl": "https://pvs-studio.com",
      "articles": [
        {
          "id": "https://pvs-studio.com/en/blog/posts/1055/",
          "author": null,
          "description": "PVS-Studio 7.25 has been released. In this version, we implemented the support of Qt Creator 10 and Rider 2022.2.3 (and higher), updated the libraries used by the analyzer, enhanced the documentation — and that's not all! See the details in the article.",
          "link": "https://pvs-studio.com/en/blog/posts/1055/",
          "publishedOn": "2023-06-14T21:00:00.000Z",
          "wordCount": 5722,
          "title": "PVS-Studio 7.25: support for latest versions of QtCreator, Rider, and more",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/1055_PressRelease_7_25/image1_thm_intoblank_1200x630.png?ver=06-15-2023-13-00-23"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/1054/",
          "author": null,
          "description": "In this article, we will thoroughly examine the XSS vulnerability in a CMS written in C#. Let's recall the theory, figure out how the security defect looks from a user's perspective and in code, and also practice writing exploits.",
          "link": "https://pvs-studio.com/en/blog/posts/csharp/1054/",
          "publishedOn": "2023-05-30T21:00:00.000Z",
          "wordCount": 6288,
          "title": "XSS vulnerability in the ASP.NET application: examining CVE-2023-24322 in mojoPortal CMS",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/1054_XSS_mojoPortal/image1_thm_intoblank_1200x630.png?ver=05-31-2023-10-45-08"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1053/",
          "author": null,
          "description": "In this article, you're going to find 60 terrible coding tips — and explanations of why they are terrible. It's a fun and serious piece at the same time. No matter how terrible these tips look, they aren't fiction, they are real: we saw them all in the real programming world.",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1053/",
          "publishedOn": "2023-05-29T21:00:00.000Z",
          "wordCount": 33636,
          "title": "60 terrible tips for a C++ developer",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/1053_60_cpp_antipatterns/image1_thm_intoblank_1200x630.png?ver=06-09-2023-10-55-15"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/1052/",
          "author": null,
          "description": "This is a brief story of how PVS-Studio collaborated with RavenDB. PVS-Studio is a static code analyzer. RavenDB is an open-source database. How can searching for errors in one project benefit both? Let's find out by going over the bug fixes and RavenDB developers' comments.",
          "link": "https://pvs-studio.com/en/blog/posts/csharp/1052/",
          "publishedOn": "2023-05-23T21:00:00.000Z",
          "wordCount": 5391,
          "title": "RavenDB and PVS-Studio: win-win collaboration",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/1052_Collaboration_of_RavenDB_and_PVSStudio/image1_thm_intoblank_1200x630.png?ver=05-24-2023-13-02-12"
        }
      ]
    },
    {
      "title": "Future",
      "feedUrl": "https://future.a16z.com/feed/",
      "siteUrl": "https://future.com/",
      "articles": []
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/feeds/posts/default",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": []
    },
    {
      "title": "Two Cents",
      "feedUrl": "https://hur.substack.com/feed",
      "siteUrl": "https://hur.substack.com",
      "articles": [
        {
          "id": "https://hur.substack.com/p/two-cents-61-generative-ai-chatgpt",
          "author": "Jin Ho Hur",
          "description": "2023년 들어서도 Gen AI 분야의 큰 변화는 멈추지 않고 계속되고 있습니다. 특히 2023년에는 제가 [Two Cents #58]에서 “2세대 모델”이라고 부른 것의 단초가 될만한 변화들이 보이기 시작했습니다. 이는 기존에 우리가 알고 있는 moat, 성공 방정식을 근본적으로 바꿀 잠재력이 있다고 판단됩니다. 이제 3-4회에 걸쳐 Two Cents에서 이 이야기를 해 보려고 합니다. 그 두 번째 이야기는, ChatGPT plugin, Autonomous Agent가 가져 올 변화에 대한 생각입니다.",
          "link": "https://hur.substack.com/p/two-cents-61-generative-ai-chatgpt",
          "publishedOn": "2023-06-20T00:00:58.000Z",
          "wordCount": null,
          "title": "[Two Cents #61] Generative AI — ChatGPT plugin와 Autonomous Agent, 그리고 새로운 패러다임의 시작",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/w_256,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F6d34c489-fd70-41ce-938f-0034893ab1fc_256x256.png",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://substackcdn.com/image/fetch/w_256,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F6d34c489-fd70-41ce-938f-0034893ab1fc_256x256.png"
        },
        {
          "id": "https://hur.substack.com/p/two-cents-60-generative-ai-llama",
          "author": "Jin Ho Hur",
          "description": "2023년 들어서도 Gen AI 분야의 큰 변화는 멈추지 않고 계속되고 있습니다. 특히 2023년에는 제가 [Two Cents #58]에서 “2세대 모델”이라고 부른 것의 단초가 될만한 변화들이 보이기 시작했습니다. 이는 기존에 우리가 알고 있는 moat, 성공 방정식을 근본적으로 바꿀 잠재력이 있다고 판단됩니다. 이제 3-4회에 걸쳐 Two Cents에서 이 이야기를 해 보려고 합니다. 그 첫 번째 이야기는 LLM 시장의 구조 변화에 대한 생각입니다.",
          "link": "https://hur.substack.com/p/two-cents-60-generative-ai-llama",
          "publishedOn": "2023-06-16T02:30:56.000Z",
          "wordCount": null,
          "title": "[Two Cents #60] Generative AI — \"LLaMA Moment\"와 LLM 시장 구조에 대하여",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/w_256,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F6d34c489-fd70-41ce-938f-0034893ab1fc_256x256.png",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://substackcdn.com/image/fetch/w_256,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F6d34c489-fd70-41ce-938f-0034893ab1fc_256x256.png"
        }
      ]
    },
    {
      "title": "Interrupt",
      "feedUrl": "https://interrupt.memfault.com/feed.xml",
      "siteUrl": "https://interrupt.memfault.com/",
      "articles": [
        {
          "id": "https://interrupt.memfault.com/blog/measuring-stack-usage",
          "author": null,
          "description": "This article is intended to shed some light on strategies for measuring stack\nmemory usage on a small embedded system.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/measuring-stack-usage",
          "publishedOn": "2023-06-14T00:00:00.000Z",
          "wordCount": null,
          "title": "Measuring Stack Usage the Hard Way",
          "imageUrl": null
        },
        {
          "id": "https://interrupt.memfault.com/blog/may-2023-roundup",
          "author": null,
          "description": "Here are the articles, videos, and tools that we’ve been excited about this\nMay.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/may-2023-roundup",
          "publishedOn": "2023-06-06T00:00:00.000Z",
          "wordCount": null,
          "title": "What we've been reading in May",
          "imageUrl": null
        },
        {
          "id": "https://interrupt.memfault.com/blog/bazel-build-system-for-embedded-projects",
          "author": null,
          "description": "Selecting a build system is an essential decision when creating a project. Changing is always painful, especially in a mature repository. Therefore the choice should be made carefully. With this article, I will try to describe a few advantages of what Bazel can provide in the context of an embedded repository and show how to set up a build environment with a cross compiler from scratch.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/bazel-build-system-for-embedded-projects",
          "publishedOn": "2023-05-30T00:00:00.000Z",
          "wordCount": null,
          "title": "Bazel Build System for Embedded Projects",
          "imageUrl": null
        },
        {
          "id": "https://interrupt.memfault.com/blog/zephyr-ring-buffers",
          "author": null,
          "description": "This post covers Zephyr’s built-in ring buffer API, a component\ncommonly used in producer-consumer scenarios. We will cover how ring buffers\nin Zephyr work, when to use them, and their strengths and weaknesses. This post\nwill close with an example of augmenting ring buffers with waiting capabilities.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/zephyr-ring-buffers",
          "publishedOn": "2023-05-24T00:00:00.000Z",
          "wordCount": null,
          "title": "Zephyr Deep Dive: Ring Buffers",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Jay Carlson",
      "feedUrl": "https://jaycarlson.net/feed",
      "siteUrl": "https://jaycarlson.net",
      "articles": []
    },
    {
      "title": "만화로 나누는 자유/오픈소스 소프트웨어 이야기",
      "feedUrl": "https://joone.net/feed/",
      "siteUrl": "https://joone.net",
      "articles": []
    },
    {
      "title": "Kimchi hill",
      "feedUrl": "https://kimchihill.com/feed/",
      "siteUrl": "https://kimchihill.com",
      "articles": [
        {
          "id": "https://kimchihill.com/?p=2707",
          "author": "kimchihill",
          "description": "In my recent endeavor as the Head of Sales, APAC, alongside my role as Country Manager at Sendbird Korea Inc., I’ve embarked on a journey that brings me back to a sales-focused role after a hiatus of five years. Previously, as the Head of Growth at Sendbird from 2015 to 2018, I was involved inContinue reading \"A Comprehensive Approach to Sales Forecasting for SaaS Startups\"\nA Comprehensive Approach to Sales Forecasting for SaaS Startups appeared first on Kimchi hill.",
          "link": "https://kimchihill.com/2023/06/18/a-comprehensive-approach-to-sales-forecasting-for-b2b-saas-startups/?utm_source=rss&utm_medium=rss&utm_campaign=a-comprehensive-approach-to-sales-forecasting-for-b2b-saas-startups",
          "publishedOn": "2023-06-18T11:43:36.000Z",
          "wordCount": 2385,
          "title": "A Comprehensive Approach to Sales Forecasting for SaaS Startups",
          "imageUrl": "https://kimchihill.com/wp-content/uploads/2023/06/cover-forecast_resized.jpg"
        },
        {
          "id": "https://kimchihill.com/?p=2685",
          "author": "kimchihill",
          "description": "최근 작성한 블로그 글, SaaS 스타트업, Head of Sales의 성공적 온보딩을 위한 20가지 체크리스트, 에서 포어캐스트 방법론을 언급했는데, 관련하여 조금 더 자세히 설명해 달라는 문의가 있었습니다. 이전 회사에서는 주로 Enterprise Account Executive 등 IC (Individual Contributor) 역할을 맡다가 새로운 회사에서 처음으로 Head of Sales 역할을 맡게 되었을 때, 첫 포어캐스트 분석이 막연할 수 있습니다. HeadContinue reading \"SaaS 스타트업의 영업 리더십을 위한 포어캐스트 (Forecast) 방법론\"\nSaaS 스타트업의 영업 리더십을 위한 포어캐스트 (Forecast) 방법론 appeared first on Kimchi hill.",
          "link": "https://kimchihill.com/2023/06/18/kr-a-comprehensive-approach-to-sales-forecasting-for-b2b-saas-startups/?utm_source=rss&utm_medium=rss&utm_campaign=kr-a-comprehensive-approach-to-sales-forecasting-for-b2b-saas-startups",
          "publishedOn": "2023-06-18T10:12:02.000Z",
          "wordCount": 2261,
          "title": "SaaS 스타트업의 영업 리더십을 위한 포어캐스트 (Forecast) 방법론",
          "imageUrl": "https://kimchihill.com/wp-content/uploads/2023/06/cover-forecast_resized.jpg"
        },
        {
          "id": "https://kimchihill.com/?p=2672",
          "author": "kimchihill",
          "description": "B2B/SaaS 스타트업이 시리즈 A를 마치면, 보통 첫 외부 임원으로 Head of Sales를 채용하는 경향이 있습니다. B2B 분야에서 연쇄 창업 경험이 있는 CEO & 창업자라면 Head of Sales 채용에 익숙할 것입니다. 그러나 처음으로 Head of Sales를 채용하는 분들을 위해 Head of Sales 채용 후 첫 60일 동안 알아야 할 사항을 정리해 보았습니다. (관련글: SaaS 스타트업에서 첫Continue reading \"SaaS 스타트업, Head of Sales의 성공적 온보딩을 위한 20가지 체크리스트\"\nSaaS 스타트업, Head of Sales의 성공적 온보딩을 위한 20가지 체크리스트 appeared first on Kimchi hill.",
          "link": "https://kimchihill.com/2023/06/17/kr_20_onboarding_checklist_for_new_head_of_sales/?utm_source=rss&utm_medium=rss&utm_campaign=kr_20_onboarding_checklist_for_new_head_of_sales",
          "publishedOn": "2023-06-17T11:32:21.000Z",
          "wordCount": 2104,
          "title": "SaaS 스타트업, Head of Sales의 성공적 온보딩을 위한 20가지 체크리스트",
          "imageUrl": "https://kimchihill.com/wp-content/uploads/2023/06/ONBOARDING-60-DAYS_RESIZED-1.png"
        }
      ]
    },
    {
      "title": "Kwang Yul Seo",
      "feedUrl": "https://kwangyulseo.com/feed/",
      "siteUrl": "https://kwangyulseo.com",
      "articles": []
    },
    {
      "title": "LimitedResults",
      "feedUrl": "https://limitedresults.com/feed/",
      "siteUrl": "https://limitedresults.com/",
      "articles": []
    },
    {
      "title": "LWN.net",
      "feedUrl": "https://lwn.net/headlines/rss",
      "siteUrl": "https://lwn.net",
      "articles": [
        {
          "id": "https://lwn.net/Articles/935260/",
          "author": "jake",
          "description": "Kernel support for copy offload is a feature that has been floating around\nin limbo for a decade or more at this point; it has been implemented along \nthe way, but never merged.  The idea is that the host\nsystem can simply ask a block storage device to copy some data within the device\nand it \nwill do so without further involving the host; instead of reading data into\nthe host so that it can be written back out again, the device circumvents\nthat process.  At the\n2023 Linux Storage, Filesystem,\nMemory-Management and BPF Summit, Nitesh Shetty led a storage and\nfilesystem session to discuss the current status of a patch set that he and\nothers have been working on, with an\neye toward getting something merged fairly soon.",
          "link": "https://lwn.net/Articles/935260/",
          "publishedOn": "2023-06-21T17:57:08.000Z",
          "wordCount": null,
          "title": "[$] Merging copy offload",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/935592/",
          "author": "corbet",
          "description": "Red Hat has announced\nthat public source releases will be restricted to CentOS Stream going\nforward:\n\n\n\tAs the CentOS Stream community grows and the enterprise software\n\tworld tackles new dynamics, we want to sharpen our focus on CentOS\n\tStream as the backbone of enterprise Linux innovation. We are\n\tcontinuing our investment in and increasing our commitment to\n\tCentOS Stream. CentOS Stream will now be the sole repository for\n\tpublic RHEL-related source code releases. For Red Hat customers\n\tand partners, source code will remain available via the Red Hat\n\tCustomer Portal.\n\n\n(Emphasis in original; thanks to Janne Blomqvist).",
          "link": "https://lwn.net/Articles/935592/",
          "publishedOn": "2023-06-21T14:42:19.000Z",
          "wordCount": 5420,
          "title": "Red Hat cutting back RHEL source availability",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/935579/",
          "author": "corbet",
          "description": "The\n6.3.9,\n6.1.35,\n5.15.118,\n5.10.185,\n5.4.248,\n4.19.287, and\n4.14.319\nstable kernel updates have all been released; each contains another set of\nimportant fixes.",
          "link": "https://lwn.net/Articles/935579/",
          "publishedOn": "2023-06-21T14:32:49.000Z",
          "wordCount": 138,
          "title": "Seven more stable kernels",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/935079/",
          "author": "jake",
          "description": "Running a Linux distribution on Arm-based single-board computers (SBCs)\nis still not as easy as on x86 systems because many Arm devices require a\nvendor-supplied kernel, a patched bootloader, and other device-specific\ncomponents. One distribution that addresses this problem is Armbian, which offers Debian- and\nUbuntu-based distributions for\nmany devices. The headline feature in the recent release, Armbian\n23.05, which came at the end of May, is a major rework of the build\nframework that has been made faster and more reliable after three years of\ndevelopment.",
          "link": "https://lwn.net/Articles/935079/",
          "publishedOn": "2023-06-21T13:48:53.000Z",
          "wordCount": null,
          "title": "[$] Armbian 23.05: optimized for single-board computers",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/935552/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (libfastjson, libx11, opensc, python-mechanize, and wordpress), SUSE (salt and terraform-provider-helm), and Ubuntu (firefox, libx11, pngcheck, python-werkzeug, ruby3.1, and vlc).",
          "link": "https://lwn.net/Articles/935552/",
          "publishedOn": "2023-06-21T12:34:31.000Z",
          "wordCount": 192,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934941/",
          "author": "jake",
          "description": "Backporting fixes to stable kernels is an ongoing process that, in general,\nis handled by the stable maintainers or the developers of the fixes.\nHowever, due \nto some unhappiness in the XFS development\ncommunity with the process of handling stable fixes for that filesystem,\na different process has come about for backporting XFS patches to the\nstable kernels.  The three developers doing that work, Leah Rumancik, Amir\nGoldstein, and Chandan Babu Rajendra, led a plenary session at the \n2023 Linux Storage, Filesystem,\nMemory-Management and BPF Summit  (with Rajendra\nparticipating remotely)  to discuss that process.",
          "link": "https://lwn.net/Articles/934941/",
          "publishedOn": "2023-06-20T18:47:27.000Z",
          "wordCount": null,
          "title": "[$] Backporting XFS fixes to stable",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/935354/",
          "author": "corbet",
          "description": "The Rust project has announced\nthe formation of the Rust Leadership Council, which will take the place of\nthe existing Core Team and Leadership Chat groups.\n\n\n\tThe Council will assume responsibility for top-level governance\n\tconcerns while most of the responsibilities of the Rust Project\n\t(such as maintenance of the compiler and core tooling, evolution of\n\tthe language and standard libraries, administration of\n\tinfrastructure, etc.) remain with the nine top level teams.\n\n\nThe details on how this body is supposed to work can be found in RFC 3392.",
          "link": "https://lwn.net/Articles/935354/",
          "publishedOn": "2023-06-20T13:08:40.000Z",
          "wordCount": 202,
          "title": "The Rust Leadership Council",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/935353/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (libxpm and php7.3), Fedora (chromium), Mageia (kernel, kernel-linus, and sysstat), Red Hat (c-ares), SUSE (libwebp), and Ubuntu (cups-filters, libjettison-java, and libsvgpp-dev).",
          "link": "https://lwn.net/Articles/935353/",
          "publishedOn": "2023-06-20T12:56:23.000Z",
          "wordCount": 194,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/935193/",
          "author": "corbet",
          "description": "Drew DeVault has announced\nthe launch of a new web site\nthat is intended to be a better introduction to the free-software\ncommunity.\n\n\n\tSome of my criticisms focused on the message: fsf.org and gnu.org\n\ttogether suffer from no small degree of incomprehensibility and\n\tinaccessibility which makes it difficult for new participants to\n\tlearn about the movement and apply it in practice to their own\n\tprojects.\n\n\tThis is something which is relatively easily fixed!",
          "link": "https://lwn.net/Articles/935193/",
          "publishedOn": "2023-06-19T15:40:40.000Z",
          "wordCount": 2108,
          "title": "DeVault:  Reforming the free software message",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934940/",
          "author": "corbet",
          "description": "In the fast-moving open-source world, programs can come and go quickly; a\ntool that has many users today can easily be eclipsed by something better\nnext week.  Even in this environment, though, some programs endure for a\nlong time.  As an example, consider the\nPostgreSQL database system, which traces its\nhistory back to 1986.  Making fundamental changes to a large code base\nwith that much history is never an easy task.  As fundamental changes go,\nmoving PostgreSQL away from its process-oriented model is not a small one,\nbut it is one that the project is considering seriously.",
          "link": "https://lwn.net/Articles/934940/",
          "publishedOn": "2023-06-19T15:21:18.000Z",
          "wordCount": null,
          "title": "[$] PostgreSQL reconsiders its process-based model",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/935184/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (golang-go.crypto, maradns, requests, sofia-sip, and xmltooling), Fedora (chromium, iaito, iniparser, libX11, matrix-synapse, radare2, and thunderbird), Red Hat (c-ares, jenkins and jenkins-2-plugins, and texlive), SUSE (bluez, chromium, go1.19, go1.20, jetty-minimal, kernel, kubernetes1.18, kubernetes1.23, kubernetes1.24, libX11, open-vm-tools, openvswitch3, opera, syncthing, and xen), and Ubuntu (libcap2, libpod, linux, linux-aws, linux-aws-5.15, linux-azure, linux-azure-5.15,\n linux-azure-fde-5.15, linux-gcp, linux-gcp-5.15, linux-gke,\n linux-gke-5.15, linux-gkeop, linux-hwe-5.15, linux-ibm, linux-kvm,\n linux-lowlatency, linux-lowlatency-hwe-5.15, linux-oracle,\n linux-oracle-5.15, linux-raspi, linux, linux-aws, linux-azure, linux-gcp, linux-hwe-5.19, linux-kvm,\n linux-lowlatency, linux-oracle, linux-raspi, linux, linux-aws, linux-lowlatency, linux-raspi, linux-oem-5.17, linux-oem-6.1, pypdf2, and qemu).",
          "link": "https://lwn.net/Articles/935184/",
          "publishedOn": "2023-06-19T14:00:49.000Z",
          "wordCount": 440,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/935083/",
          "author": "corbet",
          "description": "The 6.4-rc7 kernel prepatch is out for\ntesting.  \"Nothing particular stands out in the rc this week,\nunless you count the mptcp selftest changes that are about making the tests\nwork on stable kernels too.\"",
          "link": "https://lwn.net/Articles/935083/",
          "publishedOn": "2023-06-18T23:28:11.000Z",
          "wordCount": 148,
          "title": "Kernel prepatch 6.4-rc7",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934961/",
          "author": "jake",
          "description": "The registration for this year's Linux Plumbers Conference (LPC) is now open.  It will be held November 13-15 in Richmond, Virginia in the US. \nThe attend page has all of the details.  Meanwhile, some of the calls for proposals are still open, though the microconferences CFP is closed; this year's proposed microconference topics are listed here.  Those who want to attend should note:\n\"As usual we expect to sell our rather quickly so don't delay your registration for too long!\"",
          "link": "https://lwn.net/Articles/934961/",
          "publishedOn": "2023-06-16T20:29:09.000Z",
          "wordCount": 199,
          "title": "Registration for LPC 2023 is open",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934692/",
          "author": "jake",
          "description": "The bcachefs filesystem, and the\nprocess for getting it upstream, were the topics\nof a session led remotely by \nKent Overstreet, creator of bcachefs, at the \n2023 Linux Storage, Filesystem,\nMemory-Management and BPF Summit.  He has also discussed bcachefs in\nprevious editions of the summit, first\nin 2018 and at last year's event;\nin both of those cases, the question of getting bcachefs merged\ninto the mainline kernel came up, but that merge has not happened yet.\nThis time \naround, though, Overstreet seemed \ncloser than ever to being ready to actually start that process.",
          "link": "https://lwn.net/Articles/934692/",
          "publishedOn": "2023-06-16T19:19:38.000Z",
          "wordCount": null,
          "title": "[$] Merging bcachefs",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934459/",
          "author": "corbet",
          "description": "The fifth conference on Power\nManagement and Scheduling in the Linux Kernel (abbreviated \"OSPM\") was\nheld on April 17 to 19 in Ancona, Italy.  LWN was not there,\nunfortunately, but the attendees of the event have gotten together to write\nup summaries of the discussions that took place and LWN has the privilege\nof being able to publish them.  Reports from the second day of the event\nappear below.",
          "link": "https://lwn.net/Articles/934459/",
          "publishedOn": "2023-06-16T14:34:23.000Z",
          "wordCount": null,
          "title": "[$] Reports from OSPM 2023, part 2",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934939/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (chromium, openjdk-17, and wireshark), Fedora (iniparser, mariadb, mingw-glib2, perl-HTML-StripScripts, php, python3.7, and syncthing), Oracle (.NET 6.0, c-ares, kernel, nodejs, and python3.9), Slackware (libX11), SUSE (amazon-ssm-agent and chromium), and Ubuntu (gsasl, libx11, and sssd).",
          "link": "https://lwn.net/Articles/934939/",
          "publishedOn": "2023-06-16T14:18:33.000Z",
          "wordCount": 241,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934883/",
          "author": "corbet",
          "description": "The developers working on improving the speed of the CPython interpreter\nhave posted\na plan describing their objectives for the Python 3.13 release.  The\nbiggest piece appears to be the tier-2\noptimizer, which will optimize larger chunks of Python code:\n\"https://github.com/faster-cpython/ideas/issues/557\".",
          "link": "https://lwn.net/Articles/934883/",
          "publishedOn": "2023-06-16T12:24:57.000Z",
          "wordCount": 158,
          "title": "The faster-cpython plan for 3.13",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934679/",
          "author": "corbet",
          "description": "The C language does not provide the sort of resource-management features\nfound in more recent languages.  As a result, bugs involving\nleaked memory or failure to release a lock are relatively common in\nprograms written in C — including the kernel.  The kernel project has never\nlimited itself to the language features found in the C standard, though;\nkernel developers will happily\nuse extensions provided by compilers if they prove helpful.  It looks like\na relatively simple compiler-provided feature may lead to a significant\nchange in some common kernel coding patterns.",
          "link": "https://lwn.net/Articles/934679/",
          "publishedOn": "2023-06-15T20:57:52.000Z",
          "wordCount": null,
          "title": "[$] Scope-based resource management for the kernel",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934561/",
          "author": "jake",
          "description": "Darrick Wong has been doing work on XFS online\nrepair for a number of years \nand things are getting to the point where most of the filesystem-internal work\nhas been completed and is under review.  The work remaining mostly concerns\nthe user-space side \nto set up a periodic scan and repair cycle, so he wanted to discuss what\nuser space needs from this kind of feature in a filesystem session at the \n2023 Linux Storage, Filesystem,\nMemory-Management and BPF Summit that he led remotely.  The session may\nnot have gone quite as he hoped, as it got somewhat derailed by topics that\nspilled over from the earlier session on\nunprivileged image mounts.",
          "link": "https://lwn.net/Articles/934561/",
          "publishedOn": "2023-06-15T17:28:01.000Z",
          "wordCount": null,
          "title": "[$] XFS online filesystem check and repair",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934802/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (webkit2gtk), Fedora (python-django-filter and qt), Mageia (cups, firefox/nss, httpie, thunderbird, and webkit2), Red Hat (.NET 6.0, .NET 7.0, c-ares, firefox, jenkins and jenkins-2-plugins, nodejs, nodejs:18, python3, python3.11, python3.9, and thunderbird), Scientific Linux (firefox and thunderbird), SUSE (frr, opensc, python3, and rekor), and Ubuntu (c-ares, glib2.0, libcap2, linux-intel-iotg-5.15, pano13, and requests).",
          "link": "https://lwn.net/Articles/934802/",
          "publishedOn": "2023-06-15T14:30:37.000Z",
          "wordCount": 405,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934177/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for June 15, 2023 is available.",
          "link": "https://lwn.net/Articles/934177/",
          "publishedOn": "2023-06-15T02:29:43.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for June 15, 2023",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934674/",
          "author": "corbet",
          "description": "Robert Haas looks\nat the advantages and disadvantages of how documentation for PostgreSQL\nis written.\n\n\n\tThe strengths of this process are also its weaknesses. A developer\n\tis, by definition, someone who spends the majority of their time\n\tdoing development, which is to say writing code. Updating the\n\tdocumentation becomes a task that must be completed so that the\n\tcode one has written can get committed so that one can move on to\n\tthe next project and write some more code. If a change to the\n\tdocumentation would be beneficial but is unrelated to any\n\tparticular patch, it's not likely to get done.\n\n\tThe results are, in a certain sense, pretty comical.",
          "link": "https://lwn.net/Articles/934674/",
          "publishedOn": "2023-06-14T16:00:40.000Z",
          "wordCount": null,
          "title": "Haas: The PostgreSQL Documentation and the Limitations of Community",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934469/",
          "author": "jake",
          "description": "In something of a follow-on from the mount-operation monitoring session the\nprevious day, Christian Brauner led another discussion about providing user\nspace with a mechanism to get current mount information on day two of the\n2023 Linux Storage, Filesystem,\nMemory-Management and BPF Summit.  The session also continued on from\none at last year's \nsummit—and likely others before that.\nThere are two separate proposals for ways to retrieve this kind of\ninformation, one from Miklos Szeredi and another from David Howells, both\nof whom were present this year; Brauner's intent was to try to reach some\nkind of agreement on the way forward in the session.",
          "link": "https://lwn.net/Articles/934469/",
          "publishedOn": "2023-06-14T15:05:34.000Z",
          "wordCount": null,
          "title": "[$] Retrieving mount and filesystem information in user space",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934460/",
          "author": "jake",
          "description": "There are some \"magic links\" in kernel pseudo-filesystems, like procfs,\nthat can be—have been—(ab)used to cause security problems, such as a\ncontainer-confinement breach in 2019.\nAleksa Sarai has long been working on ways to blunt the impact of these\nmagic links.  He led a filesystem session at the\n2023 Linux Storage, Filesystem,\nMemory-Management and BPF Summit to discuss the status of those efforts.",
          "link": "https://lwn.net/Articles/934460/",
          "publishedOn": "2023-06-14T14:04:59.000Z",
          "wordCount": null,
          "title": "[$] Hardening magic links",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934620/",
          "author": "corbet",
          "description": "The\n6.3.8,\n6.1.34,\n5.15.117,\n5.10.184,\n5.4.247,\n4.19.286, and\n4.14.318\nstable kernel updates have all been released; each contains another set of\nimportant fixes.",
          "link": "https://lwn.net/Articles/934620/",
          "publishedOn": "2023-06-14T10:34:57.000Z",
          "wordCount": null,
          "title": "Another set of stable kernels",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934619/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (ffmpeg, owslib, php7.4, and php8.2), Fedora (ntp-refclock, php, and python3.7), Red Hat (c-ares, firefox, and thunderbird), SUSE (kernel, openldap2, and tomcat), and Ubuntu (binutils, dotnet6, dotnet7, node-fetch, and python-tornado).",
          "link": "https://lwn.net/Articles/934619/",
          "publishedOn": "2023-06-14T10:28:52.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934176/",
          "author": "jake",
          "description": "There has long been a desire to enable users to mount filesystem images without\nrequiring privileges, but the security\nimplications of allowing it are seriously concerning.  Few, if any, kernel\nfilesystems are hardened against maliciously crafted images, after all.\nLennart Poettering led a filesystem session at the \n2023 Linux Storage, Filesystem,\nMemory-Management and BPF Summit where he presented a possible path\nforward.",
          "link": "https://lwn.net/Articles/934176/",
          "publishedOn": "2023-06-13T14:21:34.000Z",
          "wordCount": null,
          "title": "[$] Mounting images inside a user namespace",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934142/",
          "author": "corbet",
          "description": "The fifth conference on Power\nManagement and Scheduling in the Linux Kernel (abbreviated \"OSPM\") was\nheld on April 17 to 19 in Ancona, Italy.  LWN was not there,\nunfortunately, but the attendees of the event have gotten together to write\nup summaries of the discussions that took place and LWN has the privilege\nof being able to publish them.  Reports from the first day of the event\nappear below.",
          "link": "https://lwn.net/Articles/934142/",
          "publishedOn": "2023-06-13T09:47:24.000Z",
          "wordCount": null,
          "title": "[$] Reports from OSPM 2023, part 1",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934474/",
          "author": "corbet",
          "description": "Paul McKenney has announced a new\nversion of his book Is\nParallel Programming Hard, And, If So, What Can You Do About It?.\n\n\n\tThis release contains a new section on thermal throttling (along\n\twith a new cartoon), improvements to the memory-ordering chapter\n\t(including intuitive subsets of the Linux-kernel memory model),\n\tfixes to the deferred-processing chapter, additional\n\tclocksource-deviation material to the \"What Time Is It?\" section,\n\tand numerous fixes inspired by questions and comments from readers.",
          "link": "https://lwn.net/Articles/934474/",
          "publishedOn": "2023-06-13T09:30:41.000Z",
          "wordCount": null,
          "title": "McKenney: Parallel Programming: June 2023 Update",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934478/",
          "author": "corbet",
          "description": "Videos\nfrom the 2022 Tracing Summit are now available on YouTube.  They\ninclude talks about Visual eBPF, Perfetto, the state of Linux tracers,\nlibpatch, hardware trace, and more.",
          "link": "https://lwn.net/Articles/934478/",
          "publishedOn": "2023-06-13T09:30:28.000Z",
          "wordCount": null,
          "title": "Videos from the 2022 Tracing Summit",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934492/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (vim), Fedora (kernel), Oracle (emacs, firefox, python3, and qemu), SUSE (firefox, java-1_8_0-ibm, and libwebp), and Ubuntu (firefox, glusterfs, and sniproxy).",
          "link": "https://lwn.net/Articles/934492/",
          "publishedOn": "2023-06-13T09:29:59.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934473/",
          "author": "corbet",
          "description": "The Fedora project has posted the results of its elections for members of\nthe\nFedora\nEngineering Steering Committee (Stephen Gallagher, Neal Gompa, Major\nHayden, and Tom Stellard),\nFedora\nCouncil (Sumantro Mukherjee), and Mindshare\nCommittee (David Duncan).",
          "link": "https://lwn.net/Articles/934473/",
          "publishedOn": "2023-06-13T08:09:07.000Z",
          "wordCount": null,
          "title": "Fedora election results",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934415/",
          "author": "corbet",
          "description": "The CPU scheduler's one job at any given time is to run the task that has\nthe strongest claim to the CPU.  There are many factors that complicate\nthat job, not the least of which is that the \"strongest claim\" is sometimes\na bit of a fuzzy concept.  Realtime throttling, a mechanism designed to\nkeep a runaway realtime task from monopolizing the CPU, is one case where\ndevelopers have concluded that the task with, ostensibly, the highest\npriority should not actually be the one that runs.  But realtime throttling\nhas rarely pleased anybody; the deadline-server\ninfrastructure patches posted by Daniel Bristot de Oliveira are the\nlatest attempt to find a better solution.",
          "link": "https://lwn.net/Articles/934415/",
          "publishedOn": "2023-06-12T15:26:41.000Z",
          "wordCount": null,
          "title": "[$] Deadline servers as a realtime throttling replacement",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934456/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (pypdf2 and thunderbird), Fedora (chromium, dbus, mariadb, matrix-synapse, sympa, and thunderbird), Scientific Linux (python and python3), SUSE (chromium, gdb, and openldap2), and Ubuntu (jupyter-core, requests, sssd, and vim).",
          "link": "https://lwn.net/Articles/934456/",
          "publishedOn": "2023-06-12T14:14:08.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934410/",
          "author": "corbet",
          "description": "The 6.4-rc6 kernel prepatch is out for\ntesting.\n\n\n\tI don't think we've had anything hugely interesting happen the last\n\tweek, and the whole 6.4 release really does feel like it's going\n\tfairly smoothly. Knock wood, famous last words, you know the drill.",
          "link": "https://lwn.net/Articles/934410/",
          "publishedOn": "2023-06-12T06:05:06.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.4-rc6",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934361/",
          "author": "jake",
          "description": "\"After 1 year, 9 months, and 28 days of development\", Debian 12, codenamed \"bookworm\", has been released.  The announcement has lots of details about package versions for desktop environments (6 are supported), kernel version (Linux 6.1 series), other package versions (compilers, graphics tools, office suites, languages, and more), architectures supported (8 for real hardware and 5 for cloud services), blends, and lots more.\n\nThis release contains over 11,089 new packages for a total count of 64,419 packages, while over 6,296 packages have been removed as \"obsolete\". 43,254 packages were updated in this release. The overall disk usage for \"bookworm\" is 365,016,420 kB (365 GB), and is made up of 1,341,564,204 lines of code.\n\n\"bookworm\" has more translated man pages than ever thanks to our translators who have made man-pages available in multiple languages such as: Czech, Danish, Greek, Finnish, Indonesian, Macedonian, Norwegian (Bokmål), Russian, Serbian, Swedish, Ukrainian, and Vietnamese. All of the systemd man pages are now completely available in German.\n\n\nSee the Debian 12\nrelease notes for additional information.",
          "link": "https://lwn.net/Articles/934361/",
          "publishedOn": "2023-06-10T14:39:54.000Z",
          "wordCount": null,
          "title": "Debian 12 \"bookworm\" released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934094/",
          "author": "jake",
          "description": "Two different topics concerning the virtual filesystem (VFS) layer were the\nsubject of a session led by VFS co-maintainer Christian Brauner at the\n2023 Linux Storage, Filesystem,\nMemory-Management and BPF Summit.  As might be guessed, it was a\nfilesystem-track session; Brauner had three separate items he planned on\nbringing up, but the discussion on the first two consumed the whole\nhalf-hour—and then some.  A mechanism to avoid media-change races when\nmounting loop (or loopback) and other devices was disposed of fairly\nquickly, but the \ndiscussion around the mount-beneath feature went on at length.",
          "link": "https://lwn.net/Articles/934094/",
          "publishedOn": "2023-06-09T17:12:22.000Z",
          "wordCount": null,
          "title": "[$] Two VFS topics",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934114/",
          "author": "corbet",
          "description": "Priority inversion comes about when a low-priority task holds a resource\nthat is needed by a higher-priority task, with the result that the wrong\ntask is the only one that can run.  This problem is arguably most acute in\nrealtime settings, but it can happen in just about any system that has\nmultiple tasks running.  The variety of\nscheduling classes provided by the Linux kernel make handling priority\ninversion a difficult problem; the latest version of the proxy\nexecution patch series points toward a possible solution.",
          "link": "https://lwn.net/Articles/934114/",
          "publishedOn": "2023-06-09T16:47:42.000Z",
          "wordCount": null,
          "title": "[$] Addressing priority inversion with proxy execution",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934317/",
          "author": "jake",
          "description": "Greg Kroah-Hartman has released the 6.3.7,\n6.1.33, 5.15.116, 5.10.183, 5.4.246, 4.19.285, and 4.14.317 stable kernels.  As usual, they\ncontain many important fixes throughout the tree; users of those series\nshould upgrade.",
          "link": "https://lwn.net/Articles/934317/",
          "publishedOn": "2023-06-09T14:19:16.000Z",
          "wordCount": null,
          "title": "Seven stable kernels",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934316/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (jupyter-core, openssl, and ruby2.5), Fedora (firefox), Mageia (libreoffice, openssl, and python-flask), Red Hat (python and python3), Slackware (mozilla, php8, and python3), SUSE (java-1_8_0-ibm, libcares2, mariadb, and python36), and Ubuntu (linux, linux-aws, linux-kvm, linux-lts-xenial, linux-gke, linux-intel-iotg, linux-raspi, linux-xilinx-zynqmp, and mozjs102).",
          "link": "https://lwn.net/Articles/934316/",
          "publishedOn": "2023-06-09T14:12:31.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/933867/",
          "author": "corbet",
          "description": "The kernel is an increasingly dynamic body of code, where new executable\ntext can show up at any time.  Currently, the task of allocating memory for\nnew kernel code falls on the subsystem that first brought the ability to\nload code into a running kernel: the module loader.  This patch\nset from Mike Rapoport looks to move the responsibility for these\nallocations to a new \"JIT allocator\", addressing a number of rough edges in\nthe process.",
          "link": "https://lwn.net/Articles/933867/",
          "publishedOn": "2023-06-08T15:32:23.000Z",
          "wordCount": null,
          "title": "[$] Yet another memory allocator for executable code",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934245/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (chromium, firefox-esr, and ruby2.5), Fedora (curl, dbus, pypy, pypy3.8, pypy3.9, python3.10, and python3.8), Red Hat (python and python-flask), Scientific Linux (emacs), SUSE (firefox, google-cloud-sap-agent, libwebp, opensc, openssl, openssl-3, openssl1, python-sqlparse, python310, and supportutils), and Ubuntu (libxml2, netatalk, and sysstat).",
          "link": "https://lwn.net/Articles/934245/",
          "publishedOn": "2023-06-08T14:09:49.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/933414/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for June 8, 2023 is available.",
          "link": "https://lwn.net/Articles/933414/",
          "publishedOn": "2023-06-08T00:46:10.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for June 8, 2023",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934047/",
          "author": "jake",
          "description": "Gao Xiang gave an overview of the Extended Read-Only File\nSystem (EROFS) in a filesystem session at the\n2023 Linux Storage, Filesystem,\nMemory-Management and BPF Summit.  EROFS was added\nto Linux 5.4 in 2019 and has been increasingly used in\nplaces beyond its roots as a filesystem for Android and embedded devices.\nContainer images \nbased on EROFS are being used in many places these days, for example.",
          "link": "https://lwn.net/Articles/934047/",
          "publishedOn": "2023-06-07T15:05:17.000Z",
          "wordCount": null,
          "title": "[$] An introduction to EROFS",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/933616/",
          "author": "jake",
          "description": "At the end of our February article about\nthe debate around the composefs read-only,\nintegrity-protected \nfilesystem, it was predicted that the topic would come up at the\n2023 Linux Storage, Filesystem,\nMemory-Management and BPF Summit.  That happened on the second day of\nthe summit when\nAlexander Larsson led a session on composefs.  While the mailing-list\ndiscussion was \nsomewhat contentious, the session was less so, since overlayfs can\nbe made to fit the needs of the composefs use cases.  It turns\nout that an entirely new\nfilesystem is not really needed.",
          "link": "https://lwn.net/Articles/933616/",
          "publishedOn": "2023-06-07T14:08:46.000Z",
          "wordCount": null,
          "title": "[$] A decision on composefs",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934146/",
          "author": "corbet",
          "description": "Version\n15.5 of the openSUSE Leap distribution has been released.  This is not\nintended as a feature release, but brings updated versions of many\npackages.  The project has also announced\nthat there will be one more 15.x release before that series ends and users\nhave to migrate to whatever its successor will be.",
          "link": "https://lwn.net/Articles/934146/",
          "publishedOn": "2023-06-07T13:00:58.000Z",
          "wordCount": null,
          "title": "openSUSE Leap 15.5 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934132/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (c-ares), Fedora (curl and firefox), Oracle (cups-filters, kernel, and webkit2gtk3), Red Hat (emacs and kpatch-patch), Slackware (mozilla), SUSE (kernel and openssl-1_0_0), and Ubuntu (firefox and libreoffice).",
          "link": "https://lwn.net/Articles/934132/",
          "publishedOn": "2023-06-07T10:03:29.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/933193/",
          "author": "jake",
          "description": "Margaret Mitchell, a researcher focused on the intersection of machine\nlearning and ethics, was the morning keynote speaker on the third day of \nPyCon 2023.  She spoke about her\njourney into machine learning and how the Python language has been\ninstrumental in it.  It was a timely and thought-provoking talk that looked\nbeyond the machine-learning hype to consider the bigger picture.",
          "link": "https://lwn.net/Articles/933193/",
          "publishedOn": "2023-06-06T14:06:19.000Z",
          "wordCount": null,
          "title": "[$] Ethics in a machine-learning world",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/934010/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (linux-5.10), Red Hat (cups-filters, curl, kernel, kernel-rt, kpatch-patch, and webkit2gtk3), SUSE (apache-commons-fileupload, openstack-heat, openstack-swift, python-Werkzeug, and openstack-heat, python-Werkzeug), and Ubuntu (frr, go, libraw, libssh, nghttp2, python2.7, python3.10, python3.11, python3.5, python3.6, python3.8, and xfce4-settings).",
          "link": "https://lwn.net/Articles/934010/",
          "publishedOn": "2023-06-06T12:07:30.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "M0AGX / LB9MG",
      "feedUrl": "https://m0agx.eu/feeds/all.rss.xml",
      "siteUrl": "https://m0agx.eu/",
      "articles": [
        {
          "id": "tag:m0agx.eu,2023-06-20:/homeassistant-uptime-in-minutes.html",
          "author": null,
          "description": "My Home Assistant installation sends out several \"device normal\" notifications right after startup. I wanted to avoid being bombarded with useless notifications so I needed to filter out these events. The most obvious condition can be Home Assistant uptime. Basically: send a device status notification only 1-2 minutes after startup …",
          "link": "https://m0agx.eu/homeassistant-uptime-in-minutes.html",
          "publishedOn": "2023-06-20T00:00:00.000Z",
          "wordCount": 296,
          "title": "Getting Home Assistant uptime in minutes",
          "imageUrl": null
        },
        {
          "id": "tag:m0agx.eu,2023-06-15:/water-leak-notification-homeassistant.html",
          "author": null,
          "description": "Home Assistant is an extremely flexible home automation solution that does not come in a magic locked-down box. The flexibility comes with difficulty figuring out how to actually do things because of so many options and different approaches (just like with Linux overall).\nI installed some Zigbee water leak sensors …",
          "link": "https://m0agx.eu/water-leak-notification-homeassistant.html",
          "publishedOn": "2023-06-15T00:00:00.000Z",
          "wordCount": 481,
          "title": "Water leak app notification in Home Assistant",
          "imageUrl": null
        },
        {
          "id": "tag:m0agx.eu,2023-06-11:/migrating-to-pelican.html",
          "author": null,
          "description": "Returning readers: please update your feed reader with the new RSS or Atom URL.\nI decided to migrate my blog from Wordpress to a static site generator. My main motivation, apart from just trying something new for the sake of it, was the endless stream of Wordpress updates and security …",
          "link": "https://m0agx.eu/migrating-to-pelican.html",
          "publishedOn": "2023-06-11T00:00:00.000Z",
          "wordCount": null,
          "title": "Migrating to Pelican",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://martinfowler.com/articles/linking-modular-arch.html",
          "author": null,
          "description": "Mobile applications often deliver features rapidly at first, but slow as\n     a codebase builds up. These common software problems are exacerbated by the\n     need to prioritize different features in different markets. Matthew\n     Foster describes an example of this from his work with clients,\n     and how using Domain-Driven Design and Team Topologies helped create a\n     modular architecture that substantially reduced the time needed to deliver\n     new features. \nmore…",
          "link": "https://martinfowler.com/articles/linking-modular-arch.html",
          "publishedOn": "2023-06-13T13:29:00.000Z",
          "wordCount": null,
          "title": "Linking Modular Architecture to Development Teams",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/intro-pet.html",
          "author": null,
          "description": "Making data open and available to all helps us all understand our world\n     and are thus better informed to shape the policies to run it. But such openness\n     does come with problems - one in particular is the invasion of people's\n     privacy. Detailed census information about household income helps debate\n     and planning for local government, but can reveal personal information that\n     citizens reasonably prefer to keep private. Privacy Enhancing Technologies\n     are tools that can finesse this problem. My colleague Katharine Jarmul is a\n     data scientist who is also an activist for personal privacy. Here she\n     introduces three of these tools that are usable now: Differential Privacy,\n     Distributed & Federated Analysis & Learning, and Encrypted Computation.\nmore…",
          "link": "https://martinfowler.com/articles/intro-pet.html",
          "publishedOn": "2023-05-30T14:32:00.000Z",
          "wordCount": 5391,
          "title": "Privacy Enhancing Technologies: An Introduction for Technologists",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/dependency-composition.html",
          "author": null,
          "description": "Developers commonly ask \"what framework should we use for dependency\n     injection\". Daniel Somerfield explains why this is the wrong question,\n     instead we should focus how to have clearly separated modules with a simple\n     composition mechanism between them. He illustrates how he approaches this\n     in TypeScript, with a minimalist \"function-first\" approach, on a simple\n     example application separating application logic from persistence.\nmore…",
          "link": "https://martinfowler.com/articles/dependency-composition.html",
          "publishedOn": "2023-05-23T17:56:00.000Z",
          "wordCount": 6808,
          "title": "Dependency Composition",
          "imageUrl": "https://martinfowler.com/articles/dependency-composition/card.png"
        }
      ]
    },
    {
      "title": "MCU on Eclipse",
      "feedUrl": "https://mcuoneclipse.com/feed/",
      "siteUrl": "https://mcuoneclipse.com",
      "articles": [
        {
          "id": "http://mcuoneclipse.com/?p=37621",
          "author": "Erich Styger",
          "description": "The hardware has a limited number of hardware breakpoints. This article shows how to use a unlimited number of breakpoints in flash, using GDB with a small script catching SIGTRAP signals. Continue reading →",
          "link": "https://mcuoneclipse.com/2023/05/31/catchpoints-unlimited-number-of-flash-breakpoints-with-gdb/",
          "publishedOn": "2023-05-31T21:39:00.000Z",
          "wordCount": 4279,
          "title": "Catchpoints: Unlimited Number of FLASH Breakpoints with GDB",
          "imageUrl": "https://mcuoneclipse.files.wordpress.com/2023/05/debugging-lpc845-using-unlimited-number-of-breakpoints.png"
        }
      ]
    },
    {
      "title": "The ESP Journal - Medium",
      "feedUrl": "https://medium.com/feed/the-esp-journal",
      "siteUrl": "https://blog.espressif.com?source=rss----d5414d5dee73---4",
      "articles": [
        {
          "id": "https://medium.com/p/d56dea3b2c80",
          "author": "Shu Chen",
          "description": "Espressif offers certified Thread Border Router solutions based on the ESP-IDF and OpenThread.",
          "link": "https://blog.espressif.com/espressif-thread-border-router-d56dea3b2c80?source=rss----d5414d5dee73---4",
          "publishedOn": "2023-06-15T10:33:33.000Z",
          "wordCount": 1922,
          "title": "Espressif Thread Border Router",
          "imageUrl": "https://miro.medium.com/v2/resize:fit:1200/1*6ueD7H5zTUwhZlfqsrf0Lw.png"
        },
        {
          "id": "https://medium.com/p/c23cc6a548aa",
          "author": "Anant Raj Gupta",
          "description": "",
          "link": "https://blog.espressif.com/leveraging-wi-fi-6-features-for-iot-applications-c23cc6a548aa?source=rss----d5414d5dee73---4",
          "publishedOn": "2023-06-14T03:35:01.000Z",
          "wordCount": null,
          "title": "Leveraging Wi-Fi 6 Features for IoT Applications",
          "imageUrl": null
        },
        {
          "id": "https://medium.com/p/fba0b2d2c4f2",
          "author": "ALI HASSAN SHAH",
          "description": "",
          "link": "https://blog.espressif.com/unleashing-the-power-of-openai-and-esp-box-a-guide-to-fusing-chatgpt-with-espressif-socs-fba0b2d2c4f2?source=rss----d5414d5dee73---4",
          "publishedOn": "2023-06-13T07:48:09.000Z",
          "wordCount": null,
          "title": "Unleashing the Power of OpenAI and ESP-BOX: A Guide to Fusing ChatGPT with Espressif SOCs",
          "imageUrl": null
        },
        {
          "id": "https://medium.com/p/3afa97ca553c",
          "author": "ALI HASSAN SHAH",
          "description": "",
          "link": "https://blog.espressif.com/esp32-s3-edge-ai-human-activity-recognition-using-accelerometer-data-and-esp-dl-3afa97ca553c?source=rss----d5414d5dee73---4",
          "publishedOn": "2023-06-07T07:40:35.000Z",
          "wordCount": null,
          "title": "ESP32-S3 Edge-AI｜Human Activity Recognition Using Accelerometer Data and ESP-DL",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "/* the devil is in the detail */",
      "feedUrl": "https://minjang.github.io/feed.xml",
      "siteUrl": "http://minjang.github.io/",
      "articles": []
    },
    {
      "title": "mingrammer's note",
      "feedUrl": "https://mingrammer.com/index.xml",
      "siteUrl": "https://mingrammer.com/",
      "articles": []
    },
    {
      "title": "Novel Bits",
      "feedUrl": "https://www.novelbits.io/feed",
      "siteUrl": "https://novelbits.io/",
      "articles": [
        {
          "id": "https://novelbits.io/?p=25057",
          "author": "Mohammad Afaneh",
          "description": "Introduction to BLE Bluetooth Low Energy (BLE) is a power-efficient variant of the classic Bluetooth technology, designed specifically for devices that need to consume less power and may need to run for long periods on a battery. BLE has become the de facto choice for most wireless communication between devices in close proximity. BLE is […]\nThe post Mastering BLE: A Guide to Peripherals and Centrals appeared first on Novel Bits.",
          "link": "https://novelbits.io/ble-peripherals-centrals-guide/",
          "publishedOn": "2023-06-08T00:31:06.000Z",
          "wordCount": 10062,
          "title": "Mastering BLE: A Guide to Peripherals and Centrals",
          "imageUrl": "https://mlv0gpv1snjt.i.optimole.com/cb:lAJ-.51688/w:auto/h:auto/q:90/https://novelbits.io/wp-content/uploads/2023/06/Centrals-vs.-Peripherals.png"
        },
        {
          "id": "https://novelbits.io/?p=25034",
          "author": "Mohammad Afaneh",
          "description": "There’s a lot of confusion in the developer community – not only about what Amazon Sidewalk is – but also about what it can and can’t do. To help you make sense of this new technology and start developing your own Amazon Sidewalk-enabled devices, in this article, we’ll walk through: And – be sure to […]\nThe post What is Amazon Sidewalk & How Does it Work? appeared first on Novel Bits.",
          "link": "https://novelbits.io/what-is-amazon-sidewalk-developer-guide/",
          "publishedOn": "2023-06-07T12:54:42.000Z",
          "wordCount": 9842,
          "title": "What is Amazon Sidewalk & How Does it Work?",
          "imageUrl": "https://mlv0gpv1snjt.i.optimole.com/cb:lAJ-.51688/w:auto/h:auto/q:90/https://novelbits.io/wp-content/uploads/2023/06/Amazon-Sidewalk-featured-image.png"
        },
        {
          "id": "https://novelbits.io/?p=24997",
          "author": "Mohammad Afaneh",
          "description": "In today’s interconnected world, the ability to track and monitor assets and people in real-time has become increasingly important. That’s where real-time location systems come into play, specifically Bluetooth-based systems utilizing RSSI and/or Bluetooth Direction Finding. Real-time location systems – or RTLS – can be used to identify and track the location of objects in […]\nThe post RSSI vs. Direction Finding – The Ultimate Guide to Bluetooth RTLS appeared first on Novel Bits.",
          "link": "https://novelbits.io/bluetooth-rtls-direction-finding-and-rssi/",
          "publishedOn": "2023-05-24T12:58:34.000Z",
          "wordCount": 10071,
          "title": "RSSI vs. Direction Finding – The Ultimate Guide to Bluetooth RTLS",
          "imageUrl": "https://mlv0gpv1snjt.i.optimole.com/cb:lAJ-.51688/w:auto/h:auto/q:90/https://novelbits.io/wp-content/uploads/2023/05/RSSI-vs.-Direction-Finding-4.png"
        }
      ]
    },
    {
      "title": "null program",
      "feedUrl": "https://nullprogram.com/feed/",
      "siteUrl": "https://nullprogram.com",
      "articles": [
        {
          "id": "https://nullprogram.com/blog/2023/05/31/",
          "author": null,
          "description": "I love fast builds, and for years I’ve been bothered by the build penalty\nfor translation units including windows.h. This header has an enormous\nnumber of definitions and declarations and so, for C programs, it tends to\ndominate the build time of those translation units. Most programs,\nespecially systems software, only needs a tiny portion of it. For example,\nwhen compiling u-config with GCC, two thirds of the debug build was\nspent processing windows.h just for 4 types, 16 definitions, and 16\nprototypes.\nTo give a sense of the numbers, here’s empty.c, which does nothing but\ninclude windows.h.\n\n#include <windows.h>\n\n\nWith the current Mingw-w64 headers, that’s ~82kLOC (non-blank):\n\n$ gcc -E empty.c | grep -vc '^$'\n82041\n\n\nWith w64devkit this takes my system ~450ms to compile with GCC:\n\n$ tim…",
          "link": "https://nullprogram.com/blog/2023/05/31/",
          "publishedOn": "2023-05-31T01:38:31.000Z",
          "wordCount": null,
          "title": "Hand-written Windows API prototypes: fast, flexible, and tedious",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Almost Secure",
      "feedUrl": "https://palant.info/rss.xml",
      "siteUrl": "https://palant.info/",
      "articles": [
        {
          "id": "https://palant.info/2023/06/14/why-browser-extension-games-need-access-to-all-websites/",
          "author": null,
          "description": "When installing browser extensions in Google Chrome, you are asked to confirm the extension’s permissions. In theory, this is supposed to allow assessing the risk associated with an extension. In reality however, users typically lack the knowledge to properly interpret this prompt. For example, I’ve often seen users accusing extension developers of spying just because the prompt says they could.\n\n\nOn the other hand, people will often accept these cryptic prompts without thinking twice. They expect the browser vendors to keep them out of harm’s way, trust that isn’t always justified [1] [2] [3]. The most extreme scenario here is casual games not interacting with the web at all, yet requesting access to all websites. I found a number of extensions that will abuse this power to hijack website…",
          "link": "https://palant.info/2023/06/14/why-browser-extension-games-need-access-to-all-websites/",
          "publishedOn": "2023-06-14T14:18:00.000Z",
          "wordCount": null,
          "title": "Why browser extension games need access to all websites",
          "imageUrl": null
        },
        {
          "id": "https://palant.info/2023/06/08/another-cluster-of-potentially-malicious-chrome-extensions/",
          "author": null,
          "description": "We’ve already seen Chrome extensions containing obfuscated malicious code. We’ve also seen PCVARK’s malicious ad blockers. When looking for more PCVARK extensions, I stumbled upon an inconspicuous extension called “Translator - Select to Translate.” The only unusual thing about it were its reviews, lots of raving positive reviews mixed with usability complains. That, and the permissions: why does a translator extension need webRequest and webRequestBlocking permissions?\nWhen I looked into this extension, I immediately discovered a strange code block. Supposedly, it was buggy locale processing. In reality, it turned out to be an obfuscated malicious logic meant to perform affiliate fraud.\nThat extension wasn’t alone. I kept finding similar extensions until I had a list of 109 extensions, in…",
          "link": "https://palant.info/2023/06/08/another-cluster-of-potentially-malicious-chrome-extensions/",
          "publishedOn": "2023-06-08T12:10:27.000Z",
          "wordCount": null,
          "title": "Another cluster of potentially malicious Chrome extensions",
          "imageUrl": null
        },
        {
          "id": "https://palant.info/2023/06/05/introducing-pcvark-and-their-malicious-ad-blockers/",
          "author": null,
          "description": "It isn’t news that the overwhelming majority of ad blockers in Chrome Web Store is either outright malicious or waiting to accumulate users before turning malicious. So it wasn’t a surprise that the very first ad blocker I chose semi-randomly (Adblock Web with 700,000 users) turned out malicious. Starting from it, I found another malicious extension (Ad-Blocker, 700,000 users) and two more that have been removed from Chrome Web Store a year ago (BitSafe Adblocker and Adblocker Unlimited).\n\n\nAll these ad blockers and probably some more were developed by the company PCVARK. According to Malwarebytes Labs, this company specializes in developing “potentially unwanted programs.” In other words: they show users warnings about alleged compromise, only to push them into installing their software. …",
          "link": "https://palant.info/2023/06/05/introducing-pcvark-and-their-malicious-ad-blockers/",
          "publishedOn": "2023-06-05T12:04:38.000Z",
          "wordCount": null,
          "title": "Introducing PCVARK and their malicious ad blockers",
          "imageUrl": null
        },
        {
          "id": "https://palant.info/2023/06/02/how-malicious-extensions-hide-running-arbitrary-code/",
          "author": null,
          "description": "Two days ago I wrote about the malicious extensions I discovered in Chrome Web Store. At some point this article got noticed by Avast. Once their team confirmed my findings, Google finally reacted and started removing these extensions. Out of the 34 extensions I reported, only 8 extensions remain. These eight were all part of an update where I added 16 extensions to my list, an update that came too late for Avast to notice.\nNote: Even for the removed extensions, it isn’t “mission accomplished” yet. Yes, the extensions can no longer be installed. However, the existing installations remain. From what I can tell, Google didn’t blocklist these extensions yet.\nAvast ran their own search, and they found a bunch of extensions that I didn’t see. So how come they missed eight extensions? The reason…",
          "link": "https://palant.info/2023/06/02/how-malicious-extensions-hide-running-arbitrary-code/",
          "publishedOn": "2023-06-02T10:11:33.000Z",
          "wordCount": null,
          "title": "How malicious extensions hide running arbitrary code",
          "imageUrl": null
        },
        {
          "id": "https://palant.info/2023/05/31/more-malicious-extensions-in-chrome-web-store/",
          "author": null,
          "description": "Two weeks ago I wrote about the PDF Toolbox extension containing obfuscated malicious code. Despite reporting the issue to Google via two different channels, the extension remains online. It even gained a considerable number of users after I published my article.\nA reader tipped me off however that the Zoom Plus extension also makes a request to serasearchtop[.]com. I checked it out and found two other versions of the same malicious code. And I found more extensions in Chrome Web Store which are using it.\nSo now we are at 18 malicious extensions with a combined user count of 55 million. The most popular of these extensions are Autoskip for Youtube, Crystal Ad block and Brisk VPN: nine, six and five million users respectively.\nUpdate (2023-06-01): With an increased sample I was able to find…",
          "link": "https://palant.info/2023/05/31/more-malicious-extensions-in-chrome-web-store/",
          "publishedOn": "2023-05-31T11:37:16.000Z",
          "wordCount": null,
          "title": "More malicious extensions in Chrome Web Store",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Preshing on Programming",
      "feedUrl": "http://preshing.com/feed",
      "siteUrl": "https://preshing.com/feed",
      "articles": []
    },
    {
      "title": "research!rsc",
      "feedUrl": "https://research.swtch.com/feed.atom",
      "siteUrl": "http://research.swtch.com/feed.atom",
      "articles": []
    },
    {
      "title": "AEP코리아네트",
      "feedUrl": "https://rss.blog.naver.com/aepkoreanet.xml",
      "siteUrl": "https://blog.naver.com/aepkoreanet",
      "articles": []
    },
    {
      "title": "애자일 이야기",
      "feedUrl": "http://rss.egloos.com/blog/agile",
      "siteUrl": "http://agile.egloos.com",
      "articles": []
    },
    {
      "title": "The Shape of Code",
      "feedUrl": "https://shape-of-code.com/feed/",
      "siteUrl": "https://shape-of-code.com",
      "articles": [
        {
          "id": "https://shape-of-code.com/?p=7945",
          "author": "Derek Jones",
          "description": "WebAssembly is an assembly-like language intended to be executed by web browsers on an internal stack machine. The intent is that compilers for high-level languages (i.e., C, Cobol, and C#) treat WebAssembly just like they would the assembly language of a cpu. Some substantial applications have been ported, e.g., the R statistical environment, which is […]",
          "link": "https://shape-of-code.com/2023/06/18/webassembly-vs-javascript-performance-2023-edition/",
          "publishedOn": "2023-06-18T22:25:16.000Z",
          "wordCount": 1663,
          "title": "WebAssembly vs JavaScript performance: 2023 edition",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=7912",
          "author": "Derek Jones",
          "description": "This week I have been investigating the impact of perturbing the evaluation of random floating-point expressions. In particular, the impact of adding 1 (and larger values) at a random point in an expression containing many binary operators (simply some combination of add/multiply). What mechanisms make it possible for the evaluation of an expression to be […]",
          "link": "https://shape-of-code.com/2023/06/11/perturbed-expressions-may-recover/",
          "publishedOn": "2023-06-11T22:25:35.000Z",
          "wordCount": null,
          "title": "Perturbed expressions may ‘recover’",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=7893",
          "author": "Derek Jones",
          "description": "The implementation of scientific/engineering applications requires evaluating many expressions, and can involve billions of adds and multiplies (divides tend to be much less common). Input values percolate through an application, as it is executed. What impact does the form of the expressions evaluated have on the shape of the output distribution; in particular: What is […]",
          "link": "https://shape-of-code.com/2023/06/04/distribution-of-add-multiply-expression-values/",
          "publishedOn": "2023-06-04T22:37:08.000Z",
          "wordCount": null,
          "title": "Distribution of add/multiply expression values",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=7880",
          "author": "Derek Jones",
          "description": "I recently discovered the book A Handbook of Software and Systems Engineering: Empirical Observations, Laws and Theories by Albert Endres and Dieter Rombach, completed in 2002. The preface says: “This book is about the empirical aspects of computing. … we intend to look for rules and laws, and their underlying theories.” While this sounds a […]",
          "link": "https://shape-of-code.com/2023/05/28/an-evidence-based-software-engineering-book-from-2002/",
          "publishedOn": "2023-05-28T22:25:46.000Z",
          "wordCount": null,
          "title": "An evidence-based software engineering book from 2002",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Stacey on IoT | Internet of Things news and analysis",
      "feedUrl": "https://staceyoniot.com/feed/",
      "siteUrl": "https://staceyoniot.com/",
      "articles": [
        {
          "id": "https://staceyoniot.com/?p=12538",
          "author": "Kevin C. Tofel",
          "description": "On a recent Internet of Things podcast episode, we took a voicemail from Greg on our podcast hotline. Greg’s property has a fence in the back so it’s not close to the house.. He uses HomeKit today but is planning to add a Hubitat hub as well for Z-Wave support. Greg wants a Z-Wave deadbolt […]\nThe post Smart gate locks are still barred from the market appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/smart-gate-locks-are-still-barred-from-the-market/",
          "publishedOn": "2023-06-21T13:00:25.000Z",
          "wordCount": null,
          "title": "Smart gate locks are still barred from the market",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12550",
          "author": "Kevin C. Tofel",
          "description": "When the Google Pixel Tablet was announced, I was intrigued by the tablet but excited by the dock. From a smart home perspective, this combination appeared to be nirvana. It’s two products in one: A tablet and a smart display/speaker, right? Sort of. Yes, the tablet itself is quite good, but I still feel let-down […]\nThe post Google Pixel Tablet: A great tablet, a so-so smart home device appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/google-pixel-tablet-a-great-tablet-a-so-so-smart-home-device/",
          "publishedOn": "2023-06-20T14:04:31.000Z",
          "wordCount": 3342,
          "title": "Google Pixel Tablet: A great tablet, a so-so smart home device",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2023/06/IMG_1425.jpeg"
        },
        {
          "id": "https://staceyoniot.com/?p=12534",
          "author": "Stacey Higginbotham",
          "description": "The Federal Communications Commission (FCC) wants to get back into the business of regulating privacy. On Wednesday, Chairwoman Jessica Rosenworcel announced the agency had created a Privacy and Data Protection Task Force that will be led by Loyaan Egal, the head of the enforcement bureau. The task force will continue its investigation of the sale of consumers’ […]\nThe post The FCC launches a privacy task force focused on wireless appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/the-fcc-launches-a-privacy-task-force-focused-on-wireless/",
          "publishedOn": "2023-06-19T13:00:00.000Z",
          "wordCount": 2944,
          "title": "The FCC launches a privacy task force focused on wireless",
          "imageUrl": "https://i0.wp.com/staceyoniot.com/wp-content/uploads/2023/06/jessica-rosenworcel-press-photo-09122018-scaled-e1687120576880.jpg?fit=2035%2C1228&ssl=1"
        },
        {
          "id": "https://staceyoniot.com/?p=12531",
          "author": "Stacey Higginbotham",
          "description": "Hey Disney, are you in my Alexa? Amazon and Disney announced a partnership for the former company’s Amazon Echo devices and this week, we see, or rather hear, about the deal. You can now say “Hey, Disney!” to a supported Alexa smart speaker thanks to the first Amazon Custom Assistant implementation. Technically, this is called the Disney […]\nThe post IoT news of the week for June 16, 2023 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-june-16-2023/",
          "publishedOn": "2023-06-16T18:55:13.000Z",
          "wordCount": 2620,
          "title": "IoT news of the week for June 16, 2023",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2017/08/iot-news-week.jpg"
        },
        {
          "id": "https://staceyoniot.com/?p=12528",
          "author": "Stacey Higginbotham",
          "description": "We start this week’s show with a review of DeviceScript, a limited subset of the TypeScript programming language, built by Microsoft to bring a more modern programming option to connected device programing. Kevin downloaded the code and tried it out on a simulated device and shares his thoughts. Also in programming news, Google released a […]\nThe post Podcast: What it takes to put LTE on the moon appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-what-it-takes-to-put-lte-on-the-moon/",
          "publishedOn": "2023-06-15T13:00:13.000Z",
          "wordCount": 2194,
          "title": "Podcast: What it takes to put LTE on the moon",
          "imageUrl": "https://i0.wp.com/staceyoniot.com/wp-content/uploads/2023/06/STAT-in-girl-ear-with-airpod-scaled.jpg?fit=2560%2C1440&ssl=1"
        },
        {
          "id": "https://staceyoniot.com/?p=12511",
          "author": "Kevin C. Tofel",
          "description": "Microsoft last month introduced DeviceScript, a sub-set of the company’s TypeScript programming language, specifically for the IoT. DeviceScript apps are meant to bring a more modern coding approach to small connected devices that run on microcontrollers. Given my ongoing development education, I took a brief look at DeviceScript by installing it and running through some […]\nThe post A look at DeviceScript, Microsoft’s modern IoT coding language appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/a-look-at-devicescript-microsofts-modern-iot-coding-language/",
          "publishedOn": "2023-06-14T15:23:18.000Z",
          "wordCount": null,
          "title": "A look at DeviceScript, Microsoft’s modern IoT coding language",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12495",
          "author": "Stacey Higginbotham",
          "description": "This story was originally published on June 9, 2023 in my weekly IoT newsletter. You can subscribe to it here.  One of the underreported aspects of the Federal Trade Commission’s two settlements with Amazon and its Ring division was that Amazon would need to cull face data gathered by Ring cameras and children’s data gathered from Alexa devices and […]\nThe post Xailient wants to create a privacy-driven AI vision pipeline appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/xailient-wants-to-create-a-privacy-driven-ai-vision-pipeline/",
          "publishedOn": "2023-06-13T13:00:05.000Z",
          "wordCount": null,
          "title": "Xailient wants to create a privacy-driven AI vision pipeline",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12498",
          "author": "Stacey Higginbotham",
          "description": "ABB Group, and industrial giant, has purchased Eve Systems, a maker of connected switches, plugs and sensors that work with Thread, HomeKit, and Matter. Terms of the deal were not disclosed, but the deal has been in works for at least the last six or seven months, said Jerome Gackel, CEO of Eve. I can’t […]\nThe post ABB Systems purchased Eve in a bid for smart energy appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/abb-systems-purchased-eve-in-a-bid-for-smart-energy/",
          "publishedOn": "2023-06-12T15:07:28.000Z",
          "wordCount": null,
          "title": "ABB Systems purchased Eve in a bid for smart energy",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12492",
          "author": "Stacey Higginbotham",
          "description": "This story was originally published on June 9, 2023 in my weekly IoT newsletter. You can subscribe to it here.  For the last year or so, I’ve been scoffing at the concept of the industrial metaverse. Microsoft, Nvidia, Siemens, and other big names in the computing and industrial manufacturing world have been promulgating this concept […]\nThe post Can Apple’s Vision Pro revive the industrial metaverse? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/can-apples-vision-pro-revive-the-industrial-metaverse/",
          "publishedOn": "2023-06-12T13:00:45.000Z",
          "wordCount": null,
          "title": "Can Apple’s Vision Pro revive the industrial metaverse?",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12490",
          "author": "Stacey Higginbotham",
          "description": "This company wants to launch a satellite-based Bluetooth network: Yes, this story initially seems bonkers, mostly because Bluetooth is a short-range technology that couldn’t possibly work from space. But Seattle’s Hubble Networks wants to build a constellation of 300 satellites with technology that essentially “magnifies” Bluetooth signals to let them travel up to 1,000 kilometers (621.4 miles). The company […]\nThe post IoT news of the week for June 9, 2023 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-june-9-2023/",
          "publishedOn": "2023-06-09T18:39:58.000Z",
          "wordCount": null,
          "title": "IoT news of the week for June 9, 2023",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12484",
          "author": "Stacey Higginbotham",
          "description": "It may not surprise anyone, but Kevin and I have thoughts on Apple’s Vision Pro mixed reality headset that we’re sharing with y’all. We also lay out some details about changes to Apple’s various operating systems and services that relate to Siri and the smart home. Google also added Matter support for its Home app […]\nThe post Podcast: Our take on Apple’s Vision Pro and fixes for bad air appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-our-take-on-apples-vision-pro-and-fixes-for-bad-air/",
          "publishedOn": "2023-06-08T13:00:47.000Z",
          "wordCount": null,
          "title": "Podcast: Our take on Apple’s Vision Pro and fixes for bad air",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12451",
          "author": "Kevin C. Tofel",
          "description": "On a recent Internet of Things podcast episode, we took a voicemail question left on our podcast hotline. The caller is doing a home renovation and will have access inside the walls. He’s trying to plan ahead for his smart home and wants to know what he should do from a low-voltage and high-voltage wiring […]\nThe post Should you install low-voltage wiring for your smart home in 2023? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/should-you-install-low-voltage-wiring-for-your-smart-home-in-2023/",
          "publishedOn": "2023-06-08T11:00:50.000Z",
          "wordCount": null,
          "title": "Should you install low-voltage wiring for your smart home in 2023?",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12459",
          "author": "Kevin C. Tofel",
          "description": "I’m sure by now, you’ve seen or heard about Apple Vision Pro, the company’s $3,499 spatial computing headset. If you haven’t, this nine minute video will quickly catch you up: Reactions from those who have, and those who haven’t, used it are very polarizing. The former are uniformly blown away by the technology and experience. […]\nThe post Love it or hate it, the Apple Vision Pro is a game changer appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/love-it-or-hate-it-the-apple-vision-pro-is-a-game-changer/",
          "publishedOn": "2023-06-07T15:24:13.000Z",
          "wordCount": null,
          "title": "Love it or hate it, the Apple Vision Pro is a game changer",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12447",
          "author": "Stacey Higginbotham",
          "description": "Middleware is so extremely boring that if I’m bothering to cover a company’s middleware product, it must be doing something pretty important. And in the case of ReelyActive, it really is. ReelyActive was formed in 2012 as a Bluetooth expert that built Bluetooth Low Energy (BLE) location apps and services. But today it has pivoted to become […]\nThe post ReelyActive is making Bluetooth sensors enterprise-friendly appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/reelyactive-is-making-bluetooth-sensors-enterprise-friendly/",
          "publishedOn": "2023-06-06T16:37:19.000Z",
          "wordCount": null,
          "title": "ReelyActive is making Bluetooth sensors enterprise-friendly",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12418",
          "author": "Kevin C. Tofel",
          "description": "Have you ever seen the 1999 movie “Bicentennial Man”? It stars Robin Williams as an android who, over its 200-year lifespan, strives to become human. I won’t spoil the plot but instead note that watching this movie 24 years ago gave me hope that I’d one day have a home robot act as a personal butler. […]\nThe post Privacy and AI in the coming age of home robots appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/privacy-and-ai-in-the-coming-age-of-home-robots/",
          "publishedOn": "2023-06-05T13:00:42.000Z",
          "wordCount": null,
          "title": "Privacy and AI in the coming age of home robots",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12443",
          "author": "Stacey Higginbotham",
          "description": "The FTC fines Amazon over Ring and Alexa privacy violations: The Federal Trade Commission is gunning for Amazon with a $5.8 million fine for its Ring security business and a $25 million fine for Alexa. The FTC had filed a lawsuit against Ring over what it called deceptive trade practices surrounding Ring’s collection of facial data; […]\nThe post IoT news of the week for June 2, 2023 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-june-2-2023/",
          "publishedOn": "2023-06-02T19:00:18.000Z",
          "wordCount": null,
          "title": "IoT news of the week for June 2, 2023",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12440",
          "author": "Stacey Higginbotham",
          "description": "Krogers and Walmart are both expanding various IoT devices to more of their stores as part of a larger shift in how connectivity and intelligence will change how we shop. Walmart is deploying electronic shelf labels in 500 stores while Kroger is installing Cooler Screens’ connected refrigerator doors that replace the glass doors with a […]\nThe post Podcast: Smarter grocery stores are coming appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-smarter-grocery-stores-are-coming/",
          "publishedOn": "2023-06-01T13:00:17.000Z",
          "wordCount": null,
          "title": "Podcast: Smarter grocery stores are coming",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12413",
          "author": "Stacey Higginbotham",
          "description": "This story was originally published on Friday, May 26 in my weekly newsletter. You can sign up for it here.  Concerns about the economy and anemic home sales are a potential problem for the smart home, according to conversations I had with attendees at the Parks Associates Connections smart home event in Dallas this week. […]\nThe post The economy is stalling the adoption of the smart home appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/the-economy-is-stalling-the-adoption-of-the-smart-home/",
          "publishedOn": "2023-05-31T14:13:03.000Z",
          "wordCount": null,
          "title": "The economy is stalling the adoption of the smart home",
          "imageUrl": null
        },
        {
          "id": "https://staceyoniot.com/?p=12408",
          "author": "Stacey Higginbotham",
          "description": "This story was originally published on Friday, May 26 in my weekly newsletter. You can sign up for it here.  I’m currently in Dallas for the Parks Associates Connections conference, where it’s clear that the smart home industry is laser-focused on five big topics. And while the mood here is fairly grim with regards to […]\nThe post My five big takeaways from this week’s big smart home event appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/my-five-big-takeaways-from-this-weeks-big-smart-home-event/",
          "publishedOn": "2023-05-30T15:46:44.000Z",
          "wordCount": null,
          "title": "My five big takeaways from this week’s big smart home event",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Blog – Modern Embedded Software | Quantum Leaps",
      "feedUrl": "https://www.state-machine.com/category/blog/feed",
      "siteUrl": "https://www.state-machine.com",
      "articles": []
    },
    {
      "title": "IT의 중심에서",
      "feedUrl": "https://subokim.wordpress.com/feed/",
      "siteUrl": "https://subokim.wordpress.com",
      "articles": [
        {
          "id": "http://subokim.wordpress.com/?p=12424",
          "author": "subokim",
          "description": "하지만, 기술철학을 바이블처럼 받아들이게 되면 제작의도를 지키려 노력한다.\n꽤 생각보다 아래 같은 케이스가 많다.\n\n\"이건 이렇게 되어야 하는데, 현실은 이래서 안되요.\"\n\"이건 이렇게 하려고 만든 기술인데, 이걸 고치게 되면 사고가 날거예요. 전 책임 없습니다.\"\n\n문제 해결보다는, 자기가 얼마나 훌륭한 학생인지 증명하고 싶어 한다.\n가장 흔한 케이스가 \"어떤 언어가 더 우월한가?\" 하는 논쟁이다.",
          "link": "https://subokim.wordpress.com/2023/06/11/software-is-not-bible/",
          "publishedOn": "2023-06-11T03:43:55.000Z",
          "wordCount": null,
          "title": "소프트웨어 기술을 바이블화하면 안된다.",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Pasture",
      "feedUrl": "https://thephd.dev/feed",
      "siteUrl": "https://thephd.dev/",
      "articles": [
        {
          "id": "https://thephd.dev/cuneicode-and-the-future-of-text-in-c",
          "author": null,
          "description": "Following up from the last post, there is a lot more we need to cover. This was intended to be the post where we talk exclusively about benchmarks and numbers. But, I have unfortunately been perfectly taunted and status-locked",
          "link": "https://thephd.dev/cuneicode-and-the-future-of-text-in-c",
          "publishedOn": "2023-06-07T00:00:00.000Z",
          "wordCount": null,
          "title": "cuneicode, and the Future of Text in C",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Vivonomicon's Blog",
      "feedUrl": "https://vivonomicon.com/feed/",
      "siteUrl": "https://vivonomicon.com",
      "articles": []
    },
    {
      "title": "zserge's blog",
      "feedUrl": "https://zserge.com/rss.xml",
      "siteUrl": "https://zserge.com/",
      "articles": []
    },
    {
      "title": "The Boston Globe",
      "feedUrl": "https://www.bostonglobe.com/rss/bigpicture",
      "siteUrl": "https://www.bostonglobe.com",
      "articles": []
    },
    {
      "title": "이바닥늬우스",
      "feedUrl": "https://ebadak.news/feed",
      "siteUrl": "https://ebadak.news",
      "articles": []
    },
    {
      "title": "economic view",
      "feedUrl": "http://feeds.feedburner.com/Economic_View",
      "siteUrl": "http://economicview.net",
      "articles": []
    },
    {
      "title": "슬로우뉴스",
      "feedUrl": "https://feeds.feedburner.com/slownews",
      "siteUrl": "https://slownews.kr",
      "articles": [
        {
          "id": "https://slownews.kr/?p=91757",
          "author": "이정환",
          "description": "엘리엇매니지먼트가 한국 정부를 상대로 낸 소송에서 한국 정부가 패소했다. 9900억 원의 손해 배상을 청구했는데 7%만 인정됐다. 그래도 크다. 690억 원에 법무 비용과 이자까지 포함하면 1300억 원을 지급해야 한다. 이 사건이 왜 중요한가. 이 사건의 본질은 이것이다. 더 깊게 들어가 볼까. 들통날 걸 몰랐을까. 사실상의 승소? 선방한 건 맞나. 다시 정리해 보면, 여기서 끝이 아니다. 론스타...\nThe post [컨텍스트] 1300억 원은 박근혜와 이재용이 내야 한다. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91757",
          "publishedOn": "2023-06-21T06:21:48.000Z",
          "wordCount": null,
          "title": "[컨텍스트] 1300억 원은 박근혜와 이재용이 내야 한다.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91742",
          "author": "이정환",
          "description": "대통령 명 받들어 ‘사교육과의 전쟁’. 2030 엑스포는 부산, 리야드, 로마 3파전. 민주당 혁신위도 친명 논란. 기자협회 설문, 80%가 “이동관 방통위원장 반대”. 오늘의 TMI. 인천 세관에서 마약 60% 잡는다. 영국은 코로나 청문회 연다. 삼성물산 투자한 헤지펀드에 한국 정부가 690억 원 물어줘야 한다. 5000억 원 주는 글로컬 대학, 혁신에 점수를 줬다. 가불도 복지? “예상보다 반응 좋아 깜짝...\nThe post “13초 동안 브레이크를 잘못 밟을 순 없다”, 첫 급발진 인정: 슬로우레터 6월20일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91742",
          "publishedOn": "2023-06-20T22:06:18.000Z",
          "wordCount": null,
          "title": "“13초 동안 브레이크를 잘못 밟을 순 없다”, 첫 급발진 인정: 슬로우레터 6월20일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91685",
          "author": "이정환",
          "description": "물 수능 아니고 킬러 문항만 뺀다. “불체포 특권 포기하겠다.” 주가조작은 감옥에 가도 남는 장사. 더 깊게 읽기. ‘에듀푸어’가 ‘실버푸어’ 부른다. 정부가 왜 라면값까지 흔드나. 한은과 정부의 ‘물가 이몽’. 윤석열도 캠코더 인사? 조선일보까지 불만. 레딧의 주인은 누구인가? 이용자들 집단 시위. 오늘의 TMI. 명동역에 남산 곤돌라 만든다. 학폭 재판 불출석, 권경애 정직 1년. 청소년 우울증 19% 늘었다....\nThe post 검찰 공화국의 수능, 수험생들 대혼란: 슬로우레터 6월20일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91685",
          "publishedOn": "2023-06-19T22:02:08.000Z",
          "wordCount": 4812,
          "title": "검찰 공화국의 수능, 수험생들 대혼란: 슬로우레터 6월20일.",
          "imageUrl": "https://i0.wp.com/slownews.kr/wp-content/uploads/2023/06/GettyImages-1394816859.jpg"
        },
        {
          "id": "https://slownews.kr/?p=91680",
          "author": "민주언론시민연합",
          "description": "윤석열 정부 1년을 경과하고 있는 오늘날, 한국 사회는 모든 분야에서 거대한 퇴행을 목도하고 있다. “바이든 날리면” 사태를 시작으로 국가지도자들의 거짓과 궤변은 일상화됐고 권력을 감시해야 할 언론은 침묵하거나 동조하고 있다. 영국 로이터저널리즘연구소 ‘디지털뉴스리포트 2022’에 따르면 한국의 뉴스 신뢰도는 최하위 수준으로 조사됐지만, 주요 언론은 보도조차 하지 않고 있다. 현 정부 출범 이후 많은 전문가가 걱정하는 분야가 미일...\nThe post ‘건폭’ 외친 노사법치주의의 파탄: 부조리 신고 85%가 ‘사측 불법’ appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91680",
          "publishedOn": "2023-06-19T08:23:23.000Z",
          "wordCount": 3827,
          "title": "‘건폭’ 외친 노사법치주의의 파탄: 부조리 신고 85%가 ‘사측 불법’",
          "imageUrl": "https://i0.wp.com/slownews.kr/wp-content/uploads/2023/06/GettyImages-1396560355.jpg"
        },
        {
          "id": "https://slownews.kr/?p=91673",
          "author": "정혜승",
          "description": "“아, 요즘 시간이 없어서 못봤어” 내 목소리가 마치 변명처럼 들렸다. 유행을 놓친게 내 탓인 것 처럼, 꼭 봐야 하는데 아직 못봤으면 불안한 것 처럼. 영화든 넷플릭스든, 돈만 내고 방치한 애플이나 ‘무빙’ 나오면 결제할 디즈니라든지, 웨이브, 티빙, 쿠팡은 그렇다치고 난 카카오페이지, 네이버시리즈 호구다. 볼 게 너무 많은 시대가 문제다. 하여, 사람들은 ‘빨리 감기’를 택한다. 책 제목을...\nThe post 꿈에서도 가성비 찾는 시대: ‘영화를 빨리 감기로 보는 사람들’ (2022) appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91673",
          "publishedOn": "2023-06-19T05:47:21.000Z",
          "wordCount": 3930,
          "title": "꿈에서도 가성비 찾는 시대: ‘영화를 빨리 감기로 보는 사람들’ (2022)",
          "imageUrl": "https://i0.wp.com/slownews.kr/wp-content/uploads/2023/06/GettyImages-489673880.jpg"
        },
        {
          "id": "https://slownews.kr/?p=91660",
          "author": "이정환",
          "description": "“물 수능 아니다”, 강남의 분노 잠재울 수 있을까. 국정원 인사 파동, 핵심은 파벌. “법 잘 아시는 분이 왜 이러시나.” 라면 값 내려라, 추경호의 지시가 문제인 이유. 오늘 서울 35도 폭염. 20대 자발적 백수 35만 명. “나를 살린 교수”, 주석중의 죽음. 더 깊게 읽기. 사모펀드 먹잇감이 된 버스. 학폭 즉시 분리가 보복 신고 부른다. 똥물에서 일한다고...\nThe post 대통령실 김건희 사진, 의도를 알 수 없다: 슬로우레터 6월19일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91660",
          "publishedOn": "2023-06-18T21:54:15.000Z",
          "wordCount": 4809,
          "title": "대통령실 김건희 사진, 의도를 알 수 없다: 슬로우레터 6월19일.",
          "imageUrl": "https://i0.wp.com/slownews.kr/wp-content/uploads/2023/06/cDu25Ud009M7648965cb7f94c6.76005129.jpg"
        },
        {
          "id": "https://slownews.kr/?p=91647",
          "author": "이정환",
          "description": "“어항을 깨주세요.” 천일염 네 배 뛰었다. 수능 쉬워진다, 과학 같은 국어 문제도 없앤다. 권익위원장도 검사 출신? 민주당 혁신위원장은 김은경. 호반건설에 과징금 608억 원. 쟁점과 논란. ‘태양광 대못’ 뽑는다고? 판례로 남을 노란봉투법, 보수 언론은 ‘바들바들’. 오늘의 TMI. 이번 주말 폭염, 35도까지 오른다. 현수막 정치, 석 달 동안 1300톤 분량. 100만 원에 11만 엔, 엔테크 열풍. 노노(老老)학대,...\nThe post 어항을 깨주세요, 국가의 역할은?: 슬로우레터 6월16일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91647",
          "publishedOn": "2023-06-15T22:13:13.000Z",
          "wordCount": 4627,
          "title": "어항을 깨주세요, 국가의 역할은?: 슬로우레터 6월16일.",
          "imageUrl": "https://i0.wp.com/slownews.kr/wp-content/uploads/2023/06/GettyImages-1485035590.jpg"
        },
        {
          "id": "https://slownews.kr/?p=91639",
          "author": "민주언론시민연합",
          "description": "민주언론시민연합은 2011년부터 종합편성채널 시사 프로그램을 모니터해오고 있습니다, 2019년 7월 22일부터 2021년 5월 14일까지 방영된 JTBC [전용우의 뉴스ON]도 모니터 대상 프로그램이었는데요. 방송 마지막 코너로 운영되던 ‘라이브 썰전’에는 전용우 진행자와 함께 이동관 전 청와대 홍보수석, 김종배 시사평론가가 출연해 다양한 정치 현안에 대해 토론했습니다. 생방송으로 진행된 토론에는 이동관 전 수석의 감정적이며 시청자의 눈살을 찌푸리게 하는 부적절한 언행이 반복적으로...\nThe post “충분히 길들여진 KBS”(이동관), 이 분 방통위원장 후보 맞나요? appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91639",
          "publishedOn": "2023-06-15T05:18:39.000Z",
          "wordCount": 4965,
          "title": "“충분히 길들여진 KBS”(이동관), 이 분 방통위원장 후보 맞나요?",
          "imageUrl": "https://i0.wp.com/slownews.kr/wp-content/uploads/2023/06/d5ed9b205f563fa73c1f9c2c9eb1b06c.jpg"
        },
        {
          "id": "https://slownews.kr/?p=91610",
          "author": "이정환",
          "description": "조국 출마설 3대 쟁점. 총선 D-300, 무당층이 31%. 벨라루스에 러시아 핵무기 배치. 트럼프 재판은 내년 3월부터. “한일 관계 잘 풀었다”, 한국은 47%, 일본은 84%. “연락사무소 폭파 배상하라” 북한에 447억 원 청구. 수신료 분리 찬성이 96%? 중복 답변 많았다. 김건희가 VIP? 끌려나간 작가들. 쟁점과 논란. 태양광 때리기, 뻔히 드러나는 정치적 의도. “정권의 돌격대가 된 감사원”. 오늘의...\nThe post 퇴로 없는 외교, “대통령의 입이 문제다”: 슬로우레터 6월15일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91610",
          "publishedOn": "2023-06-14T22:04:33.000Z",
          "wordCount": 4561,
          "title": "퇴로 없는 외교, “대통령의 입이 문제다”: 슬로우레터 6월15일.",
          "imageUrl": "https://i0.wp.com/slownews.kr/wp-content/uploads/2023/06/tRLs9ZukcGwm648966e6429e71.62911100.jpg"
        },
        {
          "id": "https://slownews.kr/?p=91597",
          "author": "민주언론시민연합",
          "description": "[인터뷰] ‘다단계 주가조작’ 탐사보도한 JTBC 취재팀, 2023년 5월 ‘민언련 이달의 좋은 보도상’ 2023년 4월 24일 월요일, 국내 주식시장에서 8개 종목이 하한가로 직행했다. 코스피에서 서울가스·대성홀딩스·삼천리·세방·다올투자증권, 코스닥에서 하림지주·다우데이타·선광의 주가가 전 거래일 대비 가격제한폭(-30%)까지 내렸다. 업종이 같지도, 같은 테마주로 묶이지도 않았다. 다만 SG증권이란 외국계 증권사를 통해 매도물량이 나왔다는 이유로 ‘SG증권발 주가폭락 사태’로 불렸다. 그제야 증권업계, 금융당국이 이들의 공통점을...\nThe post 아젠다 키핑의 힘: ‘SG증권발 주가폭락 사태’ 특종보도한 JTBC 취재팀 appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91597",
          "publishedOn": "2023-06-14T04:12:24.000Z",
          "wordCount": null,
          "title": "아젠다 키핑의 힘: ‘SG증권발 주가폭락 사태’ 특종보도한 JTBC 취재팀",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91587",
          "author": "정혜승",
          "description": "The post 고통의 기억, 공통의 기억: ‘궤도 이탈'(2018) appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91587",
          "publishedOn": "2023-06-14T02:50:58.000Z",
          "wordCount": null,
          "title": "고통의 기억, 공통의 기억: ‘궤도 이탈'(2018)",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91512",
          "author": "슬로우뉴스",
          "description": "[인터뷰] 가해자와 피해자 모두를 경험했던 고등 2학년 여학생 교육부 학교폭력 실태조사에 따르면 학교폭력 가운데 신체적 폭력은 9%(복수 답변 포함) 정도다. 언어 폭력이 42%, 집단 따돌림이 15%를 차지했다. 스토킹과 사이버 폭력도 각각 13%와 6%였다. 피해학생이 죽을 정도로 괴로워했다던 정순신 아들 사건 때도 신체적 폭력은 없었다. 법무법인 경 정연순 변호사가 “학교폭력이란 말이 문제의 본질을 흐린다”고 했던 건...\nThe post “‘은따’로 겪었던 절망, 물리적인 폭력이 전부가 아니에요” appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91512",
          "publishedOn": "2023-06-13T23:00:45.000Z",
          "wordCount": 5125,
          "title": "“‘은따’로 겪었던 절망, 물리적인 폭력이 전부가 아니에요”",
          "imageUrl": "https://i0.wp.com/slownews.kr/wp-content/uploads/2023/06/GettyImages-1387900704.jpg"
        },
        {
          "id": "https://slownews.kr/?p=91390",
          "author": "슬로우뉴스",
          "description": "[인터뷰] 참교육학부모연대 이윤경 회장과 김경희 부회장, “학교 밖 해법, 갈등 조정과 화해 중재가 빠졌다” 드라마 ‘더 글로리’와 정순신 아들, 이동관 아들까지 일련의 학교폭력 이슈를 겪으면서 한국 사회의 분노의 강도가 더욱 높아지고 있다. 한 사람의 인생을 파국으로 몰아붙이면서 가해자들은 처벌을 피하고 좋은 대학에 가고 아무런 걱정 없이 잘 살고 있는 것처럼 보인다. 현실은 드라마와 달라서 생활기록부에...\nThe post “학폭위 갔으니까 입 다물어”… 시장이 된 학폭, 변호사들만 신났다 appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91390",
          "publishedOn": "2023-06-13T22:13:40.000Z",
          "wordCount": 7427,
          "title": "“학폭위 갔으니까 입 다물어”… 시장이 된 학폭, 변호사들만 신났다",
          "imageUrl": "https://i0.wp.com/slownews.kr/wp-content/uploads/2023/06/GettyImages-jv11187750.jpg"
        },
        {
          "id": "https://slownews.kr/?p=91555",
          "author": "이정환",
          "description": "“위안스카이가 떠오른다.” 조국 파면. 문재인 정부 태양광 때리기, 감사원이 나섰다. 성 범죄자 죽은 뒤 4년 지나도 처벌 계속된다. 더 깊게 읽기. 나랏 돈 덜 쓰겠다는 재정준칙, 밀어붙이는 이유는? 간호사들 해외로 떠난다. 공공 병원이 죽어간다. 머그샷 공개 여론 높은데. 소수인종 우대 폐지하나. 뭉치 복용자 117만 명. 20년 뒤 인구 변화, 식당 종사자 33만 명 준다. 오늘의...\nThe post “선관위 팔 비틀어 선거 이기면 시민들 승복할까”: 슬로우레터 6월14일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91555",
          "publishedOn": "2023-06-13T22:05:53.000Z",
          "wordCount": 4827,
          "title": "“선관위 팔 비틀어 선거 이기면 시민들 승복할까”: 슬로우레터 6월14일.",
          "imageUrl": "https://i0.wp.com/slownews.kr/wp-content/uploads/2023/06/S348rcfLlgzR64880629cc26a3.72609863.jpg"
        },
        {
          "id": "https://slownews.kr/?p=91546",
          "author": "슬로우뉴스",
          "description": "안용흔 (대구가톨릭대학교 교수) 대의민주주의 체제에서 시민들은 자신들의 문제를 해결하려 문제해결 과정에 직접 참여하기보다 ‘선거’를 통해 이의 적임자를 대표자로 선출하는 방식을 선택한다. 이들 시민 대표자는 의회라는 민주주의 제도적 장에서 자신들을 선출한 시민들의 요구사항을 대변하고, 이를 실현하기 위한 정책적 방안을 법률로 제정하려 전력한다. 시민 대표자의 재선 성공 여부는 이러한 입법적 노력 및 결실에 따라 결정되게 된다. 선거는...\nThe post 다당제로의 전환, 이제 두려워할 필요 없다 appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91546",
          "publishedOn": "2023-06-13T10:08:53.000Z",
          "wordCount": null,
          "title": "다당제로의 전환, 이제 두려워할 필요 없다",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91540",
          "author": "민주언론시민연합",
          "description": "집이나 여행지에서 아침에 새소리 때문에 잠에서 깬 적 있는가? 달콤한 아침잠을 깨운 새소리를 얄궂게 느낀 적도 있을 것이다. 누군가에게 아름다운 자연의 소리지만 또 다른 누군가에게 소음일 수 있는 새소리가 ‘아예 들리지 않는다’는 상상을 해본 적이 있는가? 새소리가 들리지 않는 이유가 버드킬(조류가 비행하던 중 유리나 투명판을 인지하지 못해 충돌한 후 사망하는 것) 때문이라면 더욱 상상하기 어려울...\nThe post 한 해 788만 개의 비극, 저 새는 왜 저기 누워있을까 appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91540",
          "publishedOn": "2023-06-13T09:46:30.000Z",
          "wordCount": null,
          "title": "한 해 788만 개의 비극, 저 새는 왜 저기 누워있을까",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91499",
          "author": "이정환",
          "description": "돈봉투 체포 동의안 부결 충격. 한동훈이 도발했나. 한덕수, “후쿠시마 오염수 마실 수 있다.” 이동관 아들 학폭, 피해자는 넷, 화해는 하나. TBS 시사 프로그램 없앴다. BTS 없는 BTS 10주년, 아미들이 몰려온다. 도쿄보다 비싼 서울. 우주 쓰레기, 토성 고리처럼 지구 감싼다. 젊은이들이 술을 안 마신다. 상반기 서울 아파트 54%가 역전세, 평균 1억 토해냈다. 더 깊게 읽기. 임금피크제...\nThe post 대기업 정규직 버스, 첫차가 막차 되는 걸 막아야 한다: 슬로우레터 6월13일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91499",
          "publishedOn": "2023-06-12T22:04:54.000Z",
          "wordCount": null,
          "title": "대기업 정규직 버스, 첫차가 막차 되는 걸 막아야 한다: 슬로우레터 6월13일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91487",
          "author": "민주언론시민연합",
          "description": "오늘날 한국 언론이 처한 어려움은 첩첩산중이다. 정치권력의 언론 공작이 시대에 따라 진화하는 현재 진행형이기 때문이다. 박정희, 전두환 시절 보도지침 등을 통한 직접적인 언론탄압 통제가 자행됐고, 이후에는 정치가 자본력을 동원하는 방식을 취하고 있다. 노태우는 신문을, 이명박은 방송을 대거 등장시켜 출혈 경쟁이 이뤄지도록 만들면서 언론의 제4부 역할을 약화시켰다. 이후 언론은 정치권의 입김에서 자유롭지 못한 거대자본 또는 포털의...\nThe post 언론의 진화, 공작의 진화: 신문에서 AI 시대까지 appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91487",
          "publishedOn": "2023-06-12T05:58:47.000Z",
          "wordCount": null,
          "title": "언론의 진화, 공작의 진화: 신문에서 AI 시대까지",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91467",
          "author": "이정환",
          "description": "이동관의 거짓말. 이재명 만난 중국 대사 불러서 경고. 조국 출마설? 보수 언론이 흘린다. 6.10 기념식에 정부 불참은 처음. ‘소아과 탈출’ 학술대회 열렸다. 홍채 인식으로 사람 증명하고 기본 소득 준다고? “우크라이나는 반격 중”, 공식 인정했다. 트럼프 기소, 미국 역사상 처음. 다르게 읽기. 전기요금 고지서에 절취선을 만든다고? 원전보다 네 배 비싼 태양광 사줬다. 오늘의 TMI. 날벼락이 는다....\nThe post 보수 언론이 흘리는 조국 출마설: 슬로우레터 6월12일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91467",
          "publishedOn": "2023-06-11T22:07:18.000Z",
          "wordCount": null,
          "title": "보수 언론이 흘리는 조국 출마설: 슬로우레터 6월12일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91429",
          "author": "이정환",
          "description": "‘가짜뉴스’는 없다. 말이 현실을 규정할 때가 있다. ‘가짜뉴스’라는 말 좀 쓰지 말자는 수많은 논의가 있었지만 여전히 ‘가짜뉴스’만큼 입에 딱 붙는 말이 없는 게 사실이다. “이건 허위 조작 정보입니다, 여러분” 보다는 “가짜뉴스에 속지 마세요”라는 게 훨씬 강력하다는 걸 부정하기는 어렵다. 대통령 윤석열이 워싱턴포스트와 인터뷰에서 “100년 전의 일을 가지고 무조건 무릎꿇어야 한 하는 것은 받아들일 수 없다”고...\nThe post 챗GPT 시대, 진실과 거짓의 경계가 더욱 흐려진다. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91429",
          "publishedOn": "2023-06-11T04:53:39.000Z",
          "wordCount": null,
          "title": "챗GPT 시대, 진실과 거짓의 경계가 더욱 흐려진다.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91418",
          "author": "이정환",
          "description": "챗GPT 초기 ‘세종대왕 맥북 던짐’ 사건 같은 건 유명한 인터넷 밈이 됐지만 더 큰 문제는 어디까지가 사실이고 어디까지가 헛소리인지 구분하기 어려운 상황으로 끌려 들어가고 있다는 것이다. ‘책임있는 AI’를 만들겠다고 선언했던 구글 바드 역시 챗GPT와 크게 다를바 없는 환각(hallucination) 현상을 쏟아내고 있다. 챗GPT를 만든 오픈AI의 수석 과학자 일리야 수츠케버는 “2년 안에 환각 문제는 크게 줄어들 것”이라고...\nThe post AI가 쓴 글과 사람이 쓴 글, AI도 잘 몰라본다. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91418",
          "publishedOn": "2023-06-10T15:19:38.000Z",
          "wordCount": null,
          "title": "AI가 쓴 글과 사람이 쓴 글, AI도 잘 몰라본다.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91398",
          "author": "민노씨",
          "description": "“이름은 사물 그 자체니까요. 그리고 참이름은 사물의 참된 본질이에요. 이름을 부른다는 것은 그 사물을 통제하는 것과 같습니다.” – 어슐러 K. 르 귄, [바람의 열두 방향] ‘이름의 법칙’ 중에서 지난 두 달 동안 학교폭력의 해법을 찾기 위해 그 문제(그 해법)에 가장 가까이 있는 사람들을 찾아 여쭤봤습니다. 고등학교 2학년 학생과 지방도시 중학교 상담교사, 각각 자신의 경험을 책으로...\nThe post 두 개의 마을: 학교폭력 취재 두 달 소회 appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91398",
          "publishedOn": "2023-06-10T02:37:55.000Z",
          "wordCount": null,
          "title": "두 개의 마을: 학교폭력 취재 두 달 소회",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91373",
          "author": "이정환",
          "description": "KBS 사장의 호소, “수신료 분리 징수 철회하면 사퇴한다.” 중국 대사 찾아간 이재명. 이동관 돌파, 자신감이 없나. ROTC 지원율 4분의 1, 부사관 지원율도 역대 최저. 전세 사기, 공인중개사들이 공범이었다. 해법과 대안. 다음 뉴스 댓글 폐지. 신정동 차량 기지, 안 옮기고 수서처럼 덮개 씌운다. 금리 6% 청년 도약 계좌 나온다. 2028년부터 교과서 대신 태블릿으로 수업. 오늘의 TMI....\nThe post 전세 사기, 공인중개사들이 공범이었다: 슬로우레터 6월9일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91373",
          "publishedOn": "2023-06-08T22:07:58.000Z",
          "wordCount": null,
          "title": "전세 사기, 공인중개사들이 공범이었다: 슬로우레터 6월9일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91369",
          "author": "민주언론시민연합",
          "description": "방송통신위원회가 결국 파국으로 가고 있다. 5월 30일 윤석열 대통령은 방송통신위원회 TV조선 재승인 심사 과정에 관여한 혐의로 기소된 한상혁 위원장에 대한 면직안을 재가했다. 한 위원장은 이에 부당함을 강조하며 6월 1일 서울행정법원에 면직처분 취소소송 및 집행정지 신청 등 법적 조치를 취했다. 위원장은 면직, 야당 추천 위원은 임명 보류 이로써 그동안 설로만 나돌던 윤석열 대통령의 방송통신위원회 장악 이후...\nThe post 총체적 난국, 방송통신위원회가 위험하다 appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91369",
          "publishedOn": "2023-06-08T03:28:19.000Z",
          "wordCount": null,
          "title": "총체적 난국, 방송통신위원회가 위험하다",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91359",
          "author": "참여연대 의정감시센터",
          "description": "미국 소재 비영리단체인 AI안전센터(Center for AI Safety) 홈페이지에는 ‘AI 위험에 관한 성명서(statement of A.I. risk)’와 함께, 6월 6일 현재 ‘챗지피티(ChatGPT)’를 개발한 오픈AI 대표 샘 알트만을 포함한 466명의 서명이 게시되어 있다. 성명서 내용은 다음과 같다. “AI로 인한 ‘멸종 위험(risk of extinction)’은 전염병·핵전쟁 같은 사회적 규모의 위험으로, 이를 완화하는 것이 지구적인 우선 과제가 되어야 한다.” AI 연구자,...\nThe post AI로 인한 멸종위험과 원자력 그리고 정치개혁 appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91359",
          "publishedOn": "2023-06-08T02:05:43.000Z",
          "wordCount": null,
          "title": "AI로 인한 멸종위험과 원자력 그리고 정치개혁",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91349",
          "author": "이정환",
          "description": "정순신보다 더 센 이동관 아들 학폭. 위기의 민주당. 체르노빌 참사 이후 최악의 환경 재앙. 글로벌 경기 회복, 한국만 빼고. ‘그냥 쉰다’는 청년 39만 명. 유엔 안보리 세 번째 진출. 노사정 대화 중단. 공노비나 마찬가지, 사회복무요원 64%가 “괴롭힘 경험”. 해법과 대안. 애 있어도 세금은 똑같이, 한국만 그렇다. 군인 부족해 부사관이 위병소 근무 선다. 그랜저 세금 부담...\nThe post 감당할 수 있을까, 정순신보다 더 센 이동관 아들 학폭: 슬로우레터 6월8일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91349",
          "publishedOn": "2023-06-07T22:56:27.000Z",
          "wordCount": null,
          "title": "감당할 수 있을까, 정순신보다 더 센 이동관 아들 학폭: 슬로우레터 6월8일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91297",
          "author": "이정환",
          "description": "“천안함은 자폭” 발언보다 문제는 이재명의 독단. 최강욱도 털었다. 누가 댐을 무너뜨렸나. 해법과 대안. 이대로면 또 잠긴다. 올 여름 폭포비 예고. 남성 육아휴직 허용 기간은 최장, 사용은 최저. 밀리의서재가 밀리터리의 서재? 배달 라이더와 대리 기사도 산재 보험 받는다. AI 상담원이 노인들 말벗 서비스. 오염수 어업 피해 보상, 일본은 7500억 원, 한국은 0원. 인천 쓰레기 매립지, 가스...\nThe post 퍼거슨 감독의 말이 옳았다: 슬로우레터 6월7일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91297",
          "publishedOn": "2023-06-06T22:02:15.000Z",
          "wordCount": null,
          "title": "퍼거슨 감독의 말이 옳았다: 슬로우레터 6월7일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91286",
          "author": "이정환",
          "description": "애플이 오늘(미국 시간 6월5일), ‘비전 프로(Vision Pro)’라는 이름으로 헤드셋(공간 컴퓨터)을 공개했다. 가격이 무려 3499달러다. 내년 봄에 미국부터 출시되는데 한국에 건너오면 500만 원을 넘길 가능성이 크다. 이게 왜 중요한가. 핵심은 이것이다. 몰입형 화상 회의, 이건 상상도 못했다. 오큘러스와 어떻게 다른가. 메타버스와 어떻게 다른가. 아쉬운 대목. 전망. (영화 ‘데몰리션 맨’의 한 장면. 공무 수행 도중 과실 치사로...\nThe post 공간 컴퓨팅? 애플은 메타버스를 언급하지 않았다. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91286",
          "publishedOn": "2023-06-06T15:26:51.000Z",
          "wordCount": null,
          "title": "공간 컴퓨팅? 애플은 메타버스를 언급하지 않았다.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91274",
          "author": "민주언론시민연합",
          "description": "포스코 하청업체 ㈜포운 노동자들은 지난해 4월 24일부터 임금교섭과 노동3권 보장 등을 요구하며 포스코 광양제철소 앞에서 천막농성을 벌여왔습니다. 400일 넘는 농성에도 원청 포스코가 교섭에 임하지 않자 한국노총 전국금속노동조합연맹 김준영 사무처장은 5월 29일, 광양제철소 앞 도로에 7m 높이 고공 농성장을 설치하고 협력사 노동권 보장을 요구했습니다. 고공농성 이틀째인 5월 31일, 경찰은 특수공무집행방해와 일반교통방해 등 혐의로 김 사무처장 제압에...\nThe post ‘정글도·쇠파이프’ 보도, 사실 ‘경찰봉 머리 공격’ appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91274",
          "publishedOn": "2023-06-05T06:16:49.000Z",
          "wordCount": null,
          "title": "‘정글도·쇠파이프’ 보도, 사실 ‘경찰봉 머리 공격’",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91242",
          "author": "참여연대 의정감시센터",
          "description": "국회에 방문하려 했다가 경찰에게 끌려나온 경험이 있으신가요? 아, 질문이 좀 빨랐습니다. 국회를 방문해본 적이 있으신가요? 많은 분들이 국회에 직접 찾아갈 일은 없을 것 같아요. 국회를 방문해본 적이 없으시더라도 서명을 해달라는 요청을 받으신 적은 있으시겠죠. 이런저런 법의 제정이나 개정을 위해서요. 10.29 이태원 참사 특별법을 제정하기 위해서라던가, 최근 전세사기, 깡통전세의 피해자들을 구제하기 위해서라던가요. 다른 서명도 있을 수...\nThe post 열려라 국회! 의원회관  문턱만 4단계 appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91242",
          "publishedOn": "2023-06-05T01:11:43.000Z",
          "wordCount": null,
          "title": "열려라 국회! 의원회관  문턱만 4단계",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91232",
          "author": "이정환",
          "description": "오늘 가장 뜨거운 이슈 셋. 선관위 경찰 수사 받겠다는데, 굳이 감사원이 나서는 상황. 민간단체 보조금도 때린다. 인도에서 철도 3중 충돌. 해법과 대안. 복지 등기가 1100가구 살렸다. 인천대교 빨간 드럼통이 자살 줄였다? 학생이 줄어드니 더 많은 실험을 하게 됐다. 학식 오픈런의 이면. 서울시 청년 수당 7000명 추가 모집. 총신대 혁신 이끈 시각장애인 총장. 원전 70% 프랑스가...\nThe post “사람이 안 나오면? 냄새부터 맡습니다”: 슬로우레터 6월5일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91232",
          "publishedOn": "2023-06-04T22:04:31.000Z",
          "wordCount": null,
          "title": "“사람이 안 나오면? 냄새부터 맡습니다”: 슬로우레터 6월5일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91183",
          "author": "이정환",
          "description": "테드 창이 파이낸셜타임스와 인터뷰했다. 이 신문은 ‘FT와 점심을(lunch with the FT)’이라는 코너를 운영하고 있는데 기자가 테드 창에게 연락해서 점심을 먹자 했더니 사생활을 이야기하지 않는 조건으로 흔쾌하게 수락했다고 한다. 다음은 테드 창의 인터뷰 가운데 흥미로운 대목과 관련 기사들을 정리한 것이다. 이게 왜 중요한가. 착각하면 안 된다. 더 깊게 읽기: 확률적 앵무새. 더 깊게 읽기: 챗봇에게 속아...\nThe post 테드 창의 제안, “인공지능이 아니라 ‘응용통계’라고 부르자.” appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91183",
          "publishedOn": "2023-06-03T13:30:50.000Z",
          "wordCount": null,
          "title": "테드 창의 제안, “인공지능이 아니라 ‘응용통계’라고 부르자.”",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91114",
          "author": "이정환",
          "description": "타다(VCNC) 창업자 이재웅이 무죄 판결을 받았다. 이재웅이 이런 말을 했다. “혁신이 두려운 기득권의 편에 선 정치인들은 법을 바꿔 혁신을 주저앉혔다. 혁신을 만들어내는 기업가를 저주하고 기소하고, 법을 바꿔 혁신을 막고 기득권의 이익을 지켜내는 일은 이번을 마지막으로 더 이상 없어야 한다.” 이게 왜 중요한가. 어떻게 된 일일까. 본질은 이것이다. 붉은 깃발법. 조금 다르게 생각해 보자. 더 깊게...\nThe post [컨텍스트] 너무 늦게 도착한 타다 무죄 판결. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91114",
          "publishedOn": "2023-06-02T02:31:18.000Z",
          "wordCount": null,
          "title": "[컨텍스트] 너무 늦게 도착한 타다 무죄 판결.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91097",
          "author": "윤대균",
          "description": "플렉세라(Flexera)는 미국 일리노이주에 본사를 둔 소프트웨어 회사로, 주로 소프트웨어 자산관리 및 클라우드 관리용 서비스를 제공한다. 이 회사에서는 매년 클라우드 활용 현황 및 관련 이슈들을 조사하여 매우 포괄적인 보고서를 공개한다. 이번에도 다양한 산업 영역을 대표하는 전 세계 750명의 IT 전문가와 경영진을 대상으로 2022년 겨울에 실시한 조사 결과를 발표하였다. 조사 대상 기업군을 산업 분야별로 구분해 보면 금융서비스,...\nThe post 2023 플렉세라 클라우드 현황 보고서 appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91097",
          "publishedOn": "2023-06-02T01:06:40.000Z",
          "wordCount": null,
          "title": "2023 플렉세라 클라우드 현황 보고서",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91085",
          "author": "이정환",
          "description": "보수 진영의 조급함이 느껴진다. 사생활 통째로, 압수수색이 늘고 있다. 전세사기 피해자 26%, 자살 충동. 인천 신축 빌라 90%가 역전세. 너무 늦게 도착한 타다 무죄 판결. 미국 디폴트 위기 넘겼다. “살인해 보고 싶었다.” 해법과 대안. 연봉 10억에도 의사가 안 온다. “소아과 탈출 지원해 드립니다.” 요양보호사 1명이 노인 20명까지 돌본다. 롯폰기 20년, 도쿄를 살렸다. “100세까지 살고 싶다”...\nThe post 보수 진영의 조급함이 느껴진다: 슬로우레터 6월2일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91085",
          "publishedOn": "2023-06-01T22:02:04.000Z",
          "wordCount": null,
          "title": "보수 진영의 조급함이 느껴진다: 슬로우레터 6월2일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=90632",
          "author": "한상기",
          "description": "소버린 클라우드(sovereign cloud)는 현지 국가의 데이터 주권을 보장하기 위해 현지 법률과 규정을 준수하여 현지에 데이터 센터를 두고, 데이터 접근이 이루어지도록 설계하고 구축된 클라우드 컴퓨팅 아키텍처를 말한다. 소버린 클라우드 서비스 제공업체는 메타데이터를 포함한 각 가입자의 데이터를 외부 접근으로부터 보호하고 데이터가 발생한 나라의 개인정보 보호 의무를 준수하여 저장하도록 보장한다(참고로 ‘소버린’은 독립적, 자주적이라는 뜻). 사실 소버린 클라우드에 관한...\nThe post 소버린 클라우드, 어떻게 데이터 주권을 확보할 것인가 appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/90632",
          "publishedOn": "2023-05-31T23:30:00.000Z",
          "wordCount": null,
          "title": "소버린 클라우드, 어떻게 데이터 주권을 확보할 것인가",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=91069",
          "author": "이정환",
          "description": "“전투에 실패한 지휘관은 용서할 수 있어도, 경계에 실패한 지휘관은 용서할 수 없다.” – 군대에서 경계 교육훈련이나 경계 근무 투입 전 정신교육에서 자주 하는 말. “전쟁나면 꼼짝 없이 죽겠구나 싶었다.” “왜”도 “어떻게”도 없는 문자, 일본은 달랐다. 경찰이 1분 동안 머리 때리는 영상이 공개됐다. 오염수 시찰단, 뭘 보고 온 건가. 모스크바 드론 미스터리. 해법과 대안. 구급차 뺑뺑이...\nThe post “전쟁나면 꼼짝 없이 죽겠구나 싶었다.”: 슬로우레터 6월1일. appeared first on 슬로우뉴스.",
          "link": "https://slownews.kr/91069",
          "publishedOn": "2023-05-31T22:03:39.000Z",
          "wordCount": null,
          "title": "“전쟁나면 꼼짝 없이 죽겠구나 싶었다.”: 슬로우레터 6월1일.",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "꿈꾸는섬",
      "feedUrl": "https://happist.com/feed",
      "siteUrl": "https://happist.com",
      "articles": [
        {
          "id": "https://happist.com/?p=590988",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/590988/26%eb%87%ac-%eb%af%b8%ea%b5%ad-%ec%a0%84%ea%b8%b0%ec%b0%a8-%ec%8b%9c%ec%9e%a5-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2023-06-19T11:14:27.000Z",
          "wordCount": 5257,
          "title": "BofA, ’26년 미국 전기차 시장 전망, 테슬라 점유율은 62%에서 18%로 급락할 것",
          "imageUrl": "https://happist.com/wp-content/uploads/2023/06/tesla-market-share-2022q1.jpeg"
        },
        {
          "id": "https://happist.com/?p=590985",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/590985/%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2023-06-19T09:55:27.000Z",
          "wordCount": 5615,
          "title": "인공지능 컴퓨팅 리더, 엔비디아 투자의견 및 엔비디아 주가 전망(6/19 업뎃)",
          "imageUrl": "https://happist.com/wp-content/uploads/2020/08/엔비디아-로고-nvidia-logo.jpg"
        },
        {
          "id": "https://happist.com/?p=590978",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/590978/%eb%b0%98%eb%8f%84%ec%b2%b4-%ed%83%91%ed%94%bd",
          "publishedOn": "2023-06-19T09:22:39.000Z",
          "wordCount": 5888,
          "title": "6/19, 월가의 반도체주 전망, 모건스탠리 반도체 탑픽은 AMD  아닌 엔비디아 외",
          "imageUrl": "https://happist.com/wp-content/uploads/2020/08/엔비디아-CEO-젠슨-황Jensen-Huang-발표모습.jpg"
        },
        {
          "id": "https://happist.com/?p=590976",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/590976/%ec%9e%90%eb%8f%99%ec%b0%a8-%ed%8b%b4%ed%8c%85",
          "publishedOn": "2023-06-16T12:35:50.000Z",
          "wordCount": 5522,
          "title": "자동차 틴팅에 대한 모든 것",
          "imageUrl": "https://happist.com/wp-content/uploads/2023/01/자동차-운전중인-여인-Young-woman-driver.Photo-by-Jan-Baborak.jpg"
        },
        {
          "id": "https://happist.com/?p=590973",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/590973/amd-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-amd-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2023-06-16T09:23:06.000Z",
          "wordCount": 5614,
          "title": "반도체주 AMD 투자의견 및 AMD 주가 전망(6/16 업뎃)",
          "imageUrl": "https://happist.com/wp-content/uploads/2017/05/AMD-라이젠Ryzen-CPU-이미지-1.jpg"
        },
        {
          "id": "https://happist.com/?p=590967",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/590967/aws-%eb%aa%a8%eb%a8%bc%ed%8a%b8%ec%9d%98-%ed%85%8c%ec%8a%ac%eb%9d%bc",
          "publishedOn": "2023-06-16T08:57:05.000Z",
          "wordCount": 5541,
          "title": "웨드부시, 전기차 아성을 구축한 테슬라는 성공을 수익화로 연결하는 AWS 모먼트에 직면",
          "imageUrl": "https://happist.com/wp-content/uploads/2023/01/j테슬라를-운전하느-여성-기업가-Jenny-Ueberberg-female-entrepreneur-driving-her-Tesla-Model-3-Photo-by-Enny-Ueberberg.jpg"
        },
        {
          "id": "https://happist.com/?p=590958",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/590958/23%eb%85%84-%ed%98%81%ec%8b%a0%ea%b8%b0%ec%97%85-%ec%88%9c%ec%9c%84",
          "publishedOn": "2023-06-15T00:44:11.000Z",
          "wordCount": 5355,
          "title": "2023년 혁신기업 순위, 혁신기업 Top 10 by BCG",
          "imageUrl": "https://happist.com/wp-content/uploads/2023/06/2023년-혁신기업-Top-10.jpg"
        },
        {
          "id": "https://happist.com/?p=590951",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/590951/amd-%ec%8b%a0%ec%a0%9c%ed%92%88-%eb%b0%9c%ed%91%9c%eb%a5%bc-%eb%b3%b4%eb%8a%94-%ec%9b%94%ea%b0%80%ec%9d%98-%ec%8b%9c%ec%84%a0-%ec%8b%a0%ec%a0%9c%ed%92%88%ec%9d%80-%ea%b8%8d%ec%a0%95%ec%a0%81%ec%9d%b4",
          "publishedOn": "2023-06-14T00:30:32.000Z",
          "wordCount": null,
          "title": "AMD 신제품 발표를 보는 월가의 시선, 신제품은 긍정적이나 AMD AI 점유율 상승 가능성이 낮다",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=590948",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/590948/%ec%a0%84%ea%b8%b0%ec%b0%a8-ev6-%ea%b2%bd%ed%97%98%ea%b8%b0",
          "publishedOn": "2023-06-13T23:20:51.000Z",
          "wordCount": null,
          "title": "어느 직장인의 전기차 EV6 경험기",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=590937",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/590937/%ed%85%8c%ec%8a%ac%eb%9d%bc-%ec%8a%88%ed%8d%bc%ec%b0%a8%ec%a0%80-%ea%b0%9c%eb%b0%a9",
          "publishedOn": "2023-06-12T03:09:05.000Z",
          "wordCount": null,
          "title": "테슬라 슈퍼차저 개방을 보는 월가의 시선, 전기차 생태계 모두에게 긍정적, 테슬라는 추가 수익원으로 작용할 것",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=590932",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/590932/%ec%95%84%eb%a7%88%ec%a1%b4-%ec%9d%b8%ea%b3%b5%ec%a7%80%eb%8a%a5-%ec%82%ac%ec%97%85",
          "publishedOn": "2023-06-11T01:21:27.000Z",
          "wordCount": null,
          "title": "UBS, 아마존 인공지능 사업 수익화 가능성으로 아마존 목표주가 150달러로 상향 조정",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=590930",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/590930/%ec%95%84%eb%a7%88%ec%a1%b4-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac%ea%b3%bc-%ec%95%84%eb%a7%88%ec%a1%b4-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2023-06-08T06:00:54.000Z",
          "wordCount": null,
          "title": "월가의 아마존 투자의견 및 아마존 주가 전망(6/11 업뎃)",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=590925",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/590925/%ed%8c%8c%ec%9d%b4%ed%8d%bc-%ec%83%8c%eb%93%a4%eb%9f%ac-%ec%95%84%eb%a7%88%ec%a1%b4-%eb%aa%a9%ed%91%9c%ec%a3%bc%ea%b0%80-%ec%83%81%ed%96%a5",
          "publishedOn": "2023-06-08T01:34:38.000Z",
          "wordCount": null,
          "title": "파이퍼 샌들러, 아마존 웹 서비스 바닥 근접으로 아마존 목표주가 상향",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=590923",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/590923/%ec%95%a0%ed%94%8c-%eb%b9%84%ec%a0%84-%ed%94%84%eb%a1%9c-%ed%98%81%eb%aa%85",
          "publishedOn": "2023-06-07T23:32:40.000Z",
          "wordCount": null,
          "title": "전문가 의견, 애플 비전 프로는 혁신인가 혁명인가",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=590913",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/590913/sf%ec%9e%91%ea%b0%80-%ed%85%8c%eb%93%9c-%ec%b0%bd%ec%9d%98-%ec%9d%b8%ea%b3%b5%ec%a7%80%eb%8a%a5-%ed%95%b4%ec%84%9d",
          "publishedOn": "2023-06-07T11:44:24.000Z",
          "wordCount": null,
          "title": "SF 작가 테드 창의 인공지능(ChatGPT) 해석, FT 인터뷰",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=590907",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/590907/%ed%85%8c%ec%8a%ac%eb%9d%bc-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%ed%85%8c%ec%8a%ac%eb%9d%bc-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2023-06-07T08:34:27.000Z",
          "wordCount": null,
          "title": "월가의 테슬라 투자의견 및 테슬라 주가 전망(6/12 업뎃)",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=590902",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/590902/%ed%85%8c%ec%8a%ac%eb%9d%bc-%ec%a3%bc%ea%b0%80-%ec%a0%81%ec%a0%95",
          "publishedOn": "2023-06-07T08:13:58.000Z",
          "wordCount": null,
          "title": "파이퍼 샌들러, 자동차 사업만으론 테슬라 주가가 ‘싸다’고 볼 수 있지만 테슬라는 더 많은 가치있는 비즈니스 모델 존재",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=590899",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/590899/%ec%95%a0%ed%94%8c-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac-%eb%b0%8f-%ec%95%a0%ed%94%8c-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2023-06-07T06:31:05.000Z",
          "wordCount": null,
          "title": "월가의 애플 투자의견 및 애플 주가 전망(6/7 업뎃)",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=590875",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/590875/6-7-amd-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2023-06-07T02:44:34.000Z",
          "wordCount": null,
          "title": "파이퍼 샌들러, AMD 주가는 하반기 데이터센터 수요 증가 수혜를 입을 것",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "NewsPeppermint",
      "feedUrl": "https://newspeppermint.com/feed/",
      "siteUrl": "https://newspeppermint.com",
      "articles": [
        {
          "id": "https://newspeppermint.com/?p=77167",
          "author": "NewsPeppermint",
          "description": "오늘날 시간 정보는 과잉이라고 할 정도로 넘쳐납니다. 지금이 몇 시인지뿐 아니라 어떤 일이 언제 끝날지 알려주는 것도 오늘날에는 필수입니다. 거의 모든 가전제품에는 남은 동작 시간을 알려주는 표시창이 있습니다. 어떤 글을 몇 분이면 읽을 수 있는지 알려주는 것도 처음에 표시했을 때는 참신했지만, 어느덧 많은 매체와 웹사이트에서 쓰는 흔한 방식이 됐습니다. 이런 시간 정보는 사용자의 편의를 위한 것입니다. 하지만 정말로 그럴까요? 뉴욕타임스 칼럼니스트 파멜라 폴의 칼럼을 번역하고, 해설을 썼습니다. 전문 번역: 미묘하게 어긋난 시간들… → 더 보기",
          "link": "https://newspeppermint.com/2023/06/21/npsp_time/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_time",
          "publishedOn": "2023-06-21T09:35:03.000Z",
          "wordCount": null,
          "title": "넘치는 시간 정보, 그럼에도 문제는 알고리듬? 혹은 사람?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=76705",
          "author": "veritaholic",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 그에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. ** 오늘 소개하는 글은 4월 23일 스프에 쓴 글입니다. 한국 교육과정의 특징 중에는 고교과정에서 이과와 문과를 구분하는 것이 있습니다. 여기에는 수학을 잘하는 사람과 문학을 잘하는 사람이 따로 있으며, 이들에게 각자의 장점을 살릴 수 있는 다른 교육을 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/19/npsp_mathliterature/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_mathliterature",
          "publishedOn": "2023-06-20T00:00:24.000Z",
          "wordCount": 1906,
          "title": "[뉴페@스프] 아름다움이 진리요, 진리가 아름다움이리라",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=77151",
          "author": "NewsPeppermint",
          "description": "트럼프 전 대통령이 지난주 또 기소됐습니다. 이번에는 법무부가 임명한 잭 스미스 특검이 트럼프를 기소했습니다. 연방 검찰이 전직 대통령을 기소한 것도 미국 역사상 이번이 처음 있는 일입니다. 예상된 일이긴 했지만, 막상 트럼프가 또 기소되자 미국 언론은 관련 기사과 칼럼을 쏟아냈습니다. 뉴욕타임스도 마찬가지였는데요, 많은 글을 두 부류로 나눠 보자면 트럼프가 구체적으로 어느 부분에서 법을 어떻게 어겨서 어떤 처벌을 받게 될 것인지 주목한 글과 그러든 말든 트럼프의 인기는 더 높아져 2024년 대선의 공화당 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/19/npsp_trumpdocuments/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_trumpdocuments",
          "publishedOn": "2023-06-19T16:30:50.000Z",
          "wordCount": 1441,
          "title": "또 기소된 트럼프, 그러든 말든 대선 가도는 탄탄해서 더 문제",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=76685",
          "author": "veritaholic",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 그에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. ** 오늘 소개하는 글은 4월 19일 스프에 쓴 글입니다. 세상이 점점 더 빨리 돌아간다는 데 토를 달 사람은 별로 없을 겁니다. 해야 할 일도 늘어나고, 그래서 사람들은 바쁘다는 말을 점점 더 입에 달고 삽니다. 여기에 수시로 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/18/npsp_emailurgencybias/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_emailurgencybias",
          "publishedOn": "2023-06-18T22:59:29.000Z",
          "wordCount": 2180,
          "title": "[뉴페@스프] ‘카톡 답장의 속도’가 알려주는 나와 그 사람과의 관계",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=77136",
          "author": "NewsPeppermint",
          "description": "미국 대법원이 20세기 최고 팝아티스트 중 한 명인 앤디 워홀의 표절 문제에 관해 최근 판결을 내렸습니다. 앤디 워홀이 1984년 린 골드스미스가 찍은 팝스타 프린스의 사진을 실크스크린 초상화 시리즈의 원본 이미지로 사용한 것은 저작권 침해라고 판결한 건데요, 7:2 판결에 관해 패소한 앤디 워홀 측을 위해 법정 의견서를 썼던 스탠퍼드대학교 미술사학과의 리처드 메이어 교수가 칼럼을 썼습니다. 이를 번역하고, 표절과 독창성, 예술이란 무엇인지에 관해 해설을 썼습니다. 전문 번역: ‘앤디 워홀’에 대한 대법원의 판결은 틀렸다 해설: → 더 보기",
          "link": "https://newspeppermint.com/2023/06/17/npsp_warhol/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_warhol",
          "publishedOn": "2023-06-17T09:00:01.000Z",
          "wordCount": 1399,
          "title": "더 독창적인 방식으로 기존의 독창성을 해체한 ‘앤디 워홀’",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=76654",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 그에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. ** 오늘 소개하는 글은 4월 17일 스프에 쓴 글입니다. 이번주 미국에서 가장 많이 회자한 뉴스는 두 가지였습니다. 하나는 한국 언론에서도 자세히 다룬 우크라이나 전황 등이 담긴 기밀문서 유출, 그리고 다른 하나는 클래런스 토머스 대법관이 부자 친구로부터 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/16/npsp_yachtclimatechange/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_yachtclimatechange",
          "publishedOn": "2023-06-16T22:59:16.000Z",
          "wordCount": 2383,
          "title": "[뉴페@스프] “쟤도 안 하는데 왜 내가 해야 해?”에 대한 답을 내놔야 한다",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=76619",
          "author": "veritaholic",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 그에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. ** 오늘 소개하는 글은 4월 12일 스프에 쓴 글입니다. 시작은 미국이 작년 8월 통과시킨 인플레이션 감축법(IRA, Inflation Reduction Act)입니다. 미국은 지금 인플레이션으로 고생하고 있습니다. 이 법안은 그 이름 그대로 인플레이션을 낮추기 위해 시중의 돈을 걷는 형태를 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/14/npsp_tradewarclimatechange/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_tradewarclimatechange",
          "publishedOn": "2023-06-14T22:59:36.000Z",
          "wordCount": 2038,
          "title": "[뉴페@스프] 어려운 문제, 어떻게 하면 쉽게 바꿔 풀 수 있을까",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=77092",
          "author": "ingppoo",
          "description": "지난주 뉴욕을 비롯한 미국 북동부 일대 하늘은 짙은 황토색 연기로 뒤덮였습니다. 캐나다 전역에서 일어난 수백 건 이상의 산불에 의한 연기가 바람을 타고 미국까지 날아간 것입니다. 산불로 인한 대기 오염은 기후 위기가 보다 직접적으로 사람들에게 피해를 준 사례로 언급되고 있습니다. 산불 때문에 숨쉬기 어려울 정도로 공기가 나빠지면서 공기의 질 문제가 자연히 다시 주목받았습니다. 코로나19 팬데믹을 거치며 우리는 이미 공기 중에서 전파되는 바이러스, 환기의 중요성에 대해서도 잘 알게 됐죠. 버지니아테크에서 공기 중에 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/14/npsp_airquality/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_airquality",
          "publishedOn": "2023-06-14T09:20:09.000Z",
          "wordCount": null,
          "title": "다시 ‘코로나 대책’이 필요한 상황이 올 수 있는 이유",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=76602",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 그에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. ** 오늘 소개하는 글은 4월 10일 스프에 쓴 글입니다. 2018년 가을, 런던을 방문한 적이 있습니다. 일정을 다 마치고, 오후 한나절 시간이 났습니다. 축구의 성지 웸블리 구장에 가볼 기회가 생긴 겁니다. 웸블리 경기장은 다목적 복합 경기장으로, 주로 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/13/npsp_womensportslegend/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_womensportslegend",
          "publishedOn": "2023-06-13T22:59:27.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] ‘이 동네 지소연 언니’나 ‘저 동네 연경쌤’이 많아져야 해!",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=76577",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 그에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. ** 오늘 소개하는 글은 4월 5일 스프에 쓴 글입니다. 지난주 잭 스미스 특검이 트럼프 전 대통령의 기밀 문서 유출 혐의에 대한 수사를 마치고 트럼프 대통령을 다시 기소했는데요, 이 수사를 둘러싼 글도 조만간 쓸 예정입니다. 도널드 트럼프 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/12/npsp_trumpindicted/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_trumpindicted",
          "publishedOn": "2023-06-12T22:59:15.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 트럼프 기소의 의미, 미국서도 논란인 ‘정치검찰’",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=77064",
          "author": "NewsPeppermint",
          "description": "이달 말 올해 회기를 마치는 미국 대법원은 굵직굵직한 판결을 앞두고 있습니다. 그 가운데 소수인종 우대정책(Affirmative Action)을 둘러싼 판결에도 세간의 관심이 쏠리고 있습니다. 1960년대 민권법이 제정된 뒤 역사적으로 차별받아온 유색인종에 대한 보상의 일환으로 더 많은 교육 기회를 제공해주고자 대학 입시에서 소수인종을 우대하는 정책이 시행됐는데요, 보수 우위 대법원이 이번에 소수인종 우대정책을 폐지하려 하고 있습니다. 이에 관해 고등학교 2학년 학생이 쓴 칼럼을 번역하고, 퓨리서치 센터의 최근 여론조사를 포함한 미국 여론의 변화 등을 해설로 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/12/npsp_affirmativeaction/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_affirmativeaction",
          "publishedOn": "2023-06-12T12:45:39.000Z",
          "wordCount": null,
          "title": "수십 년 된 소수자 우대정책, 2023년에도 공정할까? ‘공정’이란 가치는 어떻게 구현해야 하나",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=76556",
          "author": "veritaholic",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 그에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. ** 오늘 소개하는 글은 4월 3일 스프에 쓴 글입니다. 지난 한주는 챗GPT가 촉발한 거대언어모델(LLM) 기반의 AI에 대한 우려가 정점을 찍은 한주였습니다. 3월 21일, “렉서스와 올리브나무”로 잘 알려진, 퓰리처 상을 수상했고 뉴욕타임스에 40년째 칼럼을 쓰고 있는 토마스 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/11/npsp_chatgptfriedmanharari/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_chatgptfriedmanharari",
          "publishedOn": "2023-06-11T22:59:16.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 프리드먼의 기대와 우려, 하라리의 강력한 경고… AI는 어디까지 온 걸까",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=76549",
          "author": "veritaholic",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 그에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. ** 오늘 소개하는 글은 3월 30일 스프에 쓴 글입니다. 우리 삶은 허구로 가득 차 있습니다. 세상은 그대로 이해하기에는 너무나 복잡해서 우리는 자신만의 이야기를 만들어냅니다. 아침 시간에 뛰고 있는 이를 보고 우리는 지금 시간과 그 사람이 입고 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/08/npsp_multiverse/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_multiverse",
          "publishedOn": "2023-06-08T22:59:36.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 환상의 멀티버스 앞에서 잊지 말아야 할 것",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=77042",
          "author": "NewsPeppermint",
          "description": "‘프레너미(frenemy)’라는 말이 있습니다. 사전에 등재된 단어는 아니고, 펜실베니아대학교 와튼 경영대학원의 애덤 그랜트 교수가 만든 말입니다. 친구(friend)와 적(enemy)을 합친 말로, 친구이자 적인 복합적이고 애매한 관계를 뜻하는 말입니다. 믿던 이에게 뜻밖에 받게 되는 상처는 준비가 안 된 만큼 더 오래 아물지 않기도 하죠. 오늘은 애덤 그랜트가 뉴욕타임스에 쓴 칼럼을 번역하고, 누구에게나 쉽지 않은 관계를 어떻게 유지하면 좋을지 함께 생각해 봤습니다. 전문 번역: ‘당신의 친구인 동시에 적’이라는 관계가 가장 해로울 수 있다 해설: 매번 하는 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/06/npsp_ambivalentrelationship/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_ambivalentrelationship",
          "publishedOn": "2023-06-07T00:30:47.000Z",
          "wordCount": null,
          "title": "매번 하는 고민 “그와의 관계를 어떻게 하는 게 좋을까”",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=76498",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 그에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. ** 오늘 소개하는 글은 3월 27일 스프에 쓴 글입니다. 미국 시각으로 3월 23일 하원 통상자원위원회(House Energy and Commerce Committee)에서 청문회가 열렸습니다. 오늘 출석한 증인은 틱톡의 최고경영자(CEO) 추쇼우즈였습니다. 짧은 동영상을 올려 공유하는 앱으로 청소년들 사이에서 선풍적인 인기를 끈 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/06/npsp_tiktok/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_tiktok",
          "publishedOn": "2023-06-06T22:59:55.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 틱톡의 문제는 단지 틱톡 만의 문제일까",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=77028",
          "author": "NewsPeppermint",
          "description": "인공지능(AI)이 바꿔놓은 현실, 바꿔놓을 미래에 관한 이야기가 어느 때보다 많이 쏟아지는 요즘입니다. 챗GPT의 등장으로 거대언어모델(LLM)을 이용한 생성 AI가 어떤 효과를 미칠지에 많은 관심이 모이는 가운데, 주목해야 하는 또 다른 분야가 바로 이미지입니다. 포토샵으로 유명한 어도비(Adobe)가 이에 대한 종합적인 대책으로 콘텐츠 진위 이니셔티브(Content Authenticity Initiative)를 내놓았습니다. 뉴욕타임스 칼럼니스트 파라드 만주가 쓴 칼럼을 번역하고, 해설을 썼습니다. 전문 번역: 인공지능 포토샵이 엄청나게 쉬워지면 무슨 문제가 생길까 해설: AI가 만들어낸 이미지의 위협, 과연 막을 수 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/05/npsp_aiphotoshop/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_aiphotoshop",
          "publishedOn": "2023-06-05T22:59:42.000Z",
          "wordCount": null,
          "title": "AI가 만들어낸 이미지의 위협, 과연 막을 수 있을까",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=76480",
          "author": "veritaholic",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 그에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. ** 오늘 소개하는 글은 3월 23일 스프에 쓴 글입니다. 코로나가 우리에게 남긴 유산 중 일상의 비대면화를 빼놓을 수는 없을 겁니다. 팬데믹이 한창일 때는 타인과의 물리적 접촉을 피할 수 해주는 모든 기술과 문화가 사회적으로 장려됐고, 이는 결과적으로 → 더 보기",
          "link": "https://newspeppermint.com/2023/06/04/npsp_wfhhealth/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_wfhhealth",
          "publishedOn": "2023-06-04T22:59:26.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 그러니 게으른 인간이여, 운동 시작을 생각이라도 하자",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=77016",
          "author": "NewsPeppermint",
          "description": "각종 후기와 평점, 남들이 매겨 놓은 순위가 판 치는 세상입니다. 그런 순위들을 쉽게 공유할 수 있게 된 덕분에 알게 된 유용한 정보도 없지 않지만, 반대로 남들이 매긴 순위에 연연할 필요가 없는 데서도 우리는 큰 의미 없는 순위나 평점에 휘둘리곤 합니다. 작가이자 비평가 레이첼 코놀리가 쓴 칼럼을 번역하고 해설을 썼습니다. 전문 번역: ‘최고’만을 좇는 세상의 횡포 속에서 우리가 취해야 할 태도는 해설: 삶의 모든 데서 ‘포모(FOMO)’는 아니지 않나요?",
          "link": "https://newspeppermint.com/2023/05/31/npsp_tyrannyofthebest/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_tyrannyofthebest",
          "publishedOn": "2023-05-31T23:45:00.000Z",
          "wordCount": null,
          "title": "삶의 모든 데서 ‘포모(FOMO)’는 아니지 않나요?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=76461",
          "author": "veritaholic",
          "description": "* 지난해 11월부터 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 그에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. ** 오늘 소개하는 글은 3월 20일 스프에 쓴 글입니다. 오늘날 미국은 명실상부한 세계 최강대국입니다. 지난 수십 년간 미국은 경제, 군사, 외교 등 모든 영역에서 다른 나라를 압도했습니다. 20세기 초까지만 하더라도 세계의 중심은 유럽이었습니다. 그러나 → 더 보기",
          "link": "https://newspeppermint.com/2023/05/30/npsp_dependence/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_dependence",
          "publishedOn": "2023-05-30T22:59:01.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] ‘각자도생’이냐 ‘공생’이냐 혹은 가운데 어딘가",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=77012",
          "author": "NewsPeppermint",
          "description": "미국에선 코로나19 팬데믹 때 도입된 재택근무가 반영구적인 노동 형태로 자리잡은 곳이 많습니다. 그러다 보니 도심의 사무실들이 텅 비는 게 문제가 됐죠. 도시가 활기 찬 공간으로 되살아나기 위해서는 이번 기회에 많은 것이 바뀌어야 합니다. 하버드대학교 경제학과의 에드워드 글레이저 교수는 이를 위해 ‘놀이터 도시’라는 개념을 제안합니다. 글레이저 교수가 쓴 칼럼을 번역하고, 해설을 덧붙였습니다. 전문 번역: 이것은 어떤 신호일까, 뉴욕에 빈 사무실이 엠파이어스테이트 26개만큼 있다는 것. 해설: 도시가 놀이터 되면 오프라인도 살아날 수 있을까",
          "link": "https://newspeppermint.com/2023/05/30/npsp_playgroundcity/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_playgroundcity",
          "publishedOn": "2023-05-30T15:15:13.000Z",
          "wordCount": null,
          "title": "도시가 놀이터 되면 오프라인도 살아날 수 있을까",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=76450",
          "author": "ingppoo",
          "description": "* 지난해 11월부터 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 그에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. ** 오늘 소개하는 글은 3월 16일 스프에 쓴 글입니다. 재난 영화를 보면 클리셰처럼 등장하는 인물이 있습니다. 치명률이 높은 무서운 전염병이든, 지진해일이든, 운석이 지구에 떨어지는 일이든, 재앙이 올 거라고 부지런히 경고하고 다니는 인물입니다. 주로 과학자가 → 더 보기",
          "link": "https://newspeppermint.com/2023/05/26/npsp_svb/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_svb",
          "publishedOn": "2023-05-26T22:59:27.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] “이러다 정말 큰일 난다”던 그의 경고, 큰일 났는데 이제 어쩔 것인가",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "WALLFLOWER",
      "feedUrl": "http://rss.egloos.com/blog/wallflower",
      "siteUrl": "http://wallflower.egloos.com",
      "articles": []
    },
    {
      "title": "내 마음의 풍경",
      "feedUrl": "https://rss.blog.naver.com/sellars.xml",
      "siteUrl": "https://blog.naver.com/sellars",
      "articles": [
        {
          "id": "https://blog.naver.com/sellars/223134715856",
          "author": "sellars",
          "description": "",
          "link": "https://blog.naver.com/sellars/223134715856",
          "publishedOn": "2023-06-21T02:55:45.000Z",
          "wordCount": null,
          "title": "[윤리와 사상] 소크라테스, 에피쿠로스, 에픽테토스",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223131872966",
          "author": "sellars",
          "description": "로티의 <철학과 자연의 거울>에서 셀라스와 관련된 부분을 보면서 내가 로티의 언명을 예전보다 더 잘 이해하고 있다는 것을 스스로 느낀다. 이제 로티의 수사학에 속아 이것이 무슨 의미인지 생각하는 대신에 이렇게 쓰면 될 것을 왜 그 따위 표현하고 있는가 하고 로티를 질책한다. 무엇이 나를 이렇게 변화시킨 것인가? 그 동안 꾸준하게 로티의 책을 읽은 것도 아니다. <이성의 논리적 공간>(2014)을 쓰고 난 후에 의식적으로 이 주제에 대한 글들을 읽지 않으려고 했다. 그럼에도 그 책에서 주장한 것들이 로티의 <철학과 자연의 거울>(1979)에서 너무 분명하게 보인다. 예전에도 로티의 주장을 나름대로 요약했지만, 이.......",
          "link": "https://blog.naver.com/sellars/223131872966",
          "publishedOn": "2023-06-18T01:26:11.000Z",
          "wordCount": 101,
          "title": "명백하게 쓰기",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223131291102",
          "author": "sellars",
          "description": "의미 전체론 * 의미는 언어놀이나 삶의 형식이라는 문맥에서 차지하는 위치이다.(p. 25) * 적어도 비트겐슈타인과 셀라스 이래로, 기호의 “의미”는 그 내용에 덧붙여지는 “비물질적” 속성이 아니라 단지 언어놀이 혹은 삶의 형식 속에서 주위 사건들의 문맥 속에서 차지하는 위치라는 점은 완전히 명백한 것 같다. ... 로크에게 기호가 의미를 가진다는 것은 관념을 기호화함으로써 산출된 결과이다. 관념은 우리가 생각할 때 우리 정신 앞에 있는 것이다. ... 그러나 비트겐슈타인이나 셀라스에 의하면, 사물을 표상적으로, 혹은 지향적으로 만드는 것은 더 넓은 맥락 즉 다른 수많은 사물들과의 상호작용 속에서 이루어지는 역할이다. * 감.......",
          "link": "https://blog.naver.com/sellars/223131291102",
          "publishedOn": "2023-06-17T03:02:39.000Z",
          "wordCount": 101,
          "title": "로티와 셀라스 2",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223129421103",
          "author": "sellars",
          "description": "약 특유의 냄새가 몹시 나는 그것을 예전에 배가 끊어질 듯 아플 때, 한 번 먹으면 그냥 낫었다. 그런데 이제는 몇 번을 먹어도 낫질 않는다. 아주 예전에 신장염으로 고생할 때, 회현동에 있는 오래된 한옥집에서 할아버지 한의사에게 약을 조제해 먹었다. 약을 먹었을 때, 금기 사항이 많았는데 가령 숙주나물을 먹지 않는다, 김치를 물에 빨아먹는다, TV를 보지 않는다 등등 이었다. 한 번은 무슨 축구대회 결승전이라고 기억하는데 그것을 다 보고 갔다. 그러면서 생각했다. 이것을 지가 도대체 어떻게 알아. 그러나 그는 내 맥을 짚으면서 귀신 같이 지적해 냈다. 이것이 나에게는 아주 강한 인상으로 남아 있다. 대학 병원에서 난감해 했던.......",
          "link": "https://blog.naver.com/sellars/223129421103",
          "publishedOn": "2023-06-15T01:51:45.000Z",
          "wordCount": 101,
          "title": "도움을 주어야 하는 철학",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223128498253",
          "author": "sellars",
          "description": "(나) 기호학이 기호를 다루는 학문이고, 기호는 무엇을 나타내는 것이라 할 때, 그 ‘나타내는 것’을 어떻게 추론하고 인식할 수 있느냐는 문제가 제시됩니다. 기호는 단순한 약속이 아니라 추론의 과정이며, 이에 따라 인간의 인식 작용이 개입합니다. 기호는 사회의 기호만이 아니라 마음의 기호이기도 하다는 뜻입니다. 이런 점은 기호를 바라보는 상반된 관점 사이의 모순을 극명하게 드러내는데, 이것은 어쩌면 기호학에서 영원히 풀리지 않는 수수께끼 같은 것일 수도 있습니다. 그러나 분명한 것은 이 모든 과정에 논리학과 인식론의 핵심적인 문제들이 관여한다는 사실입니다. 기호가 추론의 결과일 수 있다는 것은 기호를 해석하는 단.......",
          "link": "https://blog.naver.com/sellars/223128498253",
          "publishedOn": "2023-06-14T02:38:15.000Z",
          "wordCount": null,
          "title": "기호학과 논리학",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223127362502",
          "author": "sellars",
          "description": "강순전이 편집한 <현대 영미 철학에서 헤겔로의 귀환>(세창출판사, 2023)이 나온지 이제 알았다. 거기에 실린 논문들은 모두 학술지에 발표된 것이기에 이미 읽은 논문들도 다수이다. 어떤 논문은 도대체 왜 그렇게 헤겔적 관념론을 좋아하는지 알고 싶어서 읽은 것도 있고, 맥도웰이나 브랜덤에 대해서 우리의 헤겔학자들은 어떻게 평가하는지 알고 싶어서 읽은 것도 있다. 이 책을 살펴보다가 레딩(P. Redding)의 <분석철학과 헤겔적 사유의 귀환>(2007)이 생각났다. 분명히 이 책의 주요 부분들을 다 읽었는데, 그 책이 무엇을 이야기하고 있는지 아무런 기억이 나지 않는다. 이런 경우가 제일 난감하다. 분명히 읽었는데, 그 내.......",
          "link": "https://blog.naver.com/sellars/223127362502",
          "publishedOn": "2023-06-12T23:16:17.000Z",
          "wordCount": null,
          "title": "슬픈 망각",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223125677613",
          "author": "sellars",
          "description": "여유가 없는 경우, 다양한 것들을 바라보기 어렵다. 그 중에 반드시 하나를 골라 그것만을 옹호하려고 한다. 그러나 네 주제도 중요하지만, 동시에 내 주제도 중요하다. 물론 그 중요성을 평가하는 척도가 다른 것은 분명하다. <정작 하위주체 여성들은 스피박의 난해한 글을 직접 읽은 기회가 거의 없을 것이다.> 스피박의 글이 <난해>하다는 것에 대해서 어느 정도 인정되는 것 같다. 그런데 왜 난해하게 쓰는가? 나는 이해하기 쉽게 써야 한다고 생각한다. (나는 난해하게 글을 쓰는 것은 겉멋이 들어서 그렇다고 생각한다. 자기도 모르면서 마치 아는 것처럼 잘난 척 한다고 생각한다. 혹은 자기의 진짜 생각을 감추고 마치 그 이.......",
          "link": "https://blog.naver.com/sellars/223125677613",
          "publishedOn": "2023-06-11T00:44:47.000Z",
          "wordCount": null,
          "title": "해제와 평가",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223125004210",
          "author": "sellars",
          "description": "스피박의 <포스트식민 이성비판>을 소개하고 평가하는 책이 있다. 임옥희, <타자로서의 서구>(2012). 저자는 영문학 전공자이다. 여성학 관련 논문에서 이름을 보았기에 여성학자라고 생각했는데, 여성학뿐만 아니라 영문학이나 평론과 관련해서 주요한 주제들을 다 다루고 있는 듯이 보인다. 최근에 나온 그녀의 책이 <팬데믹 패닉 시대, 페미스토리 노믹스>(2021)이다. 이 책은 읽지 못하고, 이 책에 대한 서평 (서평이라기 보다는 책의 내용을 요약해서 소개해 주는) 글 하나를 보았는데, 이 책도 그렇고 작년의 그 이름을 처음 들어본 브라이도티의 책도 그렇고, 좋게 말하면 박식하고, 나쁘게 말하면 주제 넘다. 미국 영.......",
          "link": "https://blog.naver.com/sellars/223125004210",
          "publishedOn": "2023-06-09T23:33:10.000Z",
          "wordCount": null,
          "title": "문학과 철학",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223119769873",
          "author": "sellars",
          "description": "마허의 <피츠버그 학파> 4장은 언어적 의미를 다룬다. 이성 혹은 추론의 규범이나 규칙은 사유하고 말하기 위해서 그것들에 반응해야 하기 때문에 중요하지만, 그러한 규범과 규칙이 언어의 의미나 사유 내용을 구성하기 때문에 중요하다. 즉 <의미는 이성적 행동에서 규칙 지배적인 역할이다.> (의미는 무엇인가? 의미는 역할이다. 혹은 의미는 기능이다. 역할 의미론 혹은 의미 기능론이라고 할 수 있는 생각을 셀라스가 처음 주장했다고 한다. 특히 심리 철학에서 셀라스의 기능주의는 기능주의의 원천이다. 그러나 역할 의미론이나 기능주의의 경우, 주류적 주장은 인과적 네트워크에서의 기능이 의미이고 마음이다. 반면에 셀라.......",
          "link": "https://blog.naver.com/sellars/223119769873",
          "publishedOn": "2023-06-04T00:28:55.000Z",
          "wordCount": null,
          "title": "4 의미와 지향적 행동",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223117720883",
          "author": "sellars",
          "description": "마르크스주의 문학비평가인 테리 이글턴의 <반대자의 초상>(2010)에 스피박의 <포스트식민 이성 비판>에 대해서 서평이 실려 있다. 이글턴의 이 책은 그가 읽은 41권에 대한 책에 대한 서평인데, 서평 자체가 그의 개성이 드러나는 듯 아주 자유스럽기 때문에 역설적으로 읽기가 어렵다. 스피박의 책에 대해서 이따위로 글 쓰면 안 된다고 지적했지만, 이글턴도 다음처럼 말하고 있다. <이 어둠의 지침서의 제2조는 다음과 같다. ‘점잖게, 무리 없는 정도까지 계몽주의를 반박하라.’ 탈식민주의 이론가들은 자기들의 지적 담론과 그 담론의 대상인 토착민 사이에 존재하는 간극에 관해 몹시 고뇌하는 것처럼 보일 때가 많다. 그.......",
          "link": "https://blog.naver.com/sellars/223117720883",
          "publishedOn": "2023-06-01T08:51:03.000Z",
          "wordCount": null,
          "title": "테리 이글턴과 스피박",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223116272273",
          "author": "sellars",
          "description": "비트겐슈타인은 말한다. 희망, 두려움, 의심은 사유의 형식이다. 혹은 삶의 사실이 아니라, 삶의 형식이라고 표현할 수 있다. 삶의 형식은 형식적 조건이다. 삶의 패턴이다. 유의미한 세계를 가능하게 만드는 것이다. 그것은 칸트의 경험 가능성의 조건에 대한 실존적인 대응물이다. 삶의 형식은 선험적 기능을 한다. 중요한 것은 원인과 법칙으로 바라보는 것이 아니라, 형식적 연결을 파악하는 것이다. 이것이 전체망(Übersicht), 혹은 통관적 제시(synoptic presentation)이다. 이 전체망이 형식적 연결들을 바라볼 수 있게 하는 선험적 기능을 한다. 어떤 표상이 일목요연(perspicuous)할 때, 그것은 모든 것을 우리 눈 앞에 놓는다. 그것은.......",
          "link": "https://blog.naver.com/sellars/223116272273",
          "publishedOn": "2023-05-31T01:17:00.000Z",
          "wordCount": null,
          "title": "후기 비트겐슈타인의 선험성",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223114446913",
          "author": "sellars",
          "description": "(7) 김형효는 마르셀과 메르로 뽕티를 통해 의식과 코기토의 철학에 매우 부정적인 태도를 취한다. 의식과 코기토 철학에 대한 부정적 태도가 나중에 불교적이고 노장적 철학의 무(無)와 공(空)의 관여로 이끈 계기가 되었다고 말한다. 아마 다음과 같은 구절이 그가 코기토와 의식의 철학을 바라보는 기본적 관점일 것이다. <라깡은 의식의 <전체적 자기반성>을 펼치는 데까르뜨의 <코기토> 철학을 붕괴시킨다. 라깡은 데까르뜨의 <나는 생각한다. 그러므로 나는 존재한다>는 명제를 해체하면서, “내가 존재하지 않는 곳에서 나는 생각한다. 그러므로 내가 생각하지 않은 곳에서 나는 존재한다”고 언표하였다. 데까르뜨.......",
          "link": "https://blog.naver.com/sellars/223114446913",
          "publishedOn": "2023-05-29T02:33:24.000Z",
          "wordCount": null,
          "title": "의식철학과 이성주의 비판",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223113681102",
          "author": "sellars",
          "description": "대륙 신유가와 홍콩 신유가가 서로 논쟁하고 있다. 그런데 유교나 유학을 정치 제도화해야 한다는 장경(蔣慶)이라는 학자의 주장은 내가 보기에 시대착오적인 미친 소리 같다. (그리고 이러한 논의는 중국 공산당의 심기를 거슬릴 때, 즉 후덕하게 생겼지만 전혀 후덕하지 않은 시진평의 한 마디에 따라 언제나 사라질 처지에 지나지 않는다고 생각한다.) 비록 내 한 표가 아무런 현실적 힘이 없다고 해도, 내가 자유롭게 투표하거나 투표하지 않는 이 자유가 유교의 말씀 보다 더 소중하다고 나는 생각한다. 나는 장경과 이명휘의 논쟁이 <순전히 그들의 논쟁>이라고 생각한다. 그것은 중국문화와 전통, 유교나 유학에 대한 나름 자부심이.......",
          "link": "https://blog.naver.com/sellars/223113681102",
          "publishedOn": "2023-05-28T00:34:58.000Z",
          "wordCount": null,
          "title": "장경과 이명휘의 논쟁",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223112274801",
          "author": "sellars",
          "description": "이명휘는 <중국 현대 신유학의 자아전환>(2013)의 마지막 장에서 모종삼의 도통론(道通論)을 다루고 있다. 이명휘에 의하면, 모종삼의 도통론은 자아중심적이고, 전통을 자임하고, 천하의 군림하는 그런 것이 아니다. 이명휘가 이렇게 주장할 수 있는 것은 (1) 사상에서의 도통론과 철학에서의 도통론을 구분하면서, 모종삼이 주장한 것이 우리의 일반적 인상과 다르게 철학에서의 도통론이 아니라, 사상, 문화에서의 도통론이기 때문이다. (2) 모종삼의 철학은 <범도덕주의>라고 지칭하고 있고, 이것 때문에 도덕적 폐쇄성을 갖고 온다고 비판하고 있지만, <범도덕주의>는 강한 의미와 약한 의미로 나눌 수 있다. 모종삼의 주.......",
          "link": "https://blog.naver.com/sellars/223112274801",
          "publishedOn": "2023-05-26T02:22:45.000Z",
          "wordCount": null,
          "title": "현대 신유가 모종삼의 도통론(道通論)",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223111206555",
          "author": "sellars",
          "description": "어떤 의미에서 그가 주장하는 것은 간단하다. <우리는 상관주의의 원환을 벗어나기 위해 사실성을 절대자처럼 생각해야 한다는 것이다.> 그런데 사실성을 절대자처럼 생각한다는 것이 무엇을 의미하는가? <사실성>의 개념뿐만 아니라, <절대자>의 개념도 우리가 흔히 생각하는 개념이라기 보다는 오히려 메이야수의 고유한 개념처럼 보인다. 아마 메이야수의 다음 구절이 사실성을 절대자로 생각한다는 것이 무엇인지 알 수 있는 구절이라고 할 수 있다. <달리 말해서 우리는 모든 사물에 내재하는 이유의 부재를 사유가 궁극적 이유를 추구할 때 맞닥뜨리는 한계로 삼는 대신에 그러한 이유의 부재가 존재자의 궁극적 속성.......",
          "link": "https://blog.naver.com/sellars/223111206555",
          "publishedOn": "2023-05-24T23:38:19.000Z",
          "wordCount": null,
          "title": "12 사실성을 절대자로 생각하라.",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The ZipCPU by Gisselquist Technology",
      "feedUrl": "https://zipcpu.com/feed",
      "siteUrl": "https://zipcpu.com/",
      "articles": [
        {
          "id": "https://zipcpu.com/zipcpu/2023/05/29/zipcpu-3p0.html",
          "author": null,
          "description": "It’s time to announce a new version of the\nZipCPU:\nZipCPU v3.0!\nFor reference, here’s how the\nZipCPU’s\ndevelopment has taken place over the years:\nZipCPU v0.1\nWay back in the beginning, the \nZipCPU had four bit opcodes and only\n16x16-bit multiplies.  It truly had a very limited instruction set.  That said,\nthe instruction set design was too limited to be very functional.\nThis original instruction set didn’t even last a half a year.\nZipCPU v1.0\nThe ZipCPU,\nv1.0, had 32-bit bytes and no octet level access.  If you wanted to read or\nwrite an octet (8bit value) in memory, you needed to read a 32b word, modify\nthe 8b value within it, and write the 32b word back.\nAs a result, the ZipCPU, v1.0, did not\nhave C library support.\nZipCPU v2.0\nZipCPU v2.0 provided 8-bit byte support,\nbetter compiler su…",
          "link": "https://zipcpu.com/zipcpu/2023/05/29/zipcpu-3p0.html",
          "publishedOn": "2023-05-29T04:00:00.000Z",
          "wordCount": null,
          "title": "Introducing the ZipCPU v3.0",
          "imageUrl": null
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}