{
  "sources": [
    {
      "title": "Alex Edwards",
      "feedUrl": "https://www.alexedwards.net/static/feed.rss",
      "siteUrl": "https://www.alexedwards.net/blog",
      "articles": [
        {
          "id": "https://www.alexedwards.net/blog/which-go-router-should-i-use",
          "author": null,
          "description": "When you start to build web applications with Go, one of the first questions you'll probably ask is \"which\n    router should I use?\". \nIt's not an easy question to answer, either. There are probably more than 100 different routers\n        available, all with different APIs, features, and behaviors. So for this blog post I've evaluated 30 popular\n        ones, and created a shortlist of the best options along with a flowchart that you can use to help guide your choice.\n    \nNote: If you don't want to read the discussion, you can skip to the flowchart.\n    \nBefore we start, a few notes on terminology:\nBy supports method-based routing I mean that the router makes it easy to dispatch a HTTP\n        request to different handlers based on the request method (\"GET\",\n        \"POST\", etc).\nBy suppo…",
          "link": "https://www.alexedwards.net/blog/which-go-router-should-i-use",
          "publishedOn": "2021-10-04T17:00:00.000Z",
          "wordCount": 2060,
          "title": "Which Go router should I use? (with flowchart)"
        }
      ]
    },
    {
      "title": "Arjun Sreedharan",
      "feedUrl": "https://arjunsreedharan.org/rss",
      "siteUrl": "https://arjunsreedharan.org/",
      "articles": []
    },
    {
      "title": "Beningo Embedded Group",
      "feedUrl": "https://www.beningo.com/feed/",
      "siteUrl": "https://www.beningo.com",
      "articles": [
        {
          "id": "https://www.beningo.com/?p=13628",
          "author": "Jacob Beningo",
          "description": "Graphical user interfaces (GUI) are becoming more popular among embedded systems. The need for a convenient and connected interface is finding its way into wearable technologies, industrial equipment, commercial kitchens, and even home appliances. Throwing a GUI with a modern and sophisticated user experience (UX) on a device opens the door for many businesses’ use … Continue reading 5 Skills Every Embedded GUI Developer Needs\n5 Skills Every Embedded GUI Developer Needs first appeared on Beningo Embedded Group.",
          "link": "https://www.beningo.com/5-skills-every-embedded-gui-developer-needs/",
          "publishedOn": "2021-09-30T13:05:29.000Z",
          "wordCount": null,
          "title": "5 Skills Every Embedded GUI Developer Needs",
          "itunes": {}
        }
      ]
    },
    {
      "title": "The Clean Code Blog",
      "feedUrl": "https://blog.cleancoder.com/atom.xml",
      "siteUrl": "http://blog.cleancoder.com/atom.xml",
      "articles": [
        {
          "id": "http://blog.cleancoder.com/uncle-bob/2021/09/25/roots.html",
          "author": null,
          "description": "When I was 15 or so, my father would drive me, and my best friend, Tim Conrad, to the Digital Equipment Corporation (DEC) sales office each Saturday.  This was a 30 min drive.  My father would drop us off in the morning and pick us up in the late afternoon.  He spend two hours in his car each Saturday hauling us around.\nThanks Dad!\nTim and I would spend our day \"playing\" with the floor model of the PDP-8 they had at the office.  The office staff were very accommodating and accepting of our presence, and they helped us out if we needed any fresh rolls of teleprinter paper, or paper tape.\nSeveral years later, at the age of 20, I found myself working at Teradyne Applied Systems in Chicago.  The computer we used there was called an M365; but it was really just an upgraded PDP-8.  We used it to…",
          "link": "http://blog.cleancoder.com/uncle-bob/2021/09/25/roots.html",
          "publishedOn": "2021-09-25T00:00:00.000Z",
          "wordCount": 2535,
          "title": "Roots"
        }
      ]
    },
    {
      "title": "C++ Stories",
      "feedUrl": "https://www.cppstories.com/index.xml",
      "siteUrl": "https://www.cppstories.com/",
      "articles": [
        {
          "id": "https://www.cppstories.com/2013/02/smart-pointers-gotchas/",
          "author": null,
          "description": "While learning how to use the new C++ Standard, I encountered several intriguing cases with smart pointers. Casting? Array handling? Passing to functions?\nLet’s review some common concerns so that we don’t shoot yourself in the foot :)\nSome predefines\nLet us take a simple Test class with one member field to present further concepts:\nstruct Test {\n   Test() { std::cout << \"Test::Test\\n\"; }\n   ~Test() { std::cout << \"Test::~Test destructor\\n\"; }\n\n   int val_ { 0 };\n};\n\n\nWith the above declaration, we’ll be able to see when it was constructed and destructed.\nIf we need some more advanced reporting, including move semantics, we could also implement move and copy constructors and assignment operators, but it will be good for now. See more in: Moved or Not Moved - That Is the Question! - C++ Sto…",
          "link": "https://www.cppstories.com/2013/02/smart-pointers-gotchas/",
          "publishedOn": "2021-10-11T05:00:00.000Z",
          "wordCount": 2418,
          "title": "C++ Smart Pointers Gotchas"
        },
        {
          "id": "https://www.cppstories.com/2021/smart-ptr-ref-card/",
          "author": null,
          "description": "Smart pointers available since C++11 are an essential foundation for writing secure code in Modern C++. Thanks to RAII (Resource Acquisition Is Initialization), they allow you to work with pointers to allocate memory or other managed objects efficiently.\nThis blog post will show you the core points for working with those handy types.\nWant your copy to print?\nI packed this text, with some additional info, into a nice-looking PDF.\n\nHere are the main points the PDF covers:\nGeneral information about all smart pointers,\nDetails on unique_ptr\nDetails on shared_ptr\nDetails on weak_ptr\nAll of the existing subscribers of my mailing list have already got the new document.\nPlease subscribe and get updates, additional reference cards (C++17 & C++20), and other bonuses. You can unsubscribe at any time.…",
          "link": "https://www.cppstories.com/2021/smart-ptr-ref-card/",
          "publishedOn": "2021-09-27T05:55:00.000Z",
          "wordCount": 1749,
          "title": "C++ Smart Pointers Reference Card"
        },
        {
          "id": "https://www.cppstories.com/2021/sphero-cpp-return/",
          "author": null,
          "description": "What should happen when the data returned from a function is not valid? It might be an error or just how the system operates (embedded environment, a timeout). In this article, you’ll see a practical example from the robotics area where the vocabulary types from C++17 play important roles.\nThis is a guest post written by Rud Merriam:\nRud is a retired software engineer with interest in C++, embedded / robotic systems, and general hacking. He’s written about C++ for embedded systems for Hackaday and is currently working to catch up on C++20 capabilities and write about them. Reach him on Twitter at @r_merriam.\nThis text was initially published @Medium - see here.\nExploring C++ STL for Function Return Status\nSphero released the RVR robot above in 2019. Before its release, I worked to build a …",
          "link": "https://www.cppstories.com/2021/sphero-cpp-return/",
          "publishedOn": "2021-09-20T05:20:00.000Z",
          "wordCount": 3270,
          "title": "C++ Return: std::any, std::optional, or std::variant?"
        }
      ]
    },
    {
      "title": "Sticky Bits – Powered by Feabhas",
      "feedUrl": "https://blog.feabhas.com/feed/",
      "siteUrl": "https://blog.feabhas.com",
      "articles": [
        {
          "id": "https://blog.feabhas.com/?p=3698",
          "author": "Niall Cooling",
          "description": "Ceedling is still probably the best Test-Driven Development (TDD) environment for C programmers out there. But, as with many Free Open-Source Software ( FOSS ), tools getting it to work natively on a Windows environment involves the odd hoop-jumping exercise; either involving messing around with the likes of Cygwin or Mingw; or using a full Virtual Machine (VM) environment such as VirtualBox or VMware.\nHowever, with the introduction of Windows-Subsystem-for-Linux (WSL) and the much-improved update to WSL2, running Linux centric FOSS [...] \n\nThe post TDD in C with Ceedling and WSL2 – performance issues appeared first on Sticky Bits - Powered by Feabhas.",
          "link": "https://blog.feabhas.com/2021/10/tdd-in-c-with-ceedling-and-wsl2-performance-issues/",
          "publishedOn": "2021-10-07T14:00:08.000Z",
          "wordCount": 1439,
          "title": "TDD in C with Ceedling and WSL2 – performance issues"
        },
        {
          "id": "https://blog.feabhas.com/?p=3668",
          "author": "Martin Bond",
          "description": "In my first blog post about C++20 Coroutines I introduced the concepts behind a synchronous or generator style coroutine and developed a template class to support coroutines for any data type.\nIn this post I’ll add an iterator to the template to support the range-for loop and iterative algorithms. You may want to review that post before reading this one but the following code should act as a reminder about how to write and use a coroutine to read two floating [...] \n\nThe post C++20 Coroutine Iterators appeared first on Sticky Bits - Powered by Feabhas.",
          "link": "https://blog.feabhas.com/2021/09/c20-coroutine-iterators/",
          "publishedOn": "2021-09-23T16:48:32.000Z",
          "wordCount": 2290,
          "title": "C++20 Coroutine Iterators"
        },
        {
          "id": "https://blog.feabhas.com/?p=3653",
          "author": "Martin Bond",
          "description": "C++20 Coroutines\nThere seems to be a lot of confusion around the implementation of C++20 coroutines, which I think is due to the draft technical specification for C++20 stating that coroutines are a work in progress so we can’t expect full compiler and library support at this point in time.\nA lot of the problems probably arise from the lack of official documentation about working with coroutines. We have been given C++ syntax support for coroutines (the co_yield and co_return) but without [...] \n\nThe post C++20 Coroutines appeared first on Sticky Bits - Powered by Feabhas.",
          "link": "https://blog.feabhas.com/2021/09/c20-coroutines/",
          "publishedOn": "2021-09-16T14:00:15.000Z",
          "wordCount": 4128,
          "title": "C++20 Coroutines"
        }
      ]
    },
    {
      "title": "Embedded in Academia",
      "feedUrl": "https://blog.regehr.org/feed",
      "siteUrl": "https://blog.regehr.org",
      "articles": []
    },
    {
      "title": "Siemens Blogs",
      "feedUrl": "https://blogs.sw.siemens.com/feed/",
      "siteUrl": "https://blogs.sw.siemens.com",
      "articles": []
    },
    {
      "title": "CPUU의 Daydreamin&#039;",
      "feedUrl": "https://cpuu.postype.com/rss",
      "siteUrl": "https://cpuu.postype.com",
      "articles": [
        {
          "id": "https://cpuu.postype.com/post/10415747",
          "author": "CPUU",
          "description": "앞서 jailbreak 된 아이폰6을 준비했었다. \nhttps://cpuu.postype.com/post/10436260\n아이폰의 메모리를 덤프하고 프로세스 메모리를 분석하는 작업을 수행해보자.\n\n\nfrida 설치(Jailbreaken iOS Device)\n탈옥한 아이폰에는 기본적으로 시디아(cydia)가 설치되어 있다. 일종의 앱스토어인데 그 안에서 frida를 검색하여 설치하자.\n위의 설치는 탈옥한 아이폰에서 진행한 것이다. 그렇다면 이제 아이폰과 연결할 컴퓨터에서도 frida를 설치해야 연동할 수 있다.\n나의 경우 macOS에서 아래의 명령어로 설치했다.\n$ pip install --upgrade pip\n$ pip install frida\n$ pip install frida-tools\n이제 mac과 iphone을 USB 방식으로 연결을 한다.\n그리고 mac에서 다음의 명령어를 입력하면 현재 수행중인 프로세스 목록을 볼 수 있으며, pid 번호도 보인다.\n$ frida-ps -U\n PID  Name\n----  --------------------------------------------------------\n2357  AGXCompilerService                                      \n1694  AltStore                                                \n3180  AppleCredentialManagerDaemon                            \n1639  AssetCacheLocatorService      …",
          "link": "https://cpuu.postype.com/post/10415747",
          "publishedOn": "2021-10-02T13:19:10.000Z",
          "wordCount": 519,
          "title": "frida를 활용한 iOS process 메모리 분석"
        },
        {
          "id": "https://cpuu.postype.com/post/10838266",
          "author": "CPUU",
          "description": "골든래빗 출판사로부터 책을 제공받아 작성했습니다.\n\n내가 컴퓨터공학 학부 2학년을 다니던 2009년 즈음, 전공 2학년 때 배우는 객체지향 프로그래밍 시간에는 C++을 배웠었다. 서점에 갔는데, C/C++ 및 자료구조의 '열혈 프로그래밍' 시리즈로 유명한 윤성우님이 JAVA 프로그래밍 책을 출간하셨다. 놀랍게도 제목은 [난 정말 JAVA를 공부한 적이 없다구요]였다(이 책은 현재 '열혈 Java 프로그래밍'으로 개정되어 출간되었다). 그 당시 잠시 책을 살펴보긴 했지만, C++과는 코딩 스타일이 너무 다르다는 생각에 우선은 배우기를 보류했던 기억이 난다. 그런데 내가 졸업하고 몇 년 뒤부터는 학부과정 수업이 JAVA로 바뀌었다는 소식을 전해 들었다. 결과적으로 나는 JAVA를 배운 적이 없었다.\n학교를 졸업하고 군대에 가서 프로그래밍을 할 일이 많았는데, 물론 대다수의 공공기관은 전자정부 표준프레임워크 사용에 따라 JAVA를 사용할 일이 많았다. 하지만 난 여전히 C/C++을 선호하던 관성을 따르고 싶었기에 꼭 필요한 경우가 아니면 JAVA를 회피했다. 현재의 나는 주로 Python을 사용하고 golang도 배우고 있지만 이상하게도 아직까지 굳이 JAVA를 직접적으로 사용할 일은 극히 드문 상황이다. 어쩌면 내가 의도적으로 피했기 때문은 아닐까 하는 생각도 들었다. 다른 프로그래밍 언어를 알고 있으므로, 남이 작성한 자바 코드를 보고 어느 정도 읽고 이해하고 약간 수정할 줄은 알지만, 굳이 JAVA를 사용하여 프로그램을 만들고 싶은 적은 없었던 것이다.\n그러던 중 골든래빗 출판사의 '북 스포일러' 이벤트에 당…",
          "link": "https://cpuu.postype.com/post/10838266",
          "publishedOn": "2021-09-28T01:01:49.000Z",
          "wordCount": 695,
          "title": "[북리뷰] 이재환의 자바 프로그래밍 입문"
        }
      ]
    },
    {
      "title": "Dan Luu",
      "feedUrl": "https://danluu.com/atom.xml",
      "siteUrl": "https://danluu.com/atom/index.xml",
      "articles": [
        {
          "id": "https://danluu.com/in-house/",
          "author": null,
          "description": "An alternate title for this post might be, \"Twitter has a kernel team!?\". At this point, I've heard that surprised exclamation enough that I've lost count of the number times that's been said to me (I'd guess that it's more than ten but less than a hundred). If we look at trendy companies that are within a couple factors of two in size of Twitter (in terms of either market cap or number of engineers), they mostly don't have similar expertise, often as a result of path dependence — because they \"grew up\" in the cloud, they didn't need kernel expertise to keep the lights on the way an on prem company does. While that makes it socially understandable that people who've spent their career at younger, trendier, companies, are surprised by Twitter having a kernel team, I don't think there's a te…",
          "link": "https://danluu.com/in-house/",
          "publishedOn": "2021-09-29T00:00:00.000Z",
          "wordCount": 1858,
          "title": "The value of in-house expertise"
        }
      ]
    },
    {
      "title": "Damien Katz",
      "feedUrl": "http://damienkatz.net/feed/",
      "siteUrl": "http://damienkatz.net",
      "articles": []
    },
    {
      "title": "The acme of foolishness",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "edykim.com 블로그 RSS 피드",
      "feedUrl": "https://edykim.com/ko/feed.xml",
      "siteUrl": "https://edykim.com",
      "articles": []
    },
    {
      "title": "Eli Bendersky's website",
      "feedUrl": "https://eli.thegreenplace.net/feeds/all.atom.xml",
      "siteUrl": "https://eli.thegreenplace.net/",
      "articles": [
        {
          "id": "https://eli.thegreenplace.net/2021/rewriting-go-source-code-with-ast-tooling/",
          "author": null,
          "description": "<p>Go is well-known for having great tooling for analyzing code written in the\nlanguage, right in the standard library with the <tt class=\"docutils literal\">go/*</tt> packages\n(<tt class=\"docutils literal\">go/parser</tt>, <tt class=\"docutils literal\">go/ast</tt>, <tt class=\"docutils literal\">go/types</tt> etc.); in addition, the\n<a class=\"reference external\" href=\"https://pkg.go.dev/golang.org/x/tools\">golang.org/x/tools</a> module contains\nseveral supplemental packages that are even more powerful. I've used one …</p>",
          "link": "https://eli.thegreenplace.net/2021/rewriting-go-source-code-with-ast-tooling/",
          "publishedOn": "2021-10-02T12:48:00.000Z",
          "wordCount": 2245,
          "title": "Rewriting Go source code with AST tooling"
        },
        {
          "id": "https://eli.thegreenplace.net/2021/summary-of-reading-july-september-2021/",
          "author": null,
          "description": "<ul class=\"simple\">\n<li>&quot;Trick or Treatment: The Undeniable Facts about Alternative Medicine&quot; by\nEdzard Ernst and Simon Singh - a scientifically-inclined exposé about\nalternative medicine, focusing on the most common types like chiropractic,\nacupuncture and herbs, but also with notes on the more obscure approaches\nlike Reiki. Lots of interesting historical context, as well …</li></ul>",
          "link": "https://eli.thegreenplace.net/2021/summary-of-reading-july-september-2021/",
          "publishedOn": "2021-09-30T13:17:00.000Z",
          "wordCount": 1334,
          "title": "Summary of reading: July - September 2021"
        }
      ]
    },
    {
      "title": "Embedded Artistry",
      "feedUrl": "https://embeddedartistry.com/feed/",
      "siteUrl": "https://embeddedartistry.com",
      "articles": [
        {
          "id": "https://embeddedartistry.com/?p=16258",
          "author": "Matthias Schulte",
          "description": "11 October 2021 by Matthias SchulteToday we have a guest post from Mathias Schulte. Mathias is a member of the development team at YAKINDU. He likes trying out different tools and languages in order to improve his engineering skills. Implementing an IoT solution can easily become a complex task. IoT applications usually consist of three … \nContinue reading \"How to Get an IoT Project Quickly Off the Ground\"\nThe post How to Get an IoT Project Quickly Off the Ground appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2021/10/11/how-to-get-an-iot-project-quickly-off-the-ground/",
          "publishedOn": "2021-10-11T17:00:00.000Z",
          "wordCount": 1998,
          "title": "How to Get an IoT Project Quickly Off the Ground"
        }
      ]
    },
    {
      "title": "Embedded.com",
      "feedUrl": "https://www.embedded.com/feed/",
      "siteUrl": "https://www.embedded.com",
      "articles": [
        {
          "id": "https://www.embedded.com/?p=4471280",
          "author": "Luka Mustafa and Chris Coleman",
          "description": "The Linux Foundation Zephyr Open Source Project has grown into the backbone of many IoT projects. Zephyr offers a best-in-class small, scalable, real-time operating system...\nThe post Best practices for debugging Zephyr-based IoT applications appeared first on Embedded.com.",
          "link": "https://www.embedded.com/best-practices-for-debugging-zephyr-based-iot-applications/",
          "publishedOn": "2021-10-13T13:24:41.000Z",
          "wordCount": 3176,
          "title": "Best practices for debugging Zephyr-based IoT applications"
        },
        {
          "id": "https://www.embedded.com/?p=4471212",
          "author": "Mohammed Billoo",
          "description": "Continuing a two-part-series looking at how a visual trace diagnostics tool such as Percepio Tracealyzer can help in evaluating an embedded Linux system, from analyzing the driver and interrupt handler to examining the userspace applications and compiler options.\nThe post Evaluating the performance of a Yocto-based Linux system – part 2 appeared first on Embedded.com.",
          "link": "https://www.embedded.com/evaluating-the-performance-of-a-yocto-based-linux-system-part-2/",
          "publishedOn": "2021-10-13T13:02:00.000Z",
          "wordCount": 2728,
          "title": "Evaluating the performance of a Yocto-based Linux system – part 2"
        },
        {
          "id": "https://www.embedded.com/?p=4471258",
          "author": "Nitin Dahad",
          "description": "A roundup of this week’s embedded news includes new design platforms for 3D IC chip design, a look at smart mobility at ITS World Congress, and a new embedded edge podcast.\nThe post embedded news week: ITS World Congress, chiplets and podcast appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-news-week-its-world-congress-chiplets-and-podcast/",
          "publishedOn": "2021-10-08T17:50:49.000Z",
          "wordCount": 2375,
          "title": "embedded news week: ITS World Congress, chiplets and podcast"
        },
        {
          "id": "https://www.embedded.com/?p=4471250",
          "author": "Nitin Dahad",
          "description": "Synopsys said DesignWare HBM3 controller, PHY, and verification IP reduces integration risk and maximizes memory performance in multi-die systems.\nThe post Synopsys enables multi-die designs with HBM3 IP and verification appeared first on Embedded.com.",
          "link": "https://www.embedded.com/synopsys-enables-multi-die-designs-with-hbm3-ip-and-verification/",
          "publishedOn": "2021-10-08T17:25:12.000Z",
          "wordCount": 1729,
          "title": "Synopsys enables multi-die designs with HBM3 IP and verification"
        },
        {
          "id": "https://www.embedded.com/?p=4471245",
          "author": "Nitin Dahad",
          "description": "Various safety scenarios utilizing V2X are on show at ITS World Congress in Hamburg, plus NXP launches new applications processor for V2X and IIoT\nThe post ITS World Congress: V2X, protecting vulnerable road users, and e-bikes appeared first on Embedded.com.",
          "link": "https://www.embedded.com/its-world-congress-v2x-protecting-vulnerable-road-users-and-e-bikes/",
          "publishedOn": "2021-10-08T16:52:43.000Z",
          "wordCount": 1992,
          "title": "ITS World Congress: V2X, protecting vulnerable road users, and e-bikes"
        },
        {
          "id": "https://www.embedded.com/?p=4471238",
          "author": "Nitin Dahad",
          "description": "New platform provides single unified cockpit to help system-level designers plan, implement, and analyze any type of stacked die system to give a full system view and perform system-driven optimization of performance, power, and area (PPA).\nThe post Cadence enables multi chiplet design with Integrity 3D-IC platform appeared first on Embedded.com.",
          "link": "https://www.embedded.com/cadence-enables-multi-chiplet-design-with-integrity-3d-ic-platform/",
          "publishedOn": "2021-10-07T19:43:06.000Z",
          "wordCount": 2186,
          "title": "Cadence enables multi chiplet design with Integrity 3D-IC platform"
        },
        {
          "id": "https://www.embedded.com/?p=4471235",
          "author": "Nitin Dahad",
          "description": "Consortium defines a firmware interface and low-level data model that provides for vendor-independent configuration of smart sensors and effecters, as well as plug and play interoperability.\nThe post PICMG announces IoT.1 spec for smart IoT sensors and effecters appeared first on Embedded.com.",
          "link": "https://www.embedded.com/picmg-announces-iot-1-spec-for-smart-iot-sensors-and-effecters/",
          "publishedOn": "2021-10-07T13:07:42.000Z",
          "wordCount": 1512,
          "title": "PICMG announces IoT.1 spec for smart IoT sensors and effecters"
        },
        {
          "id": "https://www.embedded.com/?p=4471221",
          "author": "Nitin Dahad",
          "description": "New Iono RP combines ease of use of the Raspberry Pi with a choice of digital and analog input and output interfaces, resulting in easy-to-connect module for installation in industrial and residential environments.\nThe post Sfera Labs launches I/O module based on Raspberry Pi RP2040 appeared first on Embedded.com.",
          "link": "https://www.embedded.com/sfera-labs-launches-i-o-module-based-on-raspberry-pi-rp2040/",
          "publishedOn": "2021-10-06T18:24:20.000Z",
          "wordCount": 1915,
          "title": "Sfera Labs launches I/O module based on Raspberry Pi RP2040"
        },
        {
          "id": "https://www.embedded.com/?p=4471207",
          "author": "Aaron Bauch",
          "description": "How do you catch random interrupts or have control of the interrupt handling when applications are very complex? The demand for complex applications is increasing...\nThe post Random interrupts in multicore scenarios appeared first on Embedded.com.",
          "link": "https://www.embedded.com/random-interrupts-in-multicore-scenarios/",
          "publishedOn": "2021-10-06T12:32:19.000Z",
          "wordCount": 3223,
          "title": "Random interrupts in multicore scenarios"
        },
        {
          "id": "https://www.embedded.com/?p=4471195",
          "author": "Mohammed Billoo",
          "description": "A documented walkthrough of how a visual trace diagnostics tool such as Percepio Tracealyzer can help developers evaluate the performance of their embedded systems, from analyzing the driver and interrupt handler to examining the userspace applications and compiler options.\nThe post Evaluating a Yocto-based Linux system using visual trace diagnostics appeared first on Embedded.com.",
          "link": "https://www.embedded.com/evaluating-a-yocto-based-linux-system-using-visual-trace-diagnostics/",
          "publishedOn": "2021-10-06T12:31:07.000Z",
          "wordCount": 3761,
          "title": "Evaluating a Yocto-based Linux system using visual trace diagnostics"
        },
        {
          "id": "https://www.embedded.com/?p=4471269",
          "author": "Egil Juliussen",
          "description": "A startup developing a software platform focused on autonomous trucks is providing what looks like a path to driverless systems. Special purpose acquisition companies, or...\nThe post Startup champions driverless trucks appeared first on Embedded.com.",
          "link": "https://www.embedded.com/startup-champions-driverless-trucks/",
          "publishedOn": "2021-10-05T16:18:00.000Z",
          "wordCount": 3032,
          "title": "Startup champions driverless trucks"
        },
        {
          "id": "https://www.embedded.com/?p=4471265",
          "author": "Majeed Ahmad",
          "description": "In a bid to bring machine learning to MCUs, Renesas is integrating MicroAI’s AtomML algorithm in its RA family of MCUs. After NXP and STMicroelectronics...\nThe post Renesas MCUs get MicroAI models appeared first on Embedded.com.",
          "link": "https://www.embedded.com/renesas-mcus-get-microai-models/",
          "publishedOn": "2021-10-05T15:58:00.000Z",
          "wordCount": 1481,
          "title": "Renesas MCUs get MicroAI models"
        },
        {
          "id": "https://www.embedded.com/?p=4471231",
          "author": "Sally Ward-Foxton",
          "description": "Intel has unveiled its second-generation neuromorphic computing chip, Loihi 2, the first chip to be built on its Intel 4 process technology. Designed for research...\nThe post Intel offers Loihi 2 neuromorphic chip and software framework appeared first on Embedded.com.",
          "link": "https://www.embedded.com/intel-offers-loihi-2-neuromorphic-chip-and-software-framework/",
          "publishedOn": "2021-10-05T12:40:00.000Z",
          "wordCount": 2648,
          "title": "Intel offers Loihi 2 neuromorphic chip and software framework"
        },
        {
          "id": "https://www.embedded.com/?p=4471173",
          "author": "Nitin Dahad",
          "description": "A roundup of this week’s embedded news includes new as-a-service offerings, and open-source quantum computing software development.\nThe post embedded news week: can we get anything as-a-service? appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-news-week-can-we-get-anything-as-a-service/",
          "publishedOn": "2021-10-01T16:08:12.000Z",
          "wordCount": 1951,
          "title": "embedded news week: can we get anything as-a-service?"
        },
        {
          "id": "https://www.embedded.com/?p=4471166",
          "author": "Jorge Myszne",
          "description": "The threat landscape facing edge-computing systems in enterprise-level applications is dire. As this threat environment evolves, defending against these intrusions has become increasingly urgent. Recent...\nThe post Addressing the growing threat of firmware attacks on enterprise edge computing platforms appeared first on Embedded.com.",
          "link": "https://www.embedded.com/addressing-the-growing-threat-of-firmware-attacks-on-enterprise-edge-computing-platforms/",
          "publishedOn": "2021-10-01T15:40:08.000Z",
          "wordCount": 3088,
          "title": "Addressing the growing threat of firmware attacks on enterprise edge computing platforms"
        },
        {
          "id": "https://www.embedded.com/?p=4471159",
          "author": "Nitin Dahad",
          "description": "Qualcomm IoT services suite features an enhanced platform and now has over 30 smart verticals offered for IoT as-a-service applications.\nThe post Qualcomm defines 30 verticals in IoT as-a-service offer appeared first on Embedded.com.",
          "link": "https://www.embedded.com/qualcomm-defines-30-verticals-in-iot-as-a-service-offer/",
          "publishedOn": "2021-10-01T15:25:45.000Z",
          "wordCount": 1660,
          "title": "Qualcomm defines 30 verticals in IoT as-a-service offer"
        },
        {
          "id": "https://www.embedded.com/?p=4471149",
          "author": "Nitin Dahad",
          "description": "Open-source TKET means quantum software community can now make their own contributions and develop their own extensions to the codebase under the permissive Apache 2.0 license.\nThe post CQ makes TKET quantum software development kit open-source appeared first on Embedded.com.",
          "link": "https://www.embedded.com/cq-makes-tket-quantum-software-development-kit-open-source/",
          "publishedOn": "2021-10-01T13:19:41.000Z",
          "wordCount": 1648,
          "title": "CQ makes TKET quantum software development kit open-source"
        },
        {
          "id": "https://www.embedded.com/?p=4471145",
          "author": "Nitin Dahad",
          "description": "Siemens Digital Industries Software business has announced it is expanding the Xcelerator portfolio with the introduction of Xcelerator as a Service (XaaS).\nThe post Siemens launches Xcelerator as a service appeared first on Embedded.com.",
          "link": "https://www.embedded.com/siemens-launches-xcelerator-as-a-service/",
          "publishedOn": "2021-10-01T12:46:11.000Z",
          "wordCount": 1795,
          "title": "Siemens launches Xcelerator as a service"
        },
        {
          "id": "https://www.embedded.com/?p=4471142",
          "author": "Nitin Dahad",
          "description": "Microsys and Hailo develop embedded platform, combining AI processor with Arm Cortex NXP Layerscape platforms to give customers an efficient AI implemented into connected edge appliances for situational awareness and predictive maintenance analytics.\nThe post Microsys and Hailo offer new edge-server grade AI platform appeared first on Embedded.com.",
          "link": "https://www.embedded.com/microsys-and-hailo-offer-new-edge-server-grade-ai-platform/",
          "publishedOn": "2021-09-30T16:45:02.000Z",
          "wordCount": 1568,
          "title": "Microsys and Hailo offer new edge-server grade AI platform"
        },
        {
          "id": "https://www.embedded.com/?p=4471137",
          "author": "Nitin Dahad",
          "description": "Vision Components has developed an FPGA-based accelerator for edge pre-processing of image data in embedded vision projects with MIPI camera modules.\nThe post FPGA accelerator for embedded vision MIPI cameras appeared first on Embedded.com.",
          "link": "https://www.embedded.com/fpga-accelerator-for-embedded-vision-mipi-cameras/",
          "publishedOn": "2021-09-30T16:17:08.000Z",
          "wordCount": 1452,
          "title": "FPGA accelerator for embedded vision MIPI cameras"
        },
        {
          "id": "https://www.embedded.com/?p=4471129",
          "author": "Nitin Dahad",
          "description": "FortifyIQ simulates side-channel attacks and fault-injection attacks to help chip designers address security vulnerabilities before manufacturing with a suite of tools enabling pre-silicon security verification.\nThe post FortifyIQ helps spot vulnerability with pre-silicon security verification appeared first on Embedded.com.",
          "link": "https://www.embedded.com/fortifyiq-helps-spot-vulnerability-with-pre-silicon-security-verification/",
          "publishedOn": "2021-09-30T15:56:31.000Z",
          "wordCount": 2026,
          "title": "FortifyIQ helps spot vulnerability with pre-silicon security verification"
        },
        {
          "id": "https://www.embedded.com/?p=4471114",
          "author": "Ilja Aizenberg and Igor Kalkov-Streitz",
          "description": "Getting started with Android is theoretically as simple as choosing a good prototyping kit to learn from, but what should you consider when using it...\nThe post What to know when switching to embedded Android appeared first on Embedded.com.",
          "link": "https://www.embedded.com/what-to-know-when-switching-to-embedded-android/",
          "publishedOn": "2021-09-28T18:33:20.000Z",
          "wordCount": 2730,
          "title": "What to know when switching to embedded Android"
        },
        {
          "id": "https://www.embedded.com/?p=4471078",
          "author": "Jellenie Rodriguez and Mary McCarthy",
          "description": "In this second article on resistance temperature detector (RTD) sensing system optimization, we explore RTD system optimization, selection of external components, and how to evaluation...\nThe post Optimizing RTD temperature sensing systems: Design appeared first on Embedded.com.",
          "link": "https://www.embedded.com/optimizing-rtd-temperature-sensing-systems-design/",
          "publishedOn": "2021-09-28T14:22:11.000Z",
          "wordCount": 3417,
          "title": "Optimizing RTD temperature sensing systems: Design"
        },
        {
          "id": "https://www.embedded.com/?p=4471063",
          "author": "Gustavo Parés, NDS Cognitive Labs",
          "description": "A case study on how the IoT, AI and ML were deployed in Mexico to ensure availability of safe drinking water and predict the quality of the water moving through the city’s pipes.\nThe post How IoT is deployed in Mexico to ensure safe drinking water appeared first on Embedded.com.",
          "link": "https://www.embedded.com/how-iot-is-deployed-in-mexico-to-ensure-safe-drinking-water/",
          "publishedOn": "2021-09-27T16:02:01.000Z",
          "wordCount": 2908,
          "title": "How IoT is deployed in Mexico to ensure safe drinking water"
        },
        {
          "id": "https://www.embedded.com/?p=4471044",
          "author": "Nitin Dahad",
          "description": "A roundup of this week’s embedded news, includes NFC connected perfume bottles, sensors news, and funding news in the world of embedded startups.\nThe post embedded news week: first connected-bottle perfume fragrance appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-news-week-first-connected-bottle-perfume-fragrance/",
          "publishedOn": "2021-09-24T15:53:54.000Z",
          "wordCount": 2242,
          "title": "embedded news week: first connected-bottle perfume fragrance"
        },
        {
          "id": "https://www.embedded.com/?p=4471055",
          "author": "Nitin Dahad",
          "description": "New Paco Rabanne fragrance for men comes in perfume industry’s first-ever connected bottle powered by ST’s NFC contactless chip.\nThe post Paco Rabanne perfume delivers connected experience with ST NFC appeared first on Embedded.com.",
          "link": "https://www.embedded.com/paco-rabanne-perfume-delivers-connected-experience-with-st-nfc/",
          "publishedOn": "2021-09-24T15:52:39.000Z",
          "wordCount": 1891,
          "title": "Paco Rabanne perfume delivers connected experience with ST NFC"
        },
        {
          "id": "https://www.embedded.com/?p=4471050",
          "author": "Nitin Dahad",
          "description": "Blaize and LeiShen will jointly promote autonomous driving and smart city projects based on lidar technology, using the Blaize Pathfinder P1600 AI accelerator integrated into LeiShen’s advanced auto grade lidar.\nThe post Blaize and LeiShen integrate lidar and AI for automotive and smart cities appeared first on Embedded.com.",
          "link": "https://www.embedded.com/blaize-and-leishen-integrate-lidar-and-ai-for-automotive-and-smart-cities/",
          "publishedOn": "2021-09-24T13:29:51.000Z",
          "wordCount": 1508,
          "title": "Blaize and LeiShen integrate lidar and AI for automotive and smart cities"
        },
        {
          "id": "https://www.embedded.com/?p=4471098",
          "author": "Charles Janac",
          "description": "The recent evolution of automobile design represents the most significant upheaval in transportation design over the past 100 years and the most significant semiconductor opportunity...\nThe post Silicon powers the internet of cars appeared first on Embedded.com.",
          "link": "https://www.embedded.com/silicon-powers-the-internet-of-cars/",
          "publishedOn": "2021-09-22T16:15:00.000Z",
          "wordCount": 2434,
          "title": "Silicon powers the internet of cars"
        },
        {
          "id": "https://www.embedded.com/?p=4471101",
          "author": "Maurizio Di Paolo Emilio",
          "description": "Nauto’s platform identifies any elements of risk with real-time data, especially those that can be extremely hazardous due to the driver’s distraction. The cars of...\nThe post Platform addresses safety in traditional cars appeared first on Embedded.com.",
          "link": "https://www.embedded.com/platform-addresses-safety-in-traditional-cars/",
          "publishedOn": "2021-09-21T16:28:00.000Z",
          "wordCount": 2076,
          "title": "Platform addresses safety in traditional cars"
        },
        {
          "id": "https://www.embedded.com/?p=4471040",
          "author": "Andrew Hayzen",
          "description": "To understand containers is to understand the future of software development. Here’s how to best leverage this software innovation. Containers are known as an amazing...\nThe post How containers improve the way we develop software appeared first on Embedded.com.",
          "link": "https://www.embedded.com/how-containers-improve-the-way-we-develop-software/",
          "publishedOn": "2021-09-21T12:26:05.000Z",
          "wordCount": 3860,
          "title": "How containers improve the way we develop software"
        },
        {
          "id": "https://www.embedded.com/?p=4471034",
          "author": "Anne van Gemert",
          "description": "It comes as no surprise that capturing data in some of the hardest to reach corners of the planet is a challenge any IoT player...\nThe post Reaching the unreachable with satellite IoT appeared first on Embedded.com.",
          "link": "https://www.embedded.com/reaching-the-unreachable-with-satellite-iot/",
          "publishedOn": "2021-09-21T11:47:17.000Z",
          "wordCount": 2330,
          "title": "Reaching the unreachable with satellite IoT"
        },
        {
          "id": "https://www.embedded.com/?p=4471010",
          "author": "Nitin Dahad",
          "description": "Sony said its new IMX459 is the industry’s first stacked SPAD depth sensor for automotive lidar applications that includes SPAD pixels and distance measuring processing circuit on a single chip. \nThe post Sony stacks SPAD sensor and logic in single chip for automotive lidar appeared first on Embedded.com.",
          "link": "https://www.embedded.com/sony-stacks-spad-sensor-and-logic-in-single-chip-for-automotive-lidar/",
          "publishedOn": "2021-09-20T13:48:11.000Z",
          "wordCount": 1763,
          "title": "Sony stacks SPAD sensor and logic in single chip for automotive lidar"
        },
        {
          "id": "https://www.embedded.com/?p=4471026",
          "author": "Emily Newton",
          "description": "New substrates could be more effective than state-of-the-art thermal management materials in high-power density applications. Thermal management has quickly become one of the most significant...\nThe post Novel materials could cool high-power devices appeared first on Embedded.com.",
          "link": "https://www.embedded.com/novel-materials-could-cool-high-power-devices/",
          "publishedOn": "2021-09-20T11:01:00.000Z",
          "wordCount": 1874,
          "title": "Novel materials could cool high-power devices"
        },
        {
          "id": "https://www.embedded.com/?p=4471005",
          "author": "Nitin Dahad",
          "description": "A roundup of this week's embedded news, includes a tribute to a visionary, plus the launch of new sever compute modules for the edge.\nThe post embedded news week: celebrating a visionary, and edge compute appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-news-week-celebrating-a-visionary-and-edge-compute/",
          "publishedOn": "2021-09-17T15:23:46.000Z",
          "wordCount": 2393,
          "title": "embedded news week: celebrating a visionary, and edge compute"
        },
        {
          "id": "https://www.embedded.com/?p=4470998",
          "author": "Nitin Dahad",
          "description": "A tribute to Sir Clive Sinclair, an electronics industry inventor and entrepreneur who was part of an era that created a whole new generation of programmers and gamers.  \nThe post Goodbye Sir Clive Sinclair appeared first on Embedded.com.",
          "link": "https://www.embedded.com/goodbye-sir-clive-sinclair/",
          "publishedOn": "2021-09-17T10:56:41.000Z",
          "wordCount": 3008,
          "title": "Goodbye Sir Clive Sinclair"
        },
        {
          "id": "https://www.embedded.com/?p=4470992",
          "author": "Carsten Rhod Gregersen",
          "description": "Two low power radio internet protocols seek dominance in IoT, but is Thread vs Bluetooth looking like a similar battle to VHS vs Betamax in the 1980s?\nThe post Thread vs Bluetooth: the VHS vs Betamax of IoT connections? appeared first on Embedded.com.",
          "link": "https://www.embedded.com/thread-vs-bluetooth-the-vhs-vs-betamax-of-iot-connections/",
          "publishedOn": "2021-09-16T17:34:52.000Z",
          "wordCount": 1908,
          "title": "Thread vs Bluetooth: the VHS vs Betamax of IoT connections?"
        },
        {
          "id": "https://www.embedded.com/?p=4470980",
          "author": "Derek Chamorro and Gopi Sirineni",
          "description": "A review of potentially unaddressed vectors inherent in current platforms and a look at a potential solution for preventing firmware attacks and elevating platform security based on a trusted control/compute unit security processor.\nThe post Redefining firmware security appeared first on Embedded.com.",
          "link": "https://www.embedded.com/redefining-firmware-security/",
          "publishedOn": "2021-09-16T14:34:25.000Z",
          "wordCount": 2647,
          "title": "Redefining firmware security"
        },
        {
          "id": "https://www.embedded.com/?p=4470975",
          "author": "Nitin Dahad",
          "description": "SOAFEE addresses software-defined needs of cars quickly and seamlessly, with a standardized framework enhancing proven cloud-native technologies that work at scale in real-time and with safety required for automotive.\nThe post SOAFEE architecture for embedded edge enables software defined cars appeared first on Embedded.com.",
          "link": "https://www.embedded.com/soafee-architecture-for-embedded-edge-enables-software-defined-cars/",
          "publishedOn": "2021-09-15T20:40:10.000Z",
          "wordCount": 2046,
          "title": "SOAFEE architecture for embedded edge enables software defined cars"
        },
        {
          "id": "https://www.embedded.com/?p=4470970",
          "author": "Nitin Dahad",
          "description": "ADLINK said its new COM-HPC Ampere Altra is world’s first 80-core Arm based COM-HPC module that eliminates power-performance limitations. \nThe post ADLINK brings Ampere Altra SoCs to embedded with COM-HPC modules appeared first on Embedded.com.",
          "link": "https://www.embedded.com/adlink-brings-ampere-altra-socs-to-embedded-with-com-hpc-modules/",
          "publishedOn": "2021-09-15T19:52:52.000Z",
          "wordCount": 1992,
          "title": "ADLINK brings Ampere Altra SoCs to embedded with COM-HPC modules"
        },
        {
          "id": "https://www.embedded.com/?p=4470962",
          "author": "Nitin Dahad",
          "description": "New PUF technology based cryptographic controller is suitable for securing IoT nodes including medical and wearable devices, as well as long-term deployments in security-critical harsh environments.\nThe post ChipDNA PUF security co-processor provides 30x lower power appeared first on Embedded.com.",
          "link": "https://www.embedded.com/chipdna-puf-security-co-processor-provides-30x-lower-power/",
          "publishedOn": "2021-09-15T13:15:00.000Z",
          "wordCount": 1447,
          "title": "ChipDNA PUF security co-processor provides 30x lower power"
        }
      ]
    },
    {
      "title": "Better Embedded System SW",
      "feedUrl": "https://feeds.feedburner.com/BetterEmbeddedSystemSw",
      "siteUrl": "http://betterembsw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Google Developers Blog",
      "feedUrl": "https://feeds.feedburner.com/GDBcode",
      "siteUrl": "http://developers.googleblog.com/",
      "articles": [
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/9E8vUFjPOcI/app-pricing-update-details-and-editors.html",
          "author": null,
          "description": "Posted by Mike Rhemtulla, Product Manager\n      \nGoogle Workspace Marketplace is proud to announce the availability for developers to display pricing for their applications published in the Google Workspace Marketplace, and the date their application listing was last updated. \nLaunched over 11 years ago, Google Workspace Marketplace has been helping developers connect with the more than 3 billion people who use Google Workspace—with a stunning 4.8 billion apps installed to date. That incredible demand is fueling innovation in the ecosystem, and we now have more than 5300 public apps available in the Google Workspace Marketplace, plus thousands more private apps that customers have built for themselves.   \nApp Pricing \n  \nFor developers, you can now specify the app pricing choosing from Fre…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/9E8vUFjPOcI/app-pricing-update-details-and-editors.html",
          "publishedOn": "2021-10-13T17:02:00.000Z",
          "wordCount": 2873,
          "title": "App pricing, update details, and Editor’s choice now available on Google Workspace Marketplace."
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/ekr77vIqd6c/announcing-google-forms-api_01768004272.html",
          "author": null,
          "description": "Posted by Christian Schalk, Developer Advocate\n   \n    Announcing the Google Forms API \n    Google is proud to announce the Google Forms API! The Forms API is     currently available in Restricted Beta, with Open Beta expected to follow     in Q4. \n\n    Launched in 2008, Google Forms enables easy creation and distribution of     forms, surveys, and quizzes. Forms is used for a wide variety of use cases     across business operations, customer management, event planning and     logistics, education, and more. \n    Bringing Automation to Google Forms \n  \n    The new Google Forms API provides programmatic access for managing forms     and acting on responses, empowering developers to build powerful     integrations on top of Forms. The API supports two key use cases: \n\n    \n        \n         …",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/ekr77vIqd6c/announcing-google-forms-api_01768004272.html",
          "publishedOn": "2021-10-12T19:33:00.000Z",
          "wordCount": 3490,
          "title": "Announcing the Google Forms API"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/x0yMKXME5vY/granular-google-account-update.html",
          "author": null,
          "description": "Posted by Vikrant Rana, Product Manager, and Badi Azad, Group Product Manager\n   \nSummary\n  \nGoogle Identity strives to be the best stewards for Google Account users who entrust us to protect their data. At the same time, we want to help our developer community build apps that give users amazing experiences. Together, Google and developers can provide users three important ways to manage sharing their data: \n \nGive users control in deciding who has access to their account data  \nMake it easier and safer for users to share their Google Account data with your app when they choose to do so  \nMake it clear to users the specific data they are sharing with apps\n\n\nWhat we are doing today\n\nIn service of that stewardship, today we are announcing an OAuth consent experience that simplifies how users…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/x0yMKXME5vY/granular-google-account-update.html",
          "publishedOn": "2021-10-11T19:34:00.001Z",
          "wordCount": 2848,
          "title": "Google OAuth incremental authorization improvement"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/Eh273GMj9i8/what-is-the-dev-library.html",
          "author": null,
          "description": "Developers worldwide are creating open-source tools and tutorials; however, they have difficulty getting them discovered. The content published often spanned on many different sites—from GitHub to Medium. Therefore Google decided to create a space where the best projects related to Google technologies can be highlighted in one place—introducing the Dev Library, a curated archive of projects and articles built specifically using Google technologies. \nDev Library as a  platform showcases blog posts and open source tools with easy-to-use navigation for these product areas: Machine Learning, Flutter, Firebase, Angular, Cloud, and Android.  \nWhat makes the Dev Library unique?  \nNot all the articles or projects submitted by you, get on the site! A team of Google experts look for accuracy and rel…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/Eh273GMj9i8/what-is-the-dev-library.html",
          "publishedOn": "2021-10-07T17:17:00.002Z",
          "wordCount": 2939,
          "title": "What is Google’s Dev Library––a new open-source platform for developers"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/sUgf0z6FMT8/next-21-must-see-google-workspace.html",
          "author": null,
          "description": "Posted by Charles Maxson, Developer Advocate \n          \nGoogle Workspace offers a broad set of tools and capabilities that empowers creators and developers of all experience levels to build a wide range of custom productivity solutions. For professional developers looking to integrate their own app experiences into Workspace, the platform enables deep integrations with frameworks like Google Workspace Add-ons and Chat apps, as well as deep access to the full suite of Google Workspace apps via numerous REST APIs. And for citizen developers on the business side or developers looking to build solutions quickly and easily, tools like Apps Script and AppSheet make it simple to customize, extend, and automate workflows directly within Google Workspace. \nAt Next ‘21 we have 7 sessions you won’t …",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/sUgf0z6FMT8/next-21-must-see-google-workspace.html",
          "publishedOn": "2021-10-05T16:58:00.001Z",
          "wordCount": 3451,
          "title": "Next ‘21: Must-see Google Workspace sessions for developers and creators"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/z3dwjEVnbfg/introducing-flutter-meetup-network.html",
          "author": null,
          "description": "Posted by Sarah Fullmer, Program Manager\n     \nThe Flutter Meetup Network (FMN) is an international network of Meetup groups united by their enthusiasm for Flutter. The FMN program mission is to foster a thriving worldwide community of Flutter developers by empowering community organizers to educate and inspire local communities with engaging events.\nMeetups – and similar developer community groups - are a great resource. As Flutter has grown in popularity over the past few years, over 100 Meetup groups have sprung up organically around the world to celebrate and educate their members about Flutter. The volunteers who run these groups have hosted many awesome events and workshops. \n    \nWe, in the Flutter team, see and appreciate these amazing communities. 💙 The Flutter Meetup Network (FMN) is now being launched to support these groups officially. Network members will have access to various resources (more details available soon!), making it easier to plan and host Flutter-themed events. \nMeetups have many benefits, aside from networking. When stuck on an issue in your current Flutter project, chances are good that you can find a developer in your local Flutter Meetup who has solved a similar problem. Or, maybe they know the perfect package for your needs. \nWe are thrilled to support our amazing and passionate organizers and can’t wait to see what the Flutter Meetup Network does moving forward. \nJoin a Meetup near you! https://www.meetup.com/pro/flutter",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/z3dwjEVnbfg/introducing-flutter-meetup-network.html",
          "publishedOn": "2021-10-01T16:59:00.000Z",
          "wordCount": 2610,
          "title": "Introducing the Flutter Meetup Network!"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/mjO-uyvtCtE/youre-invited-to-google-smart-home-developer-summit.html",
          "author": null,
          "description": "Posted by Toni Klopfenstein, Developer Relations Engineer \n  \nToday there are over 276 million smart home households globally, and the industry continues to see rapid growth every year. Users have never been more comfortable bringing home new smart home devices — but they also continue to expect more from their devices, and their smart homes. To meet and exceed these expectations,   we want to make sure developers have the tools and support to build their best experience across the Google Home app, Nest, Android, and Assistant.  \nThat’s why we’re excited to announce the return of the Google Smart Home Developer Summit on October 21, 2021! This year’s event is free to join, fully virtual and will be hosted on our website with broadcast times available for our developer communities in the AMER, EMEA, and APAC regions. \nTo kick things off, Michele Turner, Senior Director of Product for Google’s Smart Home Ecosystem, will share our vision for the home and preview upcoming tools and features to build your next devices and apps using Matter and Thread — technologies transforming the industry. This will be followed by a developer keynote to dig deeper into announcements, and a round of technical sessions, workshops, and more, hosted by Google's smart home leaders. \nBuilding the best smart home platform means using trusted technology and intelligence to develop your integrations faster, provide tools to drive your innovation, and allow you new paths to growth. We can’t wait to engage with you and share more about how we can lead and grow the smart home together. \nYou can register for the Google Smart Home Developer Summit 2021 here, and follow along with the event using the tag #GoogleHomeSummit on social media. We hope to see you there!",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/mjO-uyvtCtE/youre-invited-to-google-smart-home-developer-summit.html",
          "publishedOn": "2021-09-30T15:58:00.000Z",
          "wordCount": 2662,
          "title": "You’re invited to the Google Smart Home Developer Summit"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/eynmsgArsls/save-the-date-fall-events-2021.html",
          "author": null,
          "description": "Posted by the Google Developer Team \n   Developers: it’s time to start marking your calendars, we’re hard at work on a busy slate of summits coming your way in just a few weeks. Here’s a quick rundown of three summits we just announced this week:  \n \nAndroid Dev Summit: October 27-28  \nChrome Dev Summit: November 3  \nFirebase Summit: November 10 \n\nAndroid Dev Summit is back, October 27-28\nDirectly from the team who builds Android, the Android Dev Summit returns this year on October 27-28. Join us to hear about the latest updates in Android development, centered on this year’s theme: excellent apps, across devices. We have over 30 sessions on a range of technical Android development topics. Plus, we’ve assembled the team that builds Android to get your burning #AskAndroid questions answered live. Interested in learning more? Be sure to sign up for updates through our Android newsletter here. \nDiscover, Connect, Inspire at Chrome Dev Summit 2021\nThe countdown to Chrome Dev Summit 2021 is on — and we can’t wait to share what we have in store. We’ll kick things off on November 3 by sharing the latest product updates in our keynote and hosting a live ask me anything (AMA) with Chrome leaders. You’ll also have the chance to chat live with Googlers and developers around the world, participate in workshops with industry experts, attend interactive learning lounges to consult with engineers in a group setting, and receive personalized support during one-on-one office hours. Everyone can tune into the keynote and AMA, but space is limited for the workshops, office hours, and learning lounges. Request an invite to secure your spot — we’ll see you on November 3! \nAnd follow the Firebase Twitter channel for more updates on Firebase Summit, which will be coming to you on November 10!",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/eynmsgArsls/save-the-date-fall-events-2021.html",
          "publishedOn": "2021-09-29T19:01:00.001Z",
          "wordCount": 2677,
          "title": "Mark your calendars: Android Dev Summit, Chrome Dev Summit and Firebase Summit are coming your way in a few weeks!"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/pdaM7uwWPps/how-to-use-app-engine-push-queues-in.html",
          "author": null,
          "description": "Posted by Wesley Chun (@wescpy), Developer Advocate, Google Cloud\n   \nIntroduction\n Since its original launch in 2008, many of the core Google App Engine services such as Datastore, Memcache, and Blobstore, have matured to become their own standalone products: for example, Cloud Datastore, Cloud Memorystore, and Cloud Storage, respectively. The same is true for App Engine Task Queues with Cloud Tasks. Today's Module 7 episode of Serverless Migration Station reviews how App Engine push tasks work, by adding this feature to an existing App Engine ndb Flask app. \n  \nApp Engine push queues in Flask apps video\n  \nThat app is where we left off at the end of Module 1, migrating its web framework from App Engine webapp2 to Flask. The app registers web page visits, creating a Datastore Entity for e…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/pdaM7uwWPps/how-to-use-app-engine-push-queues-in.html",
          "publishedOn": "2021-09-29T16:56:00.001Z",
          "wordCount": 2891,
          "title": "How to use App Engine push queues in Flask apps"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/XWoBPuUTpYs/exploring-serverless-with-nebulous-app.html",
          "author": null,
          "description": "Posted by Wesley Chun (@wescpy), Developer Advocate, Google Cloud\n  \nIntroduction\n\nGoogle Cloud offers three distinct ways of running your code or application in a serverless way, each serving different use cases. Google App Engine, our first Cloud product, was created to give users the ability to deploy source-based web applications or mobile backends directly to the cloud without the need of thinking about servers or scaling. Cloud Functions came later for scenarios where you may not have an entire app, great for one-off utility functions or event-driven microservices. Cloud Run is our latest fully-managed serverless product that gives developers the flexibility of containers along with the convenience of serverless. \nAs all are serverless compute platforms, users recognize they share so…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/XWoBPuUTpYs/exploring-serverless-with-nebulous-app.html",
          "publishedOn": "2021-09-28T17:00:00.002Z",
          "wordCount": 3660,
          "title": "Exploring serverless with a nebulous app: Deploy the same app to App Engine, Cloud Functions, or Cloud Run"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/hq9M70tEl70/gdg-nyc-positive-planet.html",
          "author": null,
          "description": "Posted by Kübra Zengin, Program Manager, Developer Relations\n            \nGoogle Developer Group (GDG) chapters are in a unique position to help make an impact during a time where many companies and businesses are trying to shift to a digital first world. Perhaps no one knows this better than GDG NYC Lead, Anna Nerezova. Over the past year, she’s seen firsthand just how powerful the GDG NYC community can be when the right opportunity presents itself. \n\nGDG NYC levels up their Google Cloud skills\n\nIn the past few years, Anna and other GDG NYC organizers have hosted a number of events focused on learning and sharing Cloud technologies with community members, including Cloud Study Jams and in-person workshops on Machine Learning Cloud-Speech-to-Text, Natural Language Processing, and more. Las…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/hq9M70tEl70/gdg-nyc-positive-planet.html",
          "publishedOn": "2021-09-27T17:00:00.002Z",
          "wordCount": 3275,
          "title": "GDG NYC members apply their skills to help a local nonprofit reach higher"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/zMMLdXPR18o/from-beginner-to-machine-learning-expert.html",
          "author": null,
          "description": "Posted by Salim Abid, MENA Regional Lead, Developer Relations\n     \nYara Elkady, Google Developer Student Club (GDSC) Lead, can trace her passion for tech all the way back to a single moment. She was sitting in computer class when her middle school teacher posed a question to the class: \n\n“Did you know that you can create apps and games like the ones that you spend so much time on?”\n\nIt was a simple question, but it was enough to plant the seed that would define the trajectory of Yara’s career. Following in the footsteps of so many beginners before her, Yara did a Google search to find out more about creating apps. She didn’t realize it at the time, but Yara had just taken her first steps down the path to becoming a developer. \nKnowing that she wanted to pursue tech further, Yara went to c…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/zMMLdXPR18o/from-beginner-to-machine-learning-expert.html",
          "publishedOn": "2021-09-22T16:59:00.004Z",
          "wordCount": 3375,
          "title": "From Beginner to Machine Learning Instructor In A Year"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/QS5xu3zyerY/run-code-directly-from-google-cloud-documentation.html",
          "author": null,
          "description": "Posted by Abby Carey, Developer Advocate\n \n Long gone are the days of looking for documentation, finding a how-to guide, and questioning whether the commands and code samples actually work. \nGoogle Cloud recently added a Cloud Shell integration within each and every documentation page. \nThis new functionality lets you test code in a preprovisioned virtual machine instance while learning about Google Cloud services. Running commands and code from the documentation cuts down on context switching between the documentation and a terminal window to run the commands in a tutorial. \nThis gif shows how Google Cloud’s documentation uses Cloud Shell, letting you run commands in a quickstart within your Cloud Shell environment. \n \n If you’re new to developing on Google Cloud, this creates a low barri…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/QS5xu3zyerY/run-code-directly-from-google-cloud-documentation.html",
          "publishedOn": "2021-09-21T17:30:00.005Z",
          "wordCount": 3083,
          "title": "Skip the setup— Run code directly from Google Cloud’s documentation"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/ft4i4rBon40/mentoring-future-women-experts.html",
          "author": null,
          "description": "Posted by Justyna Politanska-Pyszko\n Google Developers Experts is a global community of developers, engineers and thought leaders who passionately share their technical knowledge with others.  \nBecoming a Google Developers Expert is no easy task. First, you need to have strong skills in one of the technical areas - Android, Kotlin, Google Cloud, Machine Learning, Web Technologies, Angular, Firebase, Google Workspace, Flutter or other. You also need to have a track record of sharing your knowledge - be it via conference talks, your personal blog, youtube videos or in some other form. Finally, you need one more thing. The courage to approach an existing Expert or a Google employee and ask them to support your application. \nIt’s not easy, but it’s worth it. Joining the Experts community comes…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/ft4i4rBon40/mentoring-future-women-experts.html",
          "publishedOn": "2021-09-20T17:00:00.002Z",
          "wordCount": 2888,
          "title": "Mentoring future women Experts"
        }
      ]
    },
    {
      "title": "Many But Finite",
      "feedUrl": "https://feeds.feedburner.com/GustavoDuarte",
      "siteUrl": "https://manybutfinite.com/",
      "articles": []
    },
    {
      "title": "Krister Walfridsson’s blog",
      "feedUrl": "http://feeds.feedburner.com/KristerWalfridssonsBlog",
      "siteUrl": "https://kristerw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Python Insider",
      "feedUrl": "https://feeds.feedburner.com/PythonInsider",
      "siteUrl": "https://pythoninsider.blogspot.com/",
      "articles": [
        {
          "id": "http://feedproxy.google.com/~r/PythonInsider/~3/rfZ4c8nXGdk/python-3110a1-is-available.html",
          "author": null,
          "description": "Now that we are on a release spree, here you have the first alpha release of Python 3.11: Python 3.11.0a1. Let the testing and validation games begin!\nhttps://www.python.org/downloads/release/python-3110a1/\n\n\nMajor new features of the 3.11 series, compared to 3.10\nAmong the new major new features and changes so far:\n\n\nPEP 657 – Include Fine-Grained Error Locations in Tracebacks\nPEP 654 – PEP 654 – Exception Groups and except*\n(Hey, fellow core developer, if a feature you find important is missing from this list, let Pablo know.)\n\nThe next pre-release of Python 3.11 will be 3.11.0a2, currently scheduled for 2021-11-02.\n\nMore resources\n\nOnline Documentation\n\nPEP 664, 3.11 Release Schedule\nReport bugs at https://bugs.python.org.\n\nHelp fund Python and its community.\n\n\n\nAnd now for something co…",
          "link": "http://feedproxy.google.com/~r/PythonInsider/~3/rfZ4c8nXGdk/python-3110a1-is-available.html",
          "publishedOn": "2021-10-07T12:03:00.006Z",
          "wordCount": 873,
          "title": "Python 3.11.0a1 is available"
        },
        {
          "id": "http://feedproxy.google.com/~r/PythonInsider/~3/ojK529j7CAQ/python-3100-is-available.html",
          "author": null,
          "description": "On behalf of the Python development community and the Python 3.10 release team, I’m pleased to announce the availability of Python 3.10.0.\n\nPython 3.10.0 is the newest major release of the Python programming language, and it contains many new features and optimizations.\n\nhttps://www.python.org/downloads/release/python-3100/\nMajor new features of the 3.10 series, compared to 3.9\n\nAmong the new major new features and changes so far:\n\n\nPEP 623 – Deprecate and prepare for the removal of the wstr member in PyUnicodeObject.\n\nPEP 604 – Allow writing union types as X | Y\n\nPEP 612 – Parameter Specification Variables\n\nPEP 626 – Precise line numbers for debugging and other tools.\n\nPEP 618 – Add Optional Length-Checking To zip.\n\nbpo-12782: Parenthesized context managers are now officially allowed.\n\nPE…",
          "link": "http://feedproxy.google.com/~r/PythonInsider/~3/ojK529j7CAQ/python-3100-is-available.html",
          "publishedOn": "2021-10-04T21:07:00.006Z",
          "wordCount": 979,
          "title": "Python 3.10.0 is available"
        }
      ]
    },
    {
      "title": "from www.viva64.com",
      "feedUrl": "http://feeds.feedburner.com/viva64-blog-en",
      "siteUrl": "https://pvs-studio.com",
      "articles": [
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0873/",
          "author": null,
          "description": "Modern applications have lots of code. And the C++ language doesn't get easier. Nowadays, code reviews are not enough to fully analyze program code. Here's where static code analysis comes in.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/Xgk3xjidb8E/",
          "publishedOn": "2021-10-11T21:00:00.000Z",
          "wordCount": 4313,
          "title": "C++ tools evolution: static code analyzers"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/0872/",
          "author": null,
          "description": "We are actively developing the PVS-Studio static analysis tool towards detecting Safety and Security-related errors. To be more precise, we've expanded the coverage of the MISRA C:2012 and OWASP ASVS standards. We have supported the MISRA Compliance 2020 standard. One of the more extraordinary innovations is the Best Warnings display mode. This mode displays the most significant (meaningful) warnings and can be useful when you are just starting out with the analyzer.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/3DYby4goWRI/",
          "publishedOn": "2021-10-10T21:00:00.000Z",
          "wordCount": 2070,
          "title": "PVS-Studio 7.15: MISRA, CWE, OWASP, Unreal Engine"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0871/",
          "author": null,
          "description": "Commercial static analyzers perform deeper and fuller code analysis compared to compilers. Let's see what PVS-Studio found in the source code of the LLVM 13.0.0 project.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/XxVHaMPHKN0/",
          "publishedOn": "2021-10-07T21:00:00.000Z",
          "wordCount": 4975,
          "title": "Detecting errors in the LLVM release 13.0.0"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0870/",
          "author": null,
          "description": "On this episode, Rob Irving and Jason Turner are joined by David Barr. First, they discuss Microsoft open-source calculator and an update to CMake. Then they talk about David's YouTube channel – One Lone Coder, what inspired him to start it, and PixelGameEngine – the 2D game engine he works on with the One Lone Coder community.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/Ydv0sOrNk5Y/",
          "publishedOn": "2021-10-03T21:00:00.000Z",
          "wordCount": 4860,
          "title": "Text broadcast of CppCast 293: One Lone Coder"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/0869/",
          "author": null,
          "description": "For the first time PVS-Studio provided support for the CWE classification in the 6.21 release. It took place on January 15, 2018. Years have passed since then and we would like to tell you about the improvements related to the support of this classification in the latest analyzer version.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/ZPsC9Px8btc/",
          "publishedOn": "2021-09-27T21:00:00.000Z",
          "wordCount": 3129,
          "title": "CWE Top 25 2021. What is it, what is it for and how is it useful for static analysis?"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0868/",
          "author": null,
          "description": "In May 2021, CppCast recorded a podcast called ABI stability (CppCast #300). In this podcast, Marshall Clow and the hosts discussed rather old news — Visual Studio compilers support the AddressSantitzer tool. We have already integrated ASan into our testing system a long time ago. Now we want to tell you about a couple of interesting errors it found.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/APjUUfYG7N8/",
          "publishedOn": "2021-09-26T21:00:00.000Z",
          "wordCount": 3513,
          "title": "Why we need dynamic code analysis: the example of the PVS-Studio project"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/0867/",
          "author": null,
          "description": "After you read this article, you'll have the knowledge to create your own static analyzer for C#. With the help of the analyzer, you can find potential errors and vulnerabilities in the source code of your own and other projects. Are you intrigued? Well, let's get started.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/294cUpY4MnU/",
          "publishedOn": "2021-09-22T21:00:00.000Z",
          "wordCount": 6891,
          "title": "Creating Roslyn API-based static analyzer for C#"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0866/",
          "author": null,
          "description": "A couple of years ago the PVS-Studio analyzer got its first diagnostic rules to check program code compliance with the MISRA C and MISRA C++ standards. We collected feedback and saw that our clients were interested in using the analyzer to check their projects for MISRA compliance. So, we decided to further develop the analyzer in this direction. The article covers the MISRA C/C++ standard and the MISRA Compliance report. It also shows what we already managed to do and what we plan to achieve by the end of the year.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/LUhbbJ-3UyE/",
          "publishedOn": "2021-09-21T21:00:00.000Z",
          "wordCount": 4173,
          "title": "MISRA C: struggle for code quality and security"
        }
      ]
    },
    {
      "title": "Future",
      "feedUrl": "https://future.a16z.com/feed/",
      "siteUrl": "https://future.a16z.com",
      "articles": [
        {
          "id": "https://future.a16z.com/?p=2202",
          "author": "Chris Dixon",
          "description": "Major computing waves generally have two eras: the skeuomorphic era and the native era. In the skeuomorphic era, the design thinking is largely adapted from older domains. For example, the early web was mostly digital adaptations of pre-internet activities like letter writing and mail-order shopping. Websites back then were mostly read-only. It took about a... Read More\nThe post Tokens are a New Digital Primitive, Analogous to the Website appeared first on Future.",
          "link": "https://future.a16z.com/tokens-are-a-new-digital-primitive-analogous-to-the-website/",
          "publishedOn": "2021-10-13T15:00:55.000Z",
          "wordCount": 1133,
          "title": "Tokens are a New Digital Primitive, Analogous to the Website"
        },
        {
          "id": "https://future.a16z.com/?p=2193",
          "author": "Parag Khanna",
          "description": "Excerpted from MOVE: The Forces Uprooting Us, by Parag Khanna. Copyright © 2021 by Parag Khanna. Excerpted with permission by Scribner, a division of Simon & Schuster Inc., for Future by a16z.  The Great Lockdown of 2020 was also a Great Reset. Thousands of entrepreneurs chose to become digital nomads, ditching San Francisco for Costa... Read More\nThe post The World Needs a New Protocol for Global Travel appeared first on Future.",
          "link": "https://future.a16z.com/the-world-needs-a-new-protocol-for-global-travel/",
          "publishedOn": "2021-10-12T16:07:14.000Z",
          "wordCount": 2351,
          "title": "The World Needs a New Protocol for Global Travel"
        },
        {
          "id": "https://future.a16z.com/?p=2148",
          "author": "Molly Mielke",
          "description": "Within the past few years, tech companies’ digital design all started to look the same: marginally, monotonously quirky; safe. From the sans-serif fonts to the muted pastel color palette, the stark white backgrounds to the curvy shape and hue of the buttons, most modern software blurs together into a familiar, squint-and-you’ll-confuse-it aesthetic.  Historically, the look... Read More\nThe post Why We Crave Software With Style Over “Branding” appeared first on Future.",
          "link": "https://future.a16z.com/software-style-over-branding/",
          "publishedOn": "2021-10-08T15:30:37.000Z",
          "wordCount": 2697,
          "title": "Why We Crave Software With Style Over “Branding”"
        },
        {
          "id": "https://future.a16z.com/?p=2101",
          "author": "Zoran Basich",
          "description": "Web1 (roughly 1990-2005) was about open protocols that were decentralized and community-governed. Most of the value accrued to the edges of the network — users and builders. Web2 (roughly 2005-2020) was about siloed, centralized services run by corporations. Most of the value accrued to a handful of companies like Google, Apple, Amazon, and Facebook. We... Read More\nThe post Why Web3 Matters appeared first on Future.",
          "link": "https://future.a16z.com/why-web3-matters/",
          "publishedOn": "2021-10-07T13:00:46.000Z",
          "wordCount": 1168,
          "title": "Why Web3 Matters"
        },
        {
          "id": "https://future.a16z.com/?p=2072",
          "author": "Lauren Murrow",
          "description": "On the surface, the gaming and music industries share many similarities: both have an enormous impact on popular culture, drive billions of dollars in consumer spending each year, and rank #1 and #2, respectively, when Gen Z consumers are asked how they prefer to spend their free time.  Having spent the past 20 years in... Read More\nThe post The Music Industry Is Built on Artists, but Shuns Creators appeared first on Future.",
          "link": "https://future.a16z.com/music-copyright-ugc/",
          "publishedOn": "2021-10-05T16:30:16.000Z",
          "wordCount": 5318,
          "title": "The Music Industry Is Built on Artists, but Shuns Creators"
        },
        {
          "id": "https://future.a16z.com/?p=2073",
          "author": "Sonal Chokshi",
          "description": "We’ve now seen multiple trends come to fruition at the intersection of bio and technology over the past decade: A Moore’s Law for bio, thanks to computation; machine learning and AI transforming many areas of bio pharma and healthcare; the ability to not just “read”, but “write”, to bio, including CRISPR (even in just a... Read More\nThe post The Coming Age for Tech x Bio: The ‘Industrial Bio Complex’ appeared first on Future.",
          "link": "https://future.a16z.com/the-industrial-bio-complex-technology-biology/",
          "publishedOn": "2021-10-04T18:30:00.000Z",
          "wordCount": 4075,
          "title": "The Coming Age for Tech x Bio: The ‘Industrial Bio Complex’"
        },
        {
          "id": "https://future.a16z.com/?post_type=podcast&p=2058",
          "author": "Sonal Chokshi",
          "description": "There are lots of challenges in being public while trying to innovate, and limits to being a private company as well; but it’s rare to see a company go public then private then back to public again. As is the case with Dell Technologies, one of the largest tech companies — which went private 2012-2013 and... Read More\nThe post Cloud Wars & Company Wars: Play Nice, But Win appeared first on Future.",
          "link": "https://future.a16z.com/podcasts/cloud-wars-company-wars-play-nice-but-win-michael-dell-book/",
          "publishedOn": "2021-10-01T06:55:22.000Z",
          "wordCount": 836,
          "title": "Cloud Wars & Company Wars: Play Nice, But Win"
        },
        {
          "id": "https://future.a16z.com/?p=2032",
          "author": "Lauren Murrow",
          "description": "Reputation systems present an opportunity for platforms to recognize—and thus incentivize—participants’ high-quality contributions, including content creation, moderation, community building, and gameplay. This is crucial to the growth and sustainability of any web3 project. Yet designing reputation systems requires complex considerations around reputation supply, distribution, credibility, and more. So while many are exploring this space—from DAOs... Read More\nThe post A Novel Framework for Reputation-Based Systems appeared first on Future.",
          "link": "https://future.a16z.com/reputation-based-systems/",
          "publishedOn": "2021-09-30T15:00:22.000Z",
          "wordCount": 3798,
          "title": "A Novel Framework for Reputation-Based Systems"
        },
        {
          "id": "https://future.a16z.com/?p=2008",
          "author": "Zoran Basich",
          "description": "The promise of providing financial services to underserved communities around the globe is a key motivation for our work, and we’ve been concerned by a counterintuitive trend that’s taken root in Western economies over the past few decades. A growing share of GDP is flowing to the finance sector, but millions remain shut out of... Read More\nThe post Stablecoins, Stability, and Financial Inclusion appeared first on Future.",
          "link": "https://future.a16z.com/stablecoins-stability-and-financial-inclusion/",
          "publishedOn": "2021-09-27T09:00:37.000Z",
          "wordCount": 2612,
          "title": "Stablecoins, Stability, and Financial Inclusion"
        },
        {
          "id": "https://future.a16z.com/?p=1984",
          "author": "Lauren Murrow",
          "description": "Creator economy is a buzzy, often catchall term used to describe independent contractors. But in reality, most of the innovation has revolved around passion-project content (Substack for writing, Teachable for courses, etc.) and niche side projects. To date, “creator” tools have largely been quasi-horizontal, designed to serve broad categories of largely creative pursuits: writing, podcasting,... Read More\nThe post As More Workers Go Solo, the Software Stack Is the New Firm appeared first on Future.",
          "link": "https://future.a16z.com/solo-workers-software-stack/",
          "publishedOn": "2021-09-24T15:00:20.000Z",
          "wordCount": 3092,
          "title": "As More Workers Go Solo, the Software Stack Is the New Firm"
        },
        {
          "id": "https://future.a16z.com/?p=1945",
          "author": "Lauren Murrow",
          "description": "14 hours and 40 minutes. That’s the average daily media consumption in Latin America—the highest in the world, according to a recent GWI survey. In addition, Latin America tops the charts for internet usage: the average Brazilian spends more than 10 hours a day online (three hours longer than the global average). And 88 percent... Read More\nThe post Inside Latin America’s Creator Economy: Rich in Influence, Poor in Cash appeared first on Future.",
          "link": "https://future.a16z.com/latin-america-creator-economy/",
          "publishedOn": "2021-09-22T15:00:07.000Z",
          "wordCount": 2169,
          "title": "Inside Latin America’s Creator Economy: Rich in Influence, Poor in Cash"
        },
        {
          "id": "https://future.a16z.com/?p=1928",
          "author": "Zoran Basich",
          "description": "The following is an excerpt from the book UNCONTROLLED SPREAD by Scott Gottlieb, MD. Copyright © 2021 by Scott Gottlieb. Published on Future with permission by Harper, an imprint of HarperCollins Publishers. Establishing the odds that a lab might have played a role in expanding the COVID outbreak isn’t merely a curiosity, or a political... Read More\nThe post Global Labs Pose Major Threat — Here’s What U.S. Should Do appeared first on Future.",
          "link": "https://future.a16z.com/global-labs-pose-major-threat-heres-what-u-s-should-do/",
          "publishedOn": "2021-09-21T15:48:50.000Z",
          "wordCount": 2083,
          "title": "Global Labs Pose Major Threat — Here’s What U.S. Should Do"
        },
        {
          "id": "https://future.a16z.com/?post_type=podcast&p=1918",
          "author": "Sonal Chokshi",
          "description": "There’s no question technology played a huge role in the recent/current pandemic, including especially in the plug-and-play engineering and incredibly fast development behind the mRNA vaccines… But is there an even bigger role for the private sector, not just government, to play (and partner) when it comes to key infrastructure for future such emergencies, and... Read More\nThe post Uncontrolled Spread: Science, Policy, Institutions, Infrastructure appeared first on Future.",
          "link": "https://future.a16z.com/podcasts/uncontrolled-spread-gottlieb-book-science-policy-institutions-technology-infrastructure-public-private-pandemic-emergency-beyond/",
          "publishedOn": "2021-09-19T23:45:58.000Z",
          "wordCount": 564,
          "title": "Uncontrolled Spread: Science, Policy, Institutions, Infrastructure"
        },
        {
          "id": "https://future.a16z.com/?p=1543",
          "author": "Lauren Murrow",
          "description": "From one of the oldest known works of literature, The Epic of Gilgamesh, which chronicles a mythical quest for immortality, to today’s media fascination with young blood-transfusing biohackers, the notion of conquering aging has long captured our imagination. Conspicuously missing from this narrative, however, is an economic perspective: the monetary implications of curbing aging.   In... Read More\nThe post The Average American Would Pay $242,000 For One Extra Year of Good Health appeared first on Future.",
          "link": "https://future.a16z.com/economic-case-for-curbing-aging/",
          "publishedOn": "2021-09-15T15:00:30.000Z",
          "wordCount": 2153,
          "title": "The Average American Would Pay $242,000 For One Extra Year of Good Health"
        }
      ]
    },
    {
      "title": "Two Cents",
      "feedUrl": "https://hur.substack.com/feed",
      "siteUrl": "https://hur.substack.com",
      "articles": [
        {
          "id": "https://hur.substack.com/p/two-cents-49-nft-dao-metaverse-gtm-56a",
          "author": "Jin Ho Hur",
          "description": "[9월16일 오후 실수로 편집 도중 Part 2가 먼저 발송되어 버렸습니다ㅠㅠ 원래 일정대로 Part 1, Part 2를 다시 보내 드립니다 - 허진호] [스타트업] Here are all the companies from Y Combinator’s Summer 2021 Demo Day, Part 1 | TechCrunch Here are all the companies from Day 2 of Y Combinator’s Summer 2021 Demo Day | TechCrunch",
          "link": "https://hur.substack.com/p/two-cents-49-nft-dao-metaverse-gtm-56a",
          "publishedOn": "2021-09-17T01:10:06.000Z",
          "wordCount": null,
          "title": "[Two Cents #49] NFT, DAO, Metaverse; &#52285;&#50629;&#8202;-&#8202;&#49457;&#51109; &#51204;&#47029;, GTM; &#49884;&#51109;&#8202;-&#8202;BNPL, CRISPR, &#45367;&#54540;&#47533;&#49828; &#44172;&#51076;; &#49828;&#53440;&#53944;&#50629;&#8202;-&#8202;YC 2021, Airtable, Afterpay; &#51473;&#44397;&#8202;-&#8202;VC &#53804;&#51088;, &#48288;&#51060;&#51669; &#51613;&#49884;; FTX, SushiSwap; VC &#47784;&#45944; &#48320;&#54868;; &#49464;&#54028;&#54532;&#46993; (Part 2)",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F291f3a16-1f61-43ee-acb9-cb8eea2fab84_1600x810.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://hur.substack.com/p/two-cents-49-nft-dao-metaverse-gtm",
          "author": "Jin Ho Hur",
          "description": "[9월16일 오후 실수로 편집 도중 Part 2가 먼저 발송되어 버렸습니다ㅠㅠ 원래 일정대로 Part 1, Part 2를 다시 보내 드립니다 - 허진호] [Deep Dive] Vishal Kankani on Twitter: 1/ A long thread on why DAOs are the next logical step in our history and would bring incredible prosperity / Twitter Vishal Kankani on Twitter: 1/ Another long thread on DAOs. There would be millions of miniDAOs. They would come together to form composable and modularized bigDAOs that would have millions of people working for them. / Twitter",
          "link": "https://hur.substack.com/p/two-cents-49-nft-dao-metaverse-gtm",
          "publishedOn": "2021-09-17T01:00:46.000Z",
          "wordCount": null,
          "title": "[Two Cents #49] NFT, DAO, Metaverse; &#52285;&#50629;&#8202;-&#8202;&#49457;&#51109; &#51204;&#47029;, GTM; &#49884;&#51109;&#8202;-&#8202;BNPL, CRISPR, &#45367;&#54540;&#47533;&#49828; &#44172;&#51076;; &#49828;&#53440;&#53944;&#50629;&#8202;-&#8202;YC 2021, Airtable, Afterpay; &#51473;&#44397;&#8202;-&#8202;VC &#53804;&#51088;, &#48288;&#51060;&#51669; &#51613;&#49884;; FTX, SushiSwap; VC &#47784;&#45944; &#48320;&#54868;;&#160;&#49464;&#54028;&#54532;&#46993; (Part 1)",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fec43cbe8-300d-46fd-a596-a70391faa906_1440x810.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://hur.substack.com/p/two-cents-49-nft-dao-metaverse-gtm-dab",
          "author": "Jin Ho Hur",
          "description": "[스타트업] Here are all the companies from Y Combinator’s Summer 2021 Demo Day, Part 1 | TechCrunch Here are all the companies from Day 2 of Y Combinator’s Summer 2021 Demo Day | TechCrunch 요즘 새로 등장하는 스타트업 트렌드를 보기 위해 YC 데모데이는 빠지지 않고 보는 편인데, 이번 ’21 Summer batch에는 ‘아하’ 하는 스타트업이 거의 눈에 띄지 않는다. 아마 a16z, Benchmark, Sequoia 등의 주요 플레이어들이 모두 seed 단계까지 내려 오면서, 눈에 띄는 emerging 트렌드 회사는 모두 싹쓸이해 버려서인 듯. 최근 Clubhouse, BeReal, Poparazzi, YGG 등이 경쟁적으로 투자 받은 것 보면 알 수 있듯이.",
          "link": "https://hur.substack.com/p/two-cents-49-nft-dao-metaverse-gtm-dab",
          "publishedOn": "2021-09-16T07:53:26.000Z",
          "wordCount": null,
          "title": "[Two Cents #49] NFT, DAO, Metaverse; &#49884;&#51109;&#8202;-&#8202;&#49457;&#51109; &#51204;&#47029;, GTM; &#49884;&#51109;&#8202;-&#8202;BNPL, CRISPR, &#45367;&#54540;&#47533;&#49828; &#44172;&#51076;; &#49828;&#53440;&#53944;&#50629;&#8202;-&#8202;YC 2021, Airtable, Afterpay; &#51473;&#44397;&#8202;-&#8202;VC &#53804;&#51088;, &#48288;&#51060;&#51669; &#51613;&#49884;; FTX, SushiSwap; VC &#47784;&#45944; &#48320;&#54868;;&#160;&#49464;&#54028;&#54532;&#46993; (2/2)",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F291f3a16-1f61-43ee-acb9-cb8eea2fab84_1600x810.png",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Interrupt",
      "feedUrl": "https://interrupt.memfault.com/feed.xml",
      "siteUrl": "https://interrupt.memfault.com/",
      "articles": [
        {
          "id": "https://interrupt.memfault.com/blog/september-2021-roundup",
          "author": null,
          "description": "Here are the articles, videos, and tools that we’ve been excited about this\nSeptember.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/september-2021-roundup",
          "publishedOn": "2021-10-12T00:00:00.000Z",
          "wordCount": 948,
          "title": "What we've been reading in September"
        },
        {
          "id": "https://interrupt.memfault.com/blog/cmsis-packs",
          "author": null,
          "description": "In this article, we’ll take a look at what CMSIS-Packs are, and how they can be\nuseful!\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/cmsis-packs",
          "publishedOn": "2021-10-07T00:00:00.000Z",
          "wordCount": 1391,
          "title": "Peeking inside CMSIS-Packs"
        }
      ]
    },
    {
      "title": "News & Blog – IoT Security Foundation",
      "feedUrl": "https://www.iotsecurityfoundation.org/blog/feed",
      "siteUrl": "https://www.iotsecurityfoundation.org",
      "articles": [
        {
          "id": "https://www.iotsecurityfoundation.org/?p=21288",
          "author": "-",
          "description": "We’re delighted to announce Release 2 of our popular best practice guide on Vulnerability Disclosure Best Practice. This is an essential element of cybersecurity hygiene and was one of the first ever guides we published back in 2017 to support our mission to 'make it safe to connect'. So much has",
          "link": "https://www.iotsecurityfoundation.org/major-update-released-for-iotsfs-vulnerability-disclosure-best-practice-guide/",
          "publishedOn": "2021-09-28T08:05:36.000Z",
          "wordCount": 471,
          "title": "Major Update Released for IoTSF’s Vulnerability Disclosure Best Practice Guide"
        }
      ]
    },
    {
      "title": "james hunt (.us)",
      "feedUrl": "https://jameshunt.us/feed/",
      "siteUrl": "https://jameshunt.us",
      "articles": []
    },
    {
      "title": "Jay Carlson",
      "feedUrl": "https://jaycarlson.net/feed",
      "siteUrl": "https://jaycarlson.net",
      "articles": [
        {
          "id": "https://jaycarlson.net/?p=1914",
          "author": "Jay Carlson",
          "description": "My workspace has gone through a ton of changes over the years, but this year, I started making a concerted...\nThe post Here’s how I juggle embedded projects (home office/workspace tour) appeared first on Jay Carlson.",
          "link": "https://jaycarlson.net/2021/09/18/juggle-embedded-projects-home-office-workspace-tour/",
          "publishedOn": "2021-09-19T04:16:35.000Z",
          "wordCount": 6375,
          "title": "Here’s how I juggle embedded projects (home office/workspace tour)"
        }
      ]
    },
    {
      "title": "Kwang Yul Seo",
      "feedUrl": "https://kwangyulseo.com/feed/",
      "siteUrl": "https://kwangyulseo.com",
      "articles": []
    },
    {
      "title": "LimitedResults",
      "feedUrl": "https://limitedresults.com/feed/",
      "siteUrl": "https://limitedresults.com",
      "articles": []
    },
    {
      "title": "Lucky Resistor",
      "feedUrl": "https://luckyresistor.me/feed/",
      "siteUrl": "https://luckyresistor.me",
      "articles": []
    },
    {
      "title": "LWN.net",
      "feedUrl": "https://lwn.net/headlines/rss",
      "siteUrl": "https://lwn.net",
      "articles": [
        {
          "id": "https://lwn.net/Articles/872845/rss",
          "author": "ris",
          "description": "Stable kernels 5.14.12, 5.10.73, 5.4.153, and 4.19.211 have been released with important\nfixes. Users of those series should upgrade.",
          "link": "https://lwn.net/Articles/872845/rss",
          "publishedOn": "2021-10-13T14:57:37.000Z",
          "wordCount": 94,
          "title": "Four stable kernels"
        },
        {
          "id": "https://lwn.net/Articles/871490/rss",
          "author": "jake",
          "description": "We recently looked at\nsome of the changes and new features arriving with the upcoming\nversion 1.7 release of the Julia programming language.\nThe package system provided by the language makes it easier to\nexplore new language versions, while still preserving \nmultiple versions of various parts of the ecosystem.  This flexible system\ntakes care of dependency management, both \nfor writing exploratory code in the REPL and for\ndeveloping projects or libraries.",
          "link": "https://lwn.net/Articles/871490/rss",
          "publishedOn": "2021-10-13T14:55:19.000Z",
          "wordCount": null,
          "title": "[$] Digging into Julia's package system"
        },
        {
          "id": "https://lwn.net/Articles/872843/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (flatpak and ruby2.3), Fedora (flatpak, httpd, mediawiki, redis, and xstream), openSUSE (kernel, libaom, libqt5-qtsvg, systemd, and webkit2gtk3), Red Hat (.NET 5.0, 389-ds-base, httpd:2.4, kernel, kernel-rt, libxml2, openssl, and thunderbird), Scientific Linux (389-ds-base, kernel, libxml2, and openssl), SUSE (apache2-mod_auth_openidc, curl, glibc, kernel, libaom, libqt5-qtsvg, systemd, and webkit2gtk3), and Ubuntu (squashfs-tools).",
          "link": "https://lwn.net/Articles/872843/rss",
          "publishedOn": "2021-10-13T14:50:37.000Z",
          "wordCount": 129,
          "title": "Security updates for Wednesday"
        },
        {
          "id": "https://lwn.net/Articles/872321/rss",
          "author": "jake",
          "description": "There are many barriers to producing software that is reliable and\nmaintainable over the long term.  One of those is software complexity.  At\nthe recently concluded 2021 KVM\nForum, Paolo Bonzini\nexplored\nthis topic, using QEMU, the open source emulator\nand virtualizer, as a case study.  Drawing on his experience as\na maintainer of several QEMU subsystems, he made some concrete\nsuggestions on how to defend against undesirable complexity.  Bonzini\nused QEMU as a running example throughout the talk, hoping to make it\neasier for future contributors to modify QEMU.  However, the\nlessons he shared are equally applicable to many other projects.",
          "link": "https://lwn.net/Articles/872321/rss",
          "publishedOn": "2021-10-12T18:34:10.000Z",
          "wordCount": null,
          "title": "[$] A QEMU case study in grappling with software complexity"
        },
        {
          "id": "https://lwn.net/Articles/872696/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (firefox-esr, hiredis, and icu), Fedora (kernel), Mageia (libreoffice), openSUSE (chromium, firefox, git, go1.16, kernel, mbedtls, mupdf, and nodejs8), Oracle (firefox and kernel), Red Hat (firefox, grafana, kernel, kpatch-patch, and rh-mysql80-mysql), and SUSE (apache2, containerd, docker, runc, curl, firefox, kernel, libqt5-qtsvg, and squid).",
          "link": "https://lwn.net/Articles/872696/rss",
          "publishedOn": "2021-10-12T15:21:13.000Z",
          "wordCount": 122,
          "title": "Security updates for Tuesday"
        },
        {
          "id": "https://lwn.net/Articles/872639/rss",
          "author": "corbet",
          "description": "A group of researchers at Trinity College in Dublin has released the\nresults of a study into the data collected by a number of Android\nvariants.  There are few surprises here, but the picture is still\ndiscouraging.\n\n\n\tWe find that the Samsung, Xiaomi, Huawei and Realme Android\n\tvariants all transmit a substantial volume of data to the OS\n\tdeveloper (i.e. Samsung etc) and to third-party parties that have\n\tpre-installed system apps (including Google, Microsoft, Heytap,\n\tLinkedIn, Facebook). LineageOS sends similar volumes of data to\n\tGoogle as these proprietary Android variants, but we do not observe\n\tthe LineageOS developers themselves collecting data nor\n\tpre-installed system apps other than those of Google. Notably,\n\t/e/OS sends no information to Google or other third parties and\n\tsends essentially no information to the /e/OS developers.",
          "link": "https://lwn.net/Articles/872639/rss",
          "publishedOn": "2021-10-12T14:00:14.000Z",
          "wordCount": 220,
          "title": "A study of data collection by Android devices"
        },
        {
          "id": "https://lwn.net/Articles/872209/rss",
          "author": "corbet",
          "description": "One does not normally expect a lot of controversy around a patch series\nthat makes  changes to platform-specific configurations and drivers.\nThe furor over some work on the Samsung Exynos platform may thus be\nsurprising.  When one looks into the discussion, things become more clear;\nit mostly has to do with disagreements over the best ways to get hardware\nvendors to cooperate with the kernel development community.",
          "link": "https://lwn.net/Articles/872209/rss",
          "publishedOn": "2021-10-11T15:24:50.000Z",
          "wordCount": null,
          "title": "[$] The intersection of modules, GKI, and rocket science"
        },
        {
          "id": "https://lwn.net/Articles/872547/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (apache2, mediawiki, neutron, and tiff), Fedora (chromium, dr_libs, firefox, and grafana), Mageia (apache), openSUSE (chromium and rabbitmq-server), Oracle (kernel), Red Hat (firefox and httpd24-httpd), SUSE (rabbitmq-server), and Ubuntu (libntlm).",
          "link": "https://lwn.net/Articles/872547/rss",
          "publishedOn": "2021-10-11T15:00:57.000Z",
          "wordCount": 109,
          "title": "Security updates for Monday"
        },
        {
          "id": "https://lwn.net/Articles/872489/rss",
          "author": "corbet",
          "description": "Jörg Schilling, a longtime free-software developer, has passed on.  Most\npeople will remember him from his work on cdrtools and the seemingly endless drama that surrounded that\nwork.  He was a difficult character to deal with, but he also contributed\nsome important code that, for a period, almost all of us depended on.  Rest\nwell, Jörg.",
          "link": "https://lwn.net/Articles/872489/rss",
          "publishedOn": "2021-10-11T14:28:00.000Z",
          "wordCount": 129,
          "title": "Jörg Schilling is gone"
        },
        {
          "id": "https://lwn.net/Articles/872454/rss",
          "author": "corbet",
          "description": "The 5.15-rc5 kernel prepatch is out for\ntesting.  \"So things continue to look quite normal, and it looks like\nthe rough patch (hah!) we had early in the release is all behind us.  Knock\nwood.\"",
          "link": "https://lwn.net/Articles/872454/rss",
          "publishedOn": "2021-10-11T00:25:26.000Z",
          "wordCount": 110,
          "title": "Kernel prepatch 5.15-rc5"
        },
        {
          "id": "https://lwn.net/Articles/872445/rss",
          "author": "corbet",
          "description": "The\n5.14.11,\n5.10.72,\n5.4.152,\n4.19.210,\n4.14.250,\n4.9.286, and\n4.4.288\nstable kernel updates have all been released; each contains another set of\nimportant fixes.",
          "link": "https://lwn.net/Articles/872445/rss",
          "publishedOn": "2021-10-10T23:40:41.000Z",
          "wordCount": 104,
          "title": "A set of stable kernels"
        },
        {
          "id": "https://lwn.net/Articles/871982/rss",
          "author": "corbet",
          "description": "For the time being, the effort to add the folio\nconcept to the memory-management subsystem appears to be stalled, but appearances can\nbe deceiving.  The numerous folio discussions have produced a number of\npoints of consensus, though; one of those is that far too much of the\nkernel has to work with page structures to get its job done.  As\nan example of how a subsystem might be weaned off of struct page\nusage, Matthew Wilcox has split out\nthe slab allocators in a 62-part patch set.  The result may be\na foreshadowing of changes to come in the memory-management subsystem.",
          "link": "https://lwn.net/Articles/871982/rss",
          "publishedOn": "2021-10-08T14:29:59.000Z",
          "wordCount": null,
          "title": "[$] Pulling slabs out of struct page"
        },
        {
          "id": "https://lwn.net/Articles/872267/rss",
          "author": "jake",
          "description": "Security updates have been issued by Fedora (libssh), Mageia (firefox), Slackware (httpd), SUSE (xen), and Ubuntu (firefox and mysql-5.7).",
          "link": "https://lwn.net/Articles/872267/rss",
          "publishedOn": "2021-10-08T13:46:27.000Z",
          "wordCount": 92,
          "title": "Security updates for Friday"
        },
        {
          "id": "https://lwn.net/Articles/872194/rss",
          "author": "jake",
          "description": "Stable kernels 5.14.10 and 4.4.287 have been released.  5.14.10 is a\nstandard stable release, with fixes throughout the kernel tree, while\n4.4.287 is fixing a build problem: \"You only need this release if you\nare building for ARM64 and had build failures \nwith 4.4.286.\"",
          "link": "https://lwn.net/Articles/872194/rss",
          "publishedOn": "2021-10-07T19:19:32.000Z",
          "wordCount": 125,
          "title": "Stable kernels 5.14.10 and 4.4.287"
        },
        {
          "id": "https://lwn.net/Articles/871866/rss",
          "author": "corbet",
          "description": "Among the many new features pulled into the mainline during the 5.15 merge\nwindow is the ksmbd\nnetwork filesystem server.  Ksmbd implements the SMB protocol\n(also known as CIFS, though that name has gone out of favor) that is\nheavily used in the Windows world.  The creation of an in-kernel SMB server\nis a bit surprising, given that Linux has benefited greatly from the\nuser-space Samba solution since\nshortly after the\nbeginning.  There are reasons for this move but, in the short term at\nleast, they risk being overshadowed by a worrisome stream of\nsecurity-related problems in ksmbd.",
          "link": "https://lwn.net/Articles/871866/rss",
          "publishedOn": "2021-10-07T14:10:14.000Z",
          "wordCount": null,
          "title": "[$] A rough start for ksmbd"
        },
        {
          "id": "https://lwn.net/Articles/872154/rss",
          "author": "jake",
          "description": "Security updates have been issued by Debian (firefox-esr), Mageia (cockpit, fail2ban, libcryptopp, libss7, nodejs, opendmarc, and weechat), openSUSE (curl, ffmpeg, git, glibc, go1.16, libcryptopp, and nodejs8), SUSE (apache2, curl, ffmpeg, git, glibc, go1.16, grilo, libcryptopp, nodejs8, transfig, and webkit2gtk3), and Ubuntu (linux-oem-5.10 and python-bottle).",
          "link": "https://lwn.net/Articles/872154/rss",
          "publishedOn": "2021-10-07T13:30:18.000Z",
          "wordCount": 117,
          "title": "Security updates for Thursday"
        },
        {
          "id": "https://lwn.net/Articles/871390/rss",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for October 7, 2021 is available.",
          "link": "https://lwn.net/Articles/871390/rss",
          "publishedOn": "2021-10-07T01:03:58.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for October 7, 2021"
        },
        {
          "id": "https://lwn.net/Articles/871989/rss",
          "author": "jake",
          "description": "Sasha Levin, one of the maintainers of the stable kernels, gave a\npresentation at\nOpen\nSource Summit North America 2021 on a proposal for a different way to\nhandle the stable tree.   He noted that throughout most of the kernel's history,\nversion numbers did not really mean anything, but that the versioning\nscheme suggests that they do, which leads to a disconnect between how the\nkernels are seen versus how they are actually maintained.  He proposed\nmaking a \"rolling stable\" release that \nprovides users what they need—timely fixes to their kernel—without forcing\nthem to choose to switch to a new version number.",
          "link": "https://lwn.net/Articles/871989/rss",
          "publishedOn": "2021-10-06T22:00:46.000Z",
          "wordCount": null,
          "title": "[$] Rolling stable kernels"
        },
        {
          "id": "https://lwn.net/Articles/872030/rss",
          "author": "ris",
          "description": "Stable kernels 5.10.71, 5.4.151, 4.19.209, 4.14.249, 4.9.285, and 4.4.286 have been released.  They all contain\nimportant fixes and users should upgrade.\n\nNote that 5.14.10\nhas been through more than the usual number of release candidates and is\nnot yet out; it should show up in the next day or so.",
          "link": "https://lwn.net/Articles/872030/rss",
          "publishedOn": "2021-10-06T15:12:24.000Z",
          "wordCount": 125,
          "title": "Stable kernel updates"
        },
        {
          "id": "https://lwn.net/Articles/872029/rss",
          "author": "ris",
          "description": "Security updates have been issued by Fedora (cryptopp), Mageia (apache), Slackware (httpd), and Ubuntu (squid, squid3).",
          "link": "https://lwn.net/Articles/872029/rss",
          "publishedOn": "2021-10-06T15:03:31.000Z",
          "wordCount": 89,
          "title": "Security updates for Wednesday"
        },
        {
          "id": "https://lwn.net/Articles/871195/rss",
          "author": "jake",
          "description": "Two Google engineers came to Open\nSource Summit North America 2021 to talk about a project to change the\nway the company creates and maintains the kernel it runs in its data\ncenters on its production\nsystems. Andrew Delgadillo and Dylan Hatch described the current production\nkernel (Prodkernel) and the problems that occur because it is so far from\nthe mainline.  Project Icebreaker is an effort to change that and to\nprovide a near-mainline kernel for development and testing within Google;\nthe talk looked at the project, its risks, its current status, and its plans.",
          "link": "https://lwn.net/Articles/871195/rss",
          "publishedOn": "2021-10-05T21:52:43.000Z",
          "wordCount": null,
          "title": "[$] Moving Google toward the mainline"
        },
        {
          "id": "https://lwn.net/Articles/871992/rss",
          "author": "ris",
          "description": "The Asahi Linux project has a progress\nreport on its goal of running Linux on Mac M1 hardware.\n\nEarlier this year we saw the absolute lowest level drivers being merged into the kernel. Those are important for bring-up, but to get a usable system we need many more. Over September we’ve seen a lot of action on this front, with many important drivers now in review or even already merged for Linux 5.16. The goal of the Asahi Linux project is to upstream everything into the Linux kernel, so all our drivers are eventually headed for upstream review.",
          "link": "https://lwn.net/Articles/871992/rss",
          "publishedOn": "2021-10-05T20:55:32.000Z",
          "wordCount": 179,
          "title": "Asahi Linux Progress Report September"
        },
        {
          "id": "https://lwn.net/Articles/871985/rss",
          "author": "ris",
          "description": "The AlmaLinux Foundation has opened\nmembership to everyone.\n\nThe AlmaLinux Foundation [...] was created as a 501(c)(6) non-profit (the same as the Linux Foundation) in order to put OWNERSHIP of the OS, the Intellectual Property and the direction of the project into the hands of the community. By joining as a member (100% free for community members) you have the right and the ability to vote on board members and the direction of the project and other decisions as they will come up in the future.",
          "link": "https://lwn.net/Articles/871985/rss",
          "publishedOn": "2021-10-05T20:29:45.000Z",
          "wordCount": 164,
          "title": "AlmaLinux Foundation opens membership"
        },
        {
          "id": "https://lwn.net/Articles/871966/rss",
          "author": "ris",
          "description": "Firefox 93.0 has been released. With this version Firefox supports the new\nAVIF image format, which is based on the modern and royalty free AV1 video\ncodec. The PDF viewer supports filling more forms, such as XFA-based forms\nused by multiple governments and banks.  Downloads that rely on insecure\nconnections are blocked, protecting against potentially malicious or unsafe\ndownloads. Details on these features and more can be found in the release notes.",
          "link": "https://lwn.net/Articles/871966/rss",
          "publishedOn": "2021-10-05T16:10:29.000Z",
          "wordCount": 144,
          "title": "Firefox 93.0"
        },
        {
          "id": "https://lwn.net/Articles/871960/rss",
          "author": "corbet",
          "description": "Version 13.0.0 of the LLVM compiler suite is out.\nThere is a long list of changes, as always; see the numerous sets of\nrelease notes below for details.",
          "link": "https://lwn.net/Articles/871960/rss",
          "publishedOn": "2021-10-05T15:14:42.000Z",
          "wordCount": 98,
          "title": "LLVM 13.0.0 released"
        },
        {
          "id": "https://lwn.net/Articles/871948/rss",
          "author": "ris",
          "description": "Security updates have been issued by Fedora (cryptopp), Mageia (kernel, kernel-linus, and sqlite), openSUSE (rabbitmq-server), Red Hat (kernel and samba), SUSE (glibc and webkit2gtk3), and Ubuntu (containerd, docker.io, imlib2, ledgersmb, mercurial, mongodb, and node-bl).",
          "link": "https://lwn.net/Articles/871948/rss",
          "publishedOn": "2021-10-05T14:51:14.000Z",
          "wordCount": 107,
          "title": "Security updates for Tuesday"
        },
        {
          "id": "https://lwn.net/Articles/871878/rss",
          "author": "corbet",
          "description": "Version 3.10.0 of the Python language has been released.  There are a lot\nof significant changes in this release, including the much-discussed\nstructural pattern-matching feature.  See\nthis \narticle for an overview of what's in 3.10.",
          "link": "https://lwn.net/Articles/871878/rss",
          "publishedOn": "2021-10-04T21:17:07.000Z",
          "wordCount": 105,
          "title": "Python 3.10.0 released"
        },
        {
          "id": "https://lwn.net/Articles/871486/rss",
          "author": "jake",
          "description": "Julia is an open-source programming\nlanguage and ecosystem for high-performance scientific computing; its\ndevelopment team has made the first release candidate for version 1.7\navailable for testing on Linux, BSD, macOS, and Windows. Back in May, we looked at the increased performance that\narrived with Julia 1.6, its last major release. In this article we describe some of\nthe changes and new features in the language and its libraries that are\ncoming in 1.7.",
          "link": "https://lwn.net/Articles/871486/rss",
          "publishedOn": "2021-10-04T19:10:19.000Z",
          "wordCount": null,
          "title": "[$] New features coming in Julia 1.7"
        },
        {
          "id": "https://lwn.net/Articles/871283/rss",
          "author": "corbet",
          "description": "Developers working in languages like C or C++ have access to\ntwo competing compilers — GCC and LLVM — either of which can usually get\nthe job done.  Rust developers, though, are currently limited to the\nLLVM-based rustc compiler.  While rustc works well, there\nare legitimate reasons for developers to wish for an alternative.  As it\nturns out, there are two different ways to compile Rust using GCC under\ndevelopment, though neither is ready at the moment.  Developers of both\napproaches came to the 2021 Linux\nPlumbers Conference to present the status of their work.",
          "link": "https://lwn.net/Articles/871283/rss",
          "publishedOn": "2021-10-04T15:33:11.000Z",
          "wordCount": null,
          "title": "[$] Rust and GCC, two different ways"
        },
        {
          "id": "https://lwn.net/Articles/871841/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (apache2, fig2dev, mediawiki, plib, and qemu), Fedora (chromium, curl, kernel, kernel-headers, kernel-tools, openssh, rust-addr2line, rust-backtrace, rust-cranelift-bforest, rust-cranelift-codegen, rust-cranelift-codegen-meta, rust-cranelift-codegen-shared, rust-cranelift-entity, rust-cranelift-frontend, rust-cranelift-native, rust-cranelift-wasm, rust-gimli, rust-object, rust-wasmparser, rust-wasmtime-cache, rust-wasmtime-environ, rust-wasmtime-fiber, rust-wasmtime-types, rust-wast, rust-wat, and webkit2gtk3), Mageia (apache-mod_auth_openidc, c-ares, chromium-browser-stable, icu, libspf2, perl-DBI, python, and python-rsa), openSUSE (haproxy and opera), Oracle (kernel), SUSE (firefox and libvirt), and Ubuntu (python3.8).",
          "link": "https://lwn.net/Articles/871841/rss",
          "publishedOn": "2021-10-04T15:29:00.000Z",
          "wordCount": 137,
          "title": "Security updates for Monday"
        },
        {
          "id": "https://lwn.net/Articles/871737/rss",
          "author": "corbet",
          "description": "The 5.15-rc4 kernel prepatch is out for\ntesting.\n\n\n\tOne thing standing out in the diffs might be the m68k 'set_fs()'\n\tremoval - not really a regression fix, but it has been pending for\n\ta while, and it turned out that the problems attributed to it were\n\tdue to an entirely unrelated m68k signal handling issue. So with\n\tthat fixed, we could get rid of set_fs from another architecture.\n\n\nSee this article for information on\nset_fs() and its removal.",
          "link": "https://lwn.net/Articles/871737/rss",
          "publishedOn": "2021-10-03T23:32:10.000Z",
          "wordCount": 153,
          "title": "Kernel prepatch 5.15-rc4"
        },
        {
          "id": "https://lwn.net/Articles/871726/rss",
          "author": "jake",
          "description": "Paul McKenney has started a blog series on Rust for the Linux kernel.  He has posted six of a planned 11 articles, though several are labeled as \"under construction\".\n\nThis series focuses mostly on use cases and opportunities, rather than on any non-trivial solutions. Please note that I am not in any way attempting to dictate or limit Rust's level of ambition. I am instead noting the memory-model consequences of a few potential levels of ambition, ranging from \"portions of a few drivers\", \"a few drivers\", \"some core code\" and up to and including \"the entire kernel\". Greater levels of ambition will require greater willingness to accommodate a wider variety of LKMM [Linux-kernel memory model] requirements.\n\n[...]\nThese blog posts will therefore present approaches ranging upwards from trivial workarounds. But be warned that some of the high-quality approaches require profound reworking of compiler backends that have thus far failed to spark joy in the hearts of compiler writers. In addition, Rust enjoys considerable use outside of the Linux kernel, for example, as something into which to rewrite inefficient Python scripts. (A megawatt here, a megawatt there, and pretty soon you are talking about real power consumption!) Therefore, there are probably sharp limits beyond which the core Rust developers are unwilling to go.",
          "link": "https://lwn.net/Articles/871726/rss",
          "publishedOn": "2021-10-03T21:38:34.000Z",
          "wordCount": 305,
          "title": "McKenney: So You Want to Rust the Linux Kernel?"
        },
        {
          "id": "https://lwn.net/Articles/871237/rss",
          "author": "corbet",
          "description": "Much of the free-software development world has adopted Git forges (such as\nGitHub, GitLab, or sourcehut) with enthusiasm.  The kernel community has\nnot.  Reasons for that reticence vary, but one that is often heard is that\nthese forges simply don't work well at the scale needed for the kernel\nproject.  At a\nKernel-Summit session during the 2021 \nLinux Plumbers conference, Donald Zickus and Prarit Bhargava sought to\nshow how Red Hat has put GitLab to good use to support its kernel team.\nNot only can these forges work for kernel development, they said, but\nmoving to a forge can bring a number of advantages.",
          "link": "https://lwn.net/Articles/871237/rss",
          "publishedOn": "2021-10-01T15:10:08.000Z",
          "wordCount": null,
          "title": "[$] How Red Hat uses GitLab for kernel development"
        },
        {
          "id": "https://lwn.net/Articles/871564/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (curl, krb5, openssl1.0, and taglib), Fedora (cifs-utils), SUSE (libqt5-qtbase and rubygem-activerecord-4_2), and Ubuntu (linux-raspi, linux-raspi-5.4 and linux-raspi2).",
          "link": "https://lwn.net/Articles/871564/rss",
          "publishedOn": "2021-10-01T15:04:45.000Z",
          "wordCount": 97,
          "title": "Security updates for Friday"
        },
        {
          "id": "https://lwn.net/Articles/871451/rss",
          "author": "corbet",
          "description": "Adrian Ratiu writes\non the Collabora blog\nabout the challenges that face developers trying to build the GNU C\nLibrary with the LLVM compiler.\n\n\n\tIs it worth it to fix glibc (and other projects which support only\n\tGCC) to build with LLVM? Is it better to just replace them with\n\talternatives already supporting LLVM? Is it best to use both GCC\n\tand LLVM, each for their respective supported projects?\n\n\tThis post is an exploration starting from these questions but does\n\tnot attempt to give any definite answers. The intent here is to not\n\tbe divisive and controversial, but to raise awareness by describing\n\tparts of the current status-quo and to encourage collaboration.",
          "link": "https://lwn.net/Articles/871451/rss",
          "publishedOn": "2021-09-30T20:07:20.000Z",
          "wordCount": 202,
          "title": "Ratiu: A tale of two toolchains and glibc"
        },
        {
          "id": "https://lwn.net/Articles/871450/rss",
          "author": "corbet",
          "description": "James Bottomley explains\nhow the integration of Matrix and BigBlueButton was done for the\njust-concluded Linux Plumbers Conference.\n\n\n\tOne thing that emerged from our initial disaster with Matrix on the\n\tfirst day is that we failed to learn from the experiences of other\n\topen source conferences (i.e. FOSDEM, which used Matrix and ran\n\tinto the same problems). So, an object of this post is to document\n\tfor posterity what we did and how to repeat it.",
          "link": "https://lwn.net/Articles/871450/rss",
          "publishedOn": "2021-09-30T20:01:14.000Z",
          "wordCount": 166,
          "title": "Bottomley: Linux Plumbers Conference Matrix and BBB integration"
        },
        {
          "id": "https://lwn.net/Articles/871113/rss",
          "author": "corbet",
          "description": "The term \"interrupt\" brings to mind a signal that originates in the\nhardware and which is handled in the kernel; even software interrupts are a\nkernel concept.  But there is, it seems, a use case for enabling user-space\nprocesses to send interrupts directly to each other.  An upcoming Intel\nprocessor generation includes support for this capability; at the 2020 Linux Plumbers Conference,\nSohil Mehta ran a\nKernel-Summit session on how Linux might support that feature.",
          "link": "https://lwn.net/Articles/871113/rss",
          "publishedOn": "2021-09-30T19:43:46.000Z",
          "wordCount": null,
          "title": "[$] User-space interrupts"
        },
        {
          "id": "https://lwn.net/Articles/871425/rss",
          "author": "ris",
          "description": "Stable kernels 5.14.9, 5.10.70, and 5.4.150 have been released with the usual set\nof important fixes. Users of those series should upgrade.",
          "link": "https://lwn.net/Articles/871425/rss",
          "publishedOn": "2021-09-30T16:26:44.000Z",
          "wordCount": 97,
          "title": "Stable kernel updates"
        },
        {
          "id": "https://lwn.net/Articles/871424/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (libxstream-java, uwsgi, and weechat), Fedora (libspf2, libvirt, mingw-python3, mono-tools, python-flask-restx, and sharpziplib), Mageia (gstreamer, libgcrypt, libgd, mosquitto, php, python-pillow, qtwebengine5, and webkit2), openSUSE (postgresql12 and postgresql13), SUSE (haproxy, postgresql12, postgresql13, and rabbitmq-server), and Ubuntu (commons-io and linux-oem-5.13).",
          "link": "https://lwn.net/Articles/871424/rss",
          "publishedOn": "2021-09-30T16:19:33.000Z",
          "wordCount": 117,
          "title": "Security updates for Thursday"
        },
        {
          "id": "https://lwn.net/Articles/871389/rss",
          "author": "corbet",
          "description": "Version 14 of the PostgreSQL relational database manager is out.\n\n\nPostgreSQL 14 brings a variety of features that help developers and\nadministrators deploy their data-backed applications. PostgreSQL continues to\nadd innovations on complex data types, including more convenient access for\nJSON and support for noncontiguous ranges of data. This latest release adds\nto PostgreSQL's trend on improving high performance and distributed\ndata workloads, with advances in connection concurrency, high-write\nworkloads, query parallelism and logical replication.\n\n\nMore information can be found in the release\nnotes.",
          "link": "https://lwn.net/Articles/871389/rss",
          "publishedOn": "2021-09-30T15:50:57.000Z",
          "wordCount": 154,
          "title": "PostgreSQL 14 released"
        },
        {
          "id": "https://lwn.net/Articles/870121/rss",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for September 30, 2021 is available.",
          "link": "https://lwn.net/Articles/870121/rss",
          "publishedOn": "2021-09-30T00:20:01.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for September 30, 2021"
        },
        {
          "id": "https://lwn.net/Articles/870269/rss",
          "author": "corbet",
          "description": "Work toward the signing of BPF programs has\nbeen finding its way into recent mainline kernel releases; it is intended\nto improve security by limiting the BPF programs that can be successfully\nloaded into the kernel.  As John Fastabend described in his \"Watching\nthe super powers\" session at the 2021 Linux Plumbers Conference,\nthis new feature has the potential to completely break his tools.  But\nrather than just complain, he decided to investigate solutions; the result\nis an outline for an auditing mechanism that brings greater flexibility to\nthe problem of controlling which programs can be run.",
          "link": "https://lwn.net/Articles/870269/rss",
          "publishedOn": "2021-09-29T18:51:50.000Z",
          "wordCount": null,
          "title": "[$] Taming the BPF superpowers"
        },
        {
          "id": "https://lwn.net/Articles/871227/rss",
          "author": "ris",
          "description": "Security updates have been issued by Fedora (iaito, libssh, radare2, and squashfs-tools), openSUSE (hivex, shibboleth-sp, and transfig), SUSE (python-urllib3 and shibboleth-sp), and Ubuntu (apache2, linux, linux-aws, linux-aws-hwe, linux-azure, linux-azure-4.15, linux-dell300x, linux-gcp, linux-gcp-4.15, linux-hwe, linux-kvm, linux-oracle, linux-snapdragon, and linux-hwe-5.11, linux-azure, linux-azure-5.11, linux-oracle-5.11).",
          "link": "https://lwn.net/Articles/871227/rss",
          "publishedOn": "2021-09-29T15:29:10.000Z",
          "wordCount": 114,
          "title": "Security updates for Wednesday"
        },
        {
          "id": "https://lwn.net/Articles/870478/rss",
          "author": "jake",
          "description": "A controversy about the handling of the Time Zone Database (tzdb) has\nbeen brewing since May, but has come to a head in recent weeks.  \nChanges that were proposed to simplify the main database file have some\nconsequences in terms of time-zone history and changes to the\nrepresentation of some zones.  Those changes have upset a number of users\nof the database—to the point where some have called for a fork.  A \nSeptember 25 release of tzdb with some, but not\nall, of the changes seems unlikely to resolve the conflict.",
          "link": "https://lwn.net/Articles/870478/rss",
          "publishedOn": "2021-09-28T22:57:37.000Z",
          "wordCount": null,
          "title": "[$] A fork for the time-zone database?"
        },
        {
          "id": "https://lwn.net/Articles/871105/rss",
          "author": "ris",
          "description": "The Free Software Foundation Europe (FSFE) is organizing the coding\ncompetition \"Youth Hacking 4 Freedom\" (YH4F) for European teenagers\n(14-18).  Six winners will receive a cash prize and a trip to Brussels.\nThere will be an opening event October 10 and registration will remain open\nuntil October 31.\n\nOn Monday 1 November 2021, a five-month coding phase starts and the participants focus on coding until March 2022. Participants may bring all their imagination to the competition; they may code any type of software they want, as long as it is Free Software. The software project can be a stand-alone program written from scratch, or you can modify or combine existing programs. Everything is welcome! The participants will have the chance to briefly follow each other’s work and exchange ideas.",
          "link": "https://lwn.net/Articles/871105/rss",
          "publishedOn": "2021-09-28T17:45:34.000Z",
          "wordCount": 205,
          "title": "FSFE: Youth Hacking 4 Freedom"
        },
        {
          "id": "https://lwn.net/Articles/871096/rss",
          "author": "ris",
          "description": "Security updates have been issued by CentOS (kernel), openSUSE (gd, grilo, nodejs14, and transfig), Oracle (nodejs:14 and squid), Red Hat (kernel and shim and fwupd), SUSE (apache2, atftp, gd, and python-Pillow), and Ubuntu (apache2, linux, linux-aws, linux-aws-5.11, linux-gcp, linux-kvm, linux-oracle, linux-raspi, linux, linux-aws, linux-aws-5.4, linux-azure, linux-azure-5.4, linux-gcp, linux-gcp-5.4, linux-gke, linux-gke-5.4, linux-gkeop, linux-gkeop-5.4, linux-hwe-5.4, linux-kvm, linux-oracle, linux-oracle-5.4, and vim).",
          "link": "https://lwn.net/Articles/871096/rss",
          "publishedOn": "2021-09-28T15:09:38.000Z",
          "wordCount": 131,
          "title": "Security updates for Tuesday"
        },
        {
          "id": "https://lwn.net/Articles/870415/rss",
          "author": "corbet",
          "description": "The Kernel Maintainers Summit is an invitation-only gathering of top-level\nkernel subsystem maintainers; it is concerned mostly with process-oriented\nissues that are not easily worked out on the mailing lists.  There was no\nmaintainers summit in 2020; plans had been made to hold it in an electronic\nform, but there turned out to be a lack of things to talk about.  In 2021,\nthough, a number of interesting topics turned up, so an online gathering\nwas held on September 24 as part of the Linux Plumbers Conference.\n\nRead on for a summary of the discussions held at this year's Summit.",
          "link": "https://lwn.net/Articles/870415/rss",
          "publishedOn": "2021-09-27T17:19:21.000Z",
          "wordCount": null,
          "title": "[$] The 2021 Kernel Maintainers Summit"
        },
        {
          "id": "https://lwn.net/Articles/870597/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (kernel, libxml-security-java, and openssl), Fedora (fetchmail and python-rsa), openSUSE (grafana-piechart-panel and opera), and Red Hat (nodejs:14).",
          "link": "https://lwn.net/Articles/870597/rss",
          "publishedOn": "2021-09-27T14:22:39.000Z",
          "wordCount": 96,
          "title": "Security updates for Monday"
        },
        {
          "id": "https://lwn.net/Articles/870557/rss",
          "author": "corbet",
          "description": "The third 5.15 kernel prepatch is out for\ntesting.  \"So after a somewhat rocky merge window and second rc,\nthings are now actually looking pretty normal for rc3. Knock wood\".",
          "link": "https://lwn.net/Articles/870557/rss",
          "publishedOn": "2021-09-26T23:03:09.000Z",
          "wordCount": 105,
          "title": "Kernel prepatch 5.15-rc3"
        },
        {
          "id": "https://lwn.net/Articles/870542/rss",
          "author": "corbet",
          "description": "The\n5.14.8,\n5.10.69,\n5.4.149,\n4.19.208,\n4.14.248,\n4.9.284, and\n4.4.285\nstable kernels have all been released; each contains another set of\nimportant fixes.",
          "link": "https://lwn.net/Articles/870542/rss",
          "publishedOn": "2021-09-26T19:04:40.000Z",
          "wordCount": 100,
          "title": "Weekend stable kernel updates"
        },
        {
          "id": "https://lwn.net/Articles/870403/rss",
          "author": "corbet",
          "description": "The 2021 election for the Linux Foundation's Technical Advisory board\nresulted in all five incumbent members (Greg Kroah-Hartman, Jonathan\nCorbet, Steven Rostedt, Ted Ts'o, and Sasha Levin) being re-elected. Of the\n1,012 developers authorized to vote, 237 actually cast ballots.",
          "link": "https://lwn.net/Articles/870403/rss",
          "publishedOn": "2021-09-24T19:55:45.000Z",
          "wordCount": 131,
          "title": "Results from the 2021 Linux Foundation Technical Advisory Board election"
        },
        {
          "id": "https://lwn.net/Articles/870045/rss",
          "author": "corbet",
          "description": "It has often been said that the competition between the GCC and LLVM\ncompilers is good for both of them.  One place where that competition \nshows up is in the area of security features; if one compiler adds a way to\nharden programs, the other is likely to follow suit.  Qing\nZhao's session at the 2021\nLinux Plumbers Conference told the story of how GCC successfully played\ncatch-up for two security-related features that were of special interest to\nthe kernel community.",
          "link": "https://lwn.net/Articles/870045/rss",
          "publishedOn": "2021-09-24T17:04:24.000Z",
          "wordCount": null,
          "title": "[$] Two security improvements for GCC"
        },
        {
          "id": "https://lwn.net/Articles/870372/rss",
          "author": "jake",
          "description": "The GNU Core Utilities (coreutils) has announced the release of version 9.0 of \"the basic file, shell and text manipulation utilities\" used by the GNU operating system and various Linux distributions.  In the year and a half or so since the last major release (8.32), various new features were added, including:\n\ncp has changed how it handles data\n\n     \nenables CoW [copy on write] by default (through FICLONE ioctl),\n     \nuses copy offload where available (through copy_file_range),\n     \ndetects holes differently (though SEEK_HOLE)\n     \nThis also applies to mv and install.",
          "link": "https://lwn.net/Articles/870372/rss",
          "publishedOn": "2021-09-24T15:49:40.000Z",
          "wordCount": 154,
          "title": "coreutils-9.0 released"
        },
        {
          "id": "https://lwn.net/Articles/870365/rss",
          "author": "jake",
          "description": "Security updates have been issued by Debian (mupdf), Fedora (ghostscript, gifsicle, and ntfs-3g), openSUSE (kernel and nodejs14), and SUSE (curl, ffmpeg, gd, hivex, kernel, nodejs14, python-reportlab, sqlite3, and xen).",
          "link": "https://lwn.net/Articles/870365/rss",
          "publishedOn": "2021-09-24T14:17:42.000Z",
          "wordCount": 102,
          "title": "Security updates for Friday"
        },
        {
          "id": "https://lwn.net/Articles/870194/rss",
          "author": "corbet",
          "description": "Here's a\nlengthy missive from Lennart Poettering taking Linux distributors to\ntask for inadequately protecting systems from physical attacks.\n\n\n\tSo, does the scheme so far implemented by generic Linux\n\tdistributions protect us against the latter two scenarios?\n\tUnfortunately not at all. Because distributions set up disk\n\tencryption the way they do, and only bind it to a user password, an\n\tattacker can easily duplicate the disk, and then attempt to brute\n\tforce your password. What's worse: since code authentication ends\n\tat the kernel — and the initrd is not authenticated anymore —,\n\tbackdooring is trivially easy: an attacker can change the initrd\n\tany way they want, without having to fight any kind of protections.\n\n\nThe article contains a lot of suggestions for how to do things better.",
          "link": "https://lwn.net/Articles/870194/rss",
          "publishedOn": "2021-09-23T15:35:55.000Z",
          "wordCount": 217,
          "title": "Poettering: Authenticated Boot and Disk Encryption on Linux"
        },
        {
          "id": "https://lwn.net/Articles/869880/rss",
          "author": "corbet",
          "description": "For the second year in a row, the GNU Tools Cauldron (the annual gathering\nof GNU toolchain developers) has been held as a dedicated track at the\nonline Linux Plumbers\nConference.  For the 2021 event, that track started with a talk by\nDavid Malcolm on his work with the GCC -fanalyzer option, which\nprovides access to a number of static-analysis features.  Quite a bit has\nbeen happening with -fanalyzer and more is on the way with the\nupcoming GCC 12 release, including, possibly, a set of checks that\nhave already found at least one vulnerability in the kernel.",
          "link": "https://lwn.net/Articles/869880/rss",
          "publishedOn": "2021-09-23T15:11:07.000Z",
          "wordCount": null,
          "title": "[$] Improvements to GCC's -fanalyzer option"
        },
        {
          "id": "https://lwn.net/Articles/870190/rss",
          "author": "jake",
          "description": "Security updates have been issued by Debian (ruby-kaminari and tomcat8), Mageia (389-ds-base, ansible, apache, apr, cpio, curl, firefox, ghostscript, gifsicle, gpac, libarchive, libgd, libssh, lynx, nextcloud-client, openssl, postgresql, proftpd, python3, thunderbird, tor, and vim), openSUSE (chromium, ffmpeg, grilo, hivex, linuxptp, and samba), Oracle (go-toolset:ol8, kernel, kernel-container, krb5, mysql:8.0, and nodejs:12), SUSE (ffmpeg, firefox, grilo, hivex, kernel, linuxptp, nodejs14, and samba), and Ubuntu (ca-certificates, edk2, sqlparse, and webkit2gtk).",
          "link": "https://lwn.net/Articles/870190/rss",
          "publishedOn": "2021-09-23T14:38:07.000Z",
          "wordCount": 140,
          "title": "Security updates for Thursday"
        },
        {
          "id": "https://lwn.net/Articles/869381/rss",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for September 23, 2021 is available.",
          "link": "https://lwn.net/Articles/869381/rss",
          "publishedOn": "2021-09-23T00:35:43.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for September 23, 2021"
        },
        {
          "id": "https://lwn.net/Articles/870047/rss",
          "author": "jake",
          "description": "Over at the Guix-HPC blog, Ludovic Courtès writes about trying to package the PyTorch machine-learning library for the Guix distribution.  Building from source in a user-verifiable manner is part of the philosophy behind Guix, but there were a number of problems that were encountered:\n\nThe first surprise when starting packaging PyTorch is that, despite being on PyPI, PyTorch is first and foremost a large C++ code base. It does have a setup.py as commonly found in pure Python packages, but that file delegates the bulk of the work to CMake.\n\nThe second surprise is that PyTorch bundles (or \"vendors\", as some would say) source code for no less than 41 dependencies, ranging from small Python and C++ helper libraries to large C++ neural network tools. Like other distributions such as Debian, Guix avoids bundling: we would rather have one Guix package for each of these dependencies. The rationale is manifold, but it boils down to keeping things auditable, reducing resource usage, and making security updates practical.",
          "link": "https://lwn.net/Articles/870047/rss",
          "publishedOn": "2021-09-22T20:21:45.000Z",
          "wordCount": 252,
          "title": "Courtès: What's in a package"
        },
        {
          "id": "https://lwn.net/Articles/869942/rss",
          "author": "jake",
          "description": "A few weeks ago, Matthew Wilcox might have guessed that his session\nat the 2021 Linux\nPlumbers Conference would be focused rather differently.  But, as we reported earlier in September, his folio patch set ran into some, perhaps\nunexpected, opposition and, ultimately, did not land in the mainline for\n5.15.  Instead of discussing how to use folios as part\nof the File\nSystems microconference, he led a discussion that was, at least in part, on the\npath forward for them.",
          "link": "https://lwn.net/Articles/869942/rss",
          "publishedOn": "2021-09-22T18:52:16.000Z",
          "wordCount": null,
          "title": "[$] A discussion on folios"
        },
        {
          "id": "https://lwn.net/Articles/870031/rss",
          "author": "ris",
          "description": "The GNOME project has announced the\nrelease of GNOME 41.\n\nThe most notable changes this in release include an improved Software app, new multitasking settings, and enhanced power management features. With these changes, GNOME is smarter, more flexible, and offers a richer and more engaging experience than ever before.\n\nThe new release also comes with significant improvements for developers, including a new developer documentation website, a major new version of the Human Interface Guidelines, new features in the Builder IDE, GTK 4 enhancements, and much more.",
          "link": "https://lwn.net/Articles/870031/rss",
          "publishedOn": "2021-09-22T18:11:41.000Z",
          "wordCount": 166,
          "title": "GNOME 41 released"
        },
        {
          "id": "https://lwn.net/Articles/870015/rss",
          "author": "corbet",
          "description": "Craig Kerstiens highlights\nsome of the \"little things\" featured in the upcoming PostgreSQL 14\nrelease.\n\n\n\tAnd now in PostgreSQL 14 there is this seemingly small update,\n\tpipeline mode, which, according to the docs, allows applications to\n\tsend a query without having to read the result of the previously\n\tsent query.  Taking advantage of the pipeline mode, a client will\n\twait less for the server, since multiple queries/results can be\n\tsent/received in a single network transaction.",
          "link": "https://lwn.net/Articles/870015/rss",
          "publishedOn": "2021-09-22T16:31:40.000Z",
          "wordCount": 167,
          "title": "Postgres 14: It's The Little Things (Kerstiens)"
        },
        {
          "id": "https://lwn.net/Articles/870014/rss",
          "author": "corbet",
          "description": "The Google security blog provides\nan overview of what is being done to address memory-safety problems in\nthe Chrome browser.\n\n\n\tIn parallel, we’ll be exploring whether we can use a memory safe\n\tlanguage for parts of Chrome in the future. The leading contender\n\tis Rust, invented by our friends at Mozilla. This is (largely)\n\tcompile-time safe; that is, the Rust compiler spots mistakes with\n\tpointers before the code even gets to your device, and thus there’s\n\tno performance penalty. Yet there are open questions about whether\n\twe can make C++ and Rust work well enough together. Even if we\n\tstarted writing new large components in Rust tomorrow, we’d be\n\tunlikely to eliminate a significant proportion of security\n\tvulnerabilities for many years.",
          "link": "https://lwn.net/Articles/870014/rss",
          "publishedOn": "2021-09-22T16:27:54.000Z",
          "wordCount": 213,
          "title": "An update on Memory Safety in Chrome"
        },
        {
          "id": "https://lwn.net/Articles/870003/rss",
          "author": "ris",
          "description": "Stable kernels 5.14.7, 5.10.68, 5.4.148, 4.19.207, 4.14.247, 4.9.283, and 4.4.284 have been released. They all contain\nimportant fixes and users should upgrade.",
          "link": "https://lwn.net/Articles/870003/rss",
          "publishedOn": "2021-09-22T15:30:29.000Z",
          "wordCount": 103,
          "title": "A set of stable kernels"
        },
        {
          "id": "https://lwn.net/Articles/870002/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (grilo), Fedora (curl, firefox, mingw-python-pillow, python-pillow, python2-pillow, and webkit2gtk3), openSUSE (chromium, grafana-piechart-panel, kernel, libcroco, php-composer, and xen), Oracle (curl, kernel, and nss and nspr), Red Hat (nodejs:12), Slackware (alpine), SUSE (ghostscript, grafana-piechart-panel, kernel, and xen), and Ubuntu (linux, linux-hwe, linux-hwe-5.11, linux-hwe-5.4, linux-raspi, linux-raspi-5.4, and linux-raspi2).",
          "link": "https://lwn.net/Articles/870002/rss",
          "publishedOn": "2021-09-22T15:15:23.000Z",
          "wordCount": 125,
          "title": "Security updates for Wednesday"
        },
        {
          "id": "https://lwn.net/Articles/869944/rss",
          "author": "ris",
          "description": "Alyssa Rosenzweig reports\nthat the open-source Panfrost driver for Mali GPUs has achieved official\nconformance on Mali-G52 for OpenGL ES 3.1.\n\nThis important milestone is a step forward for the open source driver, as it now certifies Panfrost for use in commercial products containing Mali G52 and paves the way for further conformance submissions on other Mali GPUs.",
          "link": "https://lwn.net/Articles/869944/rss",
          "publishedOn": "2021-09-21T21:00:10.000Z",
          "wordCount": 156,
          "title": "Rosenzweig: Panfrost achieves OpenGL ES 3.1 conformance on Mali-G52"
        },
        {
          "id": "https://lwn.net/Articles/869842/rss",
          "author": "jake",
          "description": "Middleboxes are,\nunfortunately in many ways, a big part of today's internet.  While middleboxes\ninhabit the same physical niche as routers, they are not aimed at packet forwarding;\ninstead they are meant to monitor and manipulate the packets that they\nsee.  The effects of those devices on users of the networks they reign over may be\nunfortunate as well, but the rest of the internet is only affected when\ntrying to communicate with those users—or so it was thought.  Based on some\nrecently reported research, it turns out that middleboxes can be abused to \ninflict denial-of-service (DoS) attacks elsewhere on the net.",
          "link": "https://lwn.net/Articles/869842/rss",
          "publishedOn": "2021-09-21T20:09:19.000Z",
          "wordCount": null,
          "title": "[$] Weaponizing middleboxes"
        },
        {
          "id": "https://lwn.net/Articles/869923/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (webkit2gtk, wpewebkit, and xen), Oracle (kernel), Red Hat (curl, go-toolset:rhel8, krb5, mysql:8.0, nodejs:12, and nss and nspr), and Ubuntu (curl and tiff).",
          "link": "https://lwn.net/Articles/869923/rss",
          "publishedOn": "2021-09-21T15:07:36.000Z",
          "wordCount": 102,
          "title": "Security updates for Tuesday"
        },
        {
          "id": "https://lwn.net/Articles/869883/rss",
          "author": "corbet",
          "description": "Ben Hoyt has published a critical\noverview of the Python 3.10 pattern-matching feature.\n\n\n\tAs shown above, there are cases where match really\n\tshines. But they are few and far between, mostly when handling\n\tsyntax trees and writing parsers. A lot of code does have\n\tif ... elif chains, but these are often either\n\tplain switch-on-value, where elif works almost as well, or\n\tthe conditions they’re testing are a more complex combination of\n\ttests that don’t fit into case patterns (unless you use awkward\n\tcase _ if cond clauses, but that’s strictly worse than\n\telif).\n\n\n(Pattern matching has been covered here as\nwell).",
          "link": "https://lwn.net/Articles/869883/rss",
          "publishedOn": "2021-09-20T22:40:36.000Z",
          "wordCount": 189,
          "title": "Hoyt: Structural pattern matching in Python 3.10"
        },
        {
          "id": "https://lwn.net/Articles/869428/rss",
          "author": "corbet",
          "description": "The first day of the Kangrejos (Rust for Linux) conference\nintroduced the project and what it was trying to accomplish; day 2 covered a number of core Rust\nconcepts and their relevance to the kernel.  On the third and final day of\nthe conference, Wedson Almeida Filho delved deeper into how Rust can be\nmade to work in the Linux kernel, covered some of the lessons that have been\nlearned so far, and discussed next steps with a number of kernel\ndevelopers.",
          "link": "https://lwn.net/Articles/869428/rss",
          "publishedOn": "2021-09-20T16:27:05.000Z",
          "wordCount": null,
          "title": "[$] More Rust concepts for the kernel"
        },
        {
          "id": "https://lwn.net/Articles/869863/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (gnutls28, nettle, nextcloud-desktop, and openssl1.0), Fedora (dovecot-fts-xapian, drupal7, ghostscript, haproxy, libtpms, lynx, wordpress, and xen), openSUSE (xen), Red Hat (rh-ruby27-ruby), and SUSE (openssl, openssl1, and xen).",
          "link": "https://lwn.net/Articles/869863/rss",
          "publishedOn": "2021-09-20T15:26:49.000Z",
          "wordCount": 106,
          "title": "Security updates for Monday"
        },
        {
          "id": "https://lwn.net/Articles/869838/rss",
          "author": "corbet",
          "description": "The 5.15-rc2 kernel prepatch is out for\ntesting.\n\n\nSo I've spent a fair amount of this week trying to sort out all the\nodd warnings, and I want to particularly thank Guenter Roeck for his\nwork on tracking where the build failures due to -Werror come from.\n\nIs it done? No. But on the whole I'm feeling fairly good about this\nall, even if it has meant that I've been looking at some really odd\nand grotty code. Who knew I'd still worry about some odd EISA driver\non alpha, after all these years? A slight change of pace ;)",
          "link": "https://lwn.net/Articles/869838/rss",
          "publishedOn": "2021-09-20T13:17:26.000Z",
          "wordCount": 175,
          "title": "Kernel prepatch 5.15-rc2"
        },
        {
          "id": "https://lwn.net/Articles/869746/rss",
          "author": "corbet",
          "description": "The relatively large\n5.14.6,\n5.13.19, and\n5.10.67\nstable kernel updates have been released; each contains another set of\nimportant fixes.  Note that this is the final update for the 5.13.x\nseries.",
          "link": "https://lwn.net/Articles/869746/rss",
          "publishedOn": "2021-09-18T15:39:12.000Z",
          "wordCount": 112,
          "title": "A few weekend stable kernels"
        },
        {
          "id": "https://lwn.net/Articles/869561/rss",
          "author": "corbet",
          "description": "Here's a\npost from Christian Schaller describing a number of the\ndesktop-oriented improvements that can be expected in the Fedora 35\nrelease.\n\n\n\tAnd I know some people will wonder why we spent so much time\n\tworking with NVidia around their binary driver, but the reality is\n\tthat NVidia is the market leader, especially in the professional\n\tLinux workstation space, and there are lot of people who either\n\twould end up not using Linux or using Linux with X without it,\n\tincluding a lot of Red Hat customers and Fedora users. And that is\n\twhat I and my team are here for at the end of the day, to make sure\n\tRed Hat customers are able to get their job done using their Linux\n\tsystems.",
          "link": "https://lwn.net/Articles/869561/rss",
          "publishedOn": "2021-09-17T16:12:29.000Z",
          "wordCount": 211,
          "title": "Schaller: Cool happenings in Fedora Workstation land"
        },
        {
          "id": "https://lwn.net/Articles/869557/rss",
          "author": "corbet",
          "description": "Ariadne Conill looks\nat the difficulties caused by the OpenSSL 3 transition in the\ncontext of Alpine Linux.\n\n\n\tFor distributions, however, the story is different:\n\tcryptography moved to using Rust, because they wanted to\n\tleverage all of the static analysis capabilities built into the\n\tlanguage.  This, too, is a reasonable decision, from a development\n\tperspective.  From the ecosystem perspective, however, it is\n\tproblematic, as the Rust ecosystem is still rapidly evolving, and\n\tso we cannot support a single branch of the Rust compiler for an\n\tentire 2 year lifecycle, which means it exists in community.  Our\n\tsolution, historically, has been to hold cryptography at\n\tthe latest version that did not require Rust to build.  However,\n\tthat version is not compatible with OpenSSL 3, and so it will\n\teventually need to be upgraded to a new version which is.  And so,\n\tsince cryptography has to move to community, so does\n\tparamiko and Ansible.",
          "link": "https://lwn.net/Articles/869557/rss",
          "publishedOn": "2021-09-17T16:06:43.000Z",
          "wordCount": 239,
          "title": "Conill: The long-term consequences of maintainers’ actions"
        },
        {
          "id": "https://lwn.net/Articles/869317/rss",
          "author": "corbet",
          "description": "The first day of the online Kangrejos conference was focused on\nintroducing the effort to bring the Rust programming language into the \nLinux kernel.  On the second day, conference organizer Miguel Ojeda shifted\nto presenting the Rust language itself with an emphasis on what Rust can\nprovide for kernel development.  The result was a useful resource for\nanybody who is curious about this project, but who has not yet had the time\nto become familiar with Rust.",
          "link": "https://lwn.net/Articles/869317/rss",
          "publishedOn": "2021-09-17T15:55:55.000Z",
          "wordCount": null,
          "title": "[$] Key Rust concepts for the kernel"
        },
        {
          "id": "https://lwn.net/Articles/869521/rss",
          "author": "jake",
          "description": "Security updates have been issued by CentOS (firefox and thunderbird), Fedora (haproxy, wordpress, and xen), openSUSE (apache2-mod_auth_openidc, fail2ban, ghostscript, haserl, libcroco, nextcloud, and wireshark), Oracle (kernel and kernel-container), Slackware (httpd), SUSE (crmsh, gtk-vnc, libcroco, Mesa, postgresql12, postgresql13, and transfig), and Ubuntu (libgcrypt20, linux-gcp, linux-gcp-4.15, linux-hwe-5.4, linux-oem-5.13, python3.4, python3.5, and qtbase-opensource-src).",
          "link": "https://lwn.net/Articles/869521/rss",
          "publishedOn": "2021-09-17T13:59:28.000Z",
          "wordCount": 123,
          "title": "Security updates for Friday"
        },
        {
          "id": "https://lwn.net/Articles/869403/rss",
          "author": "jake",
          "description": "Four new stable kernels, 5.14.5, 5.13.18, 5.10.66, and 5.4.147, have been released.\n\nThis, and the other stable kernels released today, consist of only some\nreverts to solve some reported problems with the last round of stable\nreleases.  Upgrading is not required, but highly recommended.",
          "link": "https://lwn.net/Articles/869403/rss",
          "publishedOn": "2021-09-16T17:49:31.000Z",
          "wordCount": 119,
          "title": "Four stable kernels"
        },
        {
          "id": "https://lwn.net/Articles/869388/rss",
          "author": "corbet",
          "description": "This\nars technica article describes a problem with the Travis\ncontinuous-integration service:\n\n\n\tA security flaw in Travis CI potentially exposed the secrets of\n\tthousands of open source projects that rely on the hosted\n\tcontinuous integration service. Travis CI is a software-testing\n\tsolution used by over 900,000 open source projects and 600,000\n\tusers. A vulnerability in the tool made it possible for secure\n\tenvironment variables—signing keys, access credentials, and API\n\ttokens of all public open source projects—to be exfiltrated.\n\n\nAny project storing secrets in this service would be well advised to\nreplace them.",
          "link": "https://lwn.net/Articles/869388/rss",
          "publishedOn": "2021-09-16T15:42:04.000Z",
          "wordCount": 197,
          "title": "Travis CI flaw exposed secrets of thousands of open source projects (ars technica)"
        },
        {
          "id": "https://lwn.net/Articles/869145/rss",
          "author": "corbet",
          "description": "The first ever Rust for Linux conference, known as Kangrejos, got underway on\nSeptember 13.  Organizer Miguel Ojeda used the opening session to give\nan overview of why there is interest in using Rust in the kernel, where the\nchallenges are, and what the current status is.  The talk and following\ndiscussion provided a good overview of what is driving this initiative and\nwhere some of the sticking points might be.",
          "link": "https://lwn.net/Articles/869145/rss",
          "publishedOn": "2021-09-16T15:09:38.000Z",
          "wordCount": null,
          "title": "[$] The Rust for Linux project"
        },
        {
          "id": "https://lwn.net/Articles/869380/rss",
          "author": "jake",
          "description": "Security updates have been issued by Debian (sssd), Fedora (libtpms and vim), openSUSE (kernel and php7-pear), Oracle (kernel), Slackware (curl), and Ubuntu (libgcrypt20 and squashfs-tools).",
          "link": "https://lwn.net/Articles/869380/rss",
          "publishedOn": "2021-09-16T13:22:27.000Z",
          "wordCount": 98,
          "title": "Security updates for Thursday"
        },
        {
          "id": "https://lwn.net/Articles/868745/rss",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for September 16, 2021 is available.",
          "link": "https://lwn.net/Articles/868745/rss",
          "publishedOn": "2021-09-16T00:55:35.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for September 16, 2021"
        },
        {
          "id": "https://lwn.net/Articles/869231/rss",
          "author": "jake",
          "description": "Back in January 2020, we looked at some\noddities in Python's handling of Not a Number (NaN) values in\nits statistics\nmodule.  The conversation went quiet after that, but it has been\nrevived recently with an eye toward fixing the problems that were reported.\nAs detailed in that earlier article, NaNs are rather strange beasts in the\nfloating-point universe, so figuring out how best to deal with their\npresence is less straightforward than it might seem.",
          "link": "https://lwn.net/Articles/869231/rss",
          "publishedOn": "2021-09-15T22:16:35.000Z",
          "wordCount": null,
          "title": "[$] Revisiting NaNs in Python"
        },
        {
          "id": "https://lwn.net/Articles/869302/rss",
          "author": "ris",
          "description": "Stable kernels 5.14.4, 5.13.17, 5.10.65, and 5.4.146 have been released.  There are\nimportant fixes throughout the tree and users should upgrade.",
          "link": "https://lwn.net/Articles/869302/rss",
          "publishedOn": "2021-09-15T15:45:50.000Z",
          "wordCount": 96,
          "title": "Four stable kernels"
        },
        {
          "id": "https://lwn.net/Articles/869301/rss",
          "author": "ris",
          "description": "Security updates have been issued by Arch Linux (chromium, element-desktop, element-web, firefox, ghostscript, and hedgedoc), Fedora (kernel and openssl), openSUSE (ghostscript, htmldoc, and openssl-1_0_0), Oracle (libtirpc), Red Hat (cyrus-imapd, kernel, and kernel-rt), SUSE (ghostscript), and Ubuntu (apport, curl, and squashfs-tools).",
          "link": "https://lwn.net/Articles/869301/rss",
          "publishedOn": "2021-09-15T15:36:10.000Z",
          "wordCount": 113,
          "title": "Security updates for Wednesday"
        },
        {
          "id": "https://lwn.net/Articles/869118/rss",
          "author": "jake",
          "description": "The Roundup Issue Tracker\nis a flexible tool for managing issues via the web or\nemail. However, Roundup is useful for more than\nweb-based bug tracking or help-desk ticketing; it can be used as a simple \nwiki or to manage tasks\nwith the Getting Things\nDone (GTD) \nmethodology. The 20th-anniversary\nedition of\nRoundup,\nversion 2.1.0, was\nreleased in July; it is a maintenance release, but there have been a number\nof larger improvements in the last year or so. Here we introduce \nRoundup's\nfeatures along with the\nrecent developments that have helped make Roundup even more useful for tracking\nissues to their resolution.",
          "link": "https://lwn.net/Articles/869118/rss",
          "publishedOn": "2021-09-14T22:27:17.000Z",
          "wordCount": null,
          "title": "[$] Roundup: managing issues for 20 years"
        },
        {
          "id": "https://lwn.net/Articles/869221/rss",
          "author": "ris",
          "description": "Security updates have been issued by openSUSE (libaom and nextcloud), Oracle (cyrus-imapd, firefox, and thunderbird), Red Hat (kernel and kpatch-patch), Scientific Linux (firefox and thunderbird), and Ubuntu (apport).",
          "link": "https://lwn.net/Articles/869221/rss",
          "publishedOn": "2021-09-14T14:58:03.000Z",
          "wordCount": 101,
          "title": "Security updates for Tuesday"
        }
      ]
    },
    {
      "title": "M0AGX",
      "feedUrl": "https://m0agx.eu/feed/",
      "siteUrl": "https://m0agx.eu",
      "articles": []
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://martinfowler.com/articles/2021-responsible-tech-playbook.html",
          "author": null,
          "description": "Those of us developing software don’t need to be told what a big impact it’s had on humanity this century. I’ve long maintained that this places a serious responsibility on our profession. Whether asked to or not, we have a duty to ensure our systems don’t degrade our society. But in the tumult of so many software projects, it can be difficult to step back and understand the implications of our work. In the last few months my colleagues at Thoughtworks have been putting together a catalog of techniques that we can use to address this problem, which they published as the Responsible Tech Playbook.\n\nThe playbook is a free PDF download of about 50 slides, the bulk of which is a summary of a dozen tools and methods that teams can use to better understand their responsibilities. Each summary is…",
          "link": "https://martinfowler.com/articles/2021-responsible-tech-playbook.html",
          "publishedOn": "2021-10-06T14:30:00.000Z",
          "wordCount": 539,
          "title": "Responsible Tech Playbook"
        }
      ]
    },
    {
      "title": "MCU on Eclipse",
      "feedUrl": "https://mcuoneclipse.com/feed/",
      "siteUrl": "https://mcuoneclipse.com",
      "articles": [
        {
          "id": "http://mcuoneclipse.com/?p=33592",
          "author": "Erich Styger",
          "description": "It is interesting to see that some aspects (mostly unintended) can stimulate lots of good and fruitful discussions. So this happened with “Spilling the Beans: Endless Loops” (recommended to read 🙂 where using (or not using) volatile for inline assembly created … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/10/12/spilling-the-beans-volatile-qualifier/",
          "publishedOn": "2021-10-12T05:35:47.000Z",
          "wordCount": 1765,
          "title": "Spilling the Beans: volatile Qualifier"
        },
        {
          "id": "http://mcuoneclipse.com/?p=33568",
          "author": "Erich Styger",
          "description": "In “Spilling the Beans: Endless Loops” several ways of creating and using endless loops were discussed. In this ‘bean’ it is about how to exit or break a loop. Usually a loop has a ‘ending condition’. The following examples print … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/10/10/spilling-the-beans-breaking-loops/",
          "publishedOn": "2021-10-10T08:08:06.000Z",
          "wordCount": 1126,
          "title": "Spilling the Beans: Breaking Loops"
        },
        {
          "id": "http://mcuoneclipse.com/?p=33526",
          "author": "Erich Styger",
          "description": "The university lectures are kind of ‘back to normal’: with the COVID certificates mandatory, many former limitations (social distance, masks, …) have been relaxed. So this means there are now many more questions and discussions with students. One of the … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/10/04/spilling-the-beans-endless-loops/",
          "publishedOn": "2021-10-04T21:26:00.000Z",
          "wordCount": 1825,
          "title": "Spilling the Beans: Endless Loops"
        },
        {
          "id": "http://mcuoneclipse.com/?p=33499",
          "author": "Erich Styger",
          "description": "For me the Cortex-Debug Visual Studio extension by marus25 is the standard way to use VSC for embedded development. Another ‘standard’ piece I’m using in many of my projects is the SEGGER RTT. Outline RTT is a bidirectional-multi-channel communication protocol … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/10/03/visual-studio-code-for-c-c-with-arm-cortex-m-part-9-rtt/",
          "publishedOn": "2021-10-03T12:39:33.000Z",
          "wordCount": 883,
          "title": "Visual Studio Code for C/C++ with ARM Cortex-M: Part 9 – RTT"
        },
        {
          "id": "http://mcuoneclipse.com/?p=33262",
          "author": "Erich Styger",
          "description": "A beautiful trail high above the timber line, spectacular views over the Saas Valley in Switzerland, this is the “Almageller Höhenweg”. The Saas Valley is located in the Canton Wallis in Switzerland, on the border to Italy. Part of the … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/09/27/not-for-the-faint-hearted-almagell-high-altitude-trail-round-trip/",
          "publishedOn": "2021-09-27T21:17:00.000Z",
          "wordCount": 1494,
          "title": "Not for the faint-hearted: Almagell High-Altitude Trail Round Trip"
        },
        {
          "id": "http://mcuoneclipse.com/?p=33275",
          "author": "Erich Styger",
          "description": "This tutorial shows how to use and collect coverage data using the GNU gcov tool. As board and hardaware I’m using the NXP i.MX RT1064 EVK: While this tutorial uses this specific board, things are pretty generic and should be … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/09/19/tutorial-gnu-gcov-coverage-with-the-nxp-i-mx-rt1064/",
          "publishedOn": "2021-09-19T17:11:34.000Z",
          "wordCount": 1054,
          "title": "Tutorial: GNU gcov Coverage with the NXP i.MX RT1064"
        }
      ]
    },
    {
      "title": "The ESP Journal - Medium",
      "feedUrl": "https://medium.com/feed/the-esp-journal",
      "siteUrl": "https://blog.espressif.com?source=rss----d5414d5dee73---4",
      "articles": []
    },
    {
      "title": "/* the devil is in the detail */",
      "feedUrl": "https://minjang.github.io/feed.xml",
      "siteUrl": "http://minjang.github.io/",
      "articles": []
    },
    {
      "title": "mingrammer's note",
      "feedUrl": "https://mingrammer.com/index.xml",
      "siteUrl": "https://mingrammer.com/",
      "articles": []
    },
    {
      "title": "Novel Bits",
      "feedUrl": "https://www.novelbits.io/feed",
      "siteUrl": "https://www.novelbits.io",
      "articles": []
    },
    {
      "title": "null program",
      "feedUrl": "https://nullprogram.com/feed/",
      "siteUrl": "https://nullprogram.com",
      "articles": [
        {
          "id": "https://nullprogram.com/blog/2021/09/15/",
          "author": null,
          "description": "This article was discussed on Hacker News.\nYears ago, OpenBSD gained two new security system calls, pledge(2)\n(originally tame(2)) and unveil. In both, an application\nsurrenders capabilities at run-time. The idea is to perform initialization\nlike usual, then drop capabilities before handling untrusted input,\nlimiting unwanted side effects. This feature is applicable even where type\nsafety isn’t an issue, such as Python, where a program might still get\ntricked into accessing sensitive files or making network connections when\nit shouldn’t. So how can a Python program access these system calls?\nAs discussed previously, it’s quite easy to access C APIs from\nPython through its ctypes package, and this is no exception.\nIn this article I show how to do it. Here’s the full source if you want to\ndi…",
          "link": "https://nullprogram.com/blog/2021/09/15/",
          "publishedOn": "2021-09-15T02:46:56.000Z",
          "wordCount": 1194,
          "title": "OpenBSD's pledge and unveil from Python"
        },
        {
          "id": "https://nullprogram.com/blog/2021/09/14/",
          "author": null,
          "description": "My friend over at Possibly Wrong created a code name generator. By\ncoincidence I happened to be thinking about code names myself while\nrecently replaying XCOM: Enemy Within (2012/2013). The game\ngenerates a random code name for each mission, and I wondered how often it\nrepeats. The UFOpaedia page on the topic gives the word lists: 53\nadjectives and 76 nouns, for a total of 4028 possible code names. A\ntypical game has around 60 missions, and if code names are generated\nnaively on the fly, then per the birthday paradox around half of all games\nwill see a repeated mission code name! Fortunately this is easy to avoid,\nand the particular configuration here lends itself to an interesting\nimplementation.\nMission code names are built using “adjective noun”. Some examples\nfrom the game’s word list:…",
          "link": "https://nullprogram.com/blog/2021/09/14/",
          "publishedOn": "2021-09-14T21:06:59.000Z",
          "wordCount": 1732,
          "title": "Billions of Code Name Permutations in 32 bits"
        }
      ]
    },
    {
      "title": "Preshing on Programming",
      "feedUrl": "http://preshing.com/feed",
      "siteUrl": "https://preshing.com/feed",
      "articles": []
    },
    {
      "title": "research!rsc",
      "feedUrl": "https://research.swtch.com/feed.atom",
      "siteUrl": "http://research.swtch.com/feed.atom",
      "articles": []
    },
    {
      "title": "AEP코리아네트",
      "feedUrl": "https://rss.blog.naver.com/aepkoreanet.xml",
      "siteUrl": "https://blog.naver.com/aepkoreanet",
      "articles": []
    },
    {
      "title": "애자일 이야기",
      "feedUrl": "http://rss.egloos.com/blog/agile",
      "siteUrl": "http://agile.egloos.com",
      "articles": []
    },
    {
      "title": "Embedded Rambling",
      "feedUrl": "http://shadetail.com/blog/feed/",
      "siteUrl": "http://shadetail.com/blog",
      "articles": []
    },
    {
      "title": "Stacey on IoT | Internet of Things news and analysis",
      "feedUrl": "https://staceyoniot.com/feed/",
      "siteUrl": "https://staceyoniot.com",
      "articles": [
        {
          "id": "https://staceyoniot.com/?p=9112",
          "author": "Stacey Higginbotham",
          "description": "Most IoT platform businesses focus on providing the connectivity and data pipeline to a cloud service. Generally, they focus on features such as device management, device provisioning, basic security, data transfer, and maybe a container strategy. Some provide hardware in the form of pre-built boards full of silicon, while others start with a software development […]\nThe post Mason will build IoT hardware so businesses don’t have to appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/mason-will-build-iot-hardware-so-businesses-dont-have-to/",
          "publishedOn": "2021-10-12T13:00:55.000Z",
          "wordCount": 982,
          "title": "Mason will build IoT hardware so businesses don’t have to"
        },
        {
          "id": "https://staceyoniot.com/?p=9116",
          "author": "Kevin C. Tofel",
          "description": "On our most recent IoT Podcast, Derrick called in with a question about retiring smart home devices. He’s wondering how we dispose of ours since we do go through more connected products than most people. Derrick wants to replace his current Ring devices with Nest products since he uses Google Home as his smart home […]\nThe post Where are the best places to sell your used smart home devices? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/where-are-the-best-places-to-sell-your-used-smart-home-devices/",
          "publishedOn": "2021-10-11T16:56:40.000Z",
          "wordCount": 660,
          "title": "Where are the best places to sell your used smart home devices?"
        },
        {
          "id": "https://staceyoniot.com/?p=9109",
          "author": "Stacey Higginbotham",
          "description": "This week, Arlo launched what I generously think of as its pay-for-customer-service enticement for its smart home camera products. As of Oct. 4, customers without a subscription who’ve had their devices for more than 90 days no longer get phone support. And after one year, they lose access to live chat support. Those non-subscription customers will […]\nThe post Arlo’s search for subscriptions gets desperate appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/arlos-search-for-subscriptions-gets-desperate/",
          "publishedOn": "2021-10-11T13:00:05.000Z",
          "wordCount": 971,
          "title": "Arlo’s search for subscriptions gets desperate"
        },
        {
          "id": "https://staceyoniot.com/?p=9107",
          "author": "Stacey Higginbotham",
          "description": "NICE acquires the Nortek brand of home security gear: Italian home automation company NICE has acquired Nortek’s security systems for $285 million. The deal adds to NICE’s brands of smart home gear, which include 2GIG, Numera, IntelliVision, Linear, SpeakerCraft, and others. In 2018, Nice took a majority stake in Abode, a smart home security system […]\nThe post IoT news of the week for Oct. 8, 2021 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-oct-8-2021/",
          "publishedOn": "2021-10-08T16:30:57.000Z",
          "wordCount": 1241,
          "title": "IoT news of the week for Oct. 8, 2021"
        },
        {
          "id": "https://staceyoniot.com/?p=9101",
          "author": "Stacey Higginbotham",
          "description": "Welcome to the weekly podcast! We’re moving Black Friday to October thanks to chip shortages and shipping delays. Meanwhile, Amazon is working on a smart fridge, Google is trying to use a $10 monthly subscription and Nest thermostats to help people go green and also launching new cameras and ways to surf its displays. The […]\nThe post Podcast: Smart cities and smart fridges galore appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-smart-cities-and-smart-fridges-galore/",
          "publishedOn": "2021-10-07T13:00:01.000Z",
          "wordCount": 646,
          "title": "Podcast: Smart cities and smart fridges galore"
        },
        {
          "id": "https://staceyoniot.com/?p=9086",
          "author": "Kevin C. Tofel",
          "description": "On our most recent IoT Podcast episode, James called in with two related questions. He’s looking to equip his in-laws’ multi-level house with smart home and security gear and is wondering what products we would recommend to limit requests for his IT support. He’s also wondering if they need a router upgrade. Additionally, James wants […]\nThe post What’s an easy smart home system to maintain (that speaks Spanish too)? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/whats-an-easy-smart-home-system-to-maintain-that-speaks-spanish-too/",
          "publishedOn": "2021-10-06T16:44:38.000Z",
          "wordCount": 905,
          "title": "What’s an easy smart home system to maintain (that speaks Spanish too)?"
        },
        {
          "id": "https://staceyoniot.com/?p=9093",
          "author": "Stacey Higginbotham",
          "description": "RAK Wireless, which makes IoT gateways and hotspots for Helium’s IoT network under the CalChip brand, is launching a new Helium hotspot and miner designed for the mainstream consumer. The device is called MNTD, and it will cost $400. The big bonus for Helium fans is that the miner/hotspot will ship two weeks after it […]\nThe post RAK Wireless launched a consumer miner for Helium’s IoT network appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/rak-wireless-launched-a-consumer-miner-for-heliums-iot-network/",
          "publishedOn": "2021-10-05T14:27:52.000Z",
          "wordCount": 1068,
          "title": "RAK Wireless launched a consumer miner for Helium’s IoT network"
        },
        {
          "id": "https://staceyoniot.com/?p=9080",
          "author": "Stacey Higginbotham",
          "description": "A combination of sensors, blockchain technology, and the cloud is poised to deliver almost real-time tracking of food as it leaves a farm or fishery, and the U.S. Food and Drug Administration wants to help the technology behind food traceability along. The FDA has named 12 companies as winners of its New Era of Smarter Food Safety Low- […]\nThe post The FDA investigates bringing the IoT to food supply chains appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/the-fda-investigates-bringing-the-iot-to-food-supply-chains/",
          "publishedOn": "2021-10-05T13:00:43.000Z",
          "wordCount": 1306,
          "title": "The FDA investigates bringing the IoT to food supply chains"
        },
        {
          "id": "https://staceyoniot.com/?p=9083",
          "author": "Stacey Higginbotham",
          "description": "A lot of ink (or pixels) has been devoted to covering Amazon’s device launch this week, including my own contribution. The biggest themes emerging are concerns about Amazon building a surveillance apparatus in your home and how its theme of ambient intelligence doesn’t seem to offer much value in exchange for all of the data a consumer has to give […]\nThe post Want a smart home? Get ready to subscribe. appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/want-a-smart-home-get-ready-to-subscribe/",
          "publishedOn": "2021-10-04T13:00:10.000Z",
          "wordCount": 1242,
          "title": "Want a smart home? Get ready to subscribe."
        },
        {
          "id": "https://staceyoniot.com/?p=9078",
          "author": "Stacey Higginbotham",
          "description": "Sternum gets $27 million for IoT Security: IoT security is a constant source of struggle for companies, so it’s not surprising that we have yet another IoT security startup raising funds. Sternum is a three-year-old Israeli startup that provides agentless security on resource-constrained devices. The startup’s technology monitors a device’s runtime performance and alerts when […]\nThe post IoT news of the week for Oct. 1, 2021 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-oct-1-2021/",
          "publishedOn": "2021-10-01T17:00:49.000Z",
          "wordCount": 1464,
          "title": "IoT news of the week for Oct. 1, 2021"
        },
        {
          "id": "https://staceyoniot.com/?p=9074",
          "author": "Stacey Higginbotham",
          "description": "This week’s podcast is all about Amazon (with a few other stories for variety). We start the show with a rundown of the devices and services Amazon launched at its device drop on Tuesday. We then explain what it means for the smart home and ask if this is what we want. We also question if […]\nThe post Post: Amazon wants you to trust its devices appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/post-amazon-wants-you-to-trust-its-devices/",
          "publishedOn": "2021-09-30T14:40:58.000Z",
          "wordCount": 636,
          "title": "Post: Amazon wants you to trust its devices"
        },
        {
          "id": "https://staceyoniot.com/?p=9040",
          "author": "Kevin C. Tofel",
          "description": "This month Wyze introduced version two of its Wyze Cam Pan for $39.99 plus shipping. This upgraded model gains a few new features over its predecessor including a better processor. The benefit here is improved motion detection, which is very useful for a camera that can rotate and follow people or other objects in an […]\nThe post Wyze Cam Pan v2 review: Great but mainly for specific smart home users appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/wyze-cam-pan-v2-review-great-but-mainly-for-specific-smart-home-users/",
          "publishedOn": "2021-09-29T15:01:51.000Z",
          "wordCount": 1204,
          "title": "Wyze Cam Pan v2 review: Great but mainly for specific smart home users"
        },
        {
          "id": "https://staceyoniot.com/?p=9044",
          "author": "Stacey Higginbotham",
          "description": "After an hour-long product drop by Amazon this morning I’m convinced that we are getting really close to the smart home of my dreams, and I’m increasingly unsure if I want it. Amazon launched a $999.99 home robot called Astro, its Always Home Cam that’s an indoor drone with a camera on it, and so […]\nThe post Amazon’s device drop: Robots and services and drones, oh my! appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/amazons-device-drop-robots-and-services-and-drones-oh-my/",
          "publishedOn": "2021-09-28T18:48:01.000Z",
          "wordCount": 2179,
          "title": "Amazon’s device drop: Robots and services and drones, oh my!"
        },
        {
          "id": "https://staceyoniot.com/?p=9035",
          "author": "Stacey Higginbotham",
          "description": "The “help wanted” signs scattered throughout restaurants, stores, and medical offices are becoming all too familiar these days. While economists can debate if that’s because pay is too low or pandemic benefits are too high, the end result is the same: It’s hard to find people to fill jobs. The employee shortage issue is especially […]\nThe post This factory is using AR to help with a hiring crunch appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/this-factory-is-using-ar-to-help-with-a-hiring-crunch/",
          "publishedOn": "2021-09-28T12:00:23.000Z",
          "wordCount": 1347,
          "title": "This factory is using AR to help with a hiring crunch"
        },
        {
          "id": "https://staceyoniot.com/?p=9025",
          "author": "Kevin C. Tofel",
          "description": "On our most recent IoT Podcast, Todd called in to our voicemail hotline with a question about a brand new smart home device. He heard about the recently announced Home Assistant Amber, wondering if we were familiar with it and if we’ll be reviewing it. The answer to both questions is yes, Todd! If you’re […]\nThe post What the heck is the Home Assistant Amber and do you need it? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/what-the-heck-is-the-home-assistant-amber-and-do-you-need-it/",
          "publishedOn": "2021-09-27T16:00:57.000Z",
          "wordCount": 963,
          "title": "What the heck is the Home Assistant Amber and do you need it?"
        },
        {
          "id": "https://staceyoniot.com/?p=9032",
          "author": "Stacey Higginbotham",
          "description": "Last week, I hosted four experts for an hour-long discussion on RF sensing, which I think will become an essential tool for adding more context to IoT products. Each speaker introduced one of four technologies, after which we delved into a conversation about those technologies’ respective limitations as well as privacy and the use of […]\nThe post What you missed at the RF Sensing event last week appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/what-you-missed-at-the-rf-sensing-event-last-week/",
          "publishedOn": "2021-09-27T14:15:26.000Z",
          "wordCount": 1055,
          "title": "What you missed at the RF Sensing event last week"
        },
        {
          "id": "https://staceyoniot.com/?p=9021",
          "author": "Stacey Higginbotham",
          "description": "We are offloading too much to tech: The productivity boost that technology drove in the late 1990s and early 2000s has convinced a certain section of the population that software, chips, and data can solve many of the hard problems facing the world. Even my faith in IoT is driven in part by using technology […]\nThe post IoT news of the week for Sept. 24, 2021 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-sept-24-2021/",
          "publishedOn": "2021-09-24T19:58:09.000Z",
          "wordCount": 1305,
          "title": "IoT news of the week for Sept. 24, 2021"
        },
        {
          "id": "https://staceyoniot.com/?p=9017",
          "author": "Stacey Higginbotham",
          "description": "This week’s show kicks off with the news of the Raspberry Pi Trading company closing a new funding round of $45 million. We talk about what the Pi Trading company is, how it relates to the Foundation, and how companies are building Pis. We then dig into Apple’s plans for healthcare, including plans for tracking mental […]\nThe post Podcast: Much ado about privacy and support appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-much-ado-about-privacy-and-support/",
          "publishedOn": "2021-09-23T13:00:05.000Z",
          "wordCount": 626,
          "title": "Podcast: Much ado about privacy and support"
        },
        {
          "id": "https://staceyoniot.com/?p=9006",
          "author": "Kevin C. Tofel",
          "description": "For the past four years, I’ve been using a GoControl Z-Wave smart garage door opener. Well, technically, I’ve been using it for about two years but it’s been installed since 2017. Once I moved away from smart home hubs that support Z-Wave, the GoControl has lain dormant. Since I’ve been transitioning over to HomeKit this […]\nThe post Goodbye Z-Wave, hello HomeKit smart garage door opener appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/goodbye-z-wave-hello-homekit-smart-garage-door-opener/",
          "publishedOn": "2021-09-22T13:52:56.000Z",
          "wordCount": 1309,
          "title": "Goodbye Z-Wave, hello HomeKit smart garage door opener"
        },
        {
          "id": "https://staceyoniot.com/?p=9000",
          "author": "Stacey Higginbotham",
          "description": "Not a week goes by without some sort of vulnerability or breach associated with the IoT taking place. More devices, varied devices, and the rise of far more sophisticated attackers have led to big IT firms investing in their own security capabilities while our government issues executive orders trying to compel companies to invest in […]\nThe post Forget perimeters; for security, look at device behavior appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/forget-perimeters-for-security-look-at-device-behavior/",
          "publishedOn": "2021-09-21T13:00:53.000Z",
          "wordCount": 886,
          "title": "Forget perimeters; for security, look at device behavior"
        },
        {
          "id": "https://staceyoniot.com/?p=8996",
          "author": "Stacey Higginbotham",
          "description": "This week, Silicon Labs held its annual Works With event, covering all aspects of the IoT. While many of the sessions were aimed at engineers trying to learn specific skills for product development, the event held a few panels with a larger focus that included elements worth noting. Silicon Labs also made three big news announcements […]\nThe post 6 takeaways from this week’s Works With event appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/6-takeaways-from-this-weeks-works-with-event/",
          "publishedOn": "2021-09-20T13:00:14.000Z",
          "wordCount": 1243,
          "title": "6 takeaways from this week’s Works With event"
        },
        {
          "id": "https://staceyoniot.com/?p=8954",
          "author": "Stacey Higginbotham",
          "description": "With Smart Rent going public last month, the acquisition last year of Stratis by RealPages, and an increased focus on implementing smart home features across a portfolio of rental units, multifamily IoT is having a moment. That is why I was intrigued to talk to Tray Johnson, VP of innovation at Quext, which has introduced an IoT product for multifamily […]\nThe post Quext uses LoRa radios to connect smart appartments appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/quext-uses-lora-radios-to-connect-smart-appartments/",
          "publishedOn": "2021-09-19T13:00:05.000Z",
          "wordCount": 934,
          "title": "Quext uses LoRa radios to connect smart appartments"
        },
        {
          "id": "https://staceyoniot.com/?p=8988",
          "author": "Kevin C. Tofel",
          "description": "On our most recent IoT Podcast episode, Paul called in with a question about his smart home. He currently uses indoor Nest Cams pointing outside, along with Ubiquiti UniFi routers and they work fine, as expected. However, he’s thinking about replacing his Nest Cams with different devices so that he can keep his video files […]\nThe post What local alternatives are there to cloud-based Nest Cams? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/what-local-alternatives-are-there-to-cloud-based-nest-cams/",
          "publishedOn": "2021-09-18T13:00:50.000Z",
          "wordCount": 773,
          "title": "What local alternatives are there to cloud-based Nest Cams?"
        },
        {
          "id": "https://staceyoniot.com/?p=8992",
          "author": "Stacey Higginbotham",
          "description": "Home Assistant tries with a new hub: The campaign for Home Assistant Amber is now live. For $149, customers can buy a Raspberry Pi computer that is pre-loaded with Home Assistant’s software and several radios including Wi-Fi, Bluetooth, and Zigbee. (The Zigbee radio will support Matter once that certification is out.) While some people are familiar […]\nThe post IoT news of the week for Sept. 17, 2021 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-sept-17-2021/",
          "publishedOn": "2021-09-17T20:05:52.000Z",
          "wordCount": 1029,
          "title": "IoT news of the week for Sept. 17, 2021"
        },
        {
          "id": "https://staceyoniot.com/?p=8982",
          "author": "Stacey Higginbotham",
          "description": "I need to warn y’all in advance that we don’t discuss Apple news at all this week because nothing really jumped out at us for the IoT. But we did have a lot of other big news starting with Wyze raising $100 million and sharing the precariousness of its situation over the last 18 months. […]\nThe post Podcast: Wyze comes back from the edge appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-wyze-comes-back-from-the-edge/",
          "publishedOn": "2021-09-16T13:00:03.000Z",
          "wordCount": 650,
          "title": "Podcast: Wyze comes back from the edge"
        },
        {
          "id": "https://staceyoniot.com/?p=8972",
          "author": "Kevin C. Tofel",
          "description": "Innovation in flexible computing components is arriving in wave after wave of late. In June, a report detailed a 32-bit ARM microprocessor that could bend, and this month, we learned that Stanford researchers demonstrated working bendable RAM. When discussing the pliable CPU news on our podcast, I suggested that this could help create smaller sensors […]\nThe post First flexible CPUs, now flexible RAM: Could this jumpstart truly smart clothing? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/first-flexible-cpus-now-flexible-ram-could-this-jumpstart-truly-smart-clothing/",
          "publishedOn": "2021-09-15T15:39:05.000Z",
          "wordCount": 1163,
          "title": "First flexible CPUs, now flexible RAM: Could this jumpstart truly smart clothing?"
        }
      ]
    },
    {
      "title": "IT의 중심에서",
      "feedUrl": "https://subokim.wordpress.com/feed/",
      "siteUrl": "https://subokim.wordpress.com",
      "articles": [
        {
          "id": "http://subokim.wordpress.com/?p=10863",
          "author": "subokim",
          "description": "최근 개발자 학교에 있다보니,취업프로그램을 만들기 위해 여러 기업들을 만나게 됩니다. 꽤 많은 회사의 채용팀으로부터 들은 이야기인데, 한 번 정리 해볼까 합니다.이미 많은 친구들에게 이야기를 해준 내용이기도 합니다. 신입사원 A, B 씨 (1) 신입사원 A 씨. 김대리 : “A씨, 우리가 이렇게 저렇게 할건데, 이 모듈 좀 맡아서 다음주까지 만들어 주실래요?” A 씨 : “넵, 알겠습니다.” 그러고 […]",
          "link": "https://subokim.wordpress.com/2021/09/15/why_dont_intern/",
          "publishedOn": "2021-09-15T13:26:24.000Z",
          "wordCount": 1057,
          "title": "신입개발자를 뽑지 않는 이유"
        }
      ]
    },
    {
      "title": "Vivonomicon's Blog",
      "feedUrl": "https://vivonomicon.com/feed/",
      "siteUrl": "https://vivonomicon.com",
      "articles": []
    },
    {
      "title": "zserge's blog",
      "feedUrl": "https://zserge.com/rss.xml",
      "siteUrl": "https://zserge.com/",
      "articles": []
    },
    {
      "title": "Big Picture",
      "feedUrl": "https://www.bostonglobe.com/rss/bigpicture",
      "siteUrl": null,
      "articles": []
    },
    {
      "title": "이바닥늬우스",
      "feedUrl": "https://ebadak.news/feed",
      "siteUrl": "https://ebadak.news",
      "articles": [
        {
          "id": "https://ebadak.news/?p=2762",
          "author": "Rick Kim",
          "description": "‘메타버스’는 요즘 가장 핫한 유행어입니다. 하지만 화이트보드에 붙은 포스트잇에 쓴 개념과 같지, 실제로 존재하는 것은 아닙니다. 메타버스가 하겠다고 하는 아이디어들은 말로만 그칠 수도 있습니다. 어쩌면 진짜 새로운 ‘IT’일 수도 있을 것입니다. 하지만 그것이 어떻게 동작을 하든, 완전히 새로운 종류의 기기, 경험, 새로운 콘텐츠가 필요하다는 것은 당연한 이야기겠죠.",
          "link": "https://ebadak.news/2021/10/11/metaverse-metaverse-metaverse/",
          "publishedOn": "2021-10-11T13:42:18.000Z",
          "wordCount": 1333,
          "title": "메타버스! 메타버스? 메타버스!! (번역)"
        },
        {
          "id": "https://ebadak.news/?p=2683",
          "author": "Rick Kim",
          "description": "넷플릭스의 창업자이자 CEO인 리드 헤이스팅스 역시 “넷플릭스가 테크 회사냐, 미디어 회사냐”라는 질문에 수년간 답하기를 꺼렸습니다. 하지만 최근 선언했습니다. “우리는 엔터테인먼트 회사”라고 말이죠. 그렇다면 그 말은 도대체 무슨 뜻일까요. 왜 중요할까요. 그리고 우리는 어떤 인사이트를 얻어야 할까요.",
          "link": "https://ebadak.news/2021/09/27/what-is-an-entertainment-company/",
          "publishedOn": "2021-09-27T10:23:15.000Z",
          "wordCount": 7505,
          "title": "2021년, 엔터테인먼트 업의 본질은 무엇일까요? (번역)"
        }
      ]
    },
    {
      "title": "economic view",
      "feedUrl": "http://feeds.feedburner.com/Economic_View",
      "siteUrl": "http://economicview.net",
      "articles": []
    },
    {
      "title": "슬로우뉴스",
      "feedUrl": "https://feeds.feedburner.com/slownews",
      "siteUrl": "https://slownews.kr",
      "articles": [
        {
          "id": "https://slownews.kr/?p=82232",
          "author": "민주언론시민연합",
          "description": "2012년 조선일보가 일부 지역에 배달된 신문 1면에 엉뚱한 사람의 사진을 싣고 성폭행범으로 지목한 사건이 있었습니다(‘조선일보-고종석 초상 오보 사건’). 이 사건은 소송으로까지 이어지진 않았지만, 언론의 ‘중대한’ 실수가 일반 시민에게 어떤 피해를 가져올 수 있는지 여실히 보여줍니다. 유사한 사건으로 언론사에 손해배상을 청구하면 얼마나 피해를 구제받을 수 있을까요? KBS, 막 개업한 병원을 문닫게 하다  2013년 KBS의 부주의로 개업 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/NUoV8rzrTsE/82232",
          "publishedOn": "2021-10-13T05:53:53.000Z",
          "wordCount": 844,
          "title": "KBS ‘보험사기 병원’ 오인 유도 사건 (2013)"
        },
        {
          "id": "https://slownews.kr/?p=82220",
          "author": "민주언론시민연합",
          "description": "2014년은 서럽고 아픈 해로 기억된다. 그해 4월 세월호 참사라는 믿을 수 없는 비극을 겪었다. 떠올릴수록 아픔은 커지지만, 아파도 기억해야 한다. 우리들 몫이다. 그리고 그해 10월 성유보 이사장이 우리 곁을 떠났다. 감당할 수 없는 슬픔이기에 인정하고 싶지 않았다. 지금도 같은 마음이다. 이사장이 떠났다는 사실을 인정하려니 목이 메어온다. 세상 모든 일이 서럽고, 부끄럽다. 그래서 이번 추모 글도 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/HR7TFehnl14/82220",
          "publishedOn": "2021-10-13T04:04:14.000Z",
          "wordCount": 979,
          "title": "못다 이룬 꿈도 아름답다: 성유보 이사장을 기리며"
        },
        {
          "id": "https://slownews.kr/?p=82212",
          "author": "언론인권센터",
          "description": "여야 8인 협의체 협상결렬 후에도 오는 12. 31.까지 언론미디어제도개선특별위원회에서 논의키로 합의한 뒤 철회된 국회의안번호 ‘2112222’호’ 언론중재및피해구제등에관한법률일부개정법률안(대안)는 다양한 별칭을 갖고 있다. 관점의 차이: 징벌이냐, 구제냐 이렇게 긴 이름을 가진 법률은 보통 ‘언론중재법'(앞부분) 또는 ‘언론피해구제법'(뒷부분)과 같이 약칭으로 부른다. 그런데 의안2112222호는 법률 명칭을 줄인 ‘언론중재법개정안’, ‘언론피해구제법개정안’이라는 이름 대신 ‘언론징벌법’, ‘언론재갈법’, ‘언론겁박법’ 등의 이름으로 변주되어 사용됐다. 체감하기로는 언론징벌법이라는 명칭이 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/pM2Fv2EOca8/82212",
          "publishedOn": "2021-10-12T05:40:36.000Z",
          "wordCount": 1108,
          "title": "징벌 vs. 피해구제: 또 다시 멈춘 언론중재법"
        },
        {
          "id": "https://slownews.kr/?p=82175",
          "author": "씨앗(CEART)",
          "description": "데이터를 다룬다는 일은 양날의 칼과 같다. 한쪽에서는 새로운 비즈니스 모델을 촉진하고 기업의 조직, 운영, 인재 관리 및 가치 창출 방식을 혁신시킨다. 또 다른 면에서는 데이터 보안, 개인 정보 보호 문제 및 윤리적 경계에 대한 어려운 불확실성을 다루어야 한다. 정부나 기업에서 그 중요한 데이터를 다루는 리더에게 고급 분석을 통한 정보의 잠재력을 이해하는 동시에 위험 요소를 피할 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/oKWvUjplSPg/82175",
          "publishedOn": "2021-10-08T06:54:03.000Z",
          "wordCount": 2826,
          "title": "데이터 리터러시 올리는 CDO(최고 데이터 책임자)의 8가지 역할"
        },
        {
          "id": "https://slownews.kr/?p=82165",
          "author": "언론인권센터",
          "description": "지난 29일, 전국 매장 600여 개가 넘는 도넛 브랜드 ‘던킨도너츠’가 비위생적인 환경에서 만들어진다는 제보 영상이 KBS 보도를 통해 공개되었다. 공개된 영상에서는 기름때가 낀 환기장치 아래 방치된 밀가루 반죽, 설비에 묻어있는 검은 물질 등이 포착되면서 비위생적 제조 공장이 도마에 올랐다. [KBS] [단독]① 던킨도너츠 공장 제보 영상…반죽에 기름때·시럽통엔 까만 물질 (2021-09-29) 던킨도너츠 측은 사과문을 게재했지만, 같은 날 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/sIC6PL5HCr8/82165",
          "publishedOn": "2021-10-07T08:15:14.000Z",
          "wordCount": 903,
          "title": "던킨 사태, 공익신고자 공격하는 경제지와 조선일보"
        },
        {
          "id": "https://slownews.kr/?p=82150",
          "author": "민주언론시민연합",
          "description": "2011년, 온라인 상거래가 늘면서 온라인 판매 사기 사건도 덩달아 늘었습니다. 사기꾼들은 때때로 언론의 공신력을 적극 이용했습니다. 기사를 가장한 광고인 이른바 ‘기사형 광고’와 ‘○○○브랜드 대상’ 등 수상자 선정 대가로 홍보비를 받는 시상식은 언론사들의 짭짤한 부수입 중 하나입니다. 언론의 공신력을 홍보에 이용하는 것이죠. 이런 잘못된 언론사 관행이 사기를 목적으로 한 허위업체에 공신력을 부여하여 사기 피해를 걷잡을 수 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/dEAiSPQMswU/82150",
          "publishedOn": "2021-10-06T05:25:36.000Z",
          "wordCount": 992,
          "title": "한경닷컴, 도깨비쿠폰 사건 (2011)"
        },
        {
          "id": "https://slownews.kr/?p=82132",
          "author": "윤대균",
          "description": "지난 두 차례의 칼럼에서 플랫폼으로서의 정부(GaaP: Government as a Platform) 개념과 이를 성공적으로 이끌기 위한 기본 요건들에 대해 정리해 보았다. 다시 한번 환기하는 차원에서 간단히 정리해 보면 다음과 같다. 웹 2.0, Gov 2.0, GaaP 2000년대 말 개방과 공유, 그리고 참여를 기치로 내건 “웹 2.0”이 관심을 받기 시작한 이래 불과 수년 사이 “플랫폼”을 표방한 서비스가 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/fyiX7dsJfhU/82132",
          "publishedOn": "2021-10-05T08:47:47.000Z",
          "wordCount": 3770,
          "title": "플랫폼으로서의 정부: 3. 성공 실행 전략"
        },
        {
          "id": "https://slownews.kr/?p=82114",
          "author": "민주언론시민연합",
          "description": "곽상도 국민의힘 의원 아들이 화천대유자산관리(화천대유)에서 퇴직금 등으로 50억 원을 받았다는 사실이 9월 26일 [노컷뉴스] 보도로 알려졌습니다. 화천대유는 ‘대장동 개발사업’에 참여해 막대한 이익을 얻은 곳으로, 애초 더불어민주당 대권주자인 이재명 경기지사 아들이 계열사에 다닌다거나, 이 지사 측근이 계열사를 소유하고 있다는 잘못된 정보, 확인되지 않은 사실을 근거로 이 지사 연루설이 제기됐는데요. 이후 국민의힘이 ‘50억 수수’를 알고도 숨겼고, 박영수 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/4x0kFg99buU/82114",
          "publishedOn": "2021-10-01T08:07:29.000Z",
          "wordCount": 2302,
          "title": "조중동…’곽·국힘’ 연류엔 소극, 이재명 엮기엔 적극 (@화천대유)"
        },
        {
          "id": "https://slownews.kr/?p=82108",
          "author": "언론인권센터",
          "description": "‘언론중재 및 피해구제 등에 관한 법률(이하 언론중재법)’ 개정안 처리가 또다시 늦춰졌다. 지난 9월 29일, 더불어민주당과 국민의힘은 여야 동수 18명이 참여하는 ‘국회 언론미디어제도개선 특별위원회’를 구성하고 오는 12월 31일까지 논의를 이어가겠다고 밝혔다. 본회의 상정조차 못한 개정안 미디어 피해자 입장에서 보면 이번 개정법안이 본회의 상정조차 하지 않은 것은 대단히 유감스러운 일이다. 이미 여야가 합의한 언론중재위원 확대 및 다양화, […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/N3p-3gcjkbE/82108",
          "publishedOn": "2021-10-01T06:23:20.000Z",
          "wordCount": 866,
          "title": "언론중재법 개정안 처리 유감: 또다시 연말까지"
        },
        {
          "id": "https://slownews.kr/?p=82094",
          "author": "한상기",
          "description": "클라우드 서비스 기업이 금융 분야를 전략적 산업 영역으로 정한 것은 매우 자연스러운 접근이다. 금융 기관 중에서도 은행은 다른 영역에 비해 클라우드 적용이 늦게 진행되고 있으며, 대부분 은행은 온프레미스 애플리케이션의 유산을 포기하기가 어렵고, 실제로 클라우드로 전환하는 은행도 아직 얼마 안 되기 때문이다. 은행과 클라우드 컴퓨팅 미국의 경우는 캐피털 원(Capital One)이 얼리 어답터 역할을 하고 있다. 이미 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/soQBHv13aSw/82094",
          "publishedOn": "2021-09-30T08:03:28.000Z",
          "wordCount": 1726,
          "title": "은행과 클라우드 컴퓨팅: 이슈와 과제"
        },
        {
          "id": "https://slownews.kr/?p=82088",
          "author": "경실련",
          "description": "대장동 개발을 둘러싼 권력자들의 토건 부패의 실체가 연일 드러나며 온 국민이 분노하고 있다. 주거 안정을 위해 추진해야 할 개발사업에서 민간업자는 6천억 원 이상의 부당이득을 취하는 특혜를 누렸고, 전직 대법관, 전직  검찰총장, 전직 특별검사, 현직 국회의원 가족 등까지 동원되어 막대한 이득을 취한 것으로 드러났기 때문이다. 지금 같은 부분적, 산발적 수사로는 썩은 냄새가 진동하는 토건 부패를 해소할 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/2sgxYjIiNnM/82088",
          "publishedOn": "2021-09-29T05:16:46.000Z",
          "wordCount": 1024,
          "title": "대장동 개발 의혹 = 즉각 강제수사 + 특검 도입"
        },
        {
          "id": "https://slownews.kr/?p=82081",
          "author": "참여연대 사법감시센터",
          "description": "“KF-X 사업이 이렇게 기술 이전 문제로 난항을 겪게 된 핵심적인 원인은 저는 F-X 사업의 결정 과정에 문제가 있었기 때문이라고 생각합니다. 무슨 말이냐 하면, 잘 아시는 것처럼, F-X 사업은 최초에 F-15SE로 결정되었다가 이것이 석연치 않은 이유로 부결되어 버려요. 그런 뒤에 F-35A로 수정 결정되지요. 그러면서 기술 이전 문제가 명확하지 않았고 불가능하다고 답변해 왔던 록히드마틴으로 결정되는 겁니다. 그러면서 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/yjT1tYkyHV4/82081",
          "publishedOn": "2021-09-28T05:33:20.000Z",
          "wordCount": 1467,
          "title": "차세대 전투기(F-X) 사업, 위법행위마저 국가기밀?"
        },
        {
          "id": "https://slownews.kr/?p=82060",
          "author": "민주언론시민연합",
          "description": "정부와 한국전력은 9월 23일 4분기 전기요금을 kWh당 3원 인상한다고 발표했습니다. 2013년 11월 이후 8년 만의 전기요금 인상으로 올해 도입된 연료비 연동제에 따른 조치입니다. 그러나 이번 전기요금 인상을 두고 탈원전 탓이라는 주장이 또다시 제기됐습니다. 민주언론시민연합은 ‘4분기 전기요금 인상’을 언론이 어떻게 보도하고 있는지 살펴봤습니다. 한전, 연료비 연동제 따른 전기요금 인상 동아일보 [전기요금 8년만에 인상…4인가구 月최대 1050원 더 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/PUUM5I85peQ/82060",
          "publishedOn": "2021-09-27T05:23:29.000Z",
          "wordCount": 1808,
          "title": "전기요금 인상, 시작하지도 않은 ‘탈원전’ 탓? (ft. 조·중·매·서경·한경)"
        },
        {
          "id": "https://slownews.kr/?p=82043",
          "author": "씨앗(CEART)",
          "description": "최근 몇 년 동안 데이터 환경이 크게 바뀌었다. 다양한 소스에서 구조화된 데이터와 구조화되지 않은 데이터를 모두 생성하고 있다. 애플리케이션과 서비스를 그 어느 때보다 더 자주 애자일 방법론으로 개발하고 있으며 데이터 변경은 빠르고 중요하다. 또한, 확장성 요구 사항도 매우 중요한 데, 관계형 데이터베이스 관리 시스템(RDBMS)은 이러한 모든 문제를 처리하도록 설계되지 않았다. 따라서 기업들은 새로운 데이터 요구 사항에 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/i9dVC_uSiro/82043",
          "publishedOn": "2021-09-24T08:59:30.000Z",
          "wordCount": 3154,
          "title": "그래프 데이터베이스, 시장 현황과 분석"
        },
        {
          "id": "https://slownews.kr/?p=82025",
          "author": "민주언론시민연합",
          "description": "CJ대한통운의 한 대리점주가 8월 30일 목숨을 끊었습니다. CJ대한통운 대리점연합회에 따르면 사망한 대리점주는 해당 대리점 소속 택배노조 조합원의 폭언으로 괴로워했고, 이들의 배송거부로 극심한 스트레스를 겪었다고 했습니다. 장례 기간 입장을 내지 않던 택배노조는 9월 2일 일부 조합원이 대리점주를 괴롭힌 정황을 확인했다며 사과했습니다. 다만, 해당 대리점은 지속적 수수료 삭감과 6년간 임금 지연 지급 등으로 조합원들과 갈등을 빚어왔으며, 이를 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/zsF11waQDqg/82025",
          "publishedOn": "2021-09-23T08:50:23.000Z",
          "wordCount": 2162,
          "title": "외면당한 죽음, 주목받은 죽음: 택배업계 ‘을병 갈등’ 부추기는 조선·동아"
        },
        {
          "id": "https://slownews.kr/?p=82016",
          "author": "민주언론시민연합",
          "description": "8월 30일 경기도 김포 CJ대한통운의 한 대리점주가 극단적인 선택을 한 안타까운 일이 벌어졌다. CJ대한통운 택배대리점연합회는 고인이 남긴 유서에 관해 이렇게 말했다: “유서를 확인한 결과 고인이 조합원들과의 갈등으로 극심한 스트레스를 받았으며 조합원 12명 이름을 구체적으로 지목하기도 했다.”(CJ대한통운 택배대리점연합회) 고인과 갈등을 빚었다는 조합원은 전국택배노동조합(이하 택배노조) 소속 노동자들이다. 언론부터 정치권까지, ‘을의 갈등’ 부추기기 주요 언론은 일제히 택배노조 상급단체인 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/RVnvfWk-CHw/82016",
          "publishedOn": "2021-09-23T06:37:51.000Z",
          "wordCount": 1130,
          "title": "‘택배’ 갈등의 진짜 구조: 누가 ‘을·병 갈등’을 부추기는가"
        },
        {
          "id": "https://slownews.kr/?p=81997",
          "author": "민주언론시민연합",
          "description": "인터넷매체 뉴스버스 단독보도로 시작된 ‘윤석열 검찰의 고발 사주 의혹’ 논란의 핵심은 지난해 4.15 총선을 앞둔 시점에서 검찰이 직접 작성한 고발장을 야당에 전달해 형사 고발을 사주했는지 여부입니다. 그러나 이번 사건의 본질인 ‘검찰 사유화’와 ‘검찰의 선거개입’ 여부에 대한 진상규명은 비껴간 채 언론은 오히려 ‘제보자 논란’, ‘제보 사주 의혹’에 집중하고 있습니다. 민주언론시민연합은 언론이 ‘제보자 조성은’을 어떻게 보도하고 있는지 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/5kYka0bz7UE/81997",
          "publishedOn": "2021-09-17T08:27:46.000Z",
          "wordCount": 3106,
          "title": "검찰 고발 사주 의혹, 메시지 반박이 어려우면 메신저를 공격하라"
        },
        {
          "id": "https://slownews.kr/?p=81958",
          "author": "참여연대 사법감시센터",
          "description": "지하철을 타고 문득 반대편에 앉아 있는 이들이 ‘마스크’를 벗고 있는 모습을 떠올려본다. 다시 누군가의 ‘생’얼굴을 보는 생경함을 떨치고 이내 익숙해 질 수 있을까. 코로나19는 끝이 보이지 않지만, 언젠가 ‘종식’이란 것이 된다면 그 이후의 사회는 이전과는 달라져 있을 것이다. 마스크를 쓰는 것이 오히려 자연스러운 일상이 될 것 같다고 할까. 코로나19가 새삼 일깨운 ‘공공의료 중요성’ 공공의료에 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/rUcByQe6TGw/81958",
          "publishedOn": "2021-09-17T05:37:14.000Z",
          "wordCount": 1598,
          "title": "코로나19 시대, ‘영리병원’ 손들어준 시대착오적 판결"
        },
        {
          "id": "https://slownews.kr/?p=81954",
          "author": "오픈넷",
          "description": "2021년 9월 16일 오전 9시, 세계 최대 인권단체 중 하나인 휴먼라이츠워치(Human Rights Watch)는 문재인 대통령 및 국회의원 전원 그리고 8인 여야협의체에 3개 국내외 시민단체(사단법인 오픈넷, 진보네트워크센터, 아티클 19-ARTICLE 19-)가 참여하는 공동 서한을 보내 언론중재법 개정안에서 징벌적 손해배상 관련 조항 및 열람차단권 조항을 폐지할 것을 권고했습니다. 의견서에서 휴먼라이츠워치 등은 징벌적 손해배상을 언론에만 적용하고, 언론의 비판 및 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/-CYnduE5nqU/81954",
          "publishedOn": "2021-09-16T09:09:07.000Z",
          "wordCount": 2481,
          "title": "인권단체 ‘휴먼라이츠워치’가 언론중재법 개정안을 반대하는 이유"
        },
        {
          "id": "https://slownews.kr/?p=81943",
          "author": "언론인권센터",
          "description": "언론중재법 개정안이 여야 합의로 협의체를 구성해 9월 27일까지 처리하기로 결정되었다. 지난 7일 더불어민주당과 국민의힘이 언론중재법 개정안 논의를 위한 ‘8인 협의체’ 구성을 완료했다. 하지만 협의체 구성 이후에도 양당의 핵심 쟁점에 대한 첨예한 입장 차이에 우려를 표한다. 여야가 숙의를 위한 시간을 확보한 만큼 언론중재법 개정안에 대해 피해구제의 관점에서 적극적인 협의의 태도를 보여야 한다. 민주당 vs 국힘  은 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/ZFblmiWRwkY/81943",
          "publishedOn": "2021-09-16T06:40:05.000Z",
          "wordCount": 1175,
          "title": "언론중재법, 마지막 논의에 부쳐"
        },
        {
          "id": "https://slownews.kr/?p=81936",
          "author": "경실련",
          "description": "경실련 조사 결과 서울시와 SH공사가 보유하고 있는 장기전세주택의 자산 가치는 전체 33조 7천억, 호당 평균 10억으로 나타났다. 하지만 SH가 공개한 장기전세주택의 장부가는 7조 5천억, 호당 2.3억으로 시세의 1/5에 불과했다. 아크로리버파크, 래미안퍼스티지 등의 강남권 장기전세주택은 시세가 20~30억까지 형성되어 있지만 SH가 평가한 자산가치는 호당 1억 정도에 불과했다. 자산이 저평가되면 공공주택 사업이 적자사업으로 비춰지며 적극적인 공공주택 확대가 어려워질 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/WhdfrYlc8wc/81936",
          "publishedOn": "2021-09-15T05:57:52.000Z",
          "wordCount": 1261,
          "title": "시세는 25억, 장부가는 1억? 장기전세주택과 ‘이상한 장부’"
        }
      ]
    },
    {
      "title": "꿈꾸는섬",
      "feedUrl": "https://happist.com/feed",
      "siteUrl": "https://happist.com",
      "articles": [
        {
          "id": "https://happist.com/?p=583878",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583878/21%eb%85%84-9%ec%9b%94-%eb%af%b8%ea%b5%ad-%ea%b3%a0%ec%9a%a9%ec%a7%80%ed%91%9c-%eb%b6%84%ec%84%9d",
          "publishedOn": "2021-10-08T16:00:44.000Z",
          "wordCount": 1216,
          "title": "9월 미국 고용지표 분석, 일자리 증가 부진과 임금 상승 속 실업률 하락의 엇갈린 지표"
        },
        {
          "id": "https://happist.com/?p=583867",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583867/3%eb%b6%84%ea%b8%b0-%ec%82%bc%ec%84%b1%ec%a0%84%ec%9e%90-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-10-08T08:28:13.000Z",
          "wordCount": 1444,
          "title": "기대에 못미친 3분기 삼성전자 실적, 예상을 하회한 이유와 향후 삼성전자 전망"
        },
        {
          "id": "https://happist.com/?p=583851",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583851/mysql-%eb%b9%84%ea%b5%90-%ec%bf%bc%eb%a6%ac",
          "publishedOn": "2021-10-06T22:55:13.000Z",
          "wordCount": 695,
          "title": "MySQL 사용법, 여러 회사 성과 비교하기위한 비교 쿼리"
        },
        {
          "id": "https://happist.com/?p=583842",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583842/21%eb%85%84-8%ec%9b%94-%ec%98%a8%eb%9d%bc%ec%9d%b8%ec%87%bc%ed%95%91-%eb%8f%99%ed%96%a5",
          "publishedOn": "2021-10-06T04:47:57.000Z",
          "wordCount": 1257,
          "title": "차트로 읽는 8월 온라인쇼핑 동향, 증가세 둔화는 정상으로 회귀인가? 침체의 전조인가?"
        },
        {
          "id": "https://happist.com/?p=583829",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583829/mysql-%ec%82%ac%ec%9a%a9%eb%b2%95-%ec%a0%84%eb%85%84%eb%b9%84-%ec%84%b1%ec%9e%a5%eb%a5%a0-%ea%b5%ac%ed%95%98%ea%b8%b0",
          "publishedOn": "2021-10-06T01:30:41.000Z",
          "wordCount": 788,
          "title": "MySQL 사용법, 전년비 성장률 구하기"
        },
        {
          "id": "https://happist.com/?p=583797",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583797/2022%eb%85%84-%eb%af%b8%ea%b5%ad-%ea%b2%bd%ec%a0%9c%ec%a0%84%eb%a7%9d",
          "publishedOn": "2021-10-02T14:31:46.000Z",
          "wordCount": 828,
          "title": "미국 경제전망, 델타변이 진정 후 4분기부터 경제 회복이 본격화 될 듯"
        },
        {
          "id": "https://happist.com/?p=583800",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583800/mysql-%ec%82%ac%ec%9a%a9%eb%b2%95-%eb%8d%b0%ec%9d%b4%ed%84%b0-%ec%b6%94%ec%b6%9c-%ea%b8%b0%ea%b0%84-%ec%84%a4%ec%a0%95",
          "publishedOn": "2021-10-02T11:04:42.000Z",
          "wordCount": 668,
          "title": "MySQL 사용법, 데이터 추출 기간 설정하기, 날짜 범위 데이터 추출 방법"
        },
        {
          "id": "https://happist.com/?p=583782",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583782/%ec%9d%b4%ec%9d%b5-%ea%b8%b0%ec%a4%80-%ec%84%b8%ea%b3%84-10%eb%8c%80-%ea%b8%b0%ec%97%85",
          "publishedOn": "2021-10-02T03:01:26.000Z",
          "wordCount": 1660,
          "title": "가장 많은 이익을 내는 회사, 이익 기준 세계 10대 기업(21년 10월 업뎃)"
        },
        {
          "id": "https://happist.com/?p=583749",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583749/21%eb%85%84-9%ec%9b%94-%ec%88%98%ec%b6%9c%ec%a6%9d%ea%b0%80%ec%9c%a8",
          "publishedOn": "2021-10-01T02:30:33.000Z",
          "wordCount": 3058,
          "title": "수출증가율이 꺽인 9월 수출을 어떻게 볼것인가? 사상 최고치가 빛을 바래며 이익 둔화로 연결 가능성"
        },
        {
          "id": "https://happist.com/?p=583741",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583741/%ec%95%84%ec%9d%b4%eb%94%94%ec%96%b4-%eb%b0%9c%ec%83%81%eb%b2%95",
          "publishedOn": "2021-09-30T13:06:28.000Z",
          "wordCount": 1162,
          "title": "아이디어 발상법, 어떻게 아이디어를 샘솟게 할 수 있을까?"
        },
        {
          "id": "https://happist.com/?p=583716",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583716/21%eb%85%84-3%eb%b6%84%ea%b8%b0-%eb%a7%88%ec%9d%b4%ed%81%ac%eb%a1%a0-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-09-29T11:31:14.000Z",
          "wordCount": 1840,
          "title": "호실적에도 반도체 가격 하락 우려를 불러온 3분기 마이크론 실적과 향후 전망"
        },
        {
          "id": "https://happist.com/?p=583710",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583710/mysql-%ed%85%8c%ec%9d%b4%eb%b8%94-%ec%83%9d%ec%84%b1-%eb%b0%a9%eb%b2%95",
          "publishedOn": "2021-09-25T12:54:02.000Z",
          "wordCount": 777,
          "title": "MySQL 사용법, 데이타베이스 & 테이블 & 컬럼 생성하기"
        },
        {
          "id": "https://happist.com/?p=583702",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583702/21%eb%85%84-3%eb%b6%84%ea%b8%b0-%ec%bd%94%ec%8a%a4%ed%8a%b8%ec%bd%94-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-09-25T08:31:46.000Z",
          "wordCount": 1081,
          "title": "델타 변이에도 높은 매출 및 이익 증가의 3분기 코스트코 실적 및 코스트코 주가 전망"
        },
        {
          "id": "https://happist.com/?p=583681",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583681/21%eb%85%84-3%eb%b6%84%ea%b8%b0-%eb%82%98%ec%9d%b4%ed%82%a4-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-09-25T05:52:17.000Z",
          "wordCount": 1842,
          "title": "공급망 혼란 직격탄을 맞은 3분기 나이키 실적, 부정적 전망으로 나이키 주가 하락하다"
        },
        {
          "id": "https://happist.com/?p=583684",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583684/sql-%ec%82%ac%ec%9a%a9%eb%b2%95-%ec%b5%9c%ea%b7%bc-%eb%8d%b0%ec%9d%b4%ed%84%b0-%ec%a1%b0%ed%9a%8c-%eb%b0%a9%eb%b2%95-%ec%b5%9c%ea%b7%bc-3%ea%b0%9c%ec%9b%94-%eb%8d%b0%ec%9d%b4%ed%84%b0-%eb%93%b1",
          "publishedOn": "2021-09-25T03:07:31.000Z",
          "wordCount": 527,
          "title": "SQL 사용법, 최근 데이터 조회 방법, 최근 3개월 데이터 등등"
        },
        {
          "id": "https://happist.com/?p=583622",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583622/%ec%9b%8c%eb%93%9c%ed%94%84%eb%a0%88%ec%8a%a4-%ed%85%8c%ec%9d%b4%eb%b8%94-%ed%94%8c%eb%9f%ac%ea%b7%b8%ec%9d%b8-wpdatatables-test",
          "publishedOn": "2021-09-20T08:41:36.000Z",
          "wordCount": 1867,
          "title": "워드프레스 테이블 플러그인 wpDataTables test"
        },
        {
          "id": "https://happist.com/?p=583589",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583589/%ed%8c%94%eb%9e%80%ed%8b%b0%ec%96%b4-%eb%b9%84%ec%a6%88%eb%8b%88%ec%8a%a4-%eb%aa%a8%eb%8d%b8",
          "publishedOn": "2021-09-19T07:42:24.000Z",
          "wordCount": 2071,
          "title": "독보적 데이타 분석기업, 팔란티어 비즈니스 모델과 투자 포인트"
        },
        {
          "id": "https://happist.com/?p=583463",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583463/%ec%8a%a4%eb%85%b8%ec%9a%b0%ed%94%8c%eb%a0%88%ec%9d%b4%ed%81%ac-%eb%b9%84%ec%a0%84%ea%b3%bc-%eb%b9%84%ec%a6%88%eb%8b%88%ec%8a%a4-%eb%aa%a8%eb%8d%b8",
          "publishedOn": "2021-09-18T16:01:46.000Z",
          "wordCount": 1345,
          "title": "시총 100조 기업을 만든 스노우플레이크 비전과 스노우플레이크 비즈니스 모델"
        },
        {
          "id": "https://happist.com/?p=583538",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583538/8%ec%9b%94-%eb%af%b8%ea%b5%ad-%ec%86%8c%eb%a7%a4%ed%8c%90%eb%a7%a4",
          "publishedOn": "2021-09-18T02:02:35.000Z",
          "wordCount": 2144,
          "title": "8월 미국 소매판매 0.7% 증가, 델타변이 확산에도 불구 미국 경제의 견고함을 보여주다"
        },
        {
          "id": "https://happist.com/?p=583480",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/583480/%ec%9d%b4%ed%83%9c%ec%9b%90-%ed%81%b4%eb%9d%bc%ec%93%b0-%eb%aa%85%eb%8c%80%ec%82%ac",
          "publishedOn": "2021-09-15T10:08:31.000Z",
          "wordCount": 1313,
          "title": "마음에 닿았던 이태원 클라쓰 명대사를 모아보다"
        }
      ]
    },
    {
      "title": "NewsPeppermint",
      "feedUrl": "https://newspeppermint.com/feed/",
      "siteUrl": "https://newspeppermint.com",
      "articles": [
        {
          "id": "https://newspeppermint.com/?p=73513",
          "author": "malecon",
          "description": "몇 년 전부터 각국 금융규제 기관은 기후 변화가 금융 시스템의 안정성에 미치는 위협을 경고하기 시작했습니다. 기후 리스크는 세 가지 경로를 통해 금융 시스템에 충격을 가합니다. 기업의 재무 상태를 악화시키고, 금융 기관의 비용 부담을 높이고, 자연재해, 난민 등 경제적 충격을 일으키는 것입니다. 그러나 대부분의 연구에서 기후 리스크가 금융 시스템을 붕괴시키는 수준으로 나가지는 않으리라 평가합니다. 물론 테스트의 기준이 지나치게 낙관적이라는 비판도 있습니다. 과연 기후 리스크가 금융 시스템에 어떤 경로를 통해, 얼마나 영향을 미칠까요? 이코노미스트의 기사를 소개합니다.",
          "link": "https://newspeppermint.com/2021/10/12/climatechangefinancialcrisis/?utm_source=rss&utm_medium=rss&utm_campaign=climatechangefinancialcrisis",
          "publishedOn": "2021-10-12T22:59:26.000Z",
          "wordCount": 963,
          "title": "기후 변화가 글로벌 금융 위기를 불러올 것인가?"
        },
        {
          "id": "https://newspeppermint.com/?p=73492",
          "author": "ingppoo",
          "description": "페이스북 내부고발자가 베일을 벗고 대중 앞에 섰습니다. 프랜시스 하우건이 상원 청문회에서 한 모두 발언 전문을 옮겼습니다.",
          "link": "https://newspeppermint.com/2021/10/06/fanceshaugen/?utm_source=rss&utm_medium=rss&utm_campaign=fanceshaugen",
          "publishedOn": "2021-10-06T22:30:35.000Z",
          "wordCount": 1465,
          "title": "페이스북 내부고발자 프랜시스 하우건의 의회 청문회 모두 발언"
        },
        {
          "id": "https://newspeppermint.com/?p=73477",
          "author": "ingppoo",
          "description": "여전히 아이폰과 맥북을 팔아 버는 돈이 애플의 주요 수입원입니다. 그러나 사업 포트폴리오에 게임을 제작, 판매하는 사업이 없음에도 애플은 게임 업체들이 기록하는 매출의 상당 부분을 가져갑니다. 애플이 앱스토어라는 강력한 플랫폼을 통해 게임 산업을 좌우하는 가장 강력한 '게임 기업'이 된 과정을 월스트리트저널이 정리했습니다.",
          "link": "https://newspeppermint.com/2021/10/05/appstoregameantitrust/?utm_source=rss&utm_medium=rss&utm_campaign=appstoregameantitrust",
          "publishedOn": "2021-10-05T22:59:44.000Z",
          "wordCount": 1425,
          "title": "게임 하나 안 만들고도 게임 산업의 절대 강자가 된 애플"
        },
        {
          "id": "https://newspeppermint.com/?p=73429",
          "author": "ingppoo",
          "description": "1990년대 말에 태어난 지금 대학교 신입생들은 컴퓨터 파일을 폴더별로 분류해 저장하고 보관하는 게 뭔지 잘 모릅니다. 그런 거 몰라도 디지털 세상에서 살아가는 데 아무런 지장이 없었기 때문이죠. 이런 학생들을 가르쳐야 하는 대학 교수들은 당혹스러워 합니다. 반대로 학생들은 어느 폴더에 가서 어떤 파일을 열면 이번주 과제가 있다는 교수들의 설명을 당최 알아들을 수 없어서 어리둥절합니다. 이 차이를 어떻게 좁혀나가야 할까요?",
          "link": "https://newspeppermint.com/2021/09/24/googlegenerationcomputer/?utm_source=rss&utm_medium=rss&utm_campaign=googlegenerationcomputer",
          "publishedOn": "2021-09-24T22:59:08.000Z",
          "wordCount": 2314,
          "title": "컴퓨터에 파일을 보관하는 방식과 세대 차이"
        },
        {
          "id": "https://newspeppermint.com/?p=73414",
          "author": "malecon",
          "description": "(월스트리트저널, Greg Ip) 미국은 오랫동안 정부 주도의 산업정책을 비효율의 전형이라며 비판해 왔습니다. 그러나 최근 반도체, 배터리를 포함한 전략적 산업을 지원하는 수단으로 산업정책을 주목하고 있습니다. 코로나19 팬데믹으로 글로벌 공급망이 무너지고 중국의 경제적 영향력이 높아지면서, 공화당인 트럼프 행정부와 민주당인 바이든 행정부를 막론하고 정부의 산업정책을 지지하는 목소리가 높아졌습니다. 미국 정부가 개입해 미국 산업을 육성하지 않으면 중국이 핵심적인 산업을 지배하게 될 것이라 우려합니다. 정책 전환의 배경과 전망을 설명한 월스트리트저널의 기사를 소개합니다.",
          "link": "https://newspeppermint.com/2021/09/23/industrial-policy-is-back/?utm_source=rss&utm_medium=rss&utm_campaign=industrial-policy-is-back",
          "publishedOn": "2021-09-23T22:59:19.000Z",
          "wordCount": 2120,
          "title": "‘산업정책’의 귀환, 중국을 정조준해 산업정책을 꺼내 든 미국"
        },
        {
          "id": "https://newspeppermint.com/?p=73371",
          "author": "ingppoo",
          "description": "이코노미스트 원문보기   코로나19 팬데믹으로 무너졌던 경제가 회복하는 양상은 국가별로, 지역별로, 또 산업이나 분야에 따라 천차만별입니다. 재빨리 백신을 보급, 접종한 덕분에 경제도 덩달아 빠르게 정상 궤도에 진입한 나라가 있는가 하면, 여러 가지 이유로 백신 접종률이 좀처럼 오르지 않아 고생인 나라도 많습니다. 팬데믹 상황에서, 또 팬데믹 이후 수요가 몰리는 분야도 있고, 반대로 수요가 뚝 끊겨 존립 자체가 위협받는 업종도 있습니다. 그동안 잘 눈에 띄지 않았던 또 한 가지 차이가 점점 더 → 더 보기",
          "link": "https://newspeppermint.com/2021/09/16/globalcitiesafterpandemic/?utm_source=rss&utm_medium=rss&utm_campaign=globalcitiesafterpandemic",
          "publishedOn": "2021-09-16T22:59:38.000Z",
          "wordCount": 1021,
          "title": "팬데믹 이후 도시의 모습은 어떻게 바뀔까?"
        },
        {
          "id": "https://newspeppermint.com/?p=73337",
          "author": "eyesopen1",
          "description": "BBC 원문보기 코로나19 팬데믹으로 인해 재택근무가 일반화되었다가 또 폐쇄됐던 일터가 다시 열리면서 많은 변화가 생기게 되었습니다. 어떤 변화는 다시 적응하면 그만인 것들이지만, 일터의 구성이 근본적으로 달라질 수도 있다는 예측도 나옵니다. 회사가 재택근무를 어느 정도 허용하는 유연 근무제를 시행하게 되면, 여성과 남성의 선택이 달라질 수 있기 때문입니다. 2,300명을 대상으로 한 영국의 설문조사 결과에 따르면, 자녀를 둔 여성의 69%는 팬데믹이 끝나도 일주일에 최소 1회는 재택근무를 하고 싶다고 응답했습니다. 반면, 같은 답을 한 → 더 보기",
          "link": "https://newspeppermint.com/2021/09/15/men-dominated-offices-of-the-future/?utm_source=rss&utm_medium=rss&utm_campaign=men-dominated-offices-of-the-future",
          "publishedOn": "2021-09-15T22:59:35.000Z",
          "wordCount": 739,
          "title": "포스트 팬데믹 시대, 일터에서의 성별간 격차가 커질 수도 있다?"
        }
      ]
    },
    {
      "title": "WALLFLOWER",
      "feedUrl": "http://rss.egloos.com/blog/wallflower",
      "siteUrl": "http://wallflower.egloos.com",
      "articles": [
        {
          "id": "http://wallflower.egloos.com/4202164",
          "author": "이택광",
          "description": "신고",
          "link": "http://wallflower.egloos.com/4202164",
          "publishedOn": "2021-10-12T01:03:26.000Z",
          "wordCount": 218,
          "title": "팬데믹과 기계 감시"
        },
        {
          "id": "http://wallflower.egloos.com/4202132",
          "author": "이택광",
          "description": "텔레비전에서 가장 오랜 방영시간을 자랑하는 <나는 자연인이다> 같은 프로그램이 보여주는 것은 마르크스가 언급한 부르주아의 로빈슨 서사이다. 이 프로그램은 “자연인”을 보여주기보다, 그 자연에서 자신을 개척하는 부르주아의 정신을 확인시켜주는 것이다. 여기.... 글 전체보기",
          "link": "http://wallflower.egloos.com/4202132",
          "publishedOn": "2021-10-10T16:08:32.000Z",
          "wordCount": 542,
          "title": "로빈슨 크루소"
        },
        {
          "id": "http://wallflower.egloos.com/4202100",
          "author": "이택광",
          "description": "카프카에 대한 멋진 에세이를 쓴 Aaron이 궁금할 때마다 한번씩 메일을 보내 조르고 있는 것이 The Pervert's Guide to Korea를 쓰라는 것이다. 작년 김기덕 감독의 사망 소식을 들은 뒤에 그는 이 수수께끼의 공화국에 대한 호기심을 더 가지게 .... 글 전체보기",
          "link": "http://wallflower.egloos.com/4202100",
          "publishedOn": "2021-10-09T02:54:55.000Z",
          "wordCount": 487,
          "title": "The Pervert's Guide to Korea"
        },
        {
          "id": "http://wallflower.egloos.com/4201978",
          "author": "이택광",
          "description": "전후 미국의 인문학이 아렌트나 마르쿠제 같은 나치를 피해 유럽으로 이주한 독일 지식인들 덕분에 유럽의 무대로 진출할 수 있었음을 부정하기 어렵다. 물론 전후 세계체제에서 미국이 담당했던 지정학적인 역할과 경제 부흥을 무시할 수는 없지만, 그럼에도 영국의 아류 \"향.... 글 전체보기",
          "link": "http://wallflower.egloos.com/4201978",
          "publishedOn": "2021-10-04T02:00:55.000Z",
          "wordCount": 588,
          "title": "Academic masquerades"
        },
        {
          "id": "http://wallflower.egloos.com/4201962",
          "author": "이택광",
          "description": "재외 한국학 학자가 <오징어 게임>에 대해 쓴 비평을 봤다.  요약하자면, \"사회안전망\"이 제대로 갖춰지지 않은, 극단적인 불평등 사회인 한국을 보여주는 드라마로서, 과거에 흔하지 않은 잔인한 폭력 장면은 전쟁과 군사독재를 거치면서 겪은 트라우.... 글 전체보기",
          "link": "http://wallflower.egloos.com/4201962",
          "publishedOn": "2021-10-03T07:55:33.000Z",
          "wordCount": 441,
          "title": "오징어 게임"
        },
        {
          "id": "http://wallflower.egloos.com/4201693",
          "author": "이택광",
          "description": "추석 명절 연휴가 끝났다. 추석에 고향을 찾기보다 휴양지를 찾는 이들이 더 많아진 것이 요즘 세태이지만, 이제는 추석이 한국 고유의 명절이라는 사실을 알고 외국 친구들이 ‘해피 추석’이라는 메시지를 보내줄 정도로 한국에 대한 인지도도 높아졌다. 정작 한국인들 사이.... 글 전체보기",
          "link": "http://wallflower.egloos.com/4201693",
          "publishedOn": "2021-09-23T11:37:25.000Z",
          "wordCount": 714,
          "title": "21세기의 질문"
        }
      ]
    },
    {
      "title": "내 마음의 풍경",
      "feedUrl": "https://rss.blog.naver.com/sellars.xml",
      "siteUrl": "https://blog.naver.com/sellars",
      "articles": [
        {
          "id": "https://blog.naver.com/sellars/222535305983",
          "author": "sellars",
          "description": "(가) 사단은 리에서 발(發)하고, 칠정은 기에서 발(發)한다. 퇴계는 (가)를 다음처럼 고친다. (나) 사단은 리의 발(發)이고, 칠정은 기의 발(發)이다. 무슨 차이가 있는가? (나)는 사단의 발생 혹은 발현의 주체가 리임을 분명하게 보여주고 있다. 그런데 사단은 무엇이고 칠정은 무엇인가? 때로 사단을 도덕적 감정으로, 칠정을 감정, 혹은 자연적 감정을 지시한다. 이렇게 본다면, 사단칠정론은 도덕적 감정과 (자연적) 감정의 구분, 유래, 근거에 대한 철학적 문제이다. 그렇지만 사단을 <도덕적 감정>이라고 할 수 있는가? 측은한 마음, 사양하는 마음, 창피해 하는 마음은 감정이라고 할 수 있지만, (그럼에도 이 감정이 자연적 감정.......",
          "link": "https://blog.naver.com/sellars/222535305983",
          "publishedOn": "2021-10-12T20:32:00.000Z",
          "wordCount": 8,
          "title": "사단칠정의 문제 혹은 해체"
        },
        {
          "id": "https://blog.naver.com/sellars/222533344369",
          "author": "sellars",
          "description": "칸트와 퇴계에 대한 비교가 가능할 수 있는가? 가능하다면 그것을 통해 무엇을 얻을 수 있는가? 아마도 칸트의 인식론과 퇴계를 비교할 수 없을 것이다. 칸트의 도덕철학과 퇴계의 사유를 비교할 수 있을 것이다. 여기서 그 비교의 주제나 소재가 도덕의 문제로 한정된다. 도덕의 문제가 아니라, 지식의 문제, 특히 과학적 지식의 문제, 혹은 인과율과 자유의 문제에 관심이 있다면, 이러한 비교 작업은 별로 큰 도움을 주지 못한다. 당연히 칸트와 퇴계에 대한 대부분 논문들이 도덕철학의 지평에서 이루어지고 있다. 퇴계와 칸트의 도덕에 대한 철학적 사유에서 그들이 얼마나 유사한지를 탐구하는 것이 우선적이다. 그런데 유사성에 대한 철학.......",
          "link": "https://blog.naver.com/sellars/222533344369",
          "publishedOn": "2021-10-10T23:59:11.000Z",
          "wordCount": 8,
          "title": "칸트와 퇴계"
        },
        {
          "id": "https://blog.naver.com/sellars/222532428327",
          "author": "sellars",
          "description": "내가 갖고 있는 백종현 번역의 <순수이성비판>은 2006년에 간행된 것이다. 이 책의 해제 부분에 칸트에 대한 <국내 연구논저> 목록이 있다. 그 이후에 이 목록이 수정되었는지 알 수 없지만, 그런대로 칸트의 <순수이성비판>에 대한 국내 연구 저술들에 대한 정보를 얻을 수 있다. 거기에 <칸트의 학설은 근본적, 총체적으로 틀려 있다>라는 책이 있다. 당연히 나는 이런 과장된 제목의 책은 읽지 않는다. 퇴계의 생가에서 일어난 일 같은데, 그 곳과 관련된 어떤 사람이 퇴계 선생의 철학은 칸트의 철학보다 더 낫고, 미래의 철학이라고 이야기하던 기억이 난다. 거의 노년에 가까웠던 그 중년 남자의 이야기를 듣고 참.......",
          "link": "https://blog.naver.com/sellars/222532428327",
          "publishedOn": "2021-10-09T21:53:01.000Z",
          "wordCount": 8,
          "title": "우리말 칸트 저술에 대한 평가"
        },
        {
          "id": "https://blog.naver.com/sellars/222531582534",
          "author": "sellars",
          "description": "모든 인간의 평등을 보장해 주는 평등의 기본 원칙이 이익 평등고려의 원칙, 즉 이익에 대한 평등한 고려 원칙이다. 우리는 윤리적 판단을 할 때, 개인적이고 파당적 관점을 넘어서 모든 사람들의 이익을 고려해야 한다. 이익을 측정할 때, 개인적 이익이나 집단의 이익이나 인종의 이익을 고려해서는 안 된다. 즉 우리는 이익에 대해서 평등한 고려를 해야 한다. 이 원칙을 채택하면, 인종주의나 종족주의에 의한 차별이나 불평등을 비판할 수 있다. 즉 인종주의나 종족주의는 평등의 기본 원칙에 위배된다. 피터 싱어는 이 원칙을 동물에까지 확장 적용하고자 한다. 그 결과, 우리가 동물을 우리 인간의 이익을 위해 식량으로 사용할 수 있다는.......",
          "link": "https://blog.naver.com/sellars/222531582534",
          "publishedOn": "2021-10-08T21:56:10.000Z",
          "wordCount": 8,
          "title": "동물 음식"
        },
        {
          "id": "https://blog.naver.com/sellars/222528844266",
          "author": "sellars",
          "description": "<권한과 월권을 논할 때에 법이론가들은 권리적인 문제(權利 問題)와 사실 관련 문제(事實 問題)를 구별하고, 이 양자에 대한 증명을 요구하면서, 권한 내지는 정당한 권리를 밝혀내야 하는 전자의 증명을 연역이라 일컫는다.> 권리 문제와 사실 문제를 구분하자. 권리에 대한 증명을 <연역>(deduction)이라고 한다. <우리는 일단의 경험 개념들을 어느 누구의 이의 제기 없이 사용하고 있고, 연역 없이도 그런 개념들에게 고유한 뜻과 상상된 의미를 부여하는 것이 권리가 있다고 여긴다. 왜냐하면, 우리는 그것들의 객관적 실재성을 증명해 주는 경험을 항상 직접 하고 있으니 말이다. 그러나 또한 거의 관용(寬容)으로써 통용.......",
          "link": "https://blog.naver.com/sellars/222528844266",
          "publishedOn": "2021-10-06T10:10:26.000Z",
          "wordCount": 8,
          "title": "초월적 연역과 경험적 연역"
        },
        {
          "id": "https://blog.naver.com/sellars/222527861643",
          "author": "sellars",
          "description": "초판에 있는 ‘순수 지성개념들의 연역’을 다시 읽는다. 그런데 칸트는 자기가 해야 할 과제를 망각하고 있다고 생각한다. 순수 지성개념들을, 혹은 범주들을 우리가 정당하게 사용할 수 있는 권리가 무엇인가? 혹은 그런 개념들의 정당성을 어떻게 입증할 수 있는가? 이 물음에 답변하는 것이 바로 연역의 과제이다. 순수 지성개념들이나 범주들을 우리가 정당하게 사용할 수 있는 것은 그것들이 바로 경험 가능성의 구성 조건, 혹은 필요 조건이기 때문이다. ‘순수 지성개념의 연역’이 이런 답변을 하고 있는 것도 사실이지만, 그러나 이 답변이 부차적인 것으로 간주되고 있다. 왜 그것이 가능한 경험의 필요 조건이 되는지 논증하거나 해.......",
          "link": "https://blog.naver.com/sellars/222527861643",
          "publishedOn": "2021-10-05T14:14:38.000Z",
          "wordCount": 8,
          "title": "순수 지성개념들의 연역 초판"
        },
        {
          "id": "https://blog.naver.com/sellars/222526179562",
          "author": "sellars",
          "description": "민주당 어떤 국회의원이 다음처럼 말한다. <이기면 청렴함이 입증된다? 그러면 지면 부패한 세력이 되는가? 그것이야말로 강자의 논리가 아닌가?> 이런 멍청한 주장을 하는 자가 민주당 국회의원이라는 것이 매우 실망스럽다. <만약 이기면 청렴할 것이다. 따라서 지면, 즉 이기지 못하면, 부패한 세력이 될 것이다. 즉 청렴하지 않을 것이다.> 전형적인 <전건 부정의 오류>이다. 전제로부터 결론이 결코 나오지 않는다. 결론이 나오지 않음에도 <강자의 논리>라고 말하고 있다. 일반적으로 이런 경우 <논리>라는 말을 많이 사용하지만, <논리> 대신에 강자의 <관점>이라고 말하는 것이 좋다. 논리는.......",
          "link": "https://blog.naver.com/sellars/222526179562",
          "publishedOn": "2021-10-04T05:00:23.000Z",
          "wordCount": 8,
          "title": "전건 부정의 오류"
        },
        {
          "id": "https://blog.naver.com/sellars/222524905268",
          "author": "sellars",
          "description": "우리 전통 사상을 어떻게 보아야 하는가? 그것은 철학인가, 아니면 철학의 소재인가? 나는 전통 사상에 대해서 호의적인가, 아니면 부정적인가? 왜 우리의 전통 사상에 대해서 호의적 태도를 갖지 못하는가? 우리의 전통 사상 혹은 전통 철학에 대해서, 가령 김형효가 탐구하고 있는 원효, 지눌, 이퇴계, 이율곡, 정약용에 대해서 나는 과연 무엇을 알고 있는가? 흥미롭게 이들이 서있는 기반이 모두 종교적이다. 불교, 유교, 유교와 서학이 그들이 서있는 기반이다. 거기에 중요한 철학적 문제들이 있겠지만, 그것들의 대부분은 그 종교에 의존적이다. 적어도 이것 때문에 그들의 사상에 대해서 그렇게 대단한 호감을 갖지 않지만, 다른 사람은.......",
          "link": "https://blog.naver.com/sellars/222524905268",
          "publishedOn": "2021-10-03T00:26:48.000Z",
          "wordCount": 8,
          "title": "우리 철학자"
        },
        {
          "id": "https://blog.naver.com/sellars/222523708411",
          "author": "sellars",
          "description": "(A) ‘이것’은 또한 ‘저것’이고, ‘저것’은 또한 ‘이것’이다. ‘저것’도 또한 시비(是非) 판단으로 정립되고, ‘이것’도 또한 시비(是非) 판단으로 정립된다. 그렇다면 ‘저것’과 ‘이것’은 진실로 존재하는 것일까? 아니면 존재하지 않는 것일까? ‘저것’ 과 ‘이것’이 짝이 되지 않는 경우를 ‘도의 지도리’, ‘도추(道樞)’라고 부른다. 한번 그 축이 ‘원의 중앙’에 서게 되면, 그것은 무한한 소통을 하게 된다. 그렇게 되면 ‘옳다’도 하나의 무한한 소통으로 정립되고, ‘아니다’도 하나의 무한한 소통으로 정립된다. (B) 이것이 곧 저것이요, 저것이 곧 이것이다. 저것에도 하나의 시(是)와 비(非)가 있고 이것에도 하나.......",
          "link": "https://blog.naver.com/sellars/222523708411",
          "publishedOn": "2021-10-01T16:24:34.000Z",
          "wordCount": 8,
          "title": "이것이 저것이고, 저것이 이것이다."
        },
        {
          "id": "https://blog.naver.com/sellars/222521463904",
          "author": "sellars",
          "description": "<망각은 타자를 사랑하기 위한 하나의 방법으로써만 제안된 것이다. 장자의 이런 정신은 소통(疏通)이란 개념으로 잘 요약될 수 있다. 흔히 소통은 마음과 뜻이 전해지는 것, 의사소통을 상징하는 커뮤니케이션의 번역어 정도로 이해되고 있다. 그러나 소통의 개념은 이것보다 더 복잡한 것이다. 이 개념은 ‘트다’라는 뜻의 ‘소(疏)’와 ‘연결한다’라는 뜻의 ‘통(通)’이란 글자로 구성되어 있다. 우리가 주목할 것은 ‘소’라는 개념이다. 이 개념은 막혔던 것을 터서 물 같은 것이 잘 흐르도록 한다는 작용의 의미를 담고 있다. ‘소’라는 개념은 우리 마음의 선입견을 비운다는 것, 그러니까 장자가 말했던 망각 혹은 비움과 동일한.......",
          "link": "https://blog.naver.com/sellars/222521463904",
          "publishedOn": "2021-09-29T19:59:29.000Z",
          "wordCount": 8,
          "title": "철학과 어원 분석 2"
        },
        {
          "id": "https://blog.naver.com/sellars/222517506431",
          "author": "sellars",
          "description": "이 사진을 보면서 자연스럽게 탈레반의 행위에 대해서 욕했다. 저것들은 문명적 존재가 아닐 것이다. 그런데 갑자기 다음 몇몇 얼굴들이 떠올랐다. 이것들도 한 번 크레인에 매달면 어떨 것인가? 본보기로 몇 놈 매달면 좋은 나라가 될 것인가? 아니면 이런 생각 자체가 반문명적이고 폭력적인가? 그 기준이 문제가 되겠지만, 인간적 존엄성도 인간다운 인간에게만 존재하는 것이다. 그런데 언제나 <인간다움>이나 <인간임>이 문제된다. 어떤 의미에서 내가 탈레반을 반문명적이며 비인간적 존재라고 비판할 수 없게 되었다.",
          "link": "https://blog.naver.com/sellars/222517506431",
          "publishedOn": "2021-09-26T10:11:07.000Z",
          "wordCount": 8,
          "title": "문명적 혹은 인간적"
        },
        {
          "id": "https://blog.naver.com/sellars/222513143087",
          "author": "sellars",
          "description": "https://blog.naver.com/sellars/222291932803 <2015년 8월 효고현의 '오다 마코토를 읽는 시민모임' 강연에서 김종철이 거론한 인물들은 그런 점에서 매우 흥미롭다. 그는 먼저 일본 근대, 메이지 유신의 선각자로 칭송받는 일본 최고액권 1만엔짜리 지폐의 얼굴 후쿠자와 유키치를 “조선이나 중국인의 입장에서는 엄청난 재앙과 비극과 불행의 사상적 씨앗을 뿌린 장본인”으로 비판하면서 “이 탈아입구론의 근저에 있는 사고구조가 여전히 일본 사회 속에 만만치 않게 살아 있다는 사실”을 지적한다. 그리고 등장시킨 인물이 오구라 기조(小倉紀蔵) 교토대 철학 교수다. 서울대 대학원에서 동양철학을 공부하고 박사학위를 받.......",
          "link": "https://blog.naver.com/sellars/222513143087",
          "publishedOn": "2021-09-22T05:33:26.000Z",
          "wordCount": 8,
          "title": "오구라 기조"
        },
        {
          "id": "https://blog.naver.com/sellars/222510733096",
          "author": "sellars",
          "description": "중국철학이나 동양철학에 대해서 외경심을 갖고 연구하라. 아마 서양 철학자들이 중국에 철학이 없다. 기껏해야 공자에서 볼 수 있듯이 삶의 지혜처럼 보이는 동네 늙은이의 인생에 대한 언명들이 있을 뿐이라는 혹독한 비판에 대한 대응이 이것일 것이다. 존경하라. 중국의 철학이란 그런 시시한 것이 아니다. 존경하고 공감하고 동정(同情)하면 어떤 보석을 발견할 것이다. 그러나 이러한 요구는 그렇게 바람직하지 못하다고 생각한다. 외경과 공감을 요구하기 전에, 외경하고 공감할 수밖에 없는 것을 보여주면 된다. 따라서 그것을 보고 존경하고 공감할 수밖에 없게 만들면 된다. 풍우란에 대한 한 글이 풍우란의 독창적 철학, 신리학(新理.......",
          "link": "https://blog.naver.com/sellars/222510733096",
          "publishedOn": "2021-09-19T06:55:28.000Z",
          "wordCount": 8,
          "title": "중국철학에 대한 외경심"
        },
        {
          "id": "https://blog.naver.com/sellars/222509233834",
          "author": "sellars",
          "description": "풍우란 혹은 펑유란을 통해 중국철학의 철학 개념, 또는 철학성 혹은 <합법성>의 문제를 고찰하고 있는 글을 본다. 그런데 약간 미묘하고 복합적인 감정이 든다. 왜 중국철학자 펑유란인가? 오히려 우리 철학자를 탐구했어야 하는 것이 아닌가? 한국철학은 철학인가, 그것은 재료만 한국철학이었지 실제로 서양철학과 유사한 것이 아닌가, 아니면 철학이 아니라, 일종의 사상사가 아니었던가? 그래서 그것이 사학 논문인지, 철학 논문인지 별로 구분이 되는 않는 그런 것이었는가? 혹은 한국적 철학이 가능한가, ‘한국적’이란 무슨 의미인가? 그런데 이런 물음들에 대한 글을 중국학 혹은 중국철학 전공자에게 요구한다는 것은 과연 정당.......",
          "link": "https://blog.naver.com/sellars/222509233834",
          "publishedOn": "2021-09-17T10:26:07.000Z",
          "wordCount": 8,
          "title": "중국철학의 합법성"
        }
      ]
    }
  ],
  "cliVersion": "1.11.2"
}