{
  "sources": [
    {
      "title": "Stacey on IoT | Internet of Things news and analysis",
      "feedUrl": "https://staceyoniot.com/feed/",
      "siteUrl": "https://staceyoniot.com",
      "articles": [
        {
          "id": "https://staceyoniot.com/?p=8355",
          "author": "Stacey Higginbotham",
          "description": "Span releases a second-generation smart electrical panel: As we electrify our homes and add electric vehicles to our garages we’re either going to need a lot more juice or a better way to manage the electricity coming into the home. Span’s a startup that adds computing and connectivity to electrical panels to help optimize how our […]\nThe post IoT news of the week for May 21, 2021 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-may-21-2021/",
          "publishedOn": "2021-05-21T18:10:44.000Z",
          "wordCount": 1229,
          "title": "IoT news of the week for May 21, 2021"
        },
        {
          "id": "https://staceyoniot.com/?p=8329",
          "author": "Kevin C. Tofel",
          "description": "The new Apple TV 4K arrives soon in stores with a starting price of $179. I’ve been using an Apple-loaned $199 model, which doubles the internal storage to 64 GB, for the past week. Mostly, I’ve been interested in what new smart home features Apple will deliver, but I’ll admit it: I watched a lot […]\nThe post Apple TV 4K: An amazing content experience with a side of HomeKit and Thread appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/apple-tv-4k-2021-review-homekit-thread/",
          "publishedOn": "2021-05-20T13:00:32.000Z",
          "wordCount": 1785,
          "title": "Apple TV 4K: An amazing content experience with a side of HomeKit and Thread"
        },
        {
          "id": "https://staceyoniot.com/?p=8343",
          "author": "Stacey Higginbotham",
          "description": "This week’s show focuses on news from Google I/O 2021 where it’s clear the search giant is trying to build out a fairly open ecosystem based on the Matter protocol and WebRTC for audio and video streaming. Google also said it would use Wear OS for Fitbit and combine Wear OS with Samsung’s Tizen OS. […]\nThe post Podcast: Google decides Matter matters appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-google-decides-matter-matters/",
          "publishedOn": "2021-05-20T12:58:50.000Z",
          "wordCount": 637,
          "title": "Podcast: Google decides Matter matters"
        },
        {
          "id": "https://staceyoniot.com/?p=8321",
          "author": "Stacey Higginbotham",
          "description": "Last week, the Connectivity Standards Alliance (CSA) — formerly known as the Zigbee Alliance — showed off new branding for what used to be known as Project Connected Home over IP. Now called Matter, the protocol is designed to ensure interoperability between many common smart home devices and various related ecosystems. Along with the branding, […]\nThe post Amazon, Google, Apple, and Assa Abloy are working on a smart lock standard appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/amazon-google-apple-and-assa-abloy-are-working-on-a-smart-lock-standard/",
          "publishedOn": "2021-05-18T15:36:51.000Z",
          "wordCount": 999,
          "title": "Amazon, Google, Apple, and Assa Abloy are working on a smart lock standard"
        },
        {
          "id": "https://staceyoniot.com/?p=8317",
          "author": "Kevin C. Tofel",
          "description": "On our most recent IoT Podcast episode, Ian called in to the podcast hotline with a curious question. He wants to know if future mobile devices might include Thread radios to assist with local control of Thread products in the smart home. Ian wonders if Thread will replace Bluetooth for device provisioning. In theory, it […]\nThe post Will phones and tablets eventually have Thread radios? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/will-phones-and-tablets-eventually-have-thread-radios/",
          "publishedOn": "2021-05-18T11:00:29.000Z",
          "wordCount": 777,
          "title": "Will phones and tablets eventually have Thread radios?"
        },
        {
          "id": "https://staceyoniot.com/?p=8319",
          "author": "Stacey Higginbotham",
          "description": "This week, Project Connected Home over IP became Matter, and with the new name came new information about how it will provide interoperability between certain classes of smart home devices. Now that the protocol is back in the spotlight, I’m getting a lot of questions from readers around what will happen to their existing gear, what […]\nThe post An FAQ on the Matter protocol appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/an-faq-on-the-matter-protocol/",
          "publishedOn": "2021-05-17T15:14:37.000Z",
          "wordCount": 1541,
          "title": "An FAQ on the Matter protocol"
        },
        {
          "id": "https://staceyoniot.com/?p=8313",
          "author": "Stacey Higginbotham",
          "description": "Two good stories on the Colonial Pipeline hack: The big cybersecurity news this week was a ransomware attack on Colonial Pipeline Co., which controls a pipeline that sends jet fuel, gas, and heating oil along the Eastern Seaboard of the United States. The pipeline is back up and running, but was shut down after the ransomware […]\nThe post IoT news of the week for May 14, 2021 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-may-14-2021/",
          "publishedOn": "2021-05-14T17:07:40.000Z",
          "wordCount": 1446,
          "title": "IoT news of the week for May 14, 2021"
        },
        {
          "id": "https://staceyoniot.com/?p=8308",
          "author": "Stacey Higginbotham",
          "description": "This week’s show hits on two of the biggest stories of the year for the smart home: Project Connected Home over IP is now called Matter and Amazon’s Sidewalk Network adds Tile as a participant. We also discuss what it means for Zigbee after the Zigbee Alliance changed its name to the Connectivity Standards Alliance.  […]\nThe post Episode 320: Chip becomes Matter and hacked pipelines appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/episode-320-chip-becomes-matter-and-hacked-pipelines/",
          "publishedOn": "2021-05-13T13:00:20.000Z",
          "wordCount": 600,
          "title": "Episode 320: Chip becomes Matter and hacked pipelines"
        },
        {
          "id": "https://staceyoniot.com/?p=8289",
          "author": "Kevin C. Tofel",
          "description": "It hasn’t been 24 hours since Project CHIP became Matter, and the Zigbee Alliance became the Connectivity Standards Alliance, and the full spec won’t be available until fall, but there’s already plenty of information about the new protocol if you know where to look. By looking at the project’s GitHub code repository, I learned quite […]\nThe post You can learn much about Matter from the Project CHIP GitHub repo appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/you-can-learn-much-about-matter-from-the-project-chip-github-repo/",
          "publishedOn": "2021-05-12T14:59:43.000Z",
          "wordCount": 1504,
          "title": "You can learn much about Matter from the Project CHIP GitHub repo"
        },
        {
          "id": "https://staceyoniot.com/?p=8270",
          "author": "Stacey Higginbotham",
          "description": "As it prepares for the launch of a smart home interoperability standard, the Zigbee Alliance has changed its name to the Connectivity Standards Alliance (CSA) and will broaden its scope. At the same time, the working group within the CSA previously known as Project Connected Home over IP has adopted Matter as its formal brand. […]\nThe post Project CHIP gets a new name and so does the Zigbee Alliance appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/project-chip-becomes-matter/",
          "publishedOn": "2021-05-11T16:30:11.000Z",
          "wordCount": 2042,
          "title": "Project CHIP gets a new name and so does the Zigbee Alliance"
        },
        {
          "id": "https://staceyoniot.com/?p=8252",
          "author": "Stacey Higginbotham",
          "description": "What will happen to offices, now that we’re getting COVID somewhat under control? Jamie Dimon, CEO of JP Morgan, wants everyone back at their desks, while Google has shifted its plans to a more flexible, hybrid model after an employee outcry about its original return to work plan that required workers in the office three days a week. […]\nThe post Cisco wants to be the middleman for smart buildings appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/cisco-wants-to-be-the-middleman-for-smart-buildings/",
          "publishedOn": "2021-05-11T13:00:52.000Z",
          "wordCount": 906,
          "title": "Cisco wants to be the middleman for smart buildings"
        },
        {
          "id": "https://staceyoniot.com/?p=8249",
          "author": "Stacey Higginbotham",
          "description": "It’s bad out there for customers of electronic parts and components. The semiconductor shortage is so severe it’s being covered by mainstream media; meanwhile, various politicians have tasked their aides with looking at the global supply chain. Indeed, in the short term, the dearth of chips is already leading to product delays, companies redesigning their […]\nThe post The chip shortage could lead to an era of hardware innovation appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/the-chip-shortage-could-lead-to-an-era-of-hardware-innovation/",
          "publishedOn": "2021-05-10T13:00:50.000Z",
          "wordCount": 1419,
          "title": "The chip shortage could lead to an era of hardware innovation"
        },
        {
          "id": "https://staceyoniot.com/?p=8258",
          "author": "Kevin C. Tofel",
          "description": "On our most recent IoT Podcast episode, Chris called in to our podcast hotline asking for our thoughts on Bluetooth in the smart home as compared to the new Thread protocol. Both Bluetooth and Thread support mesh networks so Chris is wondering if Bluetooth will be supplanted by Thread and if we think the two […]\nThe post Why not Bluetooth in the smart home instead of Thread? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/why-not-bluetooth-in-the-smart-home-instead-of-thread/",
          "publishedOn": "2021-05-08T13:00:29.000Z",
          "wordCount": 1011,
          "title": "Why not Bluetooth in the smart home instead of Thread?"
        },
        {
          "id": "https://staceyoniot.com/?p=8257",
          "author": "Stacey Higginbotham",
          "description": "Tile, the company that pioneered Bluetooth tracking tags, said its devices will work with Amazon’s Sidewalk Network starting in July. The news is notable for two reasons. The first is that it expands Amazon’s Sidewalk network considerably and the second is that it offers Tile (and maybe others) a way to compete with Apple’s newly […]\nThe post With Tile deal Amazon’s Sidewalk network just became more interesting appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/with-tile-deal-amazons-sidewalk-network-just-became-more-interesting/",
          "publishedOn": "2021-05-07T21:07:32.000Z",
          "wordCount": 1095,
          "title": "With Tile deal Amazon’s Sidewalk network just became more interesting"
        },
        {
          "id": "https://staceyoniot.com/?p=8254",
          "author": "Stacey Higginbotham",
          "description": "What are the real costs of using consumer tech everywhere? Consumer technology has democratized technology, taking high-cost components once used for military or rare use cases and turning them into parts for security cameras, for example. This trend also extends to manufacturers and industrial companies buying consumer tech to make their products smarter or cheaper. But given that […]\nThe post IoT news of the week for May 7, 2021 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-may-7-2021/",
          "publishedOn": "2021-05-07T16:00:23.000Z",
          "wordCount": 1551,
          "title": "IoT news of the week for May 7, 2021"
        },
        {
          "id": "https://staceyoniot.com/?p=8243",
          "author": "Stacey Higginbotham",
          "description": "This week’s show was a lot of fun to record with Kevin and me discussing Google’s upcoming I/O event and updates on the chip shortage from STMicro, TSMC, and someone who makes electronics. We also talk about Kroger’s drone delivery plans, cameras in cars, funding for robotic computer vision, and funding for robotic welding driven […]\nThe post Podcast: How ML at the edge will make products truly smart appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-how-ml-at-the-edge-will-make-products-truly-smart/",
          "publishedOn": "2021-05-06T13:00:06.000Z",
          "wordCount": 630,
          "title": "Podcast: How ML at the edge will make products truly smart"
        }
      ]
    },
    {
      "title": "LimitedResults",
      "feedUrl": "https://limitedresults.com/feed/",
      "siteUrl": "https://limitedresults.com",
      "articles": []
    },
    {
      "title": "Google Developers Blog",
      "feedUrl": "https://feeds.feedburner.com/GDBcode",
      "siteUrl": "http://developers.googleblog.com/",
      "articles": [
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/C-tG8-Xcm9M/whats-new-for-android-developers-at.html",
          "author": null,
          "description": "Cross-posted on the Android Developers blog by Karen Ng, Director, Product Management & Jacob Lehrbaum, Director of Developer Relations, Android & Play \n  \nAs Android developers, we are all driven by building experiences that delight people around the world. And with people depending on your apps more than ever, expectations are higher and your jobs as developers aren’t getting easier. Today, at Google I/O, we covered a few ways that we’re trying to help out, whether it be through Android 12 - one of the bi…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/C-tG8-Xcm9M/whats-new-for-android-developers-at.html",
          "publishedOn": "2021-05-20T23:53:00.001Z",
          "wordCount": 3855,
          "title": "What's new for Android developers at Google I/O"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/Zet2fcbSst0/google-pay-introduces-flutter-plugin-for-payments.html",
          "author": null,
          "description": "Posted by Jose Ugia, Developer Programs Engineer, Google Pay and Anthony Panissidi, Technical Writer, Google Developer Studio\n \n We made it easier than ever to integrate Google Pay in Flutter apps! \nOur open source Flutter plugin simplifies the addition of payments to Flutter apps on iOS and Android. \nThe plugin gives you the ability to add functionality to your apps across platforms with a single and familiar codebase written in Dart.  \nIt adapts common steps required to facilitate payments that adhere to …",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/Zet2fcbSst0/google-pay-introduces-flutter-plugin-for-payments.html",
          "publishedOn": "2021-05-19T18:00:00.001Z",
          "wordCount": 2767,
          "title": "Google Pay introduces a Flutter plugin for payments"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/GzFH4RTVGy0/a-new-open-source-content-library-from-google.html",
          "author": null,
          "description": "Posted by Sebastian Trzcinski-Clément, Program Manager, Developer Relations\n Developers around the world are constantly creating open source tools and tutorials but have a hard time getting them discovered. The content published often spanned many different sites - from GitHub to Medium.  Therefore we decided to create a space where we can highlight the best projects related to Google technologies in one place - introducing the Developer Library.  \n \n The platform showcases blog posts and open source tools …",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/GzFH4RTVGy0/a-new-open-source-content-library-from-google.html",
          "publishedOn": "2021-05-19T17:00:00.001Z",
          "wordCount": 2571,
          "title": "A new open source content library from Google"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/HWd67lvvpwQ/new-for-io-assistant-tools-and-features.html",
          "author": null,
          "description": "Posted by Rebecca Nathenson, Director of Product for the Google Assistant Developer Platform\n \n Today at I/O, we shared some exciting new product announcements to help you more easily bring Google Assistant to your Android apps and create more engaging content on smart displays. \nAssistant development made easy with new Android APIs\nApp Actions helps you easily bring Google Assistant to your Android app and complete user queries of all kinds, from booking a ride to posting a message on social media. Compani…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/HWd67lvvpwQ/new-for-io-assistant-tools-and-features.html",
          "publishedOn": "2021-05-18T20:00:00.008Z",
          "wordCount": 3427,
          "title": "New for I/O: Assistant tools and features for Android apps and Smart Displays"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/foS6QQINJBM/unlock-use-cases-and-increase-developer-velocity-with-new-capabilities-in-arcore.html",
          "author": null,
          "description": "Posted by Ian Zhang, Product Manager, AR & Zeina Oweis, Product Manager, AR\n \n ARCore was created to provide developers with simple yet powerful tools to seamlessly blend the digital and physical worlds. Over the last few years, we’ve seen developers create apps that entertain, engage, and help people in different ways–from letting fans interact with their favorite characters, to placing virtual electronics and furniture for the perfect home setup and beyond. \nAt I/O this year, we continue on the mission of…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/foS6QQINJBM/unlock-use-cases-and-increase-developer-velocity-with-new-capabilities-in-arcore.html",
          "publishedOn": "2021-05-18T20:00:00.007Z",
          "wordCount": 3684,
          "title": "Unlock new use cases and increase developer velocity with the latest ARCore updates"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/r2hxTcMn794/google-pay-integration-patterns-that-drive-conversions-on-android.html",
          "author": null,
          "description": "Posted by Jose Ugia, Developer Relations Engineer, Google Pay & Anthony Panissidi, Technical Writer, Google Developer Studio\n \n What do Gilt, MTS, Panera Bread, and SpotHero have in common? \nAt first glance, you probably only see four totally different businesses: \n \nGilt is an online shopping and lifestyle website.  \nMTS is a mobile network operator with 80 million users in Armenia, Belarus, and Russia.  \nPanera Bread is a chain of more than 2,000 fast-casual bakery-cafe restaurants in the US and Canada.  …",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/r2hxTcMn794/google-pay-integration-patterns-that-drive-conversions-on-android.html",
          "publishedOn": "2021-05-18T18:30:00.010Z",
          "wordCount": 3172,
          "title": "Google Pay integration patterns that drive conversions on Android"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/xR4xJcssKCQ/updated-google-pay-app-offers-more-consumer-touchpoints.html",
          "author": null,
          "description": "Posted by Soc Sieng, Developer Advocate, Payments & Ola Ben Har, Payments DevRel Lead\n    \n\n We redesigned the Google Pay app to boost user engagement with your business. \nThe redesigned app makes it easy for users to find your business and provides you with a branded surface that lets you build relationships with your customers at scale. \nThe app is available in the App Store and Google Play Store in the US, India, and Singapore with availability in more markets on the way. In this blog post, we focus on f…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/xR4xJcssKCQ/updated-google-pay-app-offers-more-consumer-touchpoints.html",
          "publishedOn": "2021-05-18T17:30:00.003Z",
          "wordCount": 2952,
          "title": "Updated Google Pay app offers more consumer touchpoints"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/ghEX1iR9SRs/new-dashboard-in-google-developer-profiles.html",
          "author": null,
          "description": "Posted by Chris Demeke, Product Manager; Amani Newton, Technical Writer\n \nThe last time you signed into your Google Developer Profile, you may have noticed a change. Now, after signing-in, you’re invited to view your personal dashboard.\n \n This feature provides a personalized view of your activity and learning content across Google Developers, Firebase, and Android (more to come soon). With the Developer Dashboard, you can see a history of your earned badges and other activity, continue any in-progress code…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/ghEX1iR9SRs/new-dashboard-in-google-developer-profiles.html",
          "publishedOn": "2021-05-04T16:00:00.005Z",
          "wordCount": 2584,
          "title": "New Dashboard in Google Developer Profiles"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/UWIuFHdNddI/updated-google-pay-button-increases-click-through-rates.html",
          "author": null,
          "description": "Posted by Soc Sieng, Developer Advocate, Google Pay\n \n An improved Google Pay button works wonders for click-through rates and the checkout experience. \nThe updated Google Pay button displays a user's card information, which makes the user 30% more likely to use it and increases conversions by 3.6%.   \nThe display of the card's type and last four digits reminds the user that they already saved a payment card to their Google Account, which makes them more likely to opt for the quick and easy checkout process…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/UWIuFHdNddI/updated-google-pay-button-increases-click-through-rates.html",
          "publishedOn": "2021-05-03T16:00:00.006Z",
          "wordCount": 2592,
          "title": "Updated Google Pay button increases click-through rates"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/fF34MuY_hxo/tips-and-shortcuts-for-more-productive-spring.html",
          "author": null,
          "description": "Posted by Bruno Panara, Google Registry Team\n \n In my previous life as a startup entrepreneur, I found that life was more manageable when I was able to stay organized — a task that’s easier said than done. At Google Registry, we've been keeping an eye out for productivity and organization tools, and we’re sharing a few of our favorites with you today, just in time for spring cleaning. \n.new shortcuts to save you time \nSince launching .new shortcuts last year, we’ve seen a range of companies use .new domains…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/fF34MuY_hxo/tips-and-shortcuts-for-more-productive-spring.html",
          "publishedOn": "2021-04-30T16:00:00.005Z",
          "wordCount": 2811,
          "title": "Tips and shortcuts for a more productive spring"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/J2IWhgcbW4M/assistant-sessions-io-2021.html",
          "author": null,
          "description": "Posted by Mike Bifulco\n \n We’re excited to host the first ever virtual Google I/O Conference this year, from May 18-20, 2021 –  and everyone's invited! Developers around the world will join us for keynotes, technical sessions, codelabs, demos, meetups, workshops, and Ask Me Anything (AMA) sessions hosted by Googlers whose teams have been hard at work preparing new features, APIs, and tools for you to try out. We can’t wait for you to explore everything Google has to share. Given the sheer amount of content …",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/J2IWhgcbW4M/assistant-sessions-io-2021.html",
          "publishedOn": "2021-04-29T16:00:00.004Z",
          "wordCount": 3390,
          "title": "Everything Assistant at I/O"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/bB6XZm4HsSY/Actions-on-Google-strategies-game-development.html",
          "author": null,
          "description": "Posted by Wally Brill and Jessica Dene Earley-Cha\n \n Since we launched Interactive Canvas, and especially in the last year we have been helping developers create great storytelling and gaming experiences for Google Assistant on smart displays. Along the way we’ve learned a lot about what does and doesn’t work. Building these kinds of interactive voice experiences is still a relatively new endeavor, and so we want to share what we've learned to help you build the next great gaming or storytelling experience …",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/bB6XZm4HsSY/Actions-on-Google-strategies-game-development.html",
          "publishedOn": "2021-04-26T19:00:00.001Z",
          "wordCount": 3470,
          "title": "Recommended strategies and best practices for designing and developing games and stories on Google Assistant"
        },
        {
          "id": "http://feedproxy.google.com/~r/GDBcode/~3/Hmzvv--peCQ/google-developer-group-spotlight.html",
          "author": null,
          "description": "Posted by Jennifer Kohl, Global Program Manager, Google Developer Communities \n         \n    The Google Developer Groups Spotlight series interviews inspiring leaders of community meetup groups around the world. Our goal is to learn more about what developers are working on, how they’ve grown their skills with the Google Developer Group community, and what tips they might have for us all.  \n      We recently spoke with Ilias Papachristos, Google Developer Group Cloud Thessaloniki Lead in Greece. Check out o…",
          "link": "http://feedproxy.google.com/~r/GDBcode/~3/Hmzvv--peCQ/google-developer-group-spotlight.html",
          "publishedOn": "2021-04-23T16:06:00.002Z",
          "wordCount": 3086,
          "title": "Google Developer Group Spotlight: A conversation with Cloud Architect, Ilias Papachristos"
        }
      ]
    },
    {
      "title": "애자일 이야기",
      "feedUrl": "http://rss.egloos.com/blog/agile",
      "siteUrl": "http://agile.egloos.com",
      "articles": []
    },
    {
      "title": "Arjun Sreedharan",
      "feedUrl": "https://feeds.feedburner.com/ArjunSreedharan",
      "siteUrl": "https://arjunsreedharan.org/",
      "articles": []
    },
    {
      "title": "Dan Luu",
      "feedUrl": "https://danluu.com/atom.xml",
      "siteUrl": "https://danluu.com/atom/index.xml",
      "articles": []
    },
    {
      "title": "Damien Katz",
      "feedUrl": "http://damienkatz.net/feed/",
      "siteUrl": "http://damienkatz.net",
      "articles": []
    },
    {
      "title": "Better Embedded System SW",
      "feedUrl": "http://feeds.feedburner.com/BetterEmbeddedSystemSw",
      "siteUrl": "http://betterembsw.blogspot.com/",
      "articles": [
        {
          "id": "http://feedproxy.google.com/~r/BetterEmbeddedSystemSw/~3/50c8LEuxJmA/job-and-career-advice.html",
          "author": null,
          "description": "A connection on LinkedIn asked me for help deciding between job offers. I can't provide personalize advice, but here are my thoughts in general.\n\n\n\n\n\nYou must accept personal ownership for choosing what you want to do with  at least the next few years of your life. Nobody can do this for you.\nYour time is a scarce, non-renewable resource so spend care in deciding.  On the other hand it is difficult to make a choice because as they say,  it is difficult to make predictions, especially about the future. It's …",
          "link": "http://feedproxy.google.com/~r/BetterEmbeddedSystemSw/~3/50c8LEuxJmA/job-and-career-advice.html",
          "publishedOn": "2021-05-08T12:39:00.010Z",
          "wordCount": 1579,
          "title": "Job and Career Advice"
        }
      ]
    },
    {
      "title": "Python Insider",
      "feedUrl": "https://feeds.feedburner.com/PythonInsider",
      "siteUrl": "https://pythoninsider.blogspot.com/",
      "articles": [
        {
          "id": "http://feedproxy.google.com/~r/PythonInsider/~3/0mh76ka5YSI/python-3810-395-and-3100b1-are-now.html",
          "author": null,
          "description": "This has been a very busy day for releases and on\r\n behalf of the Python development community we’re happy to announce the \r\navailability of three new Python releases.\n\r\n\r\nPython 3.10 is now in Beta\n\r\nGet it here: https://www.python.org/downloads/release/python-3100b1/ \n\nPython 3.10 is still in development. 3.10.0b1 is the first of four \r\nplanned beta release previews. Beta release previews are intended to \r\ngive the wider community the opportunity to test new features and bug \r\nfixes and to prepare their p…",
          "link": "http://feedproxy.google.com/~r/PythonInsider/~3/0mh76ka5YSI/python-3810-395-and-3100b1-are-now.html",
          "publishedOn": "2021-05-03T23:16:00.002Z",
          "wordCount": 1232,
          "title": "Python 3.8.10, 3.9.5, and 3.10.0b1 are now available"
        }
      ]
    },
    {
      "title": "james hunt (.us)",
      "feedUrl": "https://jameshunt.us/feed/",
      "siteUrl": "https://jameshunt.us",
      "articles": []
    },
    {
      "title": "Kwang Yul Seo",
      "feedUrl": "https://kwangyulseo.com/feed/",
      "siteUrl": "https://kwangyulseo.com",
      "articles": []
    },
    {
      "title": "AEP코리아네트",
      "feedUrl": "https://rss.blog.naver.com/aepkoreanet.xml",
      "siteUrl": "https://blog.naver.com/aepkoreanet",
      "articles": []
    },
    {
      "title": "Embedded Rambling",
      "feedUrl": "http://shadetail.com/blog/feed/",
      "siteUrl": "http://shadetail.com/blog",
      "articles": []
    },
    {
      "title": "LWN.net",
      "feedUrl": "https://lwn.net/headlines/rss",
      "siteUrl": "https://lwn.net",
      "articles": [
        {
          "id": "https://lwn.net/Articles/856934/rss",
          "author": "corbet",
          "description": "In 2018, LWN covered a talk by Gernot\nHeiser about the seL4 project, which has developed an open-source\noperating system for safety-critical applications and gone to the trouble\nof proving its correctness.  Much of that work has been done at CSIRO in\nAustralia.  Heiser has announced\nvia Twitter that CSIRO's support for this project is being shut down, with\nthe staff being \nredirected to artificial-intelligence projects.  Hopefully the seL4 Foundation, established in\n2020, will be able to carry on this inter…",
          "link": "https://lwn.net/Articles/856934/rss",
          "publishedOn": "2021-05-21T17:13:29.000Z",
          "wordCount": 163,
          "title": "CSIRO's seL4 project shut down"
        },
        {
          "id": "https://lwn.net/Articles/856926/rss",
          "author": "corbet",
          "description": "Version 5.34.0 of the Perl language has been released.\n\"Perl 5.34.0 represents approximately 11 months of development since\nPerl 5.32.0 and contains approximately 280,000 lines of changes across\n2,100 files from 78 authors.\"  See this\npage for a list of changes; they include a new try/catch syntax, a new\noctal syntax, and many improvements to various modules.",
          "link": "https://lwn.net/Articles/856926/rss",
          "publishedOn": "2021-05-21T15:43:52.000Z",
          "wordCount": 127,
          "title": "Perl 5.34.0 released"
        },
        {
          "id": "https://lwn.net/Articles/856514/rss",
          "author": "corbet",
          "description": "Among the many changes merged for the 5.13 kernel is support for the LLVM\ncontrol-flow integrity (CFI) mechanism.  CFI defends against exploits by\nensuring that indirect function calls have not been redirected by an\nattacker.  Quite a bit of work was needed to make this feature work well\nfor the kernel, but the result appears to be production-ready and able to\ndefend Linux systems from a range of attacks.",
          "link": "https://lwn.net/Articles/856514/rss",
          "publishedOn": "2021-05-21T14:36:41.000Z",
          "wordCount": null,
          "title": "[$] Control-flow integrity in 5.13"
        },
        {
          "id": "https://lwn.net/Articles/856902/rss",
          "author": "jake",
          "description": "Security updates have been issued by Arch Linux (ceph, chromium, firefox, gitlab, hedgedoc, keycloak, libx11, mariadb, opendmarc, prosody, python-babel, python-flask-security-too, redmine, squid, and vivaldi), Debian (lz4), Fedora (ceph and python-pydantic), and openSUSE (cacti, cacti-spine).",
          "link": "https://lwn.net/Articles/856902/rss",
          "publishedOn": "2021-05-21T14:05:40.000Z",
          "wordCount": 107,
          "title": "Security updates for Friday"
        },
        {
          "id": "https://lwn.net/Articles/856685/rss",
          "author": "corbet",
          "description": "The RISC-V CPU architecture has been\ngaining prominence for some years; its relatively open nature makes it an\nattractive platform on which a number of companies have built products.\nLinux supports\nRISC-V well, but there is one gaping hole: there is no support for\nvirtualization with KVM,\ndespite the fact that a high-quality \nimplementation exists.  A recent attempt to add that support is shining\nsome light on a part of the ecosystem that, it seems, does not work quite\nas well\nas one would like.",
          "link": "https://lwn.net/Articles/856685/rss",
          "publishedOn": "2021-05-20T17:39:41.000Z",
          "wordCount": null,
          "title": "[$] Why RISC-V doesn't (yet) support KVM"
        },
        {
          "id": "https://lwn.net/Articles/856775/rss",
          "author": "jake",
          "description": "Security updates have been issued by Fedora (cacti, cacti-spine, exif, firefox, kernel, mariadb, and thunderbird), Mageia (kernel, kernel-linus, and libxml2), openSUSE (exim and jhead), Oracle (slapi-nis and xorg-x11-server), Scientific Linux (slapi-nis and xorg-x11-server), Slackware (libX11), SUSE (djvulibre, fribidi, graphviz, grub2, libass, libxml2, lz4, python-httplib2, redis, rubygem-actionpack-4_2, and xen), and Ubuntu (pillow and python-babel).",
          "link": "https://lwn.net/Articles/856775/rss",
          "publishedOn": "2021-05-20T14:08:54.000Z",
          "wordCount": 126,
          "title": "Security updates for Thursday"
        },
        {
          "id": "https://lwn.net/Articles/856148/rss",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for May 20, 2021 is available.",
          "link": "https://lwn.net/Articles/856148/rss",
          "publishedOn": "2021-05-20T01:47:58.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for May 20, 2021"
        },
        {
          "id": "https://lwn.net/Articles/856518/rss",
          "author": "jake",
          "description": "May 11 marked a new major release for the Python-based Flask web\nmicroframework project, but Flask 2.0\nwas only part of the story.  While the framework may be the most visible\npiece, it is one of a small handful of cooperating libraries that provide\nsolutions for various web-development tasks;  all are incorporated into the Pallets projects organization.  For\nthe first time, all\nsix libraries that make up Pallets were released at the same time and\neach had a new major version number.  In part, that new majo…",
          "link": "https://lwn.net/Articles/856518/rss",
          "publishedOn": "2021-05-19T22:13:23.000Z",
          "wordCount": null,
          "title": "[$] A bunch of releases from the Pallets projects"
        },
        {
          "id": "https://lwn.net/Articles/856650/rss",
          "author": "ris",
          "description": "Stable kernels 5.12.5, 5.11.22, 5.10.38, and 5.4.120 have been released. This is the last\n5.11.y kernel and users should move to 5.12.y at this time.",
          "link": "https://lwn.net/Articles/856650/rss",
          "publishedOn": "2021-05-19T14:55:35.000Z",
          "wordCount": 100,
          "title": "Four stable kernels"
        },
        {
          "id": "https://lwn.net/Articles/856649/rss",
          "author": "ris",
          "description": "Security updates have been issued by Fedora (cacti, cacti-spine, exif, and hivex), Red Hat (bash, bind, bluez, brotli, container-tools:rhel8, cpio, curl, dotnet3.1, dotnet5.0, dovecot, evolution, exiv2, freerdp, ghostscript, glibc, GNOME, go-toolset:rhel8, grafana, gssdp and gupnp, httpd:2.4, idm:DL1, idm:DL1 and idm:client, ipa, kernel, kernel-rt, krb5, libdb, libvncserver, libxml2, linux-firmware, mailman:2.1, mingw packages, NetworkManager and libnma, opensc, p11-kit, pandoc, perl, pki-core:10.6 and pki-…",
          "link": "https://lwn.net/Articles/856649/rss",
          "publishedOn": "2021-05-19T14:43:10.000Z",
          "wordCount": 185,
          "title": "Security updates for Wednesday"
        },
        {
          "id": "https://lwn.net/Articles/856543/rss",
          "author": "jake",
          "description": "Several readers have alerted us to some serious problems at freenode, which runs an IRC network that\nis popular in the free-software world.  Evidently there has been a change\nof control within the volunteer-run organization that has led to the\nresignations of multiple different volunteers, at least in part due\nto a concern about the personal information of freenode users under the new\nmanagement. \"The\nfreenode resignation FAQ\" has collected a bunch of information (and\nlinks to even more resignation letters)…",
          "link": "https://lwn.net/Articles/856543/rss",
          "publishedOn": "2021-05-19T13:43:16.000Z",
          "wordCount": 221,
          "title": "Upheaval at freenode"
        },
        {
          "id": "https://lwn.net/Articles/856438/rss",
          "author": "jake",
          "description": "Control groups (cgroups) are meant to limit access to a shared resource among\nprocesses in the system.  One such resource is the values used to specify\nan encrypted-memory region for a virtual machine, such as the address-space\nidentifiers (ASIDs) used by the AMD Secure\nEncrypted Virtualization (SEV) feature.  Vipin Sharma set\nout to add a \ncontrol group for these ASIDs back in September; based on the feedback,\nthough, he expanded the idea into a controller to track and limit any countable resource.\nThe pat…",
          "link": "https://lwn.net/Articles/856438/rss",
          "publishedOn": "2021-05-18T21:39:57.000Z",
          "wordCount": null,
          "title": "[$] The misc control group"
        },
        {
          "id": "https://lwn.net/Articles/856506/rss",
          "author": "corbet",
          "description": "The Mozilla Security Blog announces\nthat there is a new site-isolation mechanism available for testing in the\nFirefox browser.  It's a defense against Meltdown and Spectre exploits.\n\n\nThis fundamental redesign of Firefox's Security architecture extends\ncurrent security mechanisms by creating operating system process-level\nboundaries for all sites loaded in Firefox for Desktop. Isolating each site\ninto a separate operating system process makes it even harder for malicious\nsites to read another site’s secret …",
          "link": "https://lwn.net/Articles/856506/rss",
          "publishedOn": "2021-05-18T16:33:55.000Z",
          "wordCount": 166,
          "title": "Introducing Site Isolation in Firefox (Mozilla security blog)"
        },
        {
          "id": "https://lwn.net/Articles/856496/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (chromium, curl, prosody, and ruby-rack-cors), Fedora (dotnet3.1 and dotnet5.0), openSUSE (ibsim and prosody), SUSE (kernel and python3), and Ubuntu (caribou and djvulibre).",
          "link": "https://lwn.net/Articles/856496/rss",
          "publishedOn": "2021-05-18T14:53:35.000Z",
          "wordCount": 102,
          "title": "Security updates for Tuesday"
        },
        {
          "id": "https://lwn.net/Articles/856312/rss",
          "author": "corbet",
          "description": "There have been many disagreements over the years in the kernel community\nconcerning the exporting of internal kernel symbols to loadable modules.\nExporting a symbol often exposes implementation decisions to outside code,\nmakes it possible to use (or abuse) kernel functionality in unintended\nways, and makes future changes harder.  That said, there is no authority\noverseeing the exporting of symbols and no process for approving exports;\ndiscussions only tend to arise \nwhen somebody notices a change that they…",
          "link": "https://lwn.net/Articles/856312/rss",
          "publishedOn": "2021-05-17T20:52:26.000Z",
          "wordCount": null,
          "title": "[$] Exported-symbol changes in 5.13"
        },
        {
          "id": "https://lwn.net/Articles/856447/rss",
          "author": "ris",
          "description": "The T2 System Development Environment Linux 21.5 was released with 18 pre-\nand cross-compiled architectures. \"The 21.5 release received updates\nacross the board, while a major point of work was the GCC 11 update as well\nas re-basing and fixing upstream regressions for the Sony PS3 support as\nwell as various small improvements, including an up to 15 seconds faster\nsystem shutdown when using sysvinit.\"",
          "link": "https://lwn.net/Articles/856447/rss",
          "publishedOn": "2021-05-17T18:57:56.000Z",
          "wordCount": 153,
          "title": "T2 Linux 21.5 \"Because we can\" for 18 architectures"
        },
        {
          "id": "https://lwn.net/Articles/856437/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (libimage-exiftool-perl and postgresql-9.6), Fedora (chromium, exiv2, firefox, kernel, kernel-headers, kernel-tools, mariadb, and python-impacket), Mageia (avahi), openSUSE (chromium, drbd-utils, dtc, ipvsadm, jhead, nagios, netdata, openvpn, opera, prosody, and virtualbox), Slackware (libxml2), SUSE (kernel and lz4), and Ubuntu (intel-microcode, python-eventlet, and rust-pleaser).",
          "link": "https://lwn.net/Articles/856437/rss",
          "publishedOn": "2021-05-17T15:12:43.000Z",
          "wordCount": 120,
          "title": "Security updates for Monday"
        },
        {
          "id": "https://lwn.net/Articles/856386/rss",
          "author": "corbet",
          "description": "The 5.13-rc2 kernel prepatch is out for\ntesting.  \"The fixes here are all over the place - drivers, arch updates,\ndocumentation, tooling.. Nothing particularly stands out\".",
          "link": "https://lwn.net/Articles/856386/rss",
          "publishedOn": "2021-05-17T12:28:22.000Z",
          "wordCount": 101,
          "title": "Kernel prepatch 5.13-rc2"
        },
        {
          "id": "https://lwn.net/Articles/855943/rss",
          "author": "corbet",
          "description": "Group membership is normally used to grant access to some resource;\nexamples might include using groups to control access to a shared\ndirectory, a printer, or the ability to use tools like sudo.  It\nis possible, though, to use group membership to deny access to a\nresource instead, and some administrators make use of that feature.  But\ngroups only work as a negative credential if the user cannot shed them at\nwill.  Occasionally, some way to escape a group has turned up, resulting in\nvulnerabilities on system…",
          "link": "https://lwn.net/Articles/855943/rss",
          "publishedOn": "2021-05-14T15:58:21.000Z",
          "wordCount": null,
          "title": "[$] Sticky groups in the shadows"
        },
        {
          "id": "https://lwn.net/Articles/856266/rss",
          "author": "jake",
          "description": "Greg Kroah-Hartman has announced the release of the 5.12.4, 5.11.21, 5.10.37, and 5.4.119 stable kernels.  These are enormous\nupdates, with changes throughout the kernel tree; users should upgrade.",
          "link": "https://lwn.net/Articles/856266/rss",
          "publishedOn": "2021-05-14T14:10:33.000Z",
          "wordCount": 115,
          "title": "Stable kernels  5.12.4, 5.11.21, 5.10.37, and 5.4.119"
        },
        {
          "id": "https://lwn.net/Articles/856265/rss",
          "author": "jake",
          "description": "Security updates have been issued by Debian (jetty9, libgetdata, and postgresql-11), openSUSE (java-11-openjdk), SUSE (dtc, ibsim, ibutils, ipvsadm, and kernel), and Ubuntu (awstats and glibc).",
          "link": "https://lwn.net/Articles/856265/rss",
          "publishedOn": "2021-05-14T13:53:04.000Z",
          "wordCount": 98,
          "title": "Security updates for Friday"
        },
        {
          "id": "https://lwn.net/Articles/856005/rss",
          "author": "corbet",
          "description": "The kernel's BPF virtual machine allows\nprograms loaded from user space to be safely run in the kernel's context.\nThat functionality would be of limited use, however, without the ability\nfor those programs to interact with the rest of the kernel.  The interface\nbetween BPF and the kernel has been kept narrow for a number of good\nreasons, including safety and keeping the kernel in control of the system.\nThe 5.13 kernel, though, contains a feature that could, over \ntime, widen that interface considerably: the…",
          "link": "https://lwn.net/Articles/856005/rss",
          "publishedOn": "2021-05-13T14:31:20.000Z",
          "wordCount": null,
          "title": "[$] Calling kernel functions from BPF"
        },
        {
          "id": "https://lwn.net/Articles/856177/rss",
          "author": "jake",
          "description": "Security updates have been issued by Debian (graphviz and redmine), Fedora (dom4j, kernel, kernel-headers, kernel-tools, mariadb, php, php-phpmailer6, and redis), openSUSE (kernel and nagios), and Ubuntu (mysql-5.7, mysql-8.0 and python-django).",
          "link": "https://lwn.net/Articles/856177/rss",
          "publishedOn": "2021-05-13T13:45:13.000Z",
          "wordCount": 103,
          "title": "Security updates for Thursday"
        },
        {
          "id": "https://lwn.net/Articles/855621/rss",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for May 13, 2021 is available.",
          "link": "https://lwn.net/Articles/855621/rss",
          "publishedOn": "2021-05-13T00:41:54.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for May 13, 2021"
        },
        {
          "id": "https://lwn.net/Articles/856044/rss",
          "author": "jake",
          "description": "The discoverer of the KRACK attacks\nagainst WPA2 encryption in WiFi is back with a new set of flaws in the\nwireless-networking protocols. FragAttacks is a sizable group of\nWiFi vulnerabilities that (ab)use the fragmentation and aggregation (thus\n\"Frag\") features of the standard.  The fixes have been coordinated over a\nnine-month period, which has allowed security researcher Mathy Vanhoef time\nto create multiple papers, some slide decks, a demo video, patches, and, of course, a web\nsite and logo for the vuln…",
          "link": "https://lwn.net/Articles/856044/rss",
          "publishedOn": "2021-05-12T22:49:51.000Z",
          "wordCount": null,
          "title": "[$] Holes in the WiFi"
        },
        {
          "id": "https://lwn.net/Articles/856091/rss",
          "author": "ris",
          "description": "GNU Guix, the transactional package manager and distribution, has released\nversion 1.3.0. This released adds new features, refines the user\nexperience, and improves performance. Support for the POWER9 platform is\nnow offered as technological preview.",
          "link": "https://lwn.net/Articles/856091/rss",
          "publishedOn": "2021-05-12T15:48:36.000Z",
          "wordCount": 118,
          "title": "GNU Guix 1.3.0 released"
        },
        {
          "id": "https://lwn.net/Articles/856087/rss",
          "author": "ris",
          "description": "Stable kernels 5.12.3 and 5.11.20 have been released with important\nfixes throughout the tree. Users should upgrade.",
          "link": "https://lwn.net/Articles/856087/rss",
          "publishedOn": "2021-05-12T15:25:21.000Z",
          "wordCount": 92,
          "title": "New stable kernels"
        },
        {
          "id": "https://lwn.net/Articles/856086/rss",
          "author": "ris",
          "description": "Security updates have been issued by Debian (composer, hivex, lz4, and rails), Fedora (chromium, community-mysql, djvulibre, dom4j, firefox, php, php-phpmailer6, python-django, and redis), Mageia (mariadb, nagios, and pngcheck), openSUSE (opera, syncthing, and vlc), SUSE (kernel, openvpn, openvpn-openssl1, shim, and xen), and Ubuntu (flatpak, linux, linux-aws, linux-aws-5.4, linux-azure, linux-azure-5.4, linux-gcp, linux-gcp-5.4, linux-gke, linux-gke-5.4, linux-gkeop, linux-gkeop-5.4, linux-hwe-5.4, linux-k…",
          "link": "https://lwn.net/Articles/856086/rss",
          "publishedOn": "2021-05-12T15:10:57.000Z",
          "wordCount": 165,
          "title": "Security updates for Wednesday"
        },
        {
          "id": "https://lwn.net/Articles/855875/rss",
          "author": "jake",
          "description": "Python in the browser has long been an item on the wish list of many in the\nPython community.  At this point, though, JavaScript has well-cemented its role as the\nlanguage embedded into the web and its browsers.  The Pyodide project provides a\nway to run Python in the browser by compiling the existing CPython\ninterpreter to WebAssembly and\nrunning that binary within the browser's JavaScript environment.  Pyodide\ncame about as part of Mozilla's Iodide\nproject, which has fallen by the wayside, but Pyodide is …",
          "link": "https://lwn.net/Articles/855875/rss",
          "publishedOn": "2021-05-11T22:43:13.000Z",
          "wordCount": null,
          "title": "[$] Pyodide: Python for the browser"
        },
        {
          "id": "https://lwn.net/Articles/856009/rss",
          "author": "corbet",
          "description": "Vice takes\na look at the SleepyHead system\nfor the management of CPAP machines.\n\n\n\tThe free, open-source, and definitely not FDA-approved piece of\n\tsoftware is the product of thousands of hours of hacking and\n\tdevelopment by a lone Australian developer named Mark Watkins, who\n\thas helped thousands of sleep apnea patients take back control of\n\ttheir treatment from overburdened and underinvested doctors. The\n\tsoftware gives patients access to the sleep data that is already\n\tbeing generated by their CPAP machi…",
          "link": "https://lwn.net/Articles/856009/rss",
          "publishedOn": "2021-05-11T21:39:13.000Z",
          "wordCount": 214,
          "title": "Why Sleep Apnea Patients Rely on a CPAP Machine Hacker (Vice)"
        },
        {
          "id": "https://lwn.net/Articles/856001/rss",
          "author": "ris",
          "description": "The Microsoft Open Source Blog takes\na look at implementing eBPF support in Windows. \"Although support for eBPF was first implemented in the Linux kernel, there has been increasing interest in allowing eBPF to be used on other operating systems and also to extend user-mode services and daemons in addition to just the kernel.\n\nToday we are excited to announce a new Microsoft open source project to\nmake eBPF work on Windows 10 and Windows Server 2016 and later. The ebpf-for-windows project aims to allow devel…",
          "link": "https://lwn.net/Articles/856001/rss",
          "publishedOn": "2021-05-11T17:10:25.000Z",
          "wordCount": 226,
          "title": "Making eBPF work on Windows (Microsoft Open Source Blog)"
        },
        {
          "id": "https://lwn.net/Articles/856000/rss",
          "author": "ris",
          "description": "The coreboot firmware project has released\nversion 4.14. \"These changes have been all over the place, so that there's no\nparticular area to focus on when describing this release: We had\nimprovements to mainboards, to chipsets (including much welcomed\nwork to open source implementations of what has been blobs before),\nto the overall architecture.\"",
          "link": "https://lwn.net/Articles/856000/rss",
          "publishedOn": "2021-05-11T16:36:10.000Z",
          "wordCount": 134,
          "title": "Announcing coreboot 4.14"
        },
        {
          "id": "https://lwn.net/Articles/855996/rss",
          "author": "ris",
          "description": "Stable kernels 5.10.36 and 5.4.118 have been released. They both contain\nimportant fixes throughout the tree. Users should upgrade.",
          "link": "https://lwn.net/Articles/855996/rss",
          "publishedOn": "2021-05-11T15:32:30.000Z",
          "wordCount": 94,
          "title": "Two stable kernels"
        }
      ]
    },
    {
      "title": "IT의 중심에서",
      "feedUrl": "https://subokim.wordpress.com/feed/",
      "siteUrl": "https://subokim.wordpress.com",
      "articles": []
    },
    {
      "title": "edykim.com 블로그 RSS 피드",
      "feedUrl": "https://edykim.com/ko/feed.xml",
      "siteUrl": "https://edykim.com/ko",
      "articles": []
    },
    {
      "title": "Preshing on Programming",
      "feedUrl": "http://preshing.com/feed",
      "siteUrl": "https://preshing.com/feed",
      "articles": []
    },
    {
      "title": "Many But Finite",
      "feedUrl": "https://feeds.feedburner.com/GustavoDuarte",
      "siteUrl": "https://manybutfinite.com/",
      "articles": []
    },
    {
      "title": "MCU on Eclipse",
      "feedUrl": "https://mcuoneclipse.com/feed/",
      "siteUrl": "https://mcuoneclipse.com",
      "articles": [
        {
          "id": "http://mcuoneclipse.com/?p=32464",
          "author": "Erich Styger",
          "description": "One major concern of embedded system development is performance. Microcontroller have more MHz than in the past, but embedded applications are all about timing and real-time aspects. The challenge is: how to get data off the target in realtime? SWO … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/05/22/swo-with-arm-cortex-m33/",
          "publishedOn": "2021-05-22T18:42:11.000Z",
          "wordCount": 1605,
          "title": "SWO with ARM Cortex-M33"
        },
        {
          "id": "http://mcuoneclipse.com/?p=32438",
          "author": "Erich Styger",
          "description": "If a Cortex microcontroller is unresponsive to a debug connection for various reasons, then this trick might help to recover that device for you. All you need is a debug probe from PEMICRO and a utility. Many NXP Kinetis and … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/05/20/recovering-cortex-m-microcontroller-with-a-power-glitch/",
          "publishedOn": "2021-05-20T18:45:00.000Z",
          "wordCount": 761,
          "title": "Recovering Cortex-M Microcontroller with a Power Glitch"
        },
        {
          "id": "http://mcuoneclipse.com/?p=31457",
          "author": "Erich Styger",
          "description": "This is about one of my ‘long running projects’: I happily can report that the missing last piece has been installed after 16 months from the start of the project: the ‘3D-Printed-Supported-Driftwood-Bath-Tub-Shower-Gel-Holder’ 🙂 : This is the ‘official finish’ of … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/05/16/full-bathroom-remodeling-with-the-help-of-a-3d-printer/",
          "publishedOn": "2021-05-16T16:02:47.000Z",
          "wordCount": 4296,
          "title": "Full Bathroom Remodeling (with the Help of a 3D Printer)"
        },
        {
          "id": "http://mcuoneclipse.com/?p=31983",
          "author": "Erich Styger",
          "description": "For a research project we selected the NXP LPC55S16 but because it has due the silicon shortage it is not available probably for the next 52 weeks (yikes!) we can use the EVK Board. The FatFS file system from Elm … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/05/15/using-fatfs-and-minini-with-the-nxp-lpc55s16-evk/",
          "publishedOn": "2021-05-15T10:17:18.000Z",
          "wordCount": 1625,
          "title": "Using FatFS and MinINI with the NXP LPC55S16 EVK"
        },
        {
          "id": "http://mcuoneclipse.com/?p=31953",
          "author": "Erich Styger",
          "description": "There are many ways to organize projects and workflows, and I would say Eclipse is flexible enough for everything. As I have been asked recently how I organize my projects, I’ll share it here. Eclipse Workspace Eclipse has the concept … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/05/13/organizing-projects-with-eclipse-and-git/",
          "publishedOn": "2021-05-13T19:11:00.000Z",
          "wordCount": 1481,
          "title": "Organizing Projects with Eclipse and Git"
        },
        {
          "id": "http://mcuoneclipse.com/?p=31924",
          "author": "Erich Styger",
          "description": "The previous parts were about installation, project setup, building and debugging. This one is about defining the ‘tool kit’ so I can make use more of the CMake infrastructure in Visual Studio Code: Outline There are still a few things … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/05/11/visual-studio-code-for-c-c-with-arm-cortex-m-part-5/",
          "publishedOn": "2021-05-11T18:46:00.000Z",
          "wordCount": 873,
          "title": "Visual Studio Code for C/C++ with ARM Cortex-M: Part 5"
        },
        {
          "id": "http://mcuoneclipse.com/?p=31851",
          "author": "Erich Styger",
          "description": "The previous parts were about installation, project setup and building. This one is about debugging an ARM Cortex-M Microcontroller with Visual Studio Code: Outline In this article I show how to debug an ARM Cortex (M4F, NXP K22FN512) microcontroller with … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/05/09/visual-studio-code-for-c-c-with-arm-cortex-m-part-4/",
          "publishedOn": "2021-05-09T16:05:14.000Z",
          "wordCount": 2249,
          "title": "Visual Studio Code for C/C++ with ARM Cortex-M: Part 4"
        },
        {
          "id": "http://mcuoneclipse.com/?p=31869",
          "author": "Erich Styger",
          "description": "After all the technical posts, on a different topic: Spring finally has arrived in Switzerland! The Föhn wind creates interesting cloud formations. There is still more than 1 meter snow in the higher areas. With temperatures > 20°C in the … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/05/09/sunny-day-in-may-2021/",
          "publishedOn": "2021-05-09T11:34:22.000Z",
          "wordCount": 540,
          "title": "Sunny Day in May 2021"
        },
        {
          "id": "http://mcuoneclipse.com/?p=31797",
          "author": "Erich Styger",
          "description": "This is the third part in a series to get up and running using the Microsoft Visual Studio Code for embedded development on ARM Cortex-M. So far we have installed the needed tools, created a project and are able to … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/05/06/visual-studio-code-for-c-c-with-arm-cortex-m-part-3/",
          "publishedOn": "2021-05-06T21:17:00.000Z",
          "wordCount": 3143,
          "title": "Visual Studio Code for C/C++ with ARM Cortex-M: Part 3"
        },
        {
          "id": "http://mcuoneclipse.com/?p=31711",
          "author": "Erich Styger",
          "description": "This is the second part of series or articles how to use the Microsoft Visual Studio Code for embedded development on ARM Cortex-M. In this part I’m going to show how to create and build a project using CMake running … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/05/04/visual-studio-code-for-c-c-with-arm-cortex-m-part-2/",
          "publishedOn": "2021-05-04T21:17:00.000Z",
          "wordCount": 3150,
          "title": "Visual Studio Code for C/C++ with ARM Cortex-M: Part 2"
        },
        {
          "id": "http://mcuoneclipse.com/?p=29899",
          "author": "Erich Styger",
          "description": "For a few months I’m learning and using Rust. I’m still learning, but I’m very impressed by the powerful and cool programming language, the vibrant ecosystem, the advanced concepts behind it and by the tools. With learning Rust I have … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/05/01/visual-studio-code-for-c-c-with-arm-cortex-m-part-1/",
          "publishedOn": "2021-05-01T19:00:02.000Z",
          "wordCount": 6971,
          "title": "Visual Studio Code for C/C++ with ARM Cortex-M: Part 1"
        },
        {
          "id": "http://mcuoneclipse.com/?p=31619",
          "author": "Erich Styger",
          "description": "As time flies by, my projects are evolving. My lab projects get used over multiple semesters, and the MCUXpresso projects by default use the SDK version used at that time. This is great because I do want to have control … Continue reading →",
          "link": "https://mcuoneclipse.com/2021/04/27/upgrade-to-a-new-nxp-mcuxpresso-sdk/",
          "publishedOn": "2021-04-27T14:48:35.000Z",
          "wordCount": 5223,
          "title": "Upgrade to a new NXP MCUXpresso SDK"
        }
      ]
    },
    {
      "title": "Embedded in Academia",
      "feedUrl": "https://blog.regehr.org/feed",
      "siteUrl": "https://blog.regehr.org",
      "articles": [
        {
          "id": "https://blog.regehr.org/?p=2109",
          "author": "regehr",
          "description": "Test-case reduction is more or less a necessity when debugging failures of complex programs such as compilers. Automated test-case reduction is useful not only because it allows developers to avoid wasting time reducing inputs by hand, but also because it supports new techniques such as automatically triaging bulk failures seen in the field or during … \nContinue reading \"llvm-reduce\"",
          "link": "https://blog.regehr.org/archives/2109",
          "publishedOn": "2021-05-13T16:58:00.000Z",
          "wordCount": 768,
          "title": "llvm-reduce"
        }
      ]
    },
    {
      "title": "Embedded.com",
      "feedUrl": "https://www.embedded.com/feed/",
      "siteUrl": "https://www.embedded.com",
      "articles": [
        {
          "id": "https://www.embedded.com/?p=4469963",
          "author": "Nitin Dahad",
          "description": "Community chip creation platform Efabless has launched chipIgnite, a program enabling low-cost fabrication of initial prototypes of intellectual property (IP) blocks or full systems on...\nThe post Efabless chipIgnite enables SoC for $9,750 in Skywater CMOS node appeared first on Embedded.com.",
          "link": "https://www.embedded.com/efabless-chipignite-enables-soc-for-9750-in-skywater-cmos-node/",
          "publishedOn": "2021-05-21T17:31:37.000Z",
          "wordCount": 1693,
          "title": "Efabless chipIgnite enables SoC for $9,750 in Skywater CMOS node"
        },
        {
          "id": "https://www.embedded.com/?p=4469947",
          "author": "Mark Hermeling",
          "description": "URGENT/11 and other recent vulnerabilities such as AMNESIA:33 related to embedded TCP/IP stacks indicate a deficiency in vetting and auditing software supply chains. The blame...\nThe post TCP/IP stacks vulnerabilities are a wake-up call for embedded software appeared first on Embedded.com.",
          "link": "https://www.embedded.com/tcp-ip-stacks-vulnerabilities-are-a-wake-up-call-for-embedded-software/",
          "publishedOn": "2021-05-19T12:08:24.000Z",
          "wordCount": 2148,
          "title": "TCP/IP stacks vulnerabilities are a wake-up call for embedded software"
        },
        {
          "id": "https://www.embedded.com/?p=4469918",
          "author": "Jason Clarke",
          "description": "Smartphones have created an interesting challenge for internet of things (IoT) development teams as consumers, industrial workers, medical professionals, and more desire a sophisticated mobile...\nThe post How to build better UX for IoT devices appeared first on Embedded.com.",
          "link": "https://www.embedded.com/how-to-build-better-ux-for-iot-devices/",
          "publishedOn": "2021-05-17T17:30:59.000Z",
          "wordCount": 1892,
          "title": "How to build better UX for IoT devices"
        },
        {
          "id": "https://www.embedded.com/?p=4469926",
          "author": "Jim Ledin",
          "description": "Editor’s Note: As advanced algorithms continue to emerge for smart product designs, developers often find themselves struggling to implement embedded systems able to meet the...\nThe post Embedded design with FPGAs: Building a project appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-design-with-fpgas-building-a-project/",
          "publishedOn": "2021-05-17T16:45:00.000Z",
          "wordCount": 3058,
          "title": "Embedded design with FPGAs: Building a project"
        },
        {
          "id": "https://www.embedded.com/?p=4469843",
          "author": "Luca Martini",
          "description": "Thanks to development of efficient power conversion technology based on wide band gap semiconductors, precision dc energy metering is becoming relevant, especially where energy billing...\nThe post Addressing design challenges in precision DC energy metering appeared first on Embedded.com.",
          "link": "https://www.embedded.com/addressing-design-challenges-in-precision-dc-energy-metering/",
          "publishedOn": "2021-05-17T13:02:00.000Z",
          "wordCount": 3520,
          "title": "Addressing design challenges in precision DC energy metering"
        },
        {
          "id": "https://www.embedded.com/?p=4469915",
          "author": "Nitin Dahad",
          "description": "Siemens Digital Industries Software has been busy adding to its IC verification portfolio, with the acquisition of Fractal Technologies and OneSpin Solutions. The integration of...\nThe post Siemens IC verification adds Fractal Technologies and OneSpin Solutions appeared first on Embedded.com.",
          "link": "https://www.embedded.com/siemens-ic-verification-adds-fractal-technologies-and-onespin-solutions/",
          "publishedOn": "2021-05-13T13:11:21.000Z",
          "wordCount": 1623,
          "title": "Siemens IC verification adds Fractal Technologies and OneSpin Solutions"
        },
        {
          "id": "https://www.embedded.com/?p=4469907",
          "author": "Nitin Dahad",
          "description": "The benefits of adding vision to everyday products have attracted the attention of many industries and sectors. But how do you actually get data from...\nThe post Tools Move up the Value Chain to Take the Mystery Out of Vision AI appeared first on Embedded.com.",
          "link": "https://www.embedded.com/tools-move-up-the-value-chain-to-take-the-mystery-out-of-vision-ai/",
          "publishedOn": "2021-05-12T19:25:20.000Z",
          "wordCount": 3229,
          "title": "Tools Move up the Value Chain to Take the Mystery Out of Vision AI"
        },
        {
          "id": "https://www.embedded.com/?p=4469895",
          "author": "Phillip Lessner",
          "description": "The idea of the internet of things (IoT) has moved rapidly from being marketing hype to market reality, as the concept has been implemented in...\nThe post Will a lack of standardization slow IoT development? appeared first on Embedded.com.",
          "link": "https://www.embedded.com/will-a-lack-of-standardization-slow-iot-development/",
          "publishedOn": "2021-05-10T14:43:22.000Z",
          "wordCount": 2469,
          "title": "Will a lack of standardization slow IoT development?"
        },
        {
          "id": "https://www.embedded.com/?p=4469934",
          "author": "Maurizio Di Paolo Emilio",
          "description": "The Food and Agriculture Organization of the United Nations predicts that the world population will grow by more than 30% by 2050, reaching some 9...\nThe post Hyperspectral imaging aids precision farming appeared first on Embedded.com.",
          "link": "https://www.embedded.com/hyperspectral-imaging-aids-precision-farming/",
          "publishedOn": "2021-05-10T14:03:00.000Z",
          "wordCount": 3066,
          "title": "Hyperspectral imaging aids precision farming"
        },
        {
          "id": "https://www.embedded.com/?p=4469929",
          "author": "Egil Juliussen",
          "description": "Teleoperation for autonomous vehicles (AVs) is growing in importance. This column will explore the AV teleoperation segment and will give you information, perspectives and opinions...\nThe post Teleoperation guides AV software platform trends appeared first on Embedded.com.",
          "link": "https://www.embedded.com/teleoperation-guides-av-software-platform-trends/",
          "publishedOn": "2021-05-10T13:42:00.000Z",
          "wordCount": 3401,
          "title": "Teleoperation guides AV software platform trends"
        },
        {
          "id": "https://www.embedded.com/?p=4469953",
          "author": "Maurizio Di Paolo Emilio",
          "description": "During PCIM, Power Integrations presented an embedded “C” code application, library and control GUI that enables designers using the company’s BridgeSwitch brushless DC (BLDC) motor...\nThe post Software eases BLDC motor driver design appeared first on Embedded.com.",
          "link": "https://www.embedded.com/software-eases-bldc-motor-driver-design/",
          "publishedOn": "2021-05-10T11:09:00.000Z",
          "wordCount": 1911,
          "title": "Software eases BLDC motor driver design"
        },
        {
          "id": "https://www.embedded.com/?p=4469938",
          "author": "Victor Wollesen and Eldrich Rebello",
          "description": "A software-defined radio (SDR) uses a general-purpose computer processor to perform aspects of digital signal processing in place of analog circuit hardware. This allows for...\nThe post How software-defined radios handle ultra-wide frequency tuning appeared first on Embedded.com.",
          "link": "https://www.embedded.com/how-software-defined-radios-handle-ultra-wide-frequency-tuning/",
          "publishedOn": "2021-05-09T14:22:00.000Z",
          "wordCount": 3273,
          "title": "How software-defined radios handle ultra-wide frequency tuning"
        },
        {
          "id": "https://www.embedded.com/?p=4469882",
          "author": "Remi Lorrain",
          "description": "With an estimated 75 billion IoT devices predicted to be online by 2025, Statista predicts that a good portion will be in areas that lack...\nThe post Satellite connectivity bridges gap to underserved IoT markets appeared first on Embedded.com.",
          "link": "https://www.embedded.com/satellite-connectivity-bridges-gap-to-underserved-iot-markets/",
          "publishedOn": "2021-05-07T12:37:44.000Z",
          "wordCount": 1922,
          "title": "Satellite connectivity bridges gap to underserved IoT markets"
        },
        {
          "id": "https://www.embedded.com/?p=4469874",
          "author": "Jim Ledin",
          "description": "Editor’s Note: As advanced algorithms continue to emerge for smart product designs, developers often find themselves struggling to implement embedded systems able to meet the...\nThe post Embedded design with FPGAs: Development process appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-design-with-fpgas-development-process/",
          "publishedOn": "2021-05-06T16:14:02.000Z",
          "wordCount": 3317,
          "title": "Embedded design with FPGAs: Development process"
        },
        {
          "id": "https://www.embedded.com/?p=4469871",
          "author": "Nitin Dahad",
          "description": "Samsung Electronics has announced availability of its newest integrated 2.5D packaging solution, Interposer-Cube4 (I-Cube4), incorporating four high bandwidth memory (HBM) dies and one logic die...\nThe post Samsung I-Cube4 puts 4 HBMs & logic die on paper-thin silicon interposer appeared first on Embedded.com.",
          "link": "https://www.embedded.com/samsung-i-cube4-puts-4-hbms-logic-die-on-paper-thin-silicon-interposer/",
          "publishedOn": "2021-05-06T12:38:01.000Z",
          "wordCount": 1511,
          "title": "Samsung I-Cube4 puts 4 HBMs & logic die on paper-thin silicon interposer"
        },
        {
          "id": "https://www.embedded.com/?p=4469861",
          "author": "James Imber, Tim Atherton",
          "description": "While the RISC (reduced instruction set computer) design philosophy has changed the face of computing forever, in this article we present a new take on...\nThe post Reduced operation set computing (ROSC) for NNA functional coverage appeared first on Embedded.com.",
          "link": "https://www.embedded.com/reduced-operation-set-computing-rosc-for-nna-functional-coverage/",
          "publishedOn": "2021-05-06T09:44:02.000Z",
          "wordCount": 2439,
          "title": "Reduced operation set computing (ROSC) for NNA functional coverage"
        },
        {
          "id": "https://www.embedded.com/?p=4469898",
          "author": "Ann R. Thryft",
          "description": "Cyberattacks on U.S. industrial control systems (ICS), targeting critical infrastructure and especially utilities, were already growing, but have accelerated with the Covid-19 pandemic. The proportion...\nThe post Zero-trust security counters multiple cyberthreats appeared first on Embedded.com.",
          "link": "https://www.embedded.com/zero-trust-security-counters-multiple-cyberthreats/",
          "publishedOn": "2021-05-05T14:41:00.000Z",
          "wordCount": 2286,
          "title": "Zero-trust security counters multiple cyberthreats"
        },
        {
          "id": "https://www.embedded.com/?p=4469888",
          "author": "Jeff Bier",
          "description": "Presented as a virtual event, the Embedded Vision Summit will examine the latest developments in practical computer vision and edge AI processing. In my role...\nThe post Embedded vision thrives on enhanced processing, greater accessibility appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-vision-thrives-on-enhanced-processing-greater-accessibility/",
          "publishedOn": "2021-05-05T14:06:00.000Z",
          "wordCount": 1793,
          "title": "Embedded vision thrives on enhanced processing, greater accessibility"
        },
        {
          "id": "https://www.embedded.com/?p=4469840",
          "author": "Luca Martini",
          "description": "Driven by the development of efficient power conversion technology based on wide band gap semiconductors, many applications now see benefits in switching to dc energy...\nThe post The growing need for precision DC energy metering appeared first on Embedded.com.",
          "link": "https://www.embedded.com/the-growing-need-for-precision-dc-energy-metering/",
          "publishedOn": "2021-05-03T14:38:08.000Z",
          "wordCount": 2597,
          "title": "The growing need for precision DC energy metering"
        }
      ]
    },
    {
      "title": "SEGGER Microcontroller RSS Feed",
      "feedUrl": "https://www.segger.com/rss.xml",
      "siteUrl": "https://www.segger.com/",
      "articles": [
        {
          "id": "https://www.segger.com/news/segger-introduces-flasher-pro-xl-the-almost-anything-programmer-with-extra-large-memory/",
          "author": null,
          "description": "With 2 gigabytes of storage, the  is designed to program large images and/or hold multiple images for use during the production programming process. These can be systems running on Android, Linux, Windows IoT, or other large operating systems, as well as deeply embedded systems that require a lot of data to be programmed. Where necessary, memory can be extended further using an industrial-grade microSD card to cover even the largest of systems.Flasher PRO XL\n“Consumers have come to expect appliances, indust…",
          "link": "https://www.segger.com/news/segger-introduces-flasher-pro-xl-the-almost-anything-programmer-with-extra-large-memory/",
          "publishedOn": "2021-05-14T09:56:00.000Z",
          "wordCount": 496,
          "title": "SEGGER Introduces Flasher PRO XL—The Almost-Anything-Programmer with Extra-Large Memory"
        },
        {
          "id": "https://www.segger.com/news/microchip-licenses-seggers-emfloat-floating-point-library-for-the-xc32-v40-compiler-toolchain/",
          "author": null,
          "description": "is a complete, fully optimized and verified floating-point library for embedded systems. The arithmetic routines are hand-coded in assembly language and optimized for small code size and increased execution speed.emFloat\n“We found that emFloat provides our clients with the best floating point package available in terms of code speed and size. We are pleased to announce that it will be included with the next release of our MPLAB XC32++ compilers,” says Rodger Richey, Senior Director of Global Development Sys…",
          "link": "https://www.segger.com/news/microchip-licenses-seggers-emfloat-floating-point-library-for-the-xc32-v40-compiler-toolchain/",
          "publishedOn": "2021-04-28T08:19:00.000Z",
          "wordCount": 462,
          "title": "Microchip Licenses SEGGER’s emFloat Floating-Point Library for the XC32 V4.0 Compiler Toolchain"
        }
      ]
    },
    {
      "title": "research!rsc",
      "feedUrl": "https://research.swtch.com/feed.atom",
      "siteUrl": "http://research.swtch.com/feed.atom",
      "articles": []
    },
    {
      "title": "null program",
      "feedUrl": "https://nullprogram.com/feed/",
      "siteUrl": "https://nullprogram.com",
      "articles": [
        {
          "id": "https://nullprogram.com/blog/2021/04/23/",
          "author": null,
          "description": "It’s been about a decade since I last worked in Java and much has changed.\nI thought I’d brush up by re-reading Effective Java by Joshua Bloch\nwhich has since received a new edition. It was once my guiding star for\nJava. However, after an additional decade of experience in a variety of\nlanguages and platforms, this book frequently made me shake my head. I\nstrongly disagreed with 20% of its items. One conflicting\ntopic was enumerations, particularly item 36: “Use EnumSet instead of bit\nfields.”\nThis is not t…",
          "link": "https://nullprogram.com/blog/2021/04/23/",
          "publishedOn": "2021-04-23T21:20:53.000Z",
          "wordCount": 1259,
          "title": "The cost of Java's EnumSet"
        }
      ]
    },
    {
      "title": "Interrupt",
      "feedUrl": "https://interrupt.memfault.com/blog/feed.xml",
      "siteUrl": "https://interrupt.memfault.com/blog/",
      "articles": [
        {
          "id": "https://interrupt.memfault.com/blog/static-analysis-with-codechecker",
          "author": null,
          "description": "In this post, I go over how to set up CodeChecker on a\nfirmware project to reap the benefits of static analysis. I’ll also cover ways\nto deal with false positives, and configure your assert functions to be\nanalysis-friendly.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/static-analysis-with-codechecker",
          "publishedOn": "2021-05-19T00:00:00.000Z",
          "wordCount": 2439,
          "title": "Firmware Static Analysis with CodeChecker"
        },
        {
          "id": "https://interrupt.memfault.com/blog/opaque-pointers",
          "author": null,
          "description": "Objects are not a native concept in C, but you can achieve something\nresembling objects by using a design pattern known as the “opaque pointer”.\nThis post will show you what the pattern is, explain some of the finer\ndetails, and provide guidance on when you should and shouldn’t use it.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/opaque-pointers",
          "publishedOn": "2021-05-11T00:00:00.000Z",
          "wordCount": 1862,
          "title": "Practical Design Patterns: Opaque Pointers and Objects in C"
        },
        {
          "id": "https://interrupt.memfault.com/blog/april-2021-roundup",
          "author": null,
          "description": "Here are the articles, videos, and tools that we’ve been excited about this\nApril.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/april-2021-roundup",
          "publishedOn": "2021-05-04T00:00:00.000Z",
          "wordCount": 1394,
          "title": "What we've been reading in April"
        }
      ]
    },
    {
      "title": "Bartek's coding blog",
      "feedUrl": "https://www.bfilipek.com/feeds/posts/default",
      "siteUrl": "https://www.bfilipek.com/",
      "articles": []
    },
    {
      "title": "zserge's blog",
      "feedUrl": "https://zserge.com/rss.xml",
      "siteUrl": "https://zserge.com/",
      "articles": [
        {
          "id": "https://zserge.com/posts/one-time-passwords/",
          "author": null,
          "description": "One-time passwords (OTP) are short sequences of numbers that authenticate user for a single login. They are often used as an additional layer of security when the 2-factor authorisation is enabled.\nA picture is worth a thousand words, here’s what I’m talking about:\nHow are these numbers generated and can we reproduce them?\nImport the secret Let’s take Google’s 2-factor authorization as an example. It all starts with telling the authenticator app the secret key from your account.",
          "link": "https://zserge.com/posts/one-time-passwords/",
          "publishedOn": "2021-04-28T00:00:00.000Z",
          "wordCount": 825,
          "title": "How do One-Time passwords work?"
        },
        {
          "id": "https://zserge.com/posts/small-web/",
          "author": null,
          "description": "The Small Web. “Smol Internet” or even “The Dork Web”. Many names for the modern phenomena of people getting away from the Big Internet of corporate gatekeepers, where data is money and users don’t own any of it anymore.\nThe Small Web is a reboot of the Internet as we know it. No, it’s not going to replace the Big Internet, but rather to create a niche for enthusiasts where people can freely express themselves, the tech stack is simple and transparent, where publishers have all the freedoms and consumers ha…",
          "link": "https://zserge.com/posts/small-web/",
          "publishedOn": "2021-04-27T00:00:00.000Z",
          "wordCount": 1632,
          "title": "Poor Man's Web"
        }
      ]
    },
    {
      "title": "The acme of foolishness",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "Krister Walfridsson’s blog",
      "feedUrl": "http://feeds.feedburner.com/KristerWalfridssonsBlog",
      "siteUrl": "https://kristerw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Embedded Artistry",
      "feedUrl": "https://embeddedartistry.com/feed/",
      "siteUrl": "https://embeddedartistry.com",
      "articles": [
        {
          "id": "https://embeddedartistry.com/?p=13699",
          "author": "Phillip Johnston",
          "description": "17 May 2021 by Phillip Johnston\nThe post Fighting Feelings of Overwhelm with an Attitude Shift appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2021/05/17/fighting-feelings-of-overwhelm-with-an-attitude-shift/",
          "publishedOn": "2021-05-17T17:00:00.000Z",
          "wordCount": 1111,
          "title": "Fighting Feelings of Overwhelm with an Attitude Shift"
        },
        {
          "id": "https://embeddedartistry.com/?p=13645",
          "author": "Phillip Johnston",
          "description": "10 May 2021 by Phillip Johnston\nThe post Multiplying my Effectiveness with Mise En Place appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2021/05/10/multiplying-my-effectiveness-with-mise-en-place/",
          "publishedOn": "2021-05-10T17:00:00.000Z",
          "wordCount": 2374,
          "title": "Multiplying my Effectiveness with Mise En Place"
        },
        {
          "id": "https://embeddedartistry.com/?p=13543",
          "author": "Phillip Johnston",
          "description": "3 May 2021 by Phillip Johnston • Last updated 7 May 2021\nThe post A Software Development Idea Inspired by Mushroom Cultivation appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2021/05/03/a-software-development-idea-inspired-by-mushroom-cultivation/",
          "publishedOn": "2021-05-03T17:00:00.000Z",
          "wordCount": 2486,
          "title": "A Software Development Idea Inspired by Mushroom Cultivation"
        },
        {
          "id": "https://embeddedartistry.com/?p=13475",
          "author": "Phillip Johnston",
          "description": "26 April 2021 by Phillip Johnston Our field is full of companies and individuals who are quick to look down on anyone who doesn’t have any programming/embedded side projects, some even going so far as to consider it a hiring “red flag”. Even with 11 years of professional experience, maintaining open source projects, and running … \nContinue reading \"Why Professional Programmers Shouldn’t Have Programming Side Projects\"\nThe post Why Professional Programmers Shouldn’t Have Programming Side Projects appeared fi…",
          "link": "https://embeddedartistry.com/blog/2021/04/26/why-professional-programmers-shouldnt-have-programming-side-projects/",
          "publishedOn": "2021-04-26T17:00:00.000Z",
          "wordCount": 1421,
          "title": "Why Professional Programmers Shouldn’t Have Programming Side Projects"
        }
      ]
    },
    {
      "title": "from www.viva64.com",
      "feedUrl": "http://feeds.feedburner.com/viva64-blog-en",
      "siteUrl": "https://pvs-studio.com",
      "articles": [
        {
          "id": "https://pvs-studio.com/en/blog/posts/0827/",
          "author": null,
          "description": "PVS-Studio user support often receives clients' suggestions on product improvement. We are happy to implement many of them. Recently one of the users suggested refining the automatic notification utility for developers (Blame Notifier). They asked us to make Blame Notifier extract the date/the code revision to which the analyzer issued a message using blame information from the version control system. This feature allowed us to expand the utility capabilities, which we'll discuss in this article.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/K9JFgPgbot4/",
          "publishedOn": "2021-05-17T21:00:00.000Z",
          "wordCount": 2666,
          "title": "PVS-Studio New Features for Notifying Developers About Errors Found"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0826/",
          "author": null,
          "description": "\"How much longer are you going to build it?\" - a phrase that every developer has uttered at least once in the middle of the night. Yes, a build can be long and there is no escaping it. One does not simply redistribute the whole thing among 100+ cores, instead of some pathetic 8-12 ones. Or is it possible?",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/Qs_NPObuNBk/",
          "publishedOn": "2021-05-16T21:00:00.000Z",
          "wordCount": 3175,
          "title": "How to speed up building ang analyzing of your project with IncrediBuild?"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0825/",
          "author": null,
          "description": "Episode 267 of CppCast was recorded on September 30th, 2020. Hosts Rob Irving and Jason Turner talked to Emery Berger, a Professor in the College of Information and Computer Science at the University of Massachusetts Amherst. They discussed New C++ features in GCC 10 and Pattern Matching from September C++ ISO Mailing. They talked about performance issues in C++ and garbage collectors' usage. They also chat about DieHard, an error-resistant memory allocator; Stabilizer, a compiler transformation and runtime…",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/JW--0ZoJ9hg/",
          "publishedOn": "2021-05-10T21:00:00.000Z",
          "wordCount": 7208,
          "title": "Text Broadcast of CppCast 267: Performance Matters"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0824/",
          "author": null,
          "description": "Somehow, it so happens that we write about our diagnostics, but barely touch upon the subject of how we enhance the analyzer's internal mechanics. So, for a change, today we'll talk about a new useful upgrade for our data flow analysis.",
          "link": "http://feedproxy.google.com/~r/viva64-blog-en/~3/C8bDOUmLtds/",
          "publishedOn": "2021-04-26T21:00:00.000Z",
          "wordCount": 2266,
          "title": "PVS-Studio Learns What strlen is All About"
        }
      ]
    },
    {
      "title": "Siemens Blogs",
      "feedUrl": "https://blogs.sw.siemens.com/feed/",
      "siteUrl": "https://blogs.sw.siemens.com",
      "articles": []
    },
    {
      "title": "Novel Bits",
      "feedUrl": "https://www.novelbits.io/feed",
      "siteUrl": "https://www.novelbits.io",
      "articles": []
    },
    {
      "title": "/* the devil is in the detail */",
      "feedUrl": "https://minjang.github.io/feed.xml",
      "siteUrl": "http://minjang.github.io/",
      "articles": []
    },
    {
      "title": "mingrammer's note",
      "feedUrl": "https://mingrammer.com/index.xml",
      "siteUrl": "https://mingrammer.com/",
      "articles": []
    },
    {
      "title": "Arm Community",
      "feedUrl": "https://community.arm.com/developer/ip-products/system/b/mainfeed",
      "siteUrl": "https://community.arm.com/developer/ip-products/system/b",
      "articles": []
    },
    {
      "title": "The Clean Code Blog",
      "feedUrl": "https://blog.cleancoder.com/atom.xml",
      "siteUrl": "http://blog.cleancoder.com/atom.xml",
      "articles": []
    },
    {
      "title": "Vivonomicon's Blog",
      "feedUrl": "https://vivonomicon.com/feed/",
      "siteUrl": "https://vivonomicon.com",
      "articles": []
    },
    {
      "title": "Beningo Embedded Group",
      "feedUrl": "https://www.beningo.com/feed/",
      "siteUrl": "https://www.beningo.com",
      "articles": []
    },
    {
      "title": "The ESP Journal - Medium",
      "feedUrl": "https://medium.com/feed/the-esp-journal",
      "siteUrl": "https://medium.com/the-esp-journal?source=rss----d5414d5dee73---4",
      "articles": [
        {
          "id": "https://medium.com/p/c203e4859326",
          "author": "ESP BOT",
          "description": "Hi everyone,",
          "link": "https://medium.com/the-esp-journal/apr-2021-c203e4859326?source=rss----d5414d5dee73---4",
          "publishedOn": "2021-05-01T16:18:45.000Z",
          "wordCount": 851,
          "title": "Apr 2021"
        },
        {
          "id": "https://medium.com/p/10f2e65f055e",
          "author": "Amey Inamdar",
          "description": "Espressif launched ESP32-C3 at the end of 2020. It’s very well received and now it’s already in the mass production state. ESP32-C3…",
          "link": "https://medium.com/the-esp-journal/memory-availability-comparison-between-esp32-and-esp32-c3-10f2e65f055e?source=rss----d5414d5dee73---4",
          "publishedOn": "2021-04-26T04:45:31.000Z",
          "wordCount": 1115,
          "title": "Memory Availability Comparison between ESP32 and ESP32-C3"
        }
      ]
    },
    {
      "title": "Eli Bendersky's website",
      "feedUrl": "https://eli.thegreenplace.net/feeds/all.atom.xml",
      "siteUrl": "https://eli.thegreenplace.net/",
      "articles": [
        {
          "id": "https://eli.thegreenplace.net/2021/rest-servers-in-go-part-6-authentication/",
          "author": null,
          "description": "This is the sixth post in a series about writing REST servers in Go. Here is\na list of posts in the series:\nPart 1 - standard library\nPart 2 - using a router package\nPart 3 - using a web framework\nPart 4 - using OpenAPI and Swagger\nPart 5 - middleware\nPart 6 - authentication (this post)\nIn this part we're going to be talking about authentication and security in\ngeneral. In previous parts, if our task server was deployed publicly, its full\nAPI would have been accessible to anyone with an internet connection.…",
          "link": "https://eli.thegreenplace.net/2021/rest-servers-in-go-part-6-authentication/",
          "publishedOn": "2021-05-14T03:26:00.000Z",
          "wordCount": 2452,
          "title": "REST Servers in Go: Part 6 - authentication"
        },
        {
          "id": "https://eli.thegreenplace.net/2021/go-socket-servers-with-tls/",
          "author": null,
          "description": "TLS (previously known as SSL) is best known for enabling HTTPS, a secure version\nof HTTP. However, as TLS's name (Transport Layer Security) suggests, it\nactually goes deeper than HTTP. TLS is best thought of as a secure version of\nTCP; in other words, it provides an ability to encrypt and sign arbitrary\ncommunications going over sockets [1]. For example, protocols like gRPC build\non top of TLS for security.\nIn an earlier post we've seen how\nto use TLS to set up HTTPS servers and clients in Go. Here, I want …",
          "link": "https://eli.thegreenplace.net/2021/go-socket-servers-with-tls/",
          "publishedOn": "2021-04-24T13:21:00.000Z",
          "wordCount": 928,
          "title": "Go socket servers with TLS"
        }
      ]
    },
    {
      "title": "Sticky Bits – Powered by Feabhas",
      "feedUrl": "https://blog.feabhas.com/feed/",
      "siteUrl": "https://blog.feabhas.com",
      "articles": [
        {
          "id": "https://blog.feabhas.com/2021/05/modern-embedded-c-deprecation-of-volatile/",
          "author": null,
          "description": "Compiling the following, straightforward code: volatile int x; int main() {   x += 10; } https://godbolt.org/z/jq83vdvj5 Using g++ with the directive -std=c++17 builds without any warnings or errors. However, change the directive to -std=c++20, and the result is: source>: In function 'int main()': :5:5: warning: compound assignment with 'volatile'-qualified left operand is deprecated [-Wvolatile]   5 |  x += 10;    |  ~~^~~~~ Compiler returned: 0 The new C++ standard, C++20, has deprecated volatile! So, what [...]",
          "link": "https://blog.feabhas.com/2021/05/modern-embedded-c-deprecation-of-volatile/",
          "publishedOn": "2021-05-12T09:46:39.000Z",
          "wordCount": 1303,
          "title": "Modern Embedded C++ &#8211; Deprecation of volatile"
        }
      ]
    },
    {
      "title": "Lucky Resistor",
      "feedUrl": "https://luckyresistor.me/feed/",
      "siteUrl": "https://luckyresistor.me",
      "articles": [
        {
          "id": "https://luckyresistor.me/?p=10499",
          "author": "Lucky Resistor",
          "description": "Assume, while digging out an ancient site from 450 AD, you found a mysterious stone with a digital display. Your analysis finds five inputs for five segments (a–e) and six outputs (1–6). It seems to be a classic multiplexed display. What is this display for? What is the highest continuous sequence of numbers it can...",
          "link": "https://luckyresistor.me/2021/05/04/logic-gates-puzzle-100/",
          "publishedOn": "2021-05-04T18:00:00.000Z",
          "wordCount": 837,
          "title": "Logic Gates Puzzle 100"
        },
        {
          "id": "https://luckyresistor.me/?p=10465",
          "author": "Lucky Resistor",
          "description": "The shown logic circuit performs a well known function; can you discover what it is? The circuit was not optimised for functionality, but to create a symmetric artwork. If you need to know the meaning of the used logic gate symbols, have a look at this Wikipedia page. Also, there are great videos from Ben...",
          "link": "https://luckyresistor.me/2021/05/03/logic-gates-puzzle-11/",
          "publishedOn": "2021-05-03T12:02:06.000Z",
          "wordCount": 1176,
          "title": "Logic Gates Puzzle 11"
        },
        {
          "id": "https://luckyresistor.me/?p=10433",
          "author": "Lucky Resistor",
          "description": "The shown logic circuit performs a handy function; can you discover what it is? The circuit was not optimised for functionality, but to create a nice artwork and interesting puzzle. If you need to know the meaning of the used logic gate symbols, have a look at this Wikipedia page. Also, there are great videos...",
          "link": "https://luckyresistor.me/2021/05/01/logic-gates-puzzle-10/",
          "publishedOn": "2021-05-01T11:04:46.000Z",
          "wordCount": 944,
          "title": "Logic Gates Puzzle 10"
        },
        {
          "id": "https://luckyresistor.me/?p=10392",
          "author": "Lucky Resistor",
          "description": "What kind of logic circuit do you see here? This logic circuit was optimised for symmetry and art. Can you see which function is implemented in this circuit? You find more about logic gates and how they work on this Wikipedia page. Check the hints below, if you get stuck. Additional Challenges The logic circuit...",
          "link": "https://luckyresistor.me/2021/04/29/logic-gates-puzzle-1/",
          "publishedOn": "2021-04-29T10:12:19.000Z",
          "wordCount": 1111,
          "title": "Logic Gates Puzzle 1"
        },
        {
          "id": "https://luckyresistor.me/?p=10355",
          "author": "Lucky Resistor",
          "description": "Older people often have troubles opening plastic bottles. Also, people with gout or other disabilities lack the required strength to turn the small caps independently. The reason is the small diameter of the caps, which requires a strong grip with just two fingers. There exist a variety of helper tools, assisting this task by increasing...",
          "link": "https://luckyresistor.me/2021/04/25/bottle-opener-for-elderly-people-or-with-disabilities/",
          "publishedOn": "2021-04-25T07:30:21.000Z",
          "wordCount": 921,
          "title": "Bottle Opener for Elderly People or with Disabilities"
        }
      ]
    },
    {
      "title": "Alex Edwards",
      "feedUrl": "https://www.alexedwards.net/static/feed.rss",
      "siteUrl": "https://www.alexedwards.net/blog",
      "articles": []
    },
    {
      "title": "News & Blog – IoT Security Foundation",
      "feedUrl": "https://www.iotsecurityfoundation.org/blog/feed",
      "siteUrl": "https://www.iotsecurityfoundation.org",
      "articles": []
    },
    {
      "title": "economic view",
      "feedUrl": "http://feeds.feedburner.com/Economic_View",
      "siteUrl": "http://economicview.net",
      "articles": []
    },
    {
      "title": "WALLFLOWER",
      "feedUrl": "http://rss.egloos.com/blog/wallflower",
      "siteUrl": "http://wallflower.egloos.com",
      "articles": []
    },
    {
      "title": "내 마음의 풍경",
      "feedUrl": "http://sellars.blog.me/rss",
      "siteUrl": "http://blog.naver.com/sellars",
      "articles": [
        {
          "id": "http://blog.naver.com/sellars/222361806543",
          "author": "",
          "description": "이기론, 혹은 리기론이 진짜 중요한 철학적 의미를 갖고 있는 것인가? 개인적으로 나는 리기론의 주장을 수용하지 않는다. <태극도설>에 있는 주장은 웅장하지만, 거의 거짓말이라고 생각한다. 그 이유는 그것을 주장하는 근거가 분명하지 않기 때문이다. 그저 골방에 앉아서 우주에 대해서 자기 주관적 생각을 표현한 것이라고 여긴다. 따라서 그에게는 매우 중요하겠지만, 나에게는 별로 중요치 않다. 리기론에 대한 몇몇 논문들은 주자, 즉 주희의 리기론에 대한 소개가 거의 전부이다. 주자의 저술로부터 리와 기에 대한 구절을 인용하면서 리가 무엇이고, 기가 무엇이며, 그들의 관계가 어떤 것인지 해설해 주고 있다. 이것도 중요하.......",
          "link": "http://blog.naver.com/sellars/222361806543",
          "publishedOn": "2021-05-22T12:47:03.000Z",
          "wordCount": 8,
          "title": "리기론, 실체, 속성"
        },
        {
          "id": "http://blog.naver.com/sellars/222360201724",
          "author": "",
          "description": "데란다의 책을 번역한 역자들이 다음처럼 말한다. 알랭 소칼이라는 시대적 사기꾼, 혹은 깡패가 등장해 지식계를 뒤집어 놓았다. 이 사악한 물리학자에 동조해서 무책임한 언사를 뱉어냈던 사람이 이 책을 읽었으면 좋겠다. 자신의 경솔함을 되돌아보고 학자로서 정직함을 진지하게 생각해 볼 기회를 가졌으면 좋겠다. 나는 소칼이 사기꾼이라고 생각하지 않는다. 그러나 깡패이기는 할 것이다. 그는 그들에게 지적 깡패이다. 소칼은 지적으로 또 학적으로 정직하지 않은 사상가들을 고발하고 혼내 주고 있다. 그들이 바로 엉터리이고 사기꾼이다. 그런데 역자들은 그렇게 생각하지 않는다. 오히려 소칼이 엉터리이며, 그에 동조하는 자가 학문적.......",
          "link": "http://blog.naver.com/sellars/222360201724",
          "publishedOn": "2021-05-21T07:32:20.000Z",
          "wordCount": 8,
          "title": "학자로서 정직함"
        },
        {
          "id": "http://blog.naver.com/sellars/222357623270",
          "author": "",
          "description": "(가) <그가 말하는 미학은 미적 예술을 잘 하도록 도와주는 미적 학문이다.> 내가 가진 그의 책은 2001년에 간행된 두 권짜리인데, 책의 앞부분을 읽어보아도 그가 <미학>을 이렇게 생각한다는 구절을 찾을 수 없었다. 이런 경우, 그의 책에서 (가)를 보여주는 구절들을 인용해 주면 좋을 것이다. <미학>이 미에 대한 학문이다. 그리고 칸트는 그러한 학문이 존재할 수 없다고 이야기한다. 칸트의 이런 주장은 이미 <순수이성비판>에 나타나 있다. 그런데 이런 칸트 주장의 정당성은 <학문>이라는 개념의 의미에 달려 있다. 칸트는 미에 대한 객관적이고 체계적이며 그 규칙과 법칙을 보여주는 학문이 불가능하다.......",
          "link": "http://blog.naver.com/sellars/222357623270",
          "publishedOn": "2021-05-19T11:48:01.000Z",
          "wordCount": 8,
          "title": "철학적 미학"
        },
        {
          "id": "http://blog.naver.com/sellars/222355057876",
          "author": "",
          "description": "<맑스주의의 외부를 통해 맑스주의를 사유하고 있다. 즉 모든 것을 설명하고 이해하게 해주었던 하나의 사상에 외부가 존재했다.> 이때 <외부>는 맑스주의와 다른 사유를 의미할 것이다. 따라서 맑스주의와 다른 사유, 혹은 다른 철학적 사유가 존재한다. 이것이 의미하는 것이 하나의 철학이나 사상이 세계의 모든 것을 설명하고 이해하게 만들어 줄 수 없다는 것이다. 나는 이 점에서 맑스주의자들이 싫어하는 포퍼의 생각이 적절하다고 여긴다. 모든 것을 설명하고 이해하게 만들어주는 철학적, 사상적 만병통치약에 조심하라. 그것은 반증이나 반박이 되지 않는 그런 신념일 것이다. <외부, 그것은 그것을 상대하는 자가 자신.......",
          "link": "http://blog.naver.com/sellars/222355057876",
          "publishedOn": "2021-05-17T13:10:52.000Z",
          "wordCount": 8,
          "title": "철학의 외부 1"
        },
        {
          "id": "http://blog.naver.com/sellars/222352866935",
          "author": "",
          "description": "니체는 연민에 대해서 매우 부정적이다. 니체는 <차라투스트라>에서 다음처럼 말한다. <위대한 사람이 비명이라도 지르면 왜소한 사람은 서둘러 달려온다. 그리고는 욕정에 어두워 혀를 입 밖으로 늘어뜨린다. 그런 것을 두고 왜소한 사람은 ‘연민’이라고 부른다. 왜소한 사람, 특히 시인이 얼마나 열심히 혀를 놀려 생을 헐뜯고 있는가. 귀를 기울여 보아라. 그러나 저 온갖 헐뜯음 속에 숨어 있는 쾌락만은 흘려듣지 마라. 생을 탄핵하는 그 같은 자들을 생은 눈 깜빡할 사이에 제압하고 만다.> ‘연민’이라고 부르고 있는 왜소한 사람들은 생을 헐뜯고 있다. 연민, 즉 불쌍하고 가련하게 여기는 것이 생을 탄핵하고, 우리 삶에.......",
          "link": "http://blog.naver.com/sellars/222352866935",
          "publishedOn": "2021-05-16T00:27:25.000Z",
          "wordCount": 8,
          "title": "니체의 연민"
        },
        {
          "id": "http://blog.naver.com/sellars/222344114016",
          "author": "",
          "description": "기어는 영미철학에서 일반적으로 이해하고 있는 비트겐슈타인의 그림과 다르게 현상학, 실존주의, 삶의 철학의 관점에서 비트겐슈타인을 이해하고자 한다. 따라서 비트겐슈타인의 철학은 칸트, 하이데거, 메를로 퐁티, 삶의 철학, 해석학 등과 아주 긴밀한 유사성을 보여준다고 주장한다. 비록 기어가 이들 여러 철학적 조류들과의 유사성을 지적하고 있고, 그런 유사성에 대해서 철학적으로 옹호하고 있지 않지만, 그 유사성에 공감하고 동의하는 것처럼 보인다. 기어는 ‘삶의 철학’이라는 표제 하에서 쇼펜하우어, 슈프랑거, 짐멜, 슈펭글러, 브라우어 등의 사유와 비트겐슈타인의 유사성을 보여주고 있다. 보헨스키의 견해에 따라 삶의 철학.......",
          "link": "http://blog.naver.com/sellars/222344114016",
          "publishedOn": "2021-05-09T12:21:32.000Z",
          "wordCount": 8,
          "title": "4 비트겐슈타인과 삶의 철학"
        },
        {
          "id": "http://blog.naver.com/sellars/222341789061",
          "author": "",
          "description": "가치론을 해체해야 한다. 왜냐하면 그것은 취향이나 선호에 지나지 않는 가치를 마치 객관적이고 보편적인 것처럼 간주하게 만들기 때문이다. 나아가 <가치의 색깔로 세상을 바라본다면, 세상이 있는 그대로 보이지 않는다.> 어떤 방식으로 가치를 해체할 수 있는가? 그 하나가 데리다의 시도이다. 데리다가 말하는 <파르마콘은 약과 독이 이원적으로 분리되지 않는 하나의 이중성과 같다는 뜻이다. 이미 불교와 도가에서 이런 파르마콘적인 사실의 이중성을 지적했다.> 어떤 하나가 약이면서 동시에 독이다. 혹은 어떤 하나가 약으로 사용될 수도 있고, 또 독으로 사용될 수도 있다. 따라서 어떤 하나가 오로지 약으로만 사용되거나.......",
          "link": "http://blog.naver.com/sellars/222341789061",
          "publishedOn": "2021-05-07T11:02:53.000Z",
          "wordCount": 8,
          "title": "포스트모더니즘과 무를 닮으려는 사유  2"
        },
        {
          "id": "http://blog.naver.com/sellars/222333652300",
          "author": "",
          "description": "<인간은 세상을 행복하게 만들기 위하여 인간이 기획한 모든 종류의 도덕적, 경제기술적 능위(能爲)의 철학이 세상과 인간을 결코 행복하게 하지 못한다는 것을 최근에야 알아차리기 시작했다. 그런 깨달음이 포스트모더니즘의 시대를 열었다.> <포스트모더니즘과 노장사상과 불교는 하버마스(Habermas)가 말한 해방적 이성의 철학을 받아들이지 않는다. 승찬대사의 말이다. “한 마음이 나지 않으면 만법에 허물이 없다. 허물이 없으면 법도 없고, 나지 않으면 마음이랄 것도 없다.(一心不生 萬法無咎. 無咎無法 不生不心)> 능위의 철학, 혹은 계몽주의의 철학은 우리를 행복하게 만들지 않는다. 오히려 <계몽의 변증법>에서.......",
          "link": "http://blog.naver.com/sellars/222333652300",
          "publishedOn": "2021-05-02T12:46:56.000Z",
          "wordCount": 8,
          "title": "포스트모더니즘과 무(無)를 닮으려는 사유 1"
        },
        {
          "id": "http://blog.naver.com/sellars/222329110557",
          "author": "",
          "description": "그가 혹은 그녀가 무엇을 주장하는가? 글의 <결론>에 잘 나타나 있다. <고도로 정밀해진 불법촬영카메라 곤충복안을 통해 관음충 군집체들은 바닥과 천장, 벽면과 틈새를 자유자재로 넘나들며 우리를 둘러싼 3차원의 일상의 시공간을 온전히 침습하는 동시에 새로이 주조해 나간다.> 관음층 군집체들, 즉 한남충들이 우리의 일상적 시공간, 즉 우리의 일상적 세계를 침습하고 그것을 주조해 나간다. 그런데 <관음층 군집체>란 무엇인가? 함께 모여 있는 한남충이라는 벌레들이다. 그것은 한남유충으로부터 시작해서 발생적인 생물학적 과정을 거쳐 한남성충으로 된 벌레들이다. 그녀는 한남유충과 한남충을, 그리고 관음충을 진.......",
          "link": "http://blog.naver.com/sellars/222329110557",
          "publishedOn": "2021-04-30T10:10:34.000Z",
          "wordCount": 8,
          "title": "한국 남자 벌레에 대한 글"
        },
        {
          "id": "http://blog.naver.com/sellars/222327730109",
          "author": "",
          "description": "김형효에 의하면, 주자학이나 토미즘은 모두 이성의 구성적(constructive) 사유를 진리로 여기고 있다. 이성은 세계에 대한 우리의 사유를 구성하거나 만들고 건설한다. 이런 구성적 사유에 대비되는 것이 ‘해체적’(deconstructive) 사유이다. 때로 구성적 사유나 해체적 사유가 모두 필요한 듯 이야기하고 있지만, 그가 강조하는 것은 해체적 사유이며, 이성이나 지성보다는 직관을 강조하고 있다. 김형효는 주자학에 나타나는 구성적 사유, 혹은 이성주의에 대해서 다음처럼 이야기한다. <진리는 경험적 사실의 개념화와 별개로 이해될 수 없다. 인간의 이성은 이 세상의 사실을 개념으로 동화시킨다. 그런 능력이 인간 마음 속에 있는 허.......",
          "link": "http://blog.naver.com/sellars/222327730109",
          "publishedOn": "2021-04-29T08:51:21.000Z",
          "wordCount": 8,
          "title": "구성적 존재론의 사유와 소유론적 진리"
        },
        {
          "id": "http://blog.naver.com/sellars/222322551151",
          "author": "",
          "description": "10. 미적 판단이 가능할 수 있는 선험적 조건의 하나가 바로 무관심성이다. 칸트는 미적 판단의 보편성과 관련해서 보편성이 가능할 수 있는 근거로서 무관심성에 대해 다음처럼 말하고 있다. 미란 개념을 떠나서 보편적 만족의 객체로서 표상되는 것이다. 미의 이러한 설명은 그것을 일체의 관심을 떠난 만족의 대상이라고 한 앞의 설명으로서 추론될 수 있다. 왜냐하면 모든 사람이 그것을 의식하고 있고, 만족이 전적으로 그에게 있어 무관심적이라는 사실은 그의 판단에서 모든 사람을 위한 만족의 근거를 함축하기 때문이다. 주체의 어떤 경향성에 그것이 의존하지 않고, 즉 판단하는 주체가 그가 대상에 부과하였던 만족에서 자유스러움을.......",
          "link": "http://blog.naver.com/sellars/222322551151",
          "publishedOn": "2021-04-25T09:14:18.000Z",
          "wordCount": 8,
          "title": "5  무관심성"
        },
        {
          "id": "http://blog.naver.com/sellars/222320615933",
          "author": "",
          "description": "프롬이 <자유로부터의 도피>에서 다음처럼 말한다. <종교적 교리나 정치적 신조의 심리적 의미를 연구할 때, 우리는 우선 심리적 분석이 우리가 분석하는 교리나 신조의 진실성에 대한 판단을 의미하지는 않는다는 점을 명심해야 한다. 이 진실성 문제는 그 문제 자체의 논리적 구조에 의해서만 결정될 수 있다. 어떤 신조나 개념 뒤에 숨어 있는 심리적 동기를 분석하는 것은 신조의 진정한 의미를 더 잘 이해하게 해줄 수 있고, 그리하여 우리의 가치 판단에 영향을 미칠 수는 있지만, 결코 그 신조의 타당성과 거기에 함축된 가치에 대한 합리적 판단을 대신할 수는 없다.> 프롬은 두 가지를 구분한다. 하나가 종교적 교리나 정치.......",
          "link": "http://blog.naver.com/sellars/222320615933",
          "publishedOn": "2021-04-23T10:32:21.000Z",
          "wordCount": 8,
          "title": "발생적 오류  2"
        }
      ]
    },
    {
      "title": "꿈꾸는섬",
      "feedUrl": "https://happist.com/feed",
      "siteUrl": "https://happist.com",
      "articles": [
        {
          "id": "https://happist.com/?p=580585",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580585/%ec%97%b0%eb%8f%84%eb%b3%84-%ea%b5%ad%eb%b0%a9%eb%b9%84-%ec%a6%9d%ea%b0%80%ec%9c%a8-gdp-%eb%8c%80%eb%b9%84-%ea%b5%ad%eb%b0%a9%eb%b9%84-%eb%b9%84%ec%a4%91",
          "publishedOn": "2021-05-22T11:11:25.000Z",
          "wordCount": 1034,
          "title": "[트렌드 차트] 연도별 국방비 증가율 및  GDP 대비 국방비 비중 추이"
        },
        {
          "id": "https://happist.com/?p=580590",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580590/%eb%b6%84%ea%b8%b0%eb%b3%84-pc-%ec%b6%9c%ed%95%98%eb%9f%89",
          "publishedOn": "2021-05-22T02:39:07.000Z",
          "wordCount": 773,
          "title": "[트렌드 차트] 분기별 PC 출하량 및 PC 점유율 추이(1Q21 업뎃)"
        },
        {
          "id": "https://happist.com/?p=580576",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580576/%eb%8f%99%eb%82%a8%ec%95%84-%ec%98%a8%eb%9d%bc%ec%9d%b8%ec%87%bc%ed%95%91-%ec%8b%9c%ec%9e%a5%ea%b7%9c%eb%aa%a8",
          "publishedOn": "2021-05-19T16:45:12.000Z",
          "wordCount": 409,
          "title": "[트렌드 차트] 동남아 온라인쇼핑 시장규모 추이 – 싱가폴, 인도네시아, 필리핀, 태국"
        },
        {
          "id": "https://happist.com/?p=580078",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580078/%ea%b5%ac%ea%b8%80-%ed%82%b5google-keep-%ec%82%ac%ec%9a%a9%eb%b2%95",
          "publishedOn": "2021-05-19T14:13:29.000Z",
          "wordCount": 872,
          "title": "윈도우 생산성 앱, 윈도우에서 구글 킵(Google keep) 사용법"
        },
        {
          "id": "https://happist.com/?p=580556",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580556/21%eb%85%84-1%eb%b6%84%ea%b8%b0-%ed%83%80%ea%b2%9f-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-05-19T13:05:40.000Z",
          "wordCount": 1233,
          "title": "매출 이익 모두 완벽했던 1분기 타겟 실적과 향후 타겟 전망"
        },
        {
          "id": "https://happist.com/?p=580545",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580545/21%eb%85%84-1%eb%b6%84%ea%b8%b0-%ed%99%88%eb%8d%b0%ed%8f%ac-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-05-19T10:40:33.000Z",
          "wordCount": 1291,
          "title": "경제가 열리는 미국을 잘 보여준 1분기 홈데포 실적과 향후 홈데포 전망"
        },
        {
          "id": "https://happist.com/?p=580529",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580529/21%eb%85%84-1%eb%b6%84%ea%b8%b0-%ec%9b%94%eb%a7%88%ed%8a%b8-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-05-19T07:54:46.000Z",
          "wordCount": 1315,
          "title": "팬데믹 이후 성장성이 의문스런 1분기 월마트 실적 및 그럼에도 오르는 월마트 주가"
        },
        {
          "id": "https://happist.com/?p=580495",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580495/%ec%84%b8%ea%b3%84-%eb%94%94%ec%a7%80%ed%83%88-%ea%b4%91%ea%b3%a0-%ec%8b%9c%ec%9e%a5-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2021-05-18T14:47:04.000Z",
          "wordCount": 996,
          "title": "팬데믹 이후 세계 광고 시장 전망, ’21년 15%로 사상 최대 성장, 디지탈 광고도 20% 성장할 것"
        },
        {
          "id": "https://happist.com/?p=580479",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580479/%ec%95%84%eb%94%94%eb%8b%a4%ec%8a%a4-%ec%98%ac%eb%b2%84%ec%a6%88-%ed%98%91%ec%97%85",
          "publishedOn": "2021-05-18T12:17:51.000Z",
          "wordCount": 1414,
          "title": "탄소중립 위한 아디다스 올버즈 협업에서 읽어보는 트렌드 변화와 시사점"
        },
        {
          "id": "https://happist.com/?p=580468",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580468/21%eb%85%84-1%eb%b6%84%ea%b8%b0-%ec%9d%b8%ed%85%8d%ed%94%8c%eb%9f%ac%ec%8a%a4-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-05-17T19:38:37.000Z",
          "wordCount": 1171,
          "title": "사상최대 수주잔고 등 비전을 보여준 1분기  인텍플러스 실적과 인텍플러스 주가"
        },
        {
          "id": "https://happist.com/?p=580453",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580453/21%eb%85%84-1%eb%b6%84%ea%b8%b0-%ed%8c%8c%ed%81%ac%ec%8b%9c%ec%8a%a4%ed%85%9c%ec%8a%a4-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2021-05-17T16:46:07.000Z",
          "wordCount": 1360,
          "title": "기대 미달 1분기 파크시스템스 실적이나 향후  기대감이 충만한 파크시스템스 전망"
        },
        {
          "id": "https://happist.com/?p=580436",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580436/%eb%84%a5%ec%8a%a4%ed%8b%b4-%ec%8b%a4%ec%a0%81-%ec%a0%84%eb%a7%9d%ea%b3%bc-%eb%84%a5%ec%8a%a4%ed%8b%b4-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2021-05-16T05:24:40.000Z",
          "wordCount": 997,
          "title": "넥스틴 실적 전망에서 읽는 향후 넥스틴 주가 전망"
        },
        {
          "id": "https://happist.com/?p=580405",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580405/jbl-%ec%97%ad%ec%82%ac",
          "publishedOn": "2021-05-15T07:44:49.000Z",
          "wordCount": 2104,
          "title": "오디오 브랜드 JBL 역사와 JBL 스피커를 이끈 5가지 키워드"
        },
        {
          "id": "https://happist.com/?p=580392",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580392/1%eb%b6%84%ea%b8%b0-%ec%bf%a0%ed%8c%a1-%ec%8b%a4%ec%a0%81%ea%b3%bc-%ec%bf%a0%ed%8c%a1-%ec%a3%bc%ea%b0%80",
          "publishedOn": "2021-05-13T19:02:58.000Z",
          "wordCount": 1119,
          "title": "적자 급증과 매출 사용자 증가 둔화로 실망스런 1분기 쿠팡 실적, 쿠팡 주가는 어디로 갈까?"
        },
        {
          "id": "https://happist.com/?p=580361",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580361/%ed%95%9c%ea%b5%ad-%ec%97%94%ed%84%b0%ed%85%8c%ec%9d%b8%eb%a8%bc%ed%8a%b8-%ea%b2%bd%ec%9f%81%eb%a0%a5",
          "publishedOn": "2021-05-12T08:05:18.000Z",
          "wordCount": 1317,
          "title": "한국 엔터테인먼트 경쟁력과 일본이 역전당한 이유 6가지"
        },
        {
          "id": "https://happist.com/?p=579798",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/579798/20%eb%85%84-1%eb%b6%84%ea%b8%b0-%eb%94%94%ec%a7%80%ed%83%88-%ea%b4%91%ea%b3%a0-%ed%8a%b8%eb%a0%8c%eb%93%9c",
          "publishedOn": "2021-05-11T13:30:23.000Z",
          "wordCount": 2807,
          "title": "1분기 실적에서 읽는 디지탈 광고 트렌드 및 디지탈 광고 전망"
        },
        {
          "id": "https://happist.com/?p=580311",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580311/ios-%ec%95%b1-%ec%b6%94%ec%a0%81-%ed%88%ac%eb%aa%85%ec%84%b1",
          "publishedOn": "2021-05-10T21:36:55.000Z",
          "wordCount": 2407,
          "title": "애플 개인 정보 보호 정책이 인터넷 생태계를 흔들다. iOS 앱 추적 투명성이 가져온 나비 효과"
        },
        {
          "id": "https://happist.com/?p=580305",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580305/%ec%a0%9c%eb%8d%94%eb%8b%a4%ec%96%91%ec%84%b1-%ea%b0%95%ec%a1%b0-%ed%98%84%eb%8c%80%ec%b0%a8-%ea%b4%91%ea%b3%a0",
          "publishedOn": "2021-05-10T11:49:26.000Z",
          "wordCount": 699,
          "title": "현대차 LGBTQ 마케팅, 젠더 다양성 강조 광고, Chosen Family, 가족은 선택할 수 있어요"
        },
        {
          "id": "https://happist.com/?p=580285",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580285/20%eb%85%84-1%eb%b6%84%ea%b8%b0-%ed%8a%b8%ec%9c%84%ed%84%b0-%ec%8b%a4%ec%a0%81%ea%b3%bc-%ed%8a%b8%ec%9c%84%ed%84%b0-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2021-05-09T14:09:42.000Z",
          "wordCount": 1295,
          "title": "매출 증가? 문제는 사용자 둔화야, 실망스런 트위터 실적과 향후 트위터 주가 전망"
        },
        {
          "id": "https://happist.com/?p=580253",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580253/%ec%8a%a4%ed%8a%9c%eb%94%94%ec%98%a4%eb%93%9c%eb%9e%98%ea%b3%a4-%ec%8b%a4%ec%a0%81%ea%b3%bc-%ec%8a%a4%ed%8a%9c%eb%94%94%ec%98%a4%eb%93%9c%eb%9e%98%ea%b3%a4-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2021-05-09T04:47:54.000Z",
          "wordCount": 1189,
          "title": "매출 감소대신 이익 개선을 택한 스튜디오드래곤 실적에서 읽는 향후 스튜디오드래곤 주가 전망"
        },
        {
          "id": "https://happist.com/?p=580225",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/580225/%ec%bd%98%ed%85%90%ec%b8%a0%eb%b3%84-%ec%95%a0%eb%93%9c%ec%84%bc%ec%8a%a4-%ec%88%98%ec%9d%b5-%eb%b6%84%ec%84%9d-%eb%b0%a9%eb%b2%95",
          "publishedOn": "2021-05-08T16:20:18.000Z",
          "wordCount": 995,
          "title": "구글 어낼리틱스로 콘텐츠별 애드센스 수익 분석 방법"
        }
      ]
    },
    {
      "title": "Big Picture",
      "feedUrl": "https://www.bostonglobe.com/rss/bigpicture",
      "siteUrl": null,
      "articles": []
    },
    {
      "title": "NewsPeppermint",
      "feedUrl": "https://newspeppermint.com/feed/",
      "siteUrl": "https://newspeppermint.com",
      "articles": [
        {
          "id": "https://newspeppermint.com/?p=72776",
          "author": "ingppoo",
          "description": "정치적인 논쟁에 휘말리는 건 무조건 피하는 게 상책이라는 통념을 거스르고도 파타고니아는 존경받는 브랜드이자 돈도 잘 버는 기업으로 확고히 자리 잡았습니다.",
          "link": "https://newspeppermint.com/2021/05/20/patagoniacorporateactivism/?utm_source=rss&utm_medium=rss&utm_campaign=patagoniacorporateactivism",
          "publishedOn": "2021-05-20T22:59:16.000Z",
          "wordCount": 2118,
          "title": "누구나 알지만 아무나 흉내낼 수 없는 파타고니아의 성공 비결"
        },
        {
          "id": "https://newspeppermint.com/?p=72784",
          "author": "veritaholic",
          "description": "(마이클 셀렌버거, environmentalprogress) 원문 보기 4. 1970년대 인구 증가율이 높아지면서 인구 폭발에 대한 두려움은 더 커졌습니다. 하지민 1972년 네이처의 편집장은 미래를 이렇게 예측했습니다. “1970, 80년대에는 기근이나 기아가 아니라 남은 음식을 어떻게 처리해야 하는지가 문제가 될 것이다.” 그는 또 공포를 조장하는 것은 “신식민주의를 옹호하는 셈이다”라 말했고, 다른 이들도 여기에 동의했습니다. 한 인구학자는 인구 폭발이 문제가 아니라 “폭발이라는 단어가 헛소리”라고 말했습니다. FAO에서 일하는 덴마크의 경제학자 에스터 보스럽은 역사적으로 인구가 증가할 때마다 사람들은 → 더 보기",
          "link": "https://newspeppermint.com/2021/05/19/m-shellenberger2/?utm_source=rss&utm_medium=rss&utm_campaign=m-shellenberger2",
          "publishedOn": "2021-05-19T22:55:27.000Z",
          "wordCount": 1313,
          "title": "피터글릭의 비판에 대한 마이클 셀렌버거의 반박(2/2)"
        },
        {
          "id": "https://newspeppermint.com/?p=72782",
          "author": "veritaholic",
          "description": "(마이클 셀렌버거, environmentalprogress) 원문 보기 피터 글릭의 비판   1. 피터 글릭은 예일기후대응모임(Yale Climate Connections)에 올린 내 책에 대한 서평에서 내가 환경주의와 기후과학을 오해하고 있다고 말합니다. 그는 내가 허수아비를 공격할 뿐 아니라, 원자력 에너지를 다른 에너지보다 옹호하고, 인신공격을 저질렀다고 썼습니다. 그러나 오해는 글릭이 내 책에 대해 하고 있습니다. 내 책은 최신 과학 연구 결과와 에너지 기술을 바탕으로 했으며, 이를 근거로 원자력을 에너지원에서 배제하지 말 것을, 그리고 원자력 기술을 옹호하는 이들을 → 더 보기",
          "link": "https://newspeppermint.com/2021/05/19/m-shellenberger1/?utm_source=rss&utm_medium=rss&utm_campaign=m-shellenberger1",
          "publishedOn": "2021-05-19T22:54:00.000Z",
          "wordCount": 1951,
          "title": "피터 글릭의 비판에 대한 마이클 셀렌버거의 반박(1/2)"
        },
        {
          "id": "https://newspeppermint.com/?p=72745",
          "author": "malecon",
          "description": "지난 4월 21일 유럽연합 집행위원회가 발표한 인공지능 규제 법안에 전 세계의 이목이 쏠렸습니다. 이번 규제안은 인공지능에 대한 광범위한 규정을 마련하는 첫 번째 시도였습니다. 과연 이 규정이 과거 유럽에서 제정해 전 세계로 퍼진 개인정보보호법처럼 널리 채택될까요? 법안의 내용, 평가, 전망에 대한 이코노미스트의 기사를 소개합니다.",
          "link": "https://newspeppermint.com/2021/05/17/the-eu-wants-to-become-the-worlds-super-regulator-in-ai/?utm_source=rss&utm_medium=rss&utm_campaign=the-eu-wants-to-become-the-worlds-super-regulator-in-ai",
          "publishedOn": "2021-05-17T22:59:28.000Z",
          "wordCount": 719,
          "title": "글로벌 인공지능 규제를 선도하려는 유럽연합"
        },
        {
          "id": "https://newspeppermint.com/?p=72764",
          "author": "ingppoo",
          "description": "이슬람력의 아홉 번째 달로 신성한 달인 라마단의 첫 번째 밤이었던 4월 13일은 공교롭게도 이스라엘의 현충일이기도 했습니다. 이날 이스라엘 경찰이 알 아크사 사원에서 강행한 작전이 7년 만에 촉발된 충돌에 적잖은 원인을 제공합니다. 뉴욕타임스가 지난 한 달간 무슨 일이 있었는지 심층 분석한 기사를 소개합니다.",
          "link": "https://newspeppermint.com/2021/05/16/israelpalestineconflict/?utm_source=rss&utm_medium=rss&utm_campaign=israelpalestineconflict",
          "publishedOn": "2021-05-17T01:30:36.000Z",
          "wordCount": 1917,
          "title": "7년간 잠잠하던 이스라엘-팔레스타인, 왜 지금 다시 충돌했나?"
        },
        {
          "id": "https://newspeppermint.com/?p=72738",
          "author": "malecon",
          "description": "전 세계의 모든 에너지를 재생에너지로 100% 대체할 수 있을까요? 가까운 미래에 재생에너지로 전환하지 않는다면 참혹한 결과가 펼쳐질 것입니다. 무분별한 탄소 배출로 지구의 상당 부분이 사람이 살 수 없는 폐허로 바뀔 수 있습니다. 물론, 이 문제의 이면에는 거시적인 갈등이 도사리고 있습니다. 일부 정치인과 대형 석유 기업은 100% 재생에너지 대체를 반대할 것입니다. 그러나 우리 대부분은 또 다른 중요한 점을 간과하는 경향이 있습니다. 기술적으로 모든 에너지를 재생에너지로 바꾸는 것이 가능하냐는 문제입니다. 기즈모도에서 전문가 패널에게 전 세계의 에너지를 100% 재생에너지로 대체할 수 있을지, 이를 위해 무엇을 해야 할지 질문을 던졌습니다. 답변을 소개합니다.",
          "link": "https://newspeppermint.com/2021/05/10/could-the-world-ever-run-entirely-on-renewable-energy/?utm_source=rss&utm_medium=rss&utm_campaign=could-the-world-ever-run-entirely-on-renewable-energy",
          "publishedOn": "2021-05-10T22:59:23.000Z",
          "wordCount": 1158,
          "title": "전 세계 모든 에너지를 재생에너지로 완전히 대체할 수 있을까요?"
        },
        {
          "id": "https://newspeppermint.com/?p=72742",
          "author": "veritaholic",
          "description": "(피터 글릭, YaleClimateConnections) 원문 보기 근거들을 취사선택하거나 오해, 남용한 고전적인 오류들도 있습니다. 셀렌버거는 자기 자신을 감정적 논증이 난무하는 분야에서 과학과 사실을 전달하는 백기사로 그리고 있습니다. “이 책의 모든 사실, 주장, 논증은 최신 과학 연구 결과에 기반해 있다… ‘지구를 위한다는 착각’은 이를 무시하는 정치적 우파와 좌파로부터 주류 과학을 보호한다.” 하지만 그의 논증에는 근거의 부적절한 사용과 이제는 유효기간이 지난 연구 결과, 자신에게 유리한 연구 결과만의 선택적 사용, 오해, 명백한 실수 등이 가득합니다. → 더 보기",
          "link": "https://newspeppermint.com/2021/05/10/m-apocalypse2/?utm_source=rss&utm_medium=rss&utm_campaign=m-apocalypse2",
          "publishedOn": "2021-05-10T22:54:44.000Z",
          "wordCount": 1557,
          "title": "피터 글릭의 “지구를 위한다는 착각(저: 마이클 셀렌버거)” 비판(2/2)"
        },
        {
          "id": "https://newspeppermint.com/?p=72741",
          "author": "veritaholic",
          "description": "(피터 글릭, YaleClimateConnections) 원문 보기 “로미오와 줄리엣”의 몬테규 집안과 캐퓰릿 집안을 생각하면 됩니다. 아니면 1863년에서 1891년 사이, 서로 원수지간이던 웨스트 버지니아와 켄터키주의 햇필드와 맥코이 가문을 생각해도 됩니다. 환경 과학, 인구 증가, 자원 부족, 생태학 분야에서 맬서스주의자와 기술만능주의자(Cornucopian) 사이의 지난 수십 년 간의 갈등이 이와 비슷합니다. 맬서스주의자들은 영국의 경제학자인 토마스 맬서스가 이야기했던, 지구 자원의 한계는 기하급수적인 인구 증가를 뒷받침하지 못할 것이며, 따라서 장기적으로 지속가능하지 않으리라는 생각에 동의하는 이들입니다. 반대로 기술만능주의자들은 그리스 → 더 보기",
          "link": "https://newspeppermint.com/2021/05/10/m-apocalypse1/?utm_source=rss&utm_medium=rss&utm_campaign=m-apocalypse1",
          "publishedOn": "2021-05-10T22:53:05.000Z",
          "wordCount": 1374,
          "title": "피터 글릭의 “지구를 위한다는 착각(저: 마이클 셀렌버거)” 비판(1/2)"
        },
        {
          "id": "https://newspeppermint.com/?p=72729",
          "author": "malecon",
          "description": "(이코노미스트) 글로벌 투자자들이 동남아시아 시장에 주목하고 있습니다. 지난해 동남아시아 인터넷 스타트업을 둘러싼 열기는 매우 뜨거웠습니다. 현지에서 성공한 토종 IT 기업들이 속속 상장 대열에 합류하고 있습니다. 2017년 뉴욕 거래소에 상장한 동남아 전자상거래 선두 기업인 Sea의 주가는 지난해 5배 급등했고, 우버를 물리친 그랩은 조만간 400억 달러(44조 원) 규모의 상장을 앞두고 있습니다. 반면, 동남아시아에 진출한 미국과 중국의 테크 기업들은 토종 기업들과 경쟁에 밀리며 고전하고 있습니다. 과연 토종 기업들의 질주가 이어지고 이 기업에 투자한 글로벌 투자자들이 대박을 터뜨릴 수 있을까요?",
          "link": "https://newspeppermint.com/2021/05/03/can-south-east-asian-techs-hot-streak-last/?utm_source=rss&utm_medium=rss&utm_campaign=can-south-east-asian-techs-hot-streak-last",
          "publishedOn": "2021-05-03T22:59:28.000Z",
          "wordCount": 835,
          "title": "동남아시아 테크 기업의 질주는 언제까지 계속될까요?"
        },
        {
          "id": "https://newspeppermint.com/?p=72711",
          "author": "ingppoo",
          "description": "영어 발음을 교정해주는 컨설턴트로 일하다가 '엉터리 영어'를 고치는 것보다 '뜻만 통하면 이해할 수 있도록 듣는 쪽에서 귀를 여는 편'이 더 낫다는 점을 깨달은 커뮤니케이션 전문가 헤더 핸슨이 NPR 팟캐스트 \"Rough Translation\"에 출연해 한 이야기를 요약했습니다.",
          "link": "https://newspeppermint.com/2021/04/29/nativespeakers/?utm_source=rss&utm_medium=rss&utm_campaign=nativespeakers",
          "publishedOn": "2021-04-29T22:59:53.000Z",
          "wordCount": 1876,
          "title": "바벨탑 허물려면 ‘콩글리시’도 괜찮은 영어 생태계 만들어야"
        },
        {
          "id": "https://newspeppermint.com/?p=72725",
          "author": "veritaholic",
          "description": "(Emily Cataneo, Undark) 원문 보기 상어나 도롱뇽, 오리너구리 등은 인간과 달리 전기장을 감지할 수 있습니다. 남아메리카의 칼고기나 아프리카의 코끼리고기는 자신의 사회적 위치나 성, 지배적 지위에 관한 정보를 전달하는 복잡한 전기장을 만들어냅니다. 우주에 이렇게 전기장을 언어처럼 사용하는 동물이 존재할 수 있을까요? 토성의 달인 엔셀라두스처럼 칠흙같은 바다를 가진 천체의 생명체는 진화를 통해 이런 특성을 가지게 되었을지 모릅니다. 캠브리지 대학의 동물학자 아릭 커셴바움은 “은하수를 여행하는 동물학자를 위한 안내서: 지구의 동물을 통해 우리가 외계인과 → 더 보기",
          "link": "https://newspeppermint.com/2021/04/28/m-astrobiology/?utm_source=rss&utm_medium=rss&utm_campaign=m-astrobiology",
          "publishedOn": "2021-04-28T22:55:43.000Z",
          "wordCount": 839,
          "title": "[책] 아릭 커셴바움의 “은하수를 여행하는 동물학자를 위한 안내서”"
        },
        {
          "id": "https://newspeppermint.com/?p=72704",
          "author": "malecon",
          "description": "(이코노미스트) 혁신적인 모빌리티 산업이 성장하면서 기존의 자동차 산업을 뒤흔들고 있습니다. 전기차와 자율주행 시스템을 앞세운 테슬라는 기존의 완성차 제조업체와 비교가 되지 않는 기업 가치를 인정받고 있습니다. 우버, 디디추싱, 리프트 등 차량호출 업체, 핀란드의 윔 등 복합 모빌리티 플랫폼은 다양한 서비스와 시장을 창출하고 있습니다. GM, 폭스바겐, 도요타 등 기존 완성차 업체들은 자동차 시장이 무엇인지부터 다시 진지하게 고민해야 하는 상황에 맞닥뜨렸습니다. 소비자의 행태와 습관의 변화, 그리고 기술의 혁신이 자동차의 판매 방식, 이용 방식, 소유 방식을 바꾸고 있습니다. 자동차와 모빌리티 혁신이 우리의 생활과 기존 산업을 어떻게 바꾸고 있을까요? 이코노미스트의 기사를 소개합니다.",
          "link": "https://newspeppermint.com/2021/04/26/new-means-of-getting-from-a-to-b-are-disrupting-carmaking/?utm_source=rss&utm_medium=rss&utm_campaign=new-means-of-getting-from-a-to-b-are-disrupting-carmaking",
          "publishedOn": "2021-04-26T22:59:00.000Z",
          "wordCount": 1301,
          "title": "모빌리티의 혁신이 자동차 제조업에 파괴적 혁신을 가져올 것입니다."
        }
      ]
    },
    {
      "title": "슬로우뉴스",
      "feedUrl": "https://feeds.feedburner.com/slownews",
      "siteUrl": "https://slownews.kr",
      "articles": [
        {
          "id": "https://slownews.kr/?p=80774",
          "author": "한승혜",
          "description": "좀 전에 KTX에서 어떤 외국인 남자랑 싸웠다. 전모는 이렇다. 열차를 탔는데, 탄 지 얼마 안 되어 어디선가 자꾸만 큰 소리가 나는 것이다. 참다못해 “누구야! 누가 공공장소에서 자꾸 큰 소리를 내는 거야!” 하면서 쳐다봤는데 내 자리 맞은편 쪽에 앉은 백인 남성이 전화 통화를 하고 있었다. 뭐 거기까진 그러려니. 문제는 남자가 마스크까지 벗고 그러고 있었다는 것이다. 너무나 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/7ZVQAajTpxk/80774",
          "publishedOn": "2021-05-21T04:28:03.000Z",
          "wordCount": 901,
          "title": "KTX 열차의 ‘사소한’ 결투"
        },
        {
          "id": "https://slownews.kr/?p=80766",
          "author": "경실련",
          "description": "누구나 살면서 갑자기 아프거나 열이 나거나 다친 경험이 있을 것이다. 더구나 아이를 키워본 분이라면, 밤에 아이가 열이 나서 발을 동동 구른 경험을 갖고 있을 것이다. 단순한 감기로 열이 나는 것을 알면서도 밤에 응급실을 가면 여러 검사에 시달리기 일쑤이고, 시간과 돈을 낭비하고 있다는 생각이 들기도 할 것이다. 찰과상 정도라면 간단한 소독만으로도 가 치료할 수 있는데 가정상비약이 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/TrXn40rgAzE/80766",
          "publishedOn": "2021-05-20T05:14:17.000Z",
          "wordCount": 1298,
          "title": "가정상비약, 무엇을 준비하고 어떻게 사용할까"
        },
        {
          "id": "https://slownews.kr/?p=80750",
          "author": "민주언론시민연합",
          "description": "문재인 정부의 ‘임기 내 산재 사망사고 절반 감축’ 공약 이행은 물 건너간 듯하다. 고용노동부가 4월 14일 발표한 ‘2020년 산업재해 사고사망 통계’를 보면 지난 한 해만 업무상 사고 재해로 882명이 사망했다. 2019년(855명)보다 27명(3.2%)이 되레 증가했다. 사망사고 81%(714명)는 주로 50인 미만 사업장에서 발생했다. 5인 미만 사업장에서 35.4%(312명), 5인 이상 29인 사업장이 45.6%(402명)로 나타났다. 노동자 1만 명당 산재사고 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/9274PcsoKzc/80750",
          "publishedOn": "2021-05-18T07:19:16.000Z",
          "wordCount": 1136,
          "title": "산재를 바라보는 두 시선: 기업범죄 vs. 달라질 거 없다"
        },
        {
          "id": "https://slownews.kr/?p=80738",
          "author": "민주언론시민연합",
          "description": "청주지방법원은 5월 13일 CJB청주방송 고 이재학 PD가 제기한 근로자지위확인소송 2심에서 이 PD 손을 들어주었습니다. 13년간 프리랜서로 고용돼 정규직보다 더 많이 일하고도 적은 임금을 받았던 이 PD가 청주방송 노동자로 인정된다는 판결입니다. 재판부는 청주방송이 이 PD가 비정규직 임금 인상을 요구한 것을 이유로 프로그램 하차 후 해고한 결정이 위법하다고 봤습니다. 따라서 청주방송에게 이 PD 해고기간 임금 6,300만 원과 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/5EiH8UDtq5U/80738",
          "publishedOn": "2021-05-17T05:09:27.000Z",
          "wordCount": 1086,
          "title": "\"제 다음 생 후배들은 비정규직 설움 못 느꼈으면\" 어느 피디의 유언"
        },
        {
          "id": "https://slownews.kr/?p=80724",
          "author": "민주언론시민연합",
          "description": "이명박 대통령 후보 캠프에서 뉴미디어 간사를 지낸 진성호 씨가 “네이버는 평정됐고 다음은 손봐야 한다”고 말했던 게 2007년 일이다. 네이버는 상대적으로 보수적인 편집을 하고 다음은 좀 더 진보적인 성향을 보인다는 평가가 많지만 지난해 9월 더불어민주당 윤영찬 의원의 “카카오 들어오라 하세요” 메시지 논란에서 보듯 서 있는 자리에 따라 풍경이 다를 수밖에 없다. 플랫폼 공정성 이슈는 여전히 뜨겁고 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/YRpyI6FussU/80724",
          "publishedOn": "2021-05-17T04:44:36.000Z",
          "wordCount": 1148,
          "title": "왜 포털에선 중앙일보가 더 많이 노출되나"
        },
        {
          "id": "https://slownews.kr/?p=80708",
          "author": "씨앗(CEART)",
          "description": "47조 5,000억 원에 ARM을 인수하면서 그래픽 카드와 CPU의 넘어선 새로운 세상을 꿈꾸고, 멜라녹스를 69억 달러에 인수하면서 데이터 처리와 관련한 명목 문제를 해결하면서 인텔 그 이상을 꿈꾸는 기업 엔비디아. 그리고 그 회사를 이끌고 있는 젠슨 황 창업자 겸 CEO. 반도체 업계에서 가장 핫한 기업 중 하나인 엔비디아가 4월 12일부터 4월 16일까지 온라인으로 개최된 GTC 2021 서 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/ZAAcR7zBfyo/80708",
          "publishedOn": "2021-05-14T04:50:15.000Z",
          "wordCount": 1743,
          "title": "엔비디아의 미래 비전 (ft. GTC 2021)"
        },
        {
          "id": "https://slownews.kr/?p=80685",
          "author": "민주언론시민연합",
          "description": "한국경제는 5월 12일 1면 머리기사로 [삼성바이오, 화이자 백신 만든다] (5월 12일 박신영 기자)를 실었습니다. 삼성바이오로직스가 화이자 백신을 위탁생산한다는 내용과 함께 8월부터 본격적인 생산이 시작된다는 보도입니다. 이어 3면에는 삼성바이오로직스의 화이자 백신 생산을 기정사실화한 채 성사 배경 등을 조명한 기사도 실었습니다. 그러나 삼성바이오로직스는 5월 12일 오전 한국경제 보도가 “사실이 아니다”라고 공시했습니다. 신문이 발행된 지 반나절도 지나지 않아 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/8lJEJIp3GNc/80685",
          "publishedOn": "2021-05-12T19:30:03.000Z",
          "wordCount": 1476,
          "title": "이재용 띄우려다 주가만 널뛰기: 한경 오보의 전말"
        },
        {
          "id": "https://slownews.kr/?p=80678",
          "author": "청년유니온",
          "description": "단지 흔한 사고여서, 이 죽음은 우리에게 그저 일상적인 일입니까? 지난 4월 22일, 경기 평택시 평택항에서 일하던 스물셋 나이의 대학생 이선호 씨가 300kg의 철판에 깔려 죽는 사고가 있었습니다. 군 전역 후에 학비와 생활비를 벌고자 잠시 아버지가 일하는 일터에서 일하다가 겪은 비극입니다. 한 번도 투입된 적 없는 개방형 컨테이너 해체작업에 안전요원도 없이, 안전모도 쓰지 않고 투입된 것입니다. […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/vZe472nSa4o/80678",
          "publishedOn": "2021-05-12T04:54:35.000Z",
          "wordCount": 790,
          "title": "일터의 위험마저 대물림되는 사회: 고 이선호를 추모하며"
        },
        {
          "id": "https://slownews.kr/?p=80671",
          "author": "언론인권센터",
          "description": "반포한강공원에서 실종된 지 닷새 만에 숨진 채 발견된 대학생 손정민(22) 씨의 사인에 대해 경찰은 아직 수사 진행 중이다. 하지만 경찰 수사와 무관하게 언론은 그들만의 수사를 진행하는 행태를 보이고 있다. 언론은 조회수 늘리기에 급급하며 사실 확인이 되지 않은 사안들을 보도하기 시작했다. 과도한 속보 경쟁 속에서 취재 없는 받아쓰기 기사, 추측과 과장으로 오염된 기사가 쏟아져 나왔다. […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/7d0tEeBssLs/80671",
          "publishedOn": "2021-05-11T04:55:31.000Z",
          "wordCount": 976,
          "title": "클릭 저널리즘의 ‘추리극장’: 고 손정민의 경우"
        },
        {
          "id": "https://slownews.kr/?p=80661",
          "author": "경실련",
          "description": "LH 땅투기 의혹으로 공기업과 정부의 부동산 정책 신뢰가 추락한 상황에서 LH 관련 각종 의혹이 계속 쏟아지고 있다. 최근에도 LH 임직원 1,900여명이 지난 10년간 공공임대·공공분양 주택에 계약한 사실이 드러났다. 권영세 의원실이 LH로부터 전수받은 자료에 따르면 LH 직원 1,621명은 공공분양 주택, 279명은 공공임대 주택을 계약한 것으로 나타났다. 저소득 무주택 서민들에게 돌아가야 할 소중한 기회를 LH 임직원이 본인들 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/MPjkVy7ZqnA/80661",
          "publishedOn": "2021-05-10T04:33:15.000Z",
          "wordCount": 1112,
          "title": "지난 10년, 공공주택 매입 LH 임직원 무려 1,900여 명"
        },
        {
          "id": "https://slownews.kr/?p=80654",
          "author": "참여연대 사법감시센터",
          "description": "2018년 6월, 환호했다. 헌법재판소가 양심적 병역거부를 헌법상 권리로 인정하고, 대체복무제 도입을 촉구했다. 평화활동가 오태양이 평화주의 신념으로 병역을 거부하면서 병역거부가 사회적 논의로 떠오른 지 17년 만이었다. 병역거부 운동이 거둔 결실이었고, 80년 동안 2만여 명의 청년이 군대 대신 감옥을 선택한 끝에 바뀐 변화였다. 양심이 이겼고, 평화가 이겼다고 자축했다. 병역거부자가 감옥에 가지 않는 세상이 오다니 꿈만 같았다. 꿈은 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/Je2IlxQ8lMA/80654",
          "publishedOn": "2021-05-06T17:56:54.000Z",
          "wordCount": 1156,
          "title": "‘진정한 양심’은 없다"
        },
        {
          "id": "https://slownews.kr/?p=80632",
          "author": "한상기",
          "description": "베세머 벤처 파트너스(BVP)는 1911년에 설립한 매우 전통 있는 벤처 캐피털이며, 트윌리오, 쇼피파이, 핀터레스트, 링크드인, 옐프, 트위치, 도큐 사인 등에 투자했던 뛰어난 성과를 보이는 투자자이다. 이 회사는 나스닥의 주요 클라우드 기업에 대한 클라우드 인덱스, 클라우드 자이언츠, 클라우드 100 등 다양한 클라우드 산업 정보를 제공하고 있으며, 지난 3월에 2020년에 이어서 2021년 클라우드 산업 현황 보고서를 발표했다. 뉴 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/20DoH8Bvgsc/80632",
          "publishedOn": "2021-05-06T04:44:45.000Z",
          "wordCount": 2011,
          "title": "뉴 노멀 시대, 2021 클라우드 시장 예측 (by BVP)"
        },
        {
          "id": "https://slownews.kr/?p=80612",
          "author": "민주언론시민연합",
          "description": "삼성전자는 4월 28일 고 이건희 회장 유산의 상속세 납부 계획과 의료사업 지원 및 미술품 기증 방안을 발표했습니다. 그러자 언론은 12조 규모의 상속세에 주목하는 등 많은 보도를 냈습니다. 민주언론시민연합은 4월 28일 지상파 3사와 종합편성채널 4사 저녁종합뉴스, 4월 29일 6개 종합 일간지와 2개 경제 일간지의 고 이건희 회장 유산 상속 관련 보도를 확인해 문제 보도를 추렸습니다. 이건희 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/wju_XkPl1xs/80612",
          "publishedOn": "2021-05-04T04:29:03.000Z",
          "wordCount": 2130,
          "title": "불법 비자금과 차명재산: 이건희 유산 기부 보도가 지운 것들"
        },
        {
          "id": "https://slownews.kr/?p=80597",
          "author": "씨앗(CEART)",
          "description": "계획을 세우고 비즈니스의 목표를 세울 때는 항상 어느 정도의 불확실성이 존재한다. 고객이 제품에 대해 어떻게 반응할지, 또는 판매 예측이 정확한지 아닌지를 실제로 알 수 없기 때문이다. 그러나 기술 시스템을 얼마나 효율적으로 운영하는지 조사하고, 그 시스템이 비즈니스 사용자에게 얼마나 사업 가치를 잘 제공하는지를 빠르고 효과적으로 추적할 수 있으면 그 불확실성을 줄일 수 있다. 모더나의 성공 사례 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/FVml2SAtdbs/80597",
          "publishedOn": "2021-05-03T05:05:04.000Z",
          "wordCount": 2283,
          "title": "클라우드의 미래 가치 (ft. 2021 매킨지 보고서)"
        },
        {
          "id": "https://slownews.kr/?p=80459",
          "author": "민노씨",
          "description": "정의라는 게 별것 아니다. 복수다, 응보다. 행위로 보면, 죄지은 만큼 벌을 받아라. 행위자로 보면, 악당이 잘살지 못하게, 착한 사람이 잘살게. 그게 정의다. 악당에게든 착한 사람에게든 그 대가를 주는 것. 그래서 악하게 살지 말라고 꾸짖고, 착하게 살라고 응원하는 거, 그게 정의다. 그렇게 정의가 실현된 뒤에야 악당도 용서받을 수 있고, 다시 공동체 속에서 일원으로 살아갈 수 있다. 이 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/ccQlmqQrPRU/80459",
          "publishedOn": "2021-04-30T04:46:07.000Z",
          "wordCount": 1988,
          "title": "J에게: 왜 악당이 승리하는가 (ft. 국민청원)"
        },
        {
          "id": "https://slownews.kr/?p=80561",
          "author": "민주언론시민연합",
          "description": "머릿속으로 떠올려 보자. 당신이 텔레비전으로 보고 있는 방송프로그램을. 혹은 스마트폰으로 보고 있을 그 프로그램을. 뉴스 브리핑 등 정치, 경제, 시사 프로그램이 나오는 프로그램이라면 좋겠다. 생방송 아침 프로그램을 하는 스튜디오에 와 있다. 프로그램 제목이 벽에 걸려 있다. 벽 뒤편은 텅 비어 있다. 미리 조정을 맞춰놓은 조명 아래 무대는 대낮같이 밝다. 분장을 마친 아나운서 또는 프리랜서 연예인들이 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/D2DHTLhqysY/80561",
          "publishedOn": "2021-04-29T07:54:29.000Z",
          "wordCount": 1058,
          "title": "방송작가가 ‘노동자’인 이유"
        },
        {
          "id": "https://slownews.kr/?p=80565",
          "author": "윤대균",
          "description": "데브섹옵스(DevSecOps)는 개발(Dev), 보안(Sec), 운영(Ops)을 합친 말이다. 기존 널리 알려진 데브옵스(DevOps)에 ‘보안'(Sec)이 더해진 것이다. 데브옵스는 소프트웨어 개발 사이클과 배포·운영 사이클이 자연스럽게 연계됨으로써 개발에서 배포까지의 전 과정에 걸쳐 시간을 단축하고자 하는 취지에서 도입되었다. 데브옵스에 대한 오해 중의 하나는 개발자가 배포·운영까지 모두 담당하는 것으로 이해하는 것이다. 물론 이 역시 데브옵스 범주에 포함될 수는 있지만, 데브옵스의 진정한 의미는 소프트웨어 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/S3lldK1AiPQ/80565",
          "publishedOn": "2021-04-29T07:13:51.000Z",
          "wordCount": 2346,
          "title": "데브섹옵스(DevSecOps), 왜 중요한가?"
        },
        {
          "id": "https://slownews.kr/?p=80552",
          "author": "슬로우뉴스",
          "description": "코로나19가 초래하는 각 나라 안의 계층별 불평등과 사회경제적 격차는 심각합니다. 그런데 눈길을 세계로 돌리면, 소위 ‘잘사는 나라’와 그렇지 못한 나라의 ‘백신 불평등’은 더 심각합니다. 2021년 3월 기준, 전 세계 인구의 16%에 불과한 부자 나라들이 전 세계 백신 접종의 56%를 차지했다고 합니다. 아직 국민 중 단 한 명도 백신을 맞지 못한 나라가 30개나 된다고 합니다. (출처: […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/49z93g1Z04Q/80552",
          "publishedOn": "2021-04-28T07:31:15.000Z",
          "wordCount": 1213,
          "title": "모두를 위한 백신: ‘트립스 유예안’을 주장하는 이유"
        },
        {
          "id": "https://slownews.kr/?p=80542",
          "author": "참여연대 사법감시센터",
          "description": "지난 2월 25일 헌법재판소는 재판관 5(합헌):4(일부 위헌)의 의견으로, 진실한 사실일지라도 다른 사람의 명예를 훼손할만한 사실을 말한 경우에는 형사처벌하도록 규정하고 있는 일명 ‘사실적시 명예훼손죄’(형법 제307조 제1항)가 헌법에 위반하지 않는다고 결정했다(헌법재판소 2021. 2. 25. 결정, 2017헌마1113). 헌재의 이번 결정은 ‘미투 운동’이나 양육비 미지급 부모의 명단을 공개하는 ‘배드파더스’ 사이트 같이, 다른 사람의 잘못된 행위를 알리는 활동들마저 잘못을 저지른 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/yHBaCXgy7ZY/80542",
          "publishedOn": "2021-04-27T00:40:26.000Z",
          "wordCount": 1947,
          "title": "나쁜 놈의 명예: 진실보다 ‘허명’과 ‘체면’이 중요하다고?"
        },
        {
          "id": "https://slownews.kr/?p=80530",
          "author": "민주언론시민연합",
          "description": "국내 코로나19 백신 접종이 2월 26일부터 시작됐습니다. 요양병원·요양시설·재활시설 입원·입소자·종사자, 의료인, 보건의료인 등을 우선 접종하고 있으며 일반 국민에 대한 접종은 아직 이뤄지지 않고 있습니다. 코로나19 백신 개발과 도입은 세계적 관심사입니다. 팬데믹을 종식시킬 유일한 열쇠로 떠올랐기 때문입니다. 국내 접종 시작 전후로 언론에서 많은 백신 관련 보도가 나왔습니다. 그러나 부정확한 정보 전달과 선정적 보도로 백신 불안을 야기하는 언론보도에 […]",
          "link": "http://feedproxy.google.com/~r/slownews/~3/2ZJDdDMmc5o/80530",
          "publishedOn": "2021-04-26T04:17:34.000Z",
          "wordCount": 3342,
          "title": "\"불바다\"에서 \"발기부전\"까지 부끄러운 백신 보도"
        }
      ]
    },
    {
      "title": "이바닥늬우스",
      "feedUrl": "https://ebadak.news/feed",
      "siteUrl": "https://ebadak.news",
      "articles": []
    }
  ],
  "cliVersion": "1.7.2"
}