{
  "sources": [
    {
      "title": "Alex Edwards",
      "feedUrl": "https://www.alexedwards.net/static/feed.rss",
      "siteUrl": "https://www.alexedwards.net/blog",
      "articles": []
    },
    {
      "title": "Arjun Sreedharan",
      "feedUrl": "https://arjunsreedharan.org/rss",
      "siteUrl": "https://arjunsreedharan.org/",
      "articles": []
    },
    {
      "title": "Beningo Embedded Group",
      "feedUrl": "https://www.beningo.com/feed/",
      "siteUrl": "https://www.beningo.com",
      "articles": [
        {
          "id": "https://www.beningo.com/?p=14121",
          "author": "Jacob Beningo",
          "description": "Have you ever wondered, while you and your team are busy writing software if the very foundation of how embedded software systems are built has changed and left you in the dust? What if while you were busily focusing on getting your product out the door, fighting bugs, and dealing with supply issues, there were … Continue reading 3 Overlooked Embedded Software Elements\n3 Overlooked Embedded Software Elements first appeared on Beningo Embedded Group.",
          "link": "https://www.beningo.com/3-overlooked-embedded-software-elements/",
          "publishedOn": "2022-04-21T19:28:32.000Z",
          "wordCount": null,
          "title": "3 Overlooked Embedded Software Elements",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.beningo.com/?p=14110",
          "author": "Jacob Beningo",
          "description": "Nearly every embedded software team I encounter is interested in becoming more agile. Adopting Agile practices can dramatically improve how agile a team is. Businesses and developers all want to be able to deliver faster. We don’t want the headache of late and buggy code, yet we often just accept that is what life is … Continue reading 5 Tips for Becoming More Agile\n5 Tips for Becoming More Agile first appeared on Beningo Embedded Group.",
          "link": "https://www.beningo.com/5-tips-for-becoming-more-agile/",
          "publishedOn": "2022-04-14T16:17:05.000Z",
          "wordCount": null,
          "title": "5 Tips for Becoming More Agile",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "https://www.beningo.com/?p=14067",
          "author": "Jacob Beningo",
          "description": "Back in the year 1998, the FIRST Robotics Competition gave me the opportunity to be involved in my first major engineering project. As a member of Team 67 (Heros of Tomorrow),  which was sponsored by the General Motors Proving Grounds in Milford, MI, I had the opportunity to be mentored by engineers and get hands-on … Continue reading 2022 FIRST Robotics Competition – Team 7769\n2022 FIRST Robotics Competition – Team 7769 first appeared on Beningo Embedded Group.",
          "link": "https://www.beningo.com/2022-first-robotics-competition-team-7769/",
          "publishedOn": "2022-04-07T13:53:48.000Z",
          "wordCount": null,
          "title": "2022 FIRST Robotics Competition – Team 7769",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Clean Code Blog",
      "feedUrl": "https://blog.cleancoder.com/atom.xml",
      "siteUrl": "http://blog.cleancoder.com/atom.xml",
      "articles": []
    },
    {
      "title": "C++ Stories",
      "feedUrl": "https://www.cppstories.com/index.xml",
      "siteUrl": "https://www.cppstories.com/",
      "articles": [
        {
          "id": "https://www.cppstories.com/2022/ranges-alg-part-one/",
          "author": null,
          "description": "C++20’s Ranges offer alternatives for most of <algorithm>'s'. This time I’d like to show you ten non-modifying operations. We’ll compare them with the “old” standard version and see their benefits and limitations.\nLet’s go.\n\n\n\n     \n    \n\n\nKey observations for std::ranges algorithms:\nRanges algorithms are defined in the <algorithm> header, while the ranges infrastructure and core types are defined in the <ranges> header.\nUsually, there are at least two overloads for range algorithms: with a pair of iterators and an overload with a single range argument.\nThe version that returns a subrange or an iterator and takes a range returns a borrowed range or a borrowed iterator. This helps detect iterators to temporary ranges.\nThe range versions take “projections,” which sometimes allows more flexib…",
          "link": "https://www.cppstories.com/2022/ranges-alg-part-one/",
          "publishedOn": "2022-04-25T00:00:00.000Z",
          "wordCount": 2686,
          "title": "C++20 Ranges Algorithms - 7 Non-modifying Operations",
          "imageUrl": "https://www.cppstories.com/2022/images/ranges_alg1.png"
        },
        {
          "id": "https://www.cppstories.com/2022/ranges-perf/",
          "author": null,
          "description": "With C++20, we have a new approach to writing algorithms and composing them. The significant question is their performance. Are they faster or slower than the standard C++ algorithms we have known for decades? Let’s find out in this article.\nI’ll show you three use cases with performance results, and also we’ll compare build times.\n\n\n\n     \n    \n\n\nI don’t think that comparing std::alg_name with its ranges counterpart like std::ranges::alg_name will give us any difference… but for completeness let’s make a simple sorting test:\nstatic void Standard(benchmark::State& state) {\n  auto data = words;\n  for (auto _ : state) {\n       std::sort(data.begin(), data.end());\n       benchmark::DoNotOptimize(data);\n    }\n}\nBENCHMARK(Standard);\n\nstatic void Ranges(benchmark::State& state) {\n  auto data = w…",
          "link": "https://www.cppstories.com/2022/ranges-perf/",
          "publishedOn": "2022-04-11T00:00:00.000Z",
          "wordCount": 1450,
          "title": "Three Benchmarks of C++20 Ranges vs Standard Algorithms",
          "imageUrl": "https://www.cppstories.com/2022/images/ranges_perf.png"
        }
      ]
    },
    {
      "title": "Sticky Bits – Powered by Feabhas",
      "feedUrl": "https://blog.feabhas.com/feed/",
      "siteUrl": "https://blog.feabhas.com",
      "articles": []
    },
    {
      "title": "The LLVM Project Blog",
      "feedUrl": "https://blog.llvm.org/index.xml",
      "siteUrl": "https://blog.llvm.org/",
      "articles": []
    },
    {
      "title": "Embedded in Academia",
      "feedUrl": "https://blog.regehr.org/feed",
      "siteUrl": "https://blog.regehr.org",
      "articles": []
    },
    {
      "title": "Siemens Blog Network",
      "feedUrl": "https://blogs.sw.siemens.com/feed/",
      "siteUrl": "https://blogs.sw.siemens.com",
      "articles": []
    },
    {
      "title": "Embedded Software Insights | Latest Embedded Technology News",
      "feedUrl": "https://www.bluefruit.co.uk/blog/feed",
      "siteUrl": "https://www.bluefruit.co.uk",
      "articles": [
        {
          "id": "https://www.bluefruit.co.uk/processes/testing-signs-verification-validation-issue/",
          "author": "bluefruit",
          "description": "Verification and validation (V&V) are vital in medical device software development regardless of where you’re looking to sell your device. But […]\nThe post V&V Testing: Signs you have a verification & validation issue appeared first on Bluefruit Software.",
          "link": "https://www.bluefruit.co.uk/processes/testing-signs-verification-validation-issue/",
          "publishedOn": "2022-04-06T09:41:34.000Z",
          "wordCount": 2113,
          "title": "V&V Testing: Signs you have a verification & validation issue",
          "imageUrl": "https://www.bluefruit.co.uk/content/uploads/2022/04/v-and-v-thumb-v1.jpg"
        }
      ]
    },
    {
      "title": "Architectures and Processors blog",
      "feedUrl": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog/rss",
      "siteUrl": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog",
      "articles": []
    },
    {
      "title": "CPUU의 Daydreamin&#039;",
      "feedUrl": "https://cpuu.postype.com/rss",
      "siteUrl": "https://cpuu.postype.com",
      "articles": [
        {
          "id": "https://cpuu.postype.com/post/12272847",
          "author": "CPUU",
          "description": "KISA에서는 [소프트웨어 개발 보안 가이드] 를 발간하고 있다. 이 가이드는 예전에 시큐어 코딩 가이드를 보다 소프트웨어공학 개발 프로세스 전체에 맞추어 확장한 것으로, 분석/설계 단계 보안강화 활동과 구현단계 시큐어코딩 가이드를 결합한 형태다.\n또한, [소프트웨어 보안약점 진단가이드] 라는 문서도 있는데, 이는 위의 개발 보안 가이드의 내용에 추가적으로 실제 어떤 문제점이 존재하는지 여부를 찾는 관점에서 여러가지 추가 내용(잘못된 코드 사례, 잘못된 탐지, 바른 탐지 등)을 포함하고 있다. \n위 두 가이드는 [SW 보안약점 진단원] 이라는 자격증 시험을 대비할 때 필수적으로 숙지해야 할 문서이다. \n\n\n이와 별개로, 2022년 2월 25일, KISA에서 [Python 시큐어코딩 가이드]라는 문서를 처음 공개했다. 기존의 시큐어코딩 가이드는 주로 C/C++ 이나 JAVA 관련 프레임워크를 다루었는데, 파이썬 언어가 추가된 것이다.\n실제로 문서내의 설명에 따르면, 파이썬 언어는 프로그래밍 언어의 순위를 공표하는 TIOBE 에서 1위를 차지하는 등 그 사용도가 매우 높기 때문에 파이썬 언어를 사용하는 서비스들도 보안 검증이 고려되어야 한다는 목적에서 추가한 것이라고 한다. 이 가이드는 Python 3.X 버전을 기준으로 한다.\n\n\n그리고 원래 기존의 구현단계 보안약점 제거 기준은 총 49개인데, 그중 파이썬에 포함하기 극히 어려운 항목은 제외하여 42개 항목에 대해서만 가이드를 구성한 것 같다.\n\n\n한가지 궁금한 점이, 기존의 보안약점 가이드는 대부분 웹 서비스를 염두하여 SQL 삽입이라던지 크로스사이트 스크립트(XSS)를 다루는 경우가 많은데 과연 파이썬 프로그래밍에서 이를 어떻게 적용할까? 생각을 했다.\n가이드를 잘 살펴보니, 우선 파이썬도 맞고 웹 서비르를 염두한 것도 맞다. 즉, Django나 Flask 같은 파이썬용 웹 프레임웍? 패키지? 를 사용하는 것으로 가정하고 여기에서 안전하지 않은 코드와 안전한 코드를 구분하여 설명하는 방식으로 서술하고 있다.\n그리고 암호화 관련된 내용에 대해서도 파이썬에 알맞은 PyCrypto 사용예를 들어 설명하고 있다. 특히 중요한 언급은 Python2 에서는 PyCrypto 기반이었지만, Python3부터는 PyCrypto를 개선한 PyCryptodomes를 사용해야 한다고 명시하고 있다. 실제로 어떤식으로 AES 암호화를 해야하는지 등의 예시도 보여주고 있다. 뿐만 아니라 난수 발생기 역시 os.urandom()이나, 그보다 좋은 secrets 등을 사용하여 강력한 난수를 생성하라고 권고하고 있다. \n\n\n전체적으로 보았을 때 그동안 파이썬 관련 보안 개발 표준이 거의 전무했는데, 최소한 국내에서 개발을 할 때에는 제시하면 좋을만한 KISA 가이드가 출시되서 좋은 것 같다. 실제로 내용도 최신 파이썬 버전이 잘 고려된 것 같다. 이 문서는 비록 다른 C/C++에 비해(최소 10년은 된듯??) 출범한지 얼마되지 않았으므로 아직 내용이나 분량이 앞으로 더 많이 늘어날 것으로 기대가 된다.\n한편 올해 9월정도에 있을 것으로 예상되는 KISA SW보안약점 진단원 시험에서 파이썬 관련 내용도 다룰지는 아직 모르겠다..",
          "link": "https://cpuu.postype.com/post/12272847",
          "publishedOn": "2022-04-24T14:44:41.000Z",
          "wordCount": 656,
          "title": "KISA 파이썬 시큐어 코딩 가이드",
          "imageUrl": "https://d3mcojo3jv0dbr.cloudfront.net/2022/04/24/23/29/250eabdbdc184c03aacabd481d9c754b.png?w=600&h=300&q=65"
        }
      ]
    },
    {
      "title": null,
      "feedUrl": "https://danluu.com/atom.xml",
      "siteUrl": "https://danluu.com/atom/index.xml",
      "articles": [
        {
          "id": "https://danluu.com/simple-architectures/",
          "author": null,
          "description": "Wave is a $1.7B company with 70 engineers1 whose product is a CRUD app that adds and subtracts numbers. In keeping with this, our architecture is a standard CRUD app architecture, a Python monolith on top of Postgres. Starting with a simple architecture and solving problems in simple ways where possible has allowed us to scale to this size while engineers mostly focus on work that delivers value to users.\nStackoverflow scaled up a monolith to good effect (2013 architecture / 2016 architecture), eventually getting acquired for $1.8B. If we look at traffic instead of market cap, Stackoverflow is among the top 100 highest traffic sites on the internet (for many other examples of valuable companies that were built on top of monoliths, see the replies to this Twitter thread. We don’t have a lot…",
          "link": "https://danluu.com/simple-architectures/",
          "publishedOn": "2022-04-06T00:00:00.000Z",
          "wordCount": 2194,
          "title": "In defense of simple architectures",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Damien Katz",
      "feedUrl": "http://damienkatz.net/feed/",
      "siteUrl": "http://damienkatz.net",
      "articles": []
    },
    {
      "title": "Dave Cheney",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "Red Hat Developer",
      "feedUrl": "https://developers.redhat.com/blog/feed",
      "siteUrl": "https://developers.redhat.com/",
      "articles": [
        {
          "id": "284222a2-ce83-4a14-9ecf-50f5e4052566",
          "author": "Ken Lee, Niti Upadhyay",
          "description": "In this article, you'll learn about user and group authorization through LDAP to an Apache Kafka cluster. For a Kafka broker, user- and group-based authorization are handled by Access Control Lists  (ACLs). More fine-grained approaches to user and group authorization on Kafka cluster resources also use single sign-on (SSO). This article combines LDAP with Red Hat's single sign-on technology, which can write Kafka ACL rules.\nThis use case applies to teams that are currently employing common identity management services (IdMs) such as Active Directory (AD) or LDAP. We demonstrate how to synchronize users and groups from an IdM into Red Hat's SSO. We then show how to create ACL rules in Red Hat's SSO to apply authorization rules and policies to Kafka. This procedure allows our Kafka cluster t…",
          "link": "https://developers.redhat.com/articles/2022/05/04/use-red-hats-sso-manage-kafka-broker-authorization",
          "publishedOn": "2022-05-04T07:00:00.000Z",
          "wordCount": 3009,
          "title": "Use Red Hat's SSO to manage Kafka broker authorization",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/GC-security_1x.png?itok=puGidoF7"
        },
        {
          "id": "91cbf943-114f-4c2f-abc8-5f0cb2a1c719",
          "author": "Petr Hracek, Zuzana Miklankova",
          "description": "Testing Farm is an open source test system that makes it easier to run unit tests on your projects. A previous article, Test GitHub projects with GitHub Actions and Testing Farm, showed you how to use the framework. This article introduces a new GitHub Action named Testing Farm as GitHub Action, which is available on GitHub Marketplace and integrates your tests into a GitOps environment so that you can ensure that tests are run at key points during development.\nNote: GitHub Marketplace is a central site where developers can find GitHub Actions along with other resources. Anyone with a GitHub account can publish an Action on GitHub Marketplace. Publishing the Action in the Marketplace brings additional visibility.\nTesting Farm is a service maintained by Red Hat, and is currently available t…",
          "link": "https://developers.redhat.com/articles/2022/05/04/schedule-tests-gitops-way-testing-farm-github-action",
          "publishedOn": "2022-05-04T07:00:00.000Z",
          "wordCount": 1715,
          "title": "Schedule tests the GitOps way with Testing Farm as GitHub Action",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/2021_Testing_GitHub_by_GitHub_Actions_Testing_Farm_B.png?itok=5hlyyRVf"
        },
        {
          "id": "10c50101-3477-4286-be2f-e90b4bb4235a",
          "author": "Natale Vinto, Sebastien Blanc",
          "description": "As Red Hat Summit 2022 approaches, we are excited to announce that our session, The Red Hat cloud way: Event-driven, serverless, distributed cloud services to support modern apps, will be part of the developer track.\nThis session will explore Red Hat Cloud Services and Red Hat Application Services to provide a walkthrough of Red Hat's cloud strategy with application development and cloud-native models.\nWe'll go on a journey of developing a microservices-based application using Red Hat OpenShift Streams for Apache Kafka and Developer Sandbox for OpenShift to support serverless, event-driven, on-demand workloads, which could be be used in IoT, edge computing, and big data. The process involves four simple steps, illustrated in Figure 1:\nCreate a Kafka cluster in the cloud. With OpenShift Str…",
          "link": "https://developers.redhat.com/articles/2022/05/03/red-hat-cloud-way-event-driven-serverless-distributed-cloud-services-support",
          "publishedOn": "2022-05-03T05:00:00.000Z",
          "wordCount": 916,
          "title": "The Red Hat Cloud way: Event-driven, serverless, distributed cloud services to support modern apps",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/summit22-box-logo.png?itok=s02ml8PF"
        },
        {
          "id": "ae0dbd68-3a12-478e-b133-cafb88444aab",
          "author": "Bilgin Ibryam",
          "description": "The performance of your Apache Kafka environment will be affected by many factors, including choices, such as the number of partitions, number of replicas, producer acknowledgments, and message batch sizes you provision. But different applications have different requirements. Some prioritize latency over throughput, and some do the opposite. Similarly, some applications put a premium on durability, whereas others care more about availability. This article introduces a way of thinking about the tradeoffs and how to design your message flows using a model I call the Kafka optimization theorem.\nOptimization goals for Kafka\nLike other systems that handle large amounts of data, Kafka balances the opposing goals of latency and throughput. Latency, in this article, refers to how long it takes to …",
          "link": "https://developers.redhat.com/articles/2022/05/03/fine-tune-kafka-performance-kafka-optimization-theorem",
          "publishedOn": "2022-05-03T05:00:00.000Z",
          "wordCount": 2639,
          "title": "Fine-tune Kafka performance with the Kafka optimization theorem",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/kafka-event-driven_1x%20%284%29.png?itok=s3HC0Lad"
        },
        {
          "id": "589be582-0928-4773-8d66-77e6a17a2e03",
          "author": "Red Hat Developer Editorial Team",
          "description": "Podman is a tool for building containers. It plays the same role as Docker and is largely compatible with Docker, offering mostly the same commands. This article offers resources both for developers getting started with Podman and for those seeking more advanced information.\nWhat is Podman?\nWe've found the following videos and articles to be great starting points.\nIn Podman: The next generation of Linux container tools, Doug Tidwell explains what Podman is and how to install the tool, build an image with it, run the image, push the image to a container registry, download the image to a non-Linux system, and run the image with Docker.\nTransitioning from Docker to Podman, one of the most popular Red Hat Developer articles about containers, uses real-world examples to show you how to install …",
          "link": "https://developers.redhat.com/articles/2022/05/02/podman-basics-resources-beginners-and-experts",
          "publishedOn": "2022-05-02T07:00:00.000Z",
          "wordCount": 1318,
          "title": "Podman basics: Resources for beginners and experts",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2019/01/podman-logo.png?itok=IidgxzLH"
        },
        {
          "id": "cf2eaab9-30af-482e-9f53-8e838b439a91",
          "author": "Maria Arias de Reyna Dominguez",
          "description": "Apache Camel and the Kaoto graphical editor can work together to provide a no-code or low-code environment to simplify the integration of services into Kubernetes applications. Integrations with microservices and containers can be complex. This article introduces criteria for a no-code environment and shows how Apache Camel and Kaoto achieve this goal for microservices and containers.\nThe right director for your symphony\nSeveral criteria have to be considered when choosing an integration framework:\nFunctionality: The most obvious criterion is a framework that's as complete as possible. Our framework should feature not only Enterprise Integration Patterns, but also a wide range of connectors to different protocols and formats. We want to be able to extract, transform, and load data in a pai…",
          "link": "https://developers.redhat.com/articles/2022/05/02/no-code-and-low-code-integrations-camel-and-kaoto",
          "publishedOn": "2022-05-02T07:00:00.000Z",
          "wordCount": 1852,
          "title": "No-code and low-code integrations with Camel and Kaoto",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/2021_CamelK_Crossteam__A.png?itok=KM8Deutq"
        },
        {
          "id": "097dad79-6467-4366-b17a-dc08e888d8fd",
          "author": "Paolo Patierno, Tom Cooper",
          "description": "The race is about to start.\nThe driver is focusing on the track and his adrenaline is at its peak.\nThe engineers are already at their computers, ready to check that everything is working fine on the car.\nThe red lights will turn on one after the other, and when they all turn off together the challenge will begin.\nOne side must drive as fast as possible, choose the right line, and overtake the opponents.\nThe other side must analyze the telemetry, spotting potential anomalies and providing feedback to the driver.\nEveryone has a single goal: to reach the checkered flag first.\nThe time has come! Five, four, three, two, one ... go!\nA Formula 1 data-streaming infrastructure\nThe story we just told plays out on every race weekend in the Formula 1 season.\nWe are not lucky enough to be drivers, so l…",
          "link": "https://developers.redhat.com/articles/2022/04/28/process-formula-1-telemetry-quarkus-and-openshift-streams-apache-kafka",
          "publishedOn": "2022-04-28T07:00:00.000Z",
          "wordCount": 2077,
          "title": "Process Formula 1 telemetry with Quarkus and OpenShift Streams for Apache Kafka",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/2021_Using_OpenShift_Streams_for_Kafka_MirrorMaker__1_0.png?itok=FlxBXGvP"
        },
        {
          "id": "4bd743c2-cdfd-40e9-ba42-4973b71428a4",
          "author": "Rishabh Singh",
          "description": "Red Hat's single sign-on technology is an identity and access management solution based on standard identity protocols (SAML, OpenID Connect) to perform authentication of users and share user information for access control. Red Hat's SSO sources user information from a federated user database, or user federation, and it provides the option to configure the Kerberos protocol for this purpose.\nIn this article, you'll see how to set up Red Hat's SSO to authenticate users using the standard Kerberos protocol along with the Simple and Protected GSS_API Negotiation Mechanism (SPNEGO) specification.\nTo use Kerberos, Red Hat's SSO must set up an identity called a service principal. The user gains access to Red Hat's SSO through Kerberos in a two-step process: first they obtain a Ticket Granting Ti…",
          "link": "https://developers.redhat.com/articles/2022/04/28/use-red-hats-single-sign-technology-secure-services-through-kerberos",
          "publishedOn": "2022-04-28T07:00:00.000Z",
          "wordCount": 2444,
          "title": "Use Red Hat's single sign-on technology to secure services through Kerberos",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2021/02/2021_RH_SSO_User_Certificate_X509_Featured_image_A.png?itok=t1NKmCAF"
        },
        {
          "id": "ebc4b271-94a2-4852-bcca-4f3dbbf7c781",
          "author": "Suresh Gaikwad",
          "description": "Red Hat OpenShift Service on AWS is a version of the Red Hat OpenShift hosting service managed by Amazon Web Services (AWS). Although your cluster's own integrity is secure in that environment, communicating safely outside the cluster requires considerable setup. In this article, you'll learn how to connect securely through a firewall to the internet while keeping your cluster in a private workspace. We use Amazon's Virtual Private Cloud (VPC), Security Token Service (STS), and AWS Transit Gateway to effect secure connections.\nNote: To follow along with this article, you should be familiar with the AWS command-line interface (CLI), and have a basic understanding of AWS networking, routing, AWS permissions, transit gateways, and OpenShift, as well as Linux shell commands.\nSecure connections…",
          "link": "https://developers.redhat.com/articles/2022/04/27/create-privatelink-red-hat-openshift-cluster-aws-sts",
          "publishedOn": "2022-04-27T07:00:00.000Z",
          "wordCount": 2869,
          "title": "Create a PrivateLink Red Hat OpenShift cluster on AWS with STS",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/GC_cloud1_2x.png?itok=7OTSzwEN"
        },
        {
          "id": "bac918cf-fe82-4689-a022-2dc4156d304a",
          "author": "Erwan Gallen",
          "description": "The traditional CPU-centric system architecture is being replaced by designs where systems are aggregated from independently intelligent devices. These systems have their own compute capabilities and can natively run network functions with an accelerated data plane. The new model allows us to offload to accelerators not only the individual subroutines but whole software subsystems, such as networking or storage, with cloud-like security isolation and architectural compartmentalization.\nOne of the most prominent examples of this new architecture is the data processing unit (DPU). DPUs offer a complete compute system with an independent software stack, network identity, and provisioning capabilities. The DPU can host its own applications using either embedded or orchestrated deployment model…",
          "link": "https://developers.redhat.com/articles/2022/04/26/orchestrate-offloaded-network-functions-dpus-red-hat-openshift",
          "publishedOn": "2022-04-26T10:00:00.000Z",
          "wordCount": 3191,
          "title": "Orchestrate offloaded network functions on DPUs with Red Hat OpenShift",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/Containers_OpenShift_0.png?itok=fSwtvSOu"
        },
        {
          "id": "8264f386-94d5-4766-9207-39e82b323299",
          "author": "Red Hat Developer Editorial Team",
          "description": "Welcome to our monthly recap of the articles we published in April! We had some important product and event announcements this month that deserve your attention:\nRed Hat CodeReady Studio reached its end of life;\nCodeReady Workspaces has scaled up and, is now Red Hat OpenShift Dev Spaces;\nRed Hat Summit 2022 is fast approaching—find out which sessions are of most interest to developers.\nAnd of course, we rolled out a panoply of articles to help you write code on the platforms you trust. Here are the April highlights.\nNote: See the end of this article for the full lineup published in April 2022.\nWhat's new in GCC 12?\nThe upcoming release of version 12 of the GCC compiler is naturally causing quite a stir for C developers working on Red Hat Enterprise Linux and other platforms. In one of our …",
          "link": "https://developers.redhat.com/articles/2022/04/26/red-hat-developer-roundup-best-april-2022",
          "publishedOn": "2022-04-26T07:00:00.000Z",
          "wordCount": 1296,
          "title": "Red Hat Developer roundup: Best of April 2022",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/RDH_Developer_Roundup.png?itok=kLwx8u_0"
        },
        {
          "id": "7bf98d00-e2bb-4cf0-922e-dddc68d2807b",
          "author": "Marek Polacek",
          "description": "Version 12.1 of the GNU Compiler Collection (GCC) is expected to be released in April 2022. Like every major GCC release, this version will bring many additions, improvements, bug fixes, and new features. GCC 12 is already the system compiler in Fedora 36. GCC 12 will also be available on Red Hat Enterprise Linux in the Red Hat Developer Toolset (version 7) or the Red Hat GCC Toolset (version 8 and 9).\nLike the article I wrote about GCC 10, this article describes only new features affecting C++.\nWe implemented several C++23 proposals in GCC 12. The default dialect in GCC 12 is -std=gnu++17; to enable C++23 features, use the -std=c++23 or -std=gnu++23 command-line options. (The latter option allows GNU extensions.)\nNote that C++20 and C++23 features are still experimental in GCC 12.\nC++23 f…",
          "link": "https://developers.redhat.com/articles/2022/04/25/new-c-features-gcc-12",
          "publishedOn": "2022-04-25T07:00:00.000Z",
          "wordCount": 3528,
          "title": "New C++ features in GCC 12",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2021/04/gcc_1x.png?itok=6l1b8Lo9"
        },
        {
          "id": "b057181b-47a5-428f-bd03-b2f716006a64",
          "author": "Feny Mehta",
          "description": "If you're writing an application for Kubernetes and want to expose secrets for connecting, or binding, to external services such as REST APIs, databases, or event buses, you have traditionally needed to manually and custom-write the code for these tasks. This process can be error-prone and can slow down developers, and the community lacked a consistent and automated way to connect applications and services.\nThe Service Binding Operator (SBO) provides such a solution. In this article, you'll learn article how to use the Service Binding Operator to easily bind a Node.js application to Red Hat OpenShift Streams for Apache Kafka.\nApache Kafka is an open source, distributed publish/subscribe messaging system for creating fault-tolerant, real-time data feeds. OpenShift Streams for Apache Kafka i…",
          "link": "https://developers.redhat.com/articles/2022/04/21/bind-kafka-cluster-nodejs-application-easy-way",
          "publishedOn": "2022-04-21T07:00:00.000Z",
          "wordCount": 3521,
          "title": "Bind a Kafka cluster to a Node.js application the easy way",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/CP-nodejskubernetes_2x-e1615240548598.png?itok=-tne5COr"
        },
        {
          "id": "7436626c-5883-4085-b1db-1dd801c7eca5",
          "author": "Olivier Rivat",
          "description": "Quarkus applications, like many other Java applications in use today, run on the network and require user authentication. If you are developing a Quarkus application that will run on a Red Hat OpenShift or Red Hat Enterprise Linux platform, you can add security quickly and easily through Red Hat's single sign-on (SSO) technology. This article takes you through the steps, with an example Quarkus application deployed on Red Hat Enterprise Linux.\nCreate a Quarkus project\nThe procedure in this article uses a simple example application from the Quarkus guide. You can install the example using Maven:\n$ mvn io.quarkus.platform:quarkus-maven-plugin:2.7.1.Final:create \\\n    -DprojectGroupId=org.acme \\\n    -DprojectArtifactId=getting-started \\\n    -Dextensions=\"resteasy\"\nThis application is deployed…",
          "link": "https://developers.redhat.com/articles/2022/04/21/add-security-quarkus-application-using-red-hats-sso",
          "publishedOn": "2022-04-21T07:00:00.000Z",
          "wordCount": 1526,
          "title": "Add security to a Quarkus application using Red Hat's SSO",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2021/02/2021_RH_SSO_User_Certificate_X509_Featured_image_A.png?itok=t1NKmCAF"
        },
        {
          "id": "54a1b5af-4138-4e11-b34f-297b8db1c6a7",
          "author": "JooHo Lee",
          "description": "A persistent volume (PV) is a common way to preserve data in case a container is accidentally lost in Kubernetes or Red Hat OpenShift. This article shows you how to manage persistent volumes with the NFS Provisioner Operator that I developed.\nDifficulties with PVs\nIn the early days of container-based development, each user had to ask an administrator to create a PV for that user's containers. Usually the administrator created 100 PVs in advance when the cluster was installed. The administrator also had to clean up the used PVs when they were released. Obviously, this process was inefficient and really burdensome.\nDynamic provisioning using StorageClass was developed to solve this problem. With StorageClass, you no longer have to manually manage your PVs—a provisioner manages them for you. …",
          "link": "https://developers.redhat.com/articles/2022/04/20/create-and-manage-local-persistent-volumes-codeready-containers",
          "publishedOn": "2022-04-20T07:00:00.000Z",
          "wordCount": 1190,
          "title": "Create and manage local persistent volumes with CodeReady Containers",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/prov_0.png?itok=R4Kr0Gen"
        },
        {
          "id": "7f17be01-c88d-45b6-be02-71b1f3b07f0b",
          "author": "Romain Pelisse",
          "description": "This article is the fourth installment in our series on Ansible for middleware. In this article, you'll use Ansible to simplify and automate the installation of Keycloak, a popular open source tool to implement single sign-on for Web applications. The previous articles in this series are:\nAutomate Red Hat JBoss Web Server deployments with Ansible\nAutomate and deploy a JBoss EAP cluster with Ansible\nDeploy Infinispan automatically with Ansible\nThe tutorial in this article builds on an Ansible Collection named middleware_automation.keycloak, which has been specifically designed for this endeavor.\nPrerequisites\nTo make use of this tutorial, you need a Red Hat Enterprise Linux or Fedora system, along with version 2.9 or higher of Ansible (preferably the latest version).\nInstall the collection\n…",
          "link": "https://developers.redhat.com/articles/2022/04/20/deploy-keycloak-single-sign-ansible",
          "publishedOn": "2022-04-20T07:00:00.000Z",
          "wordCount": 1899,
          "title": "Deploy Keycloak single sign-on with Ansible",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/2020_Authentication_Author_Keycloak_Featured_Article__B%20copy%202.png?itok=ppA8kEF8"
        },
        {
          "id": "4036d6ea-f0b6-4319-8e0b-cd3a41d76f82",
          "author": "Ben Evans",
          "description": "An increasing number of Java applications run in containers. The exact number is hard to determine, because adoption of containers depends upon the market segment and cloud maturity of each particular team or company. However, some data is available—for example, data from New Relic suggests that over 62% of their customers' Java workloads run in containers. Like all data points, this one is an imperfect proxy for the market as a whole, but the report demonstrates that a significant subset of the Java market has already moved to container-based environments. Anecdotal data also tells us that this migration trend is far from over.\nTeams using Java need to pay special attention to some aspects of container-based deployments and adopt a couple of best practices. This article focuses on the cho…",
          "link": "https://developers.redhat.com/articles/2022/04/19/best-practices-java-single-core-containers",
          "publishedOn": "2022-04-19T07:00:00.000Z",
          "wordCount": 2310,
          "title": "Best practices for Java in single-core containers",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/ST-containers_1x%20%281%29.png?itok=NK0oKjD5"
        },
        {
          "id": "d5069613-6b53-421b-9e45-bf8cf43625de",
          "author": "Severin Gehwolf",
          "description": "OpenJDK has been aware of Linux containers (such as Docker and Podman, as well as container orchestration frameworks such as Kubernetes) for some time. By container awareness, we mean that OpenJDK detects when it is running inside a container. In this article, you'll learn why container awareness is useful, what has changed recently in that area of OpenJDK, and what diagnostic options are available to help developers gain insight into how the JVM determines settings.\nOpenJDK's container awareness detection uses Linux's control group (cgroup) filesystem to detect enforced resource quotas. As of this writing, Java 17 is the only long-term support release that supports both cgroups v1 and cgroups v2 configurations. Note, however, that there is currently work ongoing to backport cgroups v2 sup…",
          "link": "https://developers.redhat.com/articles/2022/04/19/java-17-whats-new-openjdks-container-awareness",
          "publishedOn": "2022-04-19T07:00:00.000Z",
          "wordCount": 2698,
          "title": "Java 17: What’s new in OpenJDK's container awareness",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/ST-java1_1x%20%282%29.png?itok=vylISiQ1"
        },
        {
          "id": "6ec5faa0-8fbc-4e6c-b8fe-1f2e2c68160a",
          "author": "Mohit Suman",
          "description": "Red Hat CodeReady Studio will reach end of life on April 19, 2022. The project is transitioning to community development and support as part of the JBoss Tools project. This article breaks down all the information you need to know along with the future roadmap.\nWhat is CodeReady Studio?\nRed Hat CodeReady Studio is a fully bundled Eclipse IDE that includes the majority of JBoss Tools, a set of plugins for Eclipse that complements, enhances, and goes beyond the support that exists for JBoss, along with related technologies in the default Eclipse distribution. CodeReady Studio also includes all required dependencies and third-party plugins.\nCodeReady Studio has empowered application developers with a broad set of tools and capabilities. CodeReady Studio supports the full development lifecycle…",
          "link": "https://developers.redhat.com/articles/2022/04/18/announcement-red-hat-codeready-studio-reaches-end-life",
          "publishedOn": "2022-04-18T07:00:00.000Z",
          "wordCount": 1613,
          "title": "Announcement: Red Hat CodeReady Studio reaches end of life",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/ST-crs_2x.png?itok=p2dylVnA"
        },
        {
          "id": "37d49695-28fb-437e-b0a4-043a649a72c8",
          "author": "Eric Deandrea",
          "description": "Did you miss the free hands-on workshop Building Quarkus applications with Apache Cassandra, hosted by Red Hat's Eric Deandrea and Raghavan \"Rags\" Srinivas from DataStax, a Red Hat partner? This two-hour workshop showcases all the Developer Joy benefits of Quarkus, such as developer mode, debugging, containerization, and no-hassle native executable generation, coupled with an Apache Cassandra backend hosted in the cloud using DataStax Astra DB's multicloud database-as-a-service.\nIn the workshop, Rags explains some differences between relational and NoSQL databases. He introduces Apache Cassandra and the benefits it brings, explaining how Cassandra's configurable consistency level makes it highly scalable and reliable. He also introduces DataStax Astra Cassandra-as-a-service and explains so…",
          "link": "https://developers.redhat.com/articles/2022/04/14/building-quarkus-applications-apache-cassandra-workshop-recap",
          "publishedOn": "2022-04-14T07:00:00.000Z",
          "wordCount": 963,
          "title": "Building Quarkus applications with Apache Cassandra: Workshop recap",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/2019-10/Quarkus.jpg?itok=4xei_I6h"
        },
        {
          "id": "d5df0b74-748e-4ed5-a419-222174683e62",
          "author": "Rohan Kumar",
          "description": "Tools provided with Kubernetes continually make it easier for Java developers to build applications, store them in registries, and deploy images. This article looks at Helm charts, the fundamental tool for building applications on Kubernetes and the Red Hat OpenShift cloud service, together with Eclipse JKube, which is available as a Kubernetes Maven or Gradle plugin.\nThe article demonstrates how combining Helm with JKube simplifies Kubernetes manifest management for Java projects. You'll learn how JKube makes it possible for Java developers to automatically generate and publish Helm charts (Figure 1).\n\n  \n\n\n          \n\n\nOverview of Helm and JKube\nKubernetes has been here for a while now, and more and more organizations are showing interest in the platform. Java developers are becoming inc…",
          "link": "https://developers.redhat.com/articles/2022/04/14/generate-helm-charts-your-java-application-using-jkube-part-1",
          "publishedOn": "2022-04-14T07:00:00.000Z",
          "wordCount": 1987,
          "title": "Generate Helm charts for your Java application using JKube, Part 1",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2020/08/2020_Jkube_A_1.png?itok=lO63zHTG"
        },
        {
          "id": "c37a4486-42a3-4a88-8237-f5fc1cf8248e",
          "author": "Mauro Vocale",
          "description": "Enterprise Java applications don't run in a vacuum, but interact with other components such as databases, load balancers, monitoring, and so forth. Eclipse JKube makes it easier to build Java applications and connect them with the resources they need when running as containers under Kubernetes. This article builds on a previous article, Build a bootable JAR for cloud-ready microservices, and shows some advanced uses of JKube. We'll build and deploy a bootable JAR using Red Hat JBoss Enterprise Application Platform (JBoss EAP) and Jakarta EE, and incorporate a PostgreSQL database and MicroProfile capabilities.\nHow JKube helps build and deploy Java applications\nThe previous article in this series listed all the commands needed to create the application's resources (buildConfig, deployment, s…",
          "link": "https://developers.redhat.com/articles/2022/04/13/deploy-java-application-red-hat-openshift-using-jkube",
          "publishedOn": "2022-04-13T07:00:00.000Z",
          "wordCount": 2973,
          "title": "Deploy a Java application on Red Hat OpenShift using JKube",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2019/06/cloud-native.jpg?itok=iI2a17Xk"
        },
        {
          "id": "b6f7bcb3-322c-4f97-a993-ee3073d528a3",
          "author": "Saumeya Katyal",
          "description": "Cluster administrators on Kubernetes need to create namespaces for multiple developer teams and limit their use of resources by provisioning those namespaces with resource quotas and limit ranges. In this article, you'll learn how to automate these tasks with Argo CD, and how to use either Kustomize or Helm charts to simplify the process. The result implements the fundamentals of DevOps and GitOps, whereby any changes to the repository update the deployed resources.\nThere are two types of configuration that administrators have to deal with are:\nResource quota: A Kubernetes object that controls the amount of CPU or memory consumed by a namespace. This quota can also limit the number of resources that can be created in a namespace.\nLimit range: This is used in Kubernetes along with resource …",
          "link": "https://developers.redhat.com/articles/2022/04/13/manage-namespaces-multitenant-clusters-argo-cd-kustomize-and-helm",
          "publishedOn": "2022-04-13T07:00:00.000Z",
          "wordCount": 2428,
          "title": "Manage namespaces in multitenant clusters with Argo CD, Kustomize, and Helm",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/ST_argocd_2xpng.png?itok=lh9rIudN"
        },
        {
          "id": "d6c1ecb7-29cf-4660-ae1b-6e3273b83bbe",
          "author": "David Malcolm",
          "description": "Building a static analyzer into the C compiler offers several advantages over having a separate tool, because the analyzer can track what the compiler and assembler are doing intimately. As a Red Hat employee, I work on GCC, the GNU Compiler Collection. Our static analyzer is still experimental but is making big strides in interesting areas, including a taint mode and an understanding of assembly-language code.\n\n \n\n \n \n\n \nMy work on adding static analysis has spanned the past three releases of GCC (versions 10, 11, and 12). The static analysis is enabled through the -fanalyzer option, and works together with several other options. This article describes what we've accomplished on static analysis in the upcoming major release of GCC, GCC 12, which is in feature-freeze and which I hope will …",
          "link": "https://developers.redhat.com/articles/2022/04/12/state-static-analysis-gcc-12-compiler",
          "publishedOn": "2022-04-12T07:00:00.000Z",
          "wordCount": 2971,
          "title": "The state of static analysis in the GCC 12 compiler",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2021/04/2021_GNU_GDB-Developer_tutorial_Featured_Article__A.png?itok=BQsRUf8N"
        },
        {
          "id": "058dd256-91a7-4914-b9eb-7cc4fd8a2040",
          "author": "Ben Evans",
          "description": "This article explains the basics of observability for developers. We’ll look at why observability should interest you, its current level of maturity, and what to look out for to make the most of its potential.\nTwo years ago, James Governor of the developer analyst firm Redmonk remarked, \"Observability is making the transition from being a niche concern to becoming a new frontier for user experience, systems, and service management in web companies and enterprises alike.\" Today, observability is hitting the mainstream.\nAs 2022 gets underway, you should expect to hear more about observability as a concern to take seriously. However, lots of developers are still unsure about what observability actually is—​and some of the descriptions of the subject can be vague and imprecise. Read on to get …",
          "link": "https://developers.redhat.com/articles/2022/04/12/observability-2022-why-it-matters-and-how-opentelemetry-can-help",
          "publishedOn": "2022-04-12T07:00:00.000Z",
          "wordCount": 3113,
          "title": "Observability in 2022: Why it matters and how OpenTelemetry can help",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/ST-containers_1x.png?itok=4n8AjGHb"
        },
        {
          "id": "ea6eecd0-497d-4025-85af-1dfed0eb1dfe",
          "author": "Red Hat Developer Editorial Team",
          "description": "Are you a developer who works with Red Hat technologies—or is curious to learn more about them? Join us at Red Hat Summit 2022 on May 10 and 11 to learn from the experts behind the code, and find the tools you need to help solve your most pressing tech challenges. Over these two days—and beyond—you'll get access to sessions and technical presentations on the topics most relevant to your interests and career. Registration is now open!\nOne of the most anticipated presentations is \"Ask the experts anything about developer product adoption,\" a live, interactive session that will stream at 12 p.m. Eastern Time on Wednesday, May 11. Red Hat Developer's Edson Yanaga, Mithun Dhar, and Ignacio Riesgo know all about increasing your developer productivity with developer tools for Red Hat OpenShift, R…",
          "link": "https://developers.redhat.com/articles/2022/04/11/red-hat-summit-2022-developer-preview",
          "publishedOn": "2022-04-11T07:00:00.000Z",
          "wordCount": 2155,
          "title": "Red Hat Summit 2022: A developer preview",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/Summit2022-card-image.png?itok=mf9c8rYb"
        },
        {
          "id": "77b82ab1-239d-4d61-9ee6-f3ccffd31756",
          "author": "Dominic Harries",
          "description": "One of the key choices you make when building an enterprise Node.js application is whether to use plain JavaScript or a dialect that supports type validation. While participating in the Node.js reference architecture effort, we've pulled together many internal Red Hat and IBM teams to discuss our experience with using both plain JavaScript and TypeScript. Our projects seem to be split between the two, and it's often \"love it or hate it\" when using types with JavaScript.\nTypeScript is in widespread use, particularly among enterprise developers coming from other languages such as Java. TypeScript was recently voted the third most loved programming language in StackOverflow's annual developer survey—far ahead of JavaScript itself.\nThis article covers why you might want to use TypeScript and h…",
          "link": "https://developers.redhat.com/articles/2022/04/11/introduction-nodejs-reference-architecture-part-8-typescript",
          "publishedOn": "2022-04-11T07:00:00.000Z",
          "wordCount": 1802,
          "title": "Introduction to the Node.js reference architecture, Part 8: TypeScript",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/nodejs-reference-architecture_2x.png?itok=rToXkOcY"
        },
        {
          "id": "06cbe08b-54e4-4f95-968d-0127abec6901",
          "author": "Mickael Maison",
          "description": "This is the 50th edition of the Kafka Monthly Digest, and covers what happened in the Apache Kafka community in March 2022.\nFor last month’s digest, please see Kafka Monthly Digest: February 2022.\nReleases\nOn March 14, I released Kafka 3.0.1. This bugfix version addresses 29 JIRA tickets, including a few blockers. For more details, see the release notes or the release plan.\nTwo upcoming releases are in progress:\n\n3.1.1: On March 9, Tom Bentley volunteered to run the Kafka 3.1.1 bugfix release. It is expected to release in April and you can find the release plan on the Kafka wiki.\n\n\n3.2.0: The release process continues for this version. The feature freeze happened on March 16 and Bruno Cadonna cut the 3.2 branch on March 21. The first release candidate is expected in mid-April. For more det…",
          "link": "https://developers.redhat.com/articles/2022/04/07/kafka-monthly-digest-march-2022",
          "publishedOn": "2022-04-07T07:00:00.000Z",
          "wordCount": 958,
          "title": "Kafka Monthly Digest: March 2022",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/kafka-event-driven_1x%20%284%29.png?itok=s3HC0Lad"
        },
        {
          "id": "f6ca6909-f9d0-4fc8-873e-9f17b651b575",
          "author": "Wanja Pernath",
          "description": "Helm is a package manager for Kubernetes. Helm uses a packaging format called charts, which include all of the Kubernetes resources that are required to deploy an application, such as deployments, services, ingress, and so on. Helm charts are very useful for installing applications and performing upgrades on a Kubernetes cluster.\nIn chapter 3 of my e-book Getting GitOps: A Practical Platform with OpenShift, Argo CD and Tekton, I discuss the basics of creating and using Helm charts. I also dig into the the use case of creating a post-install and post-upgrade job.\nHowever, that chapter provided a very basic example that focused only on what's necessary to create and deploy a Helm chart. This article will demonstrate some more advanced techniques to create a chart that could be installed more…",
          "link": "https://developers.redhat.com/articles/2022/04/07/3-ways-install-database-helm-charts",
          "publishedOn": "2022-04-07T07:00:00.000Z",
          "wordCount": 2350,
          "title": "3 ways to install a database with Helm charts",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/helm.png?itok=J2wJxK91"
        }
      ]
    },
    {
      "title": "edykim.com 블로그 RSS 피드",
      "feedUrl": "https://edykim.com/ko/feed.xml",
      "siteUrl": "https://edykim.com",
      "articles": [
        {
          "id": "https://edykim.com/ko/post/landscaping-backyard-in-california/",
          "author": null,
          "description": "…",
          "link": "https://edykim.com/ko/post/landscaping-backyard-in-california/",
          "publishedOn": "2022-04-24T19:06:04.000Z",
          "wordCount": 937,
          "title": "뒷마당 조경 과정 정리",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Eli Bendersky's website",
      "feedUrl": "https://eli.thegreenplace.net/feeds/all.atom.xml",
      "siteUrl": "https://eli.thegreenplace.net/",
      "articles": [
        {
          "id": "https://eli.thegreenplace.net/2022/a-faster-lexer-in-go/",
          "author": null,
          "description": "<p>It's been a while since I've last <a class=\"reference external\" href=\"https://eli.thegreenplace.net/2014/03/27/rewriting-the-lexer-benchmark-in-go\">rewritten my favorite lexical analyzer</a>\n:-) That post is the last in a series implementing a lexer for the <a class=\"reference external\" href=\"https://llvm.org/docs/TableGen/\">TableGen\nlanguage</a> in a variety of programming\nlanguages, using multiple techniques. The last lexer written, in Go, was very\nfast indeed - processing 1 MiB of …</p>",
          "link": "https://eli.thegreenplace.net/2022/a-faster-lexer-in-go/",
          "publishedOn": "2022-05-04T02:53:00.000Z",
          "wordCount": 2242,
          "title": "A faster lexer in Go",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Embedded Artistry",
      "feedUrl": "https://embeddedartistry.com/feed/",
      "siteUrl": "https://embeddedartistry.com",
      "articles": [
        {
          "id": "https://embeddedartistry.com/?p=20850",
          "author": "Phillip Johnston",
          "description": "2 May 2022 by Phillip JohnstonWe were recently asked this question: Does anyone read the Embedded Artistry blog? They used to post regularly but seems the blog hasn’t updated since January. The quietness of the blog section is misleading – we still publish new content on a weekly basis! Each area of the website has … \nContinue reading \"Q&A: What Happened to the Embedded Artistry blog?\"\nThe post Q&A: What Happened to the Embedded Artistry blog? appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2022/05/02/qa-what-happened-to-the-embedded-artistry-blog/",
          "publishedOn": "2022-05-02T16:00:00.000Z",
          "wordCount": 876,
          "title": "Q&A: What Happened to the Embedded Artistry blog?",
          "imageUrl": "https://c2y6x2t8.rocketcdn.me/wp-content/uploads/2021/05/cropped-embedded_artistry_transparent_with_mark_half.png"
        },
        {
          "id": "https://embeddedartistry.com/?p=20768",
          "author": "Phillip Johnston",
          "description": "14 April 2022 by Phillip JohnstonEmbedded Artistry and Memfault are joining forces to host a quarterly embedded discussion panel that is focused on the technical aspects of building embedded systems at scale. We will be featuring guest panel members who are at the cutting edge of embedded development. Our goal is to spread beneficial techniques … \nContinue reading \"Building Embedded Systems at Scale with Device Metrics\"\nThe post Building Embedded Systems at Scale with Device Metrics appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2022/04/14/building-embedded-systems-at-scale-with-device-metrics/",
          "publishedOn": "2022-04-14T18:48:36.000Z",
          "wordCount": 518,
          "title": "Building Embedded Systems at Scale with Device Metrics",
          "imageUrl": "https://c2y6x2t8.rocketcdn.me/wp-content/uploads/2021/05/cropped-embedded_artistry_transparent_with_mark_half.png"
        }
      ]
    },
    {
      "title": "Embedded.com",
      "feedUrl": "https://www.embedded.com/feed/",
      "siteUrl": "https://www.embedded.com",
      "articles": [
        {
          "id": "https://www.embedded.com/?p=4474592",
          "author": "Mark Thoren and Cristina Șuteu",
          "description": "This article focuses on the noise of individual signal chain elements, modeling them with Python/SciPy and LTspice and verifying the results using Python. Any application...\nThe post Using Python to simplify noise analysis of mixed-mode signal chains appeared first on Embedded.com.",
          "link": "https://www.embedded.com/using-python-to-simplify-noise-analysis-of-mixed-mode-signal-chains/",
          "publishedOn": "2022-05-03T16:56:53.000Z",
          "wordCount": 6944,
          "title": "Using Python to simplify noise analysis of mixed-mode signal chains",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/05/2205adi-python_fig-01.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474529",
          "author": "Michel Chabroux",
          "description": "There is a need to evolve our relationship with the cloud specifically for the device world. Let’s call that “the three P’s”: perception, packaging, and...\nThe post The future of cloud convergence and the three P’s appeared first on Embedded.com.",
          "link": "https://www.embedded.com/the-future-of-cloud-convergence-and-the-three-ps/",
          "publishedOn": "2022-05-03T12:27:35.000Z",
          "wordCount": 2449,
          "title": "The future of cloud convergence and the three P’s",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/05/cloud_abstract-.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474597",
          "author": "Vikram Shrivastava",
          "description": "Well-designed voice control can feel omnipresent with the capability to hear around corners and through walls. This requires several design elements to be considered when building VUI-enabled products.\nThe post Voice control isn’t magic, it’s design appeared first on Embedded.com.",
          "link": "https://www.embedded.com/voice-control-isnt-magic-its-design/",
          "publishedOn": "2022-05-03T10:33:00.000Z",
          "wordCount": 2441,
          "title": "Voice control isn’t magic, it’s design",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2020/01/2001cevaf0.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474514",
          "author": "Nitin Dahad",
          "description": "The latest news from the embedded world.\nThe post embedded news: connected syringes, smart farms and more appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-news-connected-syringes-smart-farms-and-more/",
          "publishedOn": "2022-04-29T13:09:29.000Z",
          "wordCount": 2561,
          "title": "embedded news: connected syringes, smart farms and more",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/IAR-Systems-NTT-DOCOMO-Farm-Assist.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474533",
          "author": "Sally Ward-Foxton",
          "description": "Image camera–based techniques for computer vision are hugely inefficient, driving a need for alternative solutions, says one of the technology’s founding fathers. Is computer vision...\nThe post Neuromorphic sensing shifts computer vision focus appeared first on Embedded.com.",
          "link": "https://www.embedded.com/neuromorphic-sensing-shifts-computer-vision-focus/",
          "publishedOn": "2022-04-28T13:15:00.000Z",
          "wordCount": 3102,
          "title": "Neuromorphic sensing shifts computer vision focus",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/05/img20220503084934A-Shift-in-Computer-Vision-is-Co_1_w943_h751.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474502",
          "author": "Erik Carlberg",
          "description": "Version 5.1 of the Bluetooth specification introduced ‘direction finding’. This represents a very significant step forward when it comes to precise indoor positioning capabilities, promising to unlock game-changing products and services.\nThe post How Bluetooth direction finding can unlock precision indoor positioning appeared first on Embedded.com.",
          "link": "https://www.embedded.com/how-bluetooth-direction-finding-can-unlock-precision-indoor-positioning/",
          "publishedOn": "2022-04-28T11:22:46.000Z",
          "wordCount": 2833,
          "title": "How Bluetooth direction finding can unlock precision indoor positioning",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/u-blox-indoor-positioning-figure-1.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474539",
          "author": "Dan Jones",
          "description": "Selling IoT devices to enterprises is just not the same as flogging the latest iPhone to consumers. Even as we stumble into the second half...\nThe post Why hasn’t 5G–powered IoT taken off yet? appeared first on Embedded.com.",
          "link": "https://www.embedded.com/why-hasnt-5g-powered-iot-taken-off-yet/",
          "publishedOn": "2022-04-27T13:32:00.000Z",
          "wordCount": 2424,
          "title": "Why hasn’t 5G–powered IoT taken off yet?",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/05/5G-.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474487",
          "author": "Nitin Dahad",
          "description": "Arm announcements as part of its Total Solutions for IoT include new Corstone subsystems, new Cortex-M processor, new products supported on virtual hardware platform, and new Open IoT SDK Framework as part of Project Centauri.\nThe post Arm expands IoT solutions and adds to virtual hardware platform appeared first on Embedded.com.",
          "link": "https://www.embedded.com/arm-expands-iot-solutions-and-adds-to-virtual-hardware-platform/",
          "publishedOn": "2022-04-27T10:47:17.000Z",
          "wordCount": 2958,
          "title": "Arm expands IoT solutions and adds to virtual hardware platform",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/Arm-Total-Solutions-for-IoT-image.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474472",
          "author": "Brian Rodrigues",
          "description": "How developers can use an advanced wireless microcontroller with an embedded matrix vector processor to speed performance and reduce power consumption in machine-learning inference for...\nThe post Implementing accelerated machine-learning applications with an advanced MCU appeared first on Embedded.com.",
          "link": "https://www.embedded.com/implementing-accelerated-machine-learning-applications-with-an-advanced-mcu/",
          "publishedOn": "2022-04-26T22:03:58.000Z",
          "wordCount": 3775,
          "title": "Implementing accelerated machine-learning applications with an advanced MCU",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/04SiLabs_f4.png"
        },
        {
          "id": "https://www.embedded.com/?p=4474447",
          "author": "Nitin Dahad",
          "description": "The lightweight gesture algorithm can run on a low-power microcontroller and demands minimal system resources, so is easily integrated in an existing application.\nThe post ST offers touchless gesture control with new software for ToF sensor appeared first on Embedded.com.",
          "link": "https://www.embedded.com/st-offers-touchless-gesture-control-with-new-software-for-tof-sensor/",
          "publishedOn": "2022-04-25T14:50:17.000Z",
          "wordCount": 2179,
          "title": "ST offers touchless gesture control with new software for ToF sensor",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/STMicrolecetronics-gesture-control.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474439",
          "author": "Nitin Dahad",
          "description": "Lynx Software Technologies announced that its MOSA.ic platform now supports deployment of Google Anthos bare metal at the mission critical edge, enabling secure delivery of containerized software services from the cloud, such as Google Cloud Visual Inspection AI service, providing a validated solution for secure, video-based quality inspection.\nThe post Lynx’ Google Anthos bare metal support secures Kubernetes to cloud appeared first on Embedded.com.",
          "link": "https://www.embedded.com/lynx-google-anthos-bare-metal-support-secures-kubernetes-to-cloud/",
          "publishedOn": "2022-04-25T13:35:41.000Z",
          "wordCount": 2216,
          "title": "Lynx’ Google Anthos bare metal support secures Kubernetes to cloud",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/LYNX-MOSA.ic-Google-Anthos-Bare-Metal.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474437",
          "author": "Sagar Khare",
          "description": "Standalone PD controllers integrate most blocks into one IC and some even eliminate the need for an external MCU and customized firmware.  The USB Power...\nThe post How standalone power delivery controllers simplify USB-C PD design appeared first on Embedded.com.",
          "link": "https://www.embedded.com/how-standalone-power-delivery-controllers-simplify-usb-c-pd-design/",
          "publishedOn": "2022-04-25T11:50:45.000Z",
          "wordCount": 3554,
          "title": "How standalone power delivery controllers simplify USB-C PD design",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/04MaximInt_f1.png"
        },
        {
          "id": "https://www.embedded.com/?p=4474421",
          "author": "Nitin Dahad",
          "description": "Cadence’ new computational fluid dynamics (CFD) software suite claims better performance and accuracy for simulating performance of multiphysics systems.\nThe post Cadence CFD software provides 10x the accuracy of standard flow solvers appeared first on Embedded.com.",
          "link": "https://www.embedded.com/cadence-cfd-software-provides-10x-the-accuracy-of-standard-flow-solvers/",
          "publishedOn": "2022-04-22T17:39:29.000Z",
          "wordCount": 2191,
          "title": "Cadence CFD software provides 10x the accuracy of standard flow solvers",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/Cadence-Fidelity-CFD.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474400",
          "author": "Nitin Dahad",
          "description": "The latest news from the embedded world.\nThe post embedded news:  MCU toolchains, lifecycle management and more appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-news-mcu-toolchains-lifecycle-management-and-more/",
          "publishedOn": "2022-04-22T12:54:57.000Z",
          "wordCount": 2515,
          "title": "embedded news:  MCU toolchains, lifecycle management and more",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/Review-Display-Systems-RDS-USB-IO-Board.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474390",
          "author": "Nitin Dahad",
          "description": "AISIN uses the software to develop and integrate electronic control units (ECUs).\nThe post AISIN extends use of Siemens Capital VSTAR for ECUs appeared first on Embedded.com.",
          "link": "https://www.embedded.com/aisin-extends-use-of-siemens-capital-vstar-for-ecus/",
          "publishedOn": "2022-04-22T10:31:51.000Z",
          "wordCount": 1770,
          "title": "AISIN extends use of Siemens Capital VSTAR for ECUs",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/Siemens_AISIN_Capital_.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474380",
          "author": "Nitin Dahad",
          "description": "New Versal Premium with AI Engines essentially takes the AI engines block from the Versal AI Core ACAP and drops it into the Versal Premium to provide a combined adaptable hardware platform with a significant increase in signal processing capacity.\nThe post AMD-Xilinx upgrades Versal ACAP for extreme signal processing appeared first on Embedded.com.",
          "link": "https://www.embedded.com/amd-xilinx-upgrades-versal-acap-for-extreme-signal-processing/",
          "publishedOn": "2022-04-20T16:57:28.000Z",
          "wordCount": 2123,
          "title": "AMD-Xilinx upgrades Versal ACAP for extreme signal processing",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/Xilinx-Versal-Premium-with-AI-Engines.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474453",
          "author": "EDN Staff",
          "description": "Here is how engineers can identify the threats at each step of the IC production lifecycle and subsequently mitigate these threats. Today, supply chain security...\nThe post Fundamentals of security in the IC manufacturing lifecycle appeared first on Embedded.com.",
          "link": "https://www.embedded.com/fundamentals-of-security-in-the-ic-manufacturing-lifecycle/",
          "publishedOn": "2022-04-19T17:14:00.000Z",
          "wordCount": 4227,
          "title": "Fundamentals of security in the IC manufacturing lifecycle",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/img20220425010542A-primer-on-security-in-the-key-_2_w1280_h720.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474372",
          "author": "Nitin Dahad",
          "description": "The NPX6 NPU IP includes hardware and software support for multi-NPU clusters of up to eight NPUs to achieve 3500 TOPS with sparsity.\nThe post New Synopsys neural processor IP delivers 3,500 TOPs for AI SoCs appeared first on Embedded.com.",
          "link": "https://www.embedded.com/new-synopsys-neural-processor-ip-delivers-3500-tops-for-ai-socs/",
          "publishedOn": "2022-04-19T16:34:48.000Z",
          "wordCount": 2488,
          "title": "New Synopsys neural processor IP delivers 3,500 TOPs for AI SoCs",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/Synopsys-DesignWare-ARC-NPX6-NPU-featured.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474362",
          "author": "Klaus Lambertz",
          "description": "It is not without reason that the standards for safety-critical software development set precise requirements for test methods and test coverage. For a long time...\nThe post Measuring code coverage for embedded software appeared first on Embedded.com.",
          "link": "https://www.embedded.com/measuring-code-coverage-for-embedded-software/",
          "publishedOn": "2022-04-19T11:58:56.000Z",
          "wordCount": 2682,
          "title": "Measuring code coverage for embedded software",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/04verifysoft_F1_.png"
        },
        {
          "id": "https://www.embedded.com/?p=4474354",
          "author": "Nitin Dahad",
          "description": "The new LR1120 targets global geolocation applications, providing multi band LoRa and LR-FHSS communication over sub-GHz and 2.4GHz ISM bands as well as licensed S-Band for satellites.\nThe post Multi-band LoRa transceiver features S-band for global asset tracking appeared first on Embedded.com.",
          "link": "https://www.embedded.com/multi-band-lora-transceiver-features-s-band-for-global-asset-tracking/",
          "publishedOn": "2022-04-14T17:36:31.000Z",
          "wordCount": 2143,
          "title": "Multi-band LoRa transceiver features S-band for global asset tracking",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/Semtech-LoRa_LR1120.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474348",
          "author": "Nitin Dahad",
          "description": "Virtual turnkey platform allows engineers to develop application software before devices or evaluation boards are available, and multicore debug and trace tool lets users analyze and evaluate software as if it were running on an actual chip.\nThe post Renesas launches virtual development environment for automotive software appeared first on Embedded.com.",
          "link": "https://www.embedded.com/renesas-launches-virtual-development-environment-for-automotive-software/",
          "publishedOn": "2022-04-14T13:46:59.000Z",
          "wordCount": 2079,
          "title": "Renesas launches virtual development environment for automotive software",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/Renesas-virtual-development-environment-automotive-application.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474337",
          "author": "Nitin Dahad",
          "description": "The latest news from the embedded world.\nThe post embedded news: Bosch acquires Five, Sony’s sports tech ambition appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-news-bosch-acquires-five-sonys-sports-tech-ambition/",
          "publishedOn": "2022-04-14T12:01:37.000Z",
          "wordCount": 2916,
          "title": "embedded news: Bosch acquires Five, Sony’s sports tech ambition",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/Hawk-Eye-Innovations.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474319",
          "author": "Nitin Dahad",
          "description": "Broadcom’s new family of Wi-Fi 7 chips for enable will help implement the speed, latency and determinism, and features like multi-link operation offered by the new Wi-Fi standard.\nThe post Broadcom launches Wi-Fi 7 chips appeared first on Embedded.com.",
          "link": "https://www.embedded.com/broadcom-launches-wi-fi-7-chips/",
          "publishedOn": "2022-04-13T14:18:12.000Z",
          "wordCount": 3001,
          "title": "Broadcom launches Wi-Fi 7 chips",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/Broadcom-Wi-Fi-7-typical-access-point-block-diagram.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474365",
          "author": "Majeed Ahmad",
          "description": "The modern evolution of Wi-Fi shows why WiFi-7 is needed to bolster speed, reduce latency and manage determinism in highly immersive apps. Wi-Fi 7 is...\nThe post Chipsets brings Wi-Fi 7 to a broad range of wireless applications appeared first on Embedded.com.",
          "link": "https://www.embedded.com/chipsets-brings-wi-fi-7-to-a-broad-range-of-wireless-applications/",
          "publishedOn": "2022-04-13T12:18:00.000Z",
          "wordCount": 2335,
          "title": "Chipsets brings Wi-Fi 7 to a broad range of wireless applications",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/img20220419081550What-has-changed-in-the-design-j_1_w1280_h595.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474311",
          "author": "Nitin Dahad",
          "description": "Evaluation kit provides computer vision engineers with a tested solution for efficient technology onboarding and rapid application prototyping and development.\nThe post Eval kit for Sony sensor featuring Prophesee event-based vision tech appeared first on Embedded.com.",
          "link": "https://www.embedded.com/eval-kit-for-sony-sensor-featuring-prophesee-event-based-vision-tech/",
          "publishedOn": "2022-04-13T11:22:56.000Z",
          "wordCount": 2029,
          "title": "Eval kit for Sony sensor featuring Prophesee event-based vision tech",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/PROPHESEE-EVK4-HD-Top-A.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474304",
          "author": "Nitin Dahad",
          "description": "Falsification of GNSS signals can seriously impact any application relying on precise navigation and timing synchronization. OSNMA contributes to increasing the resilience of civil GNSS signals against such possible threats.\nThe post Septentrio adds OSNMA anti-spoofing security to GNSS receivers appeared first on Embedded.com.",
          "link": "https://www.embedded.com/septentrio-adds-osnma-anti-spoofing-security-to-gnss-receivers/",
          "publishedOn": "2022-04-12T16:22:46.000Z",
          "wordCount": 2102,
          "title": "Septentrio adds OSNMA anti-spoofing security to GNSS receivers",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/Septentrio-mosaic-X5-high-precision-GNSS-module-receiver.png"
        },
        {
          "id": "https://www.embedded.com/?p=4474299",
          "author": "Nitin Dahad",
          "description": "System on module products based on Qualcomm Snapdragon processors enable intelligent food delivery robots.\nThe post Thundercomm SOMs enhance food delivery robots appeared first on Embedded.com.",
          "link": "https://www.embedded.com/thundercomm-soms-enhance-food-delivery-robots/",
          "publishedOn": "2022-04-12T14:56:20.000Z",
          "wordCount": 1769,
          "title": "Thundercomm SOMs enhance food delivery robots",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/Pudu-Robotics-PUDU-D1.jpg"
        },
        {
          "id": "https://www.embedded.com/?p=4474285",
          "author": "Ang Cui",
          "description": "Embedded devices need more ransomware protection — right now. But it will require significant time and investment. OT systems are an established target for ransomware,...\nThe post Embedded devices remain vulnerable to ransomware threats appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-devices-remain-vulnerable-to-ransomware-threats/",
          "publishedOn": "2022-04-11T15:59:20.000Z",
          "wordCount": 2575,
          "title": "Embedded devices remain vulnerable to ransomware threats",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/hacking-.png"
        },
        {
          "id": "https://www.embedded.com/?p=4474278",
          "author": "Nick Heaton",
          "description": "System-level verification objectives raise a concern that validation might only be possible after the design and drivers are mostly fully assembled and debugged but waiting for the design to be finished before checking compliance isn’t helpful either.\nThe post Accelerating server-based system architecture compliance testing through emulation appeared first on Embedded.com.",
          "link": "https://www.embedded.com/accelerating-server-based-system-architecture-compliance-testing-through-emulation/",
          "publishedOn": "2022-04-09T12:49:54.000Z",
          "wordCount": 3298,
          "title": "Accelerating server-based system architecture compliance testing through emulation",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/04cadence_f1_thumb.png"
        },
        {
          "id": "https://www.embedded.com/?p=4474233",
          "author": "Nitin Dahad",
          "description": "The latest news from the embedded world. \nThe post embedded news: smart displays, smart badges and more appeared first on Embedded.com.",
          "link": "https://www.embedded.com/embedded-news-smart-displays-smart-badges-and-more/",
          "publishedOn": "2022-04-08T16:26:09.000Z",
          "wordCount": 2549,
          "title": "embedded news: smart displays, smart badges and more",
          "imageUrl": "https://www.embedded.com/wp-content/uploads/2022/04/MIKROE-mikromedia-range.jpg"
        }
      ]
    },
    {
      "title": "EmbeddedRelated.com Blogs",
      "feedUrl": "https://www.embeddedrelated.com/blogs_rss.php",
      "siteUrl": "https://www.embeddedrelated.com/blogs.php",
      "articles": [
        {
          "id": "https://www.embeddedrelated.com/showarticle/1450.php",
          "author": null,
          "description": "Less than a week to go before the conference! Check out our 2022 Embedded Online Conference promo video, featuring (in order of appearance) Helen Leigh, Peter McLaughlin, Jack Ganssle, Tyler Hoffman, Steve Branam, Colin O'Flynn, Miro Samek, Henk Muller, Jacob Beningo, Harrison Donahue, Kate Stewart, Clive (Max) Maxfield, Don Wilcher, Adam Taylor, and Jean Labrosse.\r\n\r\nIf you haven't...",
          "link": "https://www.embeddedrelated.com/showarticle/1450.php",
          "publishedOn": "2022-04-19T14:09:47.000Z",
          "wordCount": 538,
          "title": "New Promo Video for the 2022 Embedded Online Conference",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1449.php",
          "author": null,
          "description": "With the Embedded Online Conference only a couple of weeks away, we are now doing a final push to ensure that as many engineers as possible who could benefit from the conference are aware of it. \r\n\r\nIf you'd like to help us spread the word, not only will you make our day, but you'll also earn a chance to win one of TWO Saleae Logic Pro 8.   ...",
          "link": "https://www.embeddedrelated.com/showarticle/1449.php",
          "publishedOn": "2022-04-08T14:44:09.000Z",
          "wordCount": 727,
          "title": "2022 Embedded Online Conference - Final Push!",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Better Embedded System SW",
      "feedUrl": "https://feeds.feedburner.com/BetterEmbeddedSystemSw",
      "siteUrl": "http://betterembsw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Google Developers Blog",
      "feedUrl": "https://feeds.feedburner.com/GDBcode",
      "siteUrl": "http://developers.googleblog.com/",
      "articles": [
        {
          "id": "http://developers.googleblog.com/2022/04/what-is-black-and-white-and-read-all.html",
          "author": null,
          "description": "@import url('https://fonts.googleapis.com/css2?family=Noto+Emoji:wght@300..700&display=swap');       \nNoto emoji, a new black and white emoji font with less color, may gain us more in the long run\nPosted by Jennifer Daniel, Creative Director - Emoji & Expression\n         \nIn 1999 — back when Snake 🐍  was the best thing about your phone 📱 — there were three phone carriers in Japan 🗾 . On these phones were tiny, beautiful pictures called emoji (meaning “picture” and “character”  in Japanese 🥰). These 176 images were very simple — think 8-bit tech — and as a result were exquisitely abstract and tremendously useful when texting ✨ Twenty years later 👶🕛🕐🕑🕒🕓🕔🕕🕖🕗🕘🕙🕚🧓, emoji are a global phenomenon 🌎. Now, our phones have fancy retina screens and somewhere along the way an import…",
          "link": "http://developers.googleblog.com/2022/04/what-is-black-and-white-and-read-all.html",
          "publishedOn": "2022-04-29T17:02:00.001Z",
          "wordCount": 815,
          "title": "What is black and white and read all over?",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhyEAObQmHIDnGMSeSf8LU-BKySxgfLuHm0fuZwoOHWyZR70QbY8oY1pqGYpqHouyKnQWyjWJEFn9hkmltVnHXkE-a2oRhwu0QYq7J1R4Etu80HLMwX5A42wYkO0nxViDW5JnjrEubALHNxCNAchpv3vhqH-m2w0moaSoPzMUxoc8OoeWBpSke_HCal/w1200-h630-p-k-no-nu/image1.gif"
        },
        {
          "id": "http://developers.googleblog.com/2022/04/how-can-app-engine-users-take-advantage-of-cloud-functions.html",
          "author": null,
          "description": "Posted by Wesley Chun (@wescpy), Developer Advocate, Google Cloud\n \n\n\n\n\n\n Introduction\n  \nRecently, we discussed containerizing App Engine apps for Cloud Run, with or without Docker. But what about Cloud Functions… can App Engine users take advantage of that platform somehow? Back in the day, App Engine was always the right decision, because it was the only option. With Cloud Functions and Cloud Run joining in the serverless product suite, that's no longer the case. \nBack when App Engine was the only choice, it was selected to host small, single-function apps. Yes, when it was the only option. Other developers have created huge monolithic apps for App Engine as well… because it was also the only option. Fast forward to today where code follows more service-oriented or event-driven architec…",
          "link": "http://developers.googleblog.com/2022/04/how-can-app-engine-users-take-advantage-of-cloud-functions.html",
          "publishedOn": "2022-04-28T17:00:00.001Z",
          "wordCount": 1007,
          "title": "How can App Engine users take advantage of Cloud Functions?",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiAiBu3QUg8F9ZhTGFDpM1eMvuSVY2xkQ86J-v_w51yTvrrOEhMi8_aRJuhesQB2ktGcCC7lBQfMeshb-_3CEkPviqiWXm3QCZkei8q0r0lR1C_M6MpOApHAWfneRqnLMP-DWg8Cg0u7EeYkulyWqX_tMZLLt2RQtQAnvNDgXbLJyaeMs5x-SJ9qWsx/w1200-h630-p-k-no-nu/Google-Dev-How-can-app-engine-users-take-advantage-of-cloud-functions-social-v3.jpg"
        },
        {
          "id": "http://developers.googleblog.com/2022/04/how-gdsc-students-are-using-their.html",
          "author": null,
          "description": "Posted by Laura Cincera, Program Manager Google Developer Student Clubs, Europe \n \n \nRevealing character in moments of crisis\nThe conflict in Ukraine is a humanitarian crisis that presents complex challenges. During this time of uncertainty, communities of student developers are demonstrating extraordinary leadership skills and empathy as they come together to support those affected by the ongoing situation. Student Patricijia Čerkaitė and her Google Developer Student Club (GDSC) community at the Eindhoven University of Technology in the Netherlands organized Code4Ukraine, an international hackathon that brought diverse groups of over 80 student developers together on March 3-4, 2022, to develop technology solutions to support people affected by the conflict in Ukraine.  \nEven far from the…",
          "link": "http://developers.googleblog.com/2022/04/how-gdsc-students-are-using-their.html",
          "publishedOn": "2022-04-27T17:05:00.005Z",
          "wordCount": 857,
          "title": "How GDSC students are using their skills to support communities in Ukraine",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjooMJGPx30hjTh52bRE028W-pIR8q1y0aG87aDkBjsJoeOf3WBXWrQcjfmMj_ODbxxjN1oDGvg6QpRfj4zVE6Hzek9uQ7mM15caSWoYdq5p7JGV3ETVl9gZvh75Wea1HlS08QvlmVYM0gAAeveYGEO1KOmisd8Q92LHWfW5hAlKaDivvOEtVxCZ6CU/w1200-h630-p-k-no-nu/GDev-StudentSkillsSupportUkraine_1234x802.png%20"
        },
        {
          "id": "http://developers.googleblog.com/2022/04/gde-community-highlight-nishu-goel.html",
          "author": null,
          "description": "Posted by Monika Janota, Community Manager\n \n     \nNishu Goel is a renowned web engineer from India, Google Developer Expert for Angular and web technologies, Microsoft Most Valuable Professional. She’s the author of Step by Step Angular Routing (BPB, 2019) and A Hands-on Guide to Angular (Educative, 2021) as well as the author of Web Almanac 2021 JavaScript chapter. Nishu currently works at epilot GmbH as a full stack engineer. She told us about her community involvement, career plans and the best ways to learn web development. \nMonika: Let’s start with your story. What inspired you to become a developer and take on an active role within dev communities? \nNishu: I got my bachelor’s degree in computer science, we studied data structures, and that’s where the interest in programming started…",
          "link": "http://developers.googleblog.com/2022/04/gde-community-highlight-nishu-goel.html",
          "publishedOn": "2022-04-26T17:00:00.001Z",
          "wordCount": 1577,
          "title": "GDE community highlight: Nishu Goel",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjaFkAfpdT5HUBUkUw-3xiMtRQvR81eZwcRGxEFmYCeKpSE6QDeBfFJhiyTo45bGIvTSdvUsG627UP43GvKzNdWmGiWcqNFI2p4PpFJytoWG1WZzOV2RXnXsh8vw_xRWi1bef2ATOMbHY44PV2QjbUlgVGpEpHEBXAqHy8bC5MX3TXDFzY1k-ea3SHC/w1200-h630-p-k-no-nu/Google-Dev-Nishu-Goel-social.png"
        },
        {
          "id": "http://developers.googleblog.com/2022/04/exploring-accessibility-community.html",
          "author": null,
          "description": "Posted by Alessandro Palmieri, Regional Lead, Europe, Google Developer Groups\n \n      \nYou never quite know exactly how someone else experiences the world - but making an effort to connect and understand others remains a hallmark of a strong community. In November 2019, Google Developer Group Pescara invited backend developer Filippo Tenaglia to speak at a local DevFest program, as part of the global developer event. The group turned the lights down and connected Filippo’s PC to the room’s speakers, and Filippo told attendees about his life as a visually impaired developer. He let them hear what he hears when he works with the code and let them hear the different speech synthesizers he uses: the one he uses to browse on the Internet, as well as the one that he uses to read source code, tha…",
          "link": "http://developers.googleblog.com/2022/04/exploring-accessibility-community.html",
          "publishedOn": "2022-04-21T17:00:00.001Z",
          "wordCount": 755,
          "title": "Exploring accessibility through community with Pescara’s Google Developer Group",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgIw1KtkkRp_C7dRocBG3me55iHdMwDamd-R6R_Uf7ET0agWUNnkHqWKI9USqY4jnYChTc6V1gqWeTO7rABQ8yZNbGyT7xXatuJmOb_rkeZ4pCoeaGuNl4hO7gYj3OGErWyaZywCxItF182TZYdMcRIbnStK0cUoxGVizWPBHLWMdSv0gZxjGGbOATW/w1200-h630-p-k-no-nu/image1.png"
        },
        {
          "id": "http://developers.googleblog.com/2022/04/MLCommunities2022Q1.html",
          "author": null,
          "description": "Posted by Nari Yoon, Hee Jung, DevRel Community Manager / Soonson Kwon, DevRel Program Manager\n\n\n Let’s explore highlights and accomplishments of vast Google Machine Learning communities over the first quarter of the year! We are enthusiastic and grateful about all the activities that the communities across the globe do. Here are the highlights! \nML Ecosystem Campaign Highlights\n \n   \nML Olympiad is an associated Kaggle Community Competitions hosted by Machine Learning Google Developers Experts (ML GDEs) or TensorFlow User Groups (TFUGs) sponsored by Google. The first round was hosted from January to March, suggesting solving critical problems of our time. Competition highlights include Autism Prediction Challenge, Arabic_Poems, Hausa Sentiment Analysis, Quality Education, Good Health and …",
          "link": "http://developers.googleblog.com/2022/04/MLCommunities2022Q1.html",
          "publishedOn": "2022-04-15T17:05:00.000Z",
          "wordCount": 807,
          "title": "Machine Learning Communities: Q1 ‘22 highlights and achievements",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgsnXcRBS1GjOHNOdAiF4bMiyHyxCyY3r6clfeLTyEWrZq7j_yY6wQfwR4nz-RfYcMyku126kzZc9Nwz8ijTpAlhMG9pNV-hVzC8Zux7k33q2D_p1pA1mStbQIHBxVc8EIMtpCi-aY_m6nXMGWyXqyhNhfHOq3uCZ6fFxJmQ6RqOBF_dkTMjX1AJCos/w1200-h630-p-k-no-nu/GoogleDev-Machine-Learning-Communities-Q1-22-Hightlights-Achievements%20%281%29.png"
        },
        {
          "id": "http://developers.googleblog.com/2022/04/getting-started-is-hardest-part-find.html",
          "author": null,
          "description": "Posted by Kara Ireland, Technical Writer & Charles Maxson, Developer Advocate\n \n\nGoogle Apps Script is a hosted JavaScript development environment that makes it easy for anyone to build custom business solutions across several Google products.  Figuring out where to begin can be a hurdle for such an expansive tool, so we've recently released 10 new inspirational sample solutions to help you get started. These additions bolster the Apps Script documentation, which now hosts more than 30 sample solutions. \nApps Script welcomes developers of all skill levels, from beginners to professionals. We’re consistently impressed with the creative and innovative ways developers have automated business processes with Apps Script–from published add-ons that help millions of users to simple automations th…",
          "link": "http://developers.googleblog.com/2022/04/getting-started-is-hardest-part-find.html",
          "publishedOn": "2022-04-14T17:03:00.000Z",
          "wordCount": 928,
          "title": "Getting started is the hardest part: Find inspiration with Apps Script samples",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgl_YdLvTVXdFxqI9AVIlnEd2blqN1oUPeisJAiseCWCyA9_3WM7Met5CPi2hO8RAJ_AK8h55f1eQ85_QP1u4vPZFFGooFRhnTv3Cr9CPs2-IuAXvdKzHrnnXf-5nCfE35fa6KG4iurLmojyg4-Mu8inhxihSvsJPS2UwEd5KPJxk0HK9moI-DwTxQD/w1200-h630-p-k-no-nu/GoogleDev_SampleSolutionsForGoogleAppsScript_4209x1253.png"
        },
        {
          "id": "http://developers.googleblog.com/2022/04/apps-script-connector-for-appsheet.html",
          "author": null,
          "description": "Posted by Mike Procopio, Senior Staff Software Engineer \n \n \nThis week, we launched the Apps Script connector for AppSheet, which now makes it possible to call Apps Script code functions from a no-code AppSheet app. This greatly extends the abilities of AppSheet apps by letting them access the power that Apps Script provides. For example, an AppSheet app can now use Apps Script to automate workflows with Google Workspace using the Workspace APIs for Drive, Docs, Sheets, and Admin SDK, and more – as well as other Google services like YouTube, Google Analytics, and BigQuery. \nGoogle AppSheet\n  \nAppSheet is Google’s platform for building no-code custom apps and workflows to automate business processes. It lets app creators build and deploy end-to-end apps and automations without writing code.…",
          "link": "http://developers.googleblog.com/2022/04/apps-script-connector-for-appsheet.html",
          "publishedOn": "2022-04-13T17:00:00.002Z",
          "wordCount": 1855,
          "title": "Announcing the Apps Script connector for AppSheet: Automate workflows for Google Workspace",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjcve9yUjZ9jawGYllLXQ26xaNP2A4b2SJ8HUZJFtQXhPaWgo-dTKBpfxKiKjd6SJar3SJ9aQ8PpCuXNVWpi6bPUoTLSAdyhS_7bCHWhDNeXEqprTV9bm4uQWL6a8oTUlMENZO9P9iKrDVAGG36Q170BD3c3oHLCrlUDGXtCyzpXOmIwkWvJbsgJUNn/w1200-h630-p-k-no-nu/ZVkDZr9sSK5vbou.png"
        },
        {
          "id": "http://developers.googleblog.com/2022/04/dev-library-open-source.html",
          "author": null,
          "description": "Posted by Ankita Tripathi, Community Manager (Dev Library) \n   \n   \n\nWitnessing a plethora of open-source enthusiasts in the developer ecosystem in recent years gave birth to the idea of Google’s Dev Library. The inception of the platform happened in June 2021 with the only objective of giving visibility to developers who have been creating and building projects relentlessly using Google technologies. But why the Dev Library? \nWhy Dev Library?\n  \nOpen-source communities are currently at a boom. The past 3 years have seen a surge of folks constantly building in public, talking about open-source contributions, digging into opportunities, and carving out a valuable portfolio for themselves. The idea behind the Dev Library as a whole was also to capture these open-source projects and leverage …",
          "link": "http://developers.googleblog.com/2022/04/dev-library-open-source.html",
          "publishedOn": "2022-04-11T15:00:00.004Z",
          "wordCount": 1147,
          "title": "How is Dev Library useful to the open-source community?",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhxbAer02RIWNeZaNA7OON_bShxhB4MwhJXm57EcUxHNa8_af1Rtlplqims73Si860_76iAeoR5Boclw1PZ1dq5obfSZ64xTDGTwBV43TCx7xqZkAPaXGENmBZBjeTL_s93vmAvrRHSwQUrMUTFOB2qzOjbUK6ULIbIQPJXbgi8SHuPs2klYUayeWLD/w1200-h630-p-k-no-nu/GoogleDev_HowIsDevLibraryUsefulToOpenSource_1234x802-01.png"
        },
        {
          "id": "http://developers.googleblog.com/2022/04/use-oauth-20-tokens-on-your-website-app.html",
          "author": null,
          "description": "Posted by Peter Jacobsen, Technical Writer\n  \n\n OAuth 2.0 is an open standard authorization framework for token-based authorization on the internet. An OAuth 2.0 access token is a string that the OAuth 2.0 client uses to make requests to the resource server, and hides the user's identity or other information from the OAuth 2.0 client. Only use access tokens to make requests to the resource server. \nOffline refresh tokens\n  \nAccess tokens periodically expire and become invalid credentials for a related API request. If you requested offline access to the scopes associated with the token, you can refresh an access token without prompting the user for permission, even when the user isn't present. \nAs a best practice, set the expiration time for refresh tokens for a little longer than the acces…",
          "link": "http://developers.googleblog.com/2022/04/use-oauth-20-tokens-on-your-website-app.html",
          "publishedOn": "2022-04-08T17:25:00.000Z",
          "wordCount": 542,
          "title": "Use OAuth 2.0 tokens on your website, app, and servers",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEio3zJPrT2JfURt9DTg4FgTrohjquuezZ8khk4zH9zAlppBlrmy_d_xhpQV4zBLt9ii8-E9Z8XoZKmHs03PH5qf58n6oyEcKjCd5K4YIQ9LEzT7N5vO-xiU2eW60aT3dArjqG6-MMPryOHuiTbmfUAu3NEH7q4oS5Oz_0X6pYniVbdwwu-pXA7jYD_Z/w1200-h630-p-k-no-nu/Google%20Dev%20Use%20OAuth%20in%20your%20Site%20%281%29.png"
        },
        {
          "id": "http://developers.googleblog.com/2022/04/google-cloud-projects-tips-and-best.html",
          "author": null,
          "description": "By Peter Jacobsen, Google Technical Writer  \nLeast privilege\n  \nAlways apply the principle of least privilege when you provide access to Google Cloud resources. The best practice is to grant only the most limited predefined roles or custom roles that meet your needs.  \nFor more information, see Least privilege. \nGoogle Cloud billing alerts\n  \nSet up Google Cloud billing alerts for your projects at specified intervals for early warning of usage patterns, and to help reduce costs. \nFor more information, see Create, edit, or delete budgets and budget alerts. \nAPI quotas\n  \nAPI quotas protect the Google infrastructure from excessive API requests. Traffic is blocked when the level of requests reaches the daily API quota level or a per-user rate limit.  \nTo avoid disruptions due to an API quota …",
          "link": "http://developers.googleblog.com/2022/04/google-cloud-projects-tips-and-best.html",
          "publishedOn": "2022-04-06T17:02:00.000Z",
          "wordCount": 850,
          "title": "Google Cloud projects: Tips and best practices",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiGGCUcMC5sVWSXMvm8JPUVw7KHgYd-xZ-h8eknyJX0q-AiEEpP08mCQQGNJm6O5vT44ZPePtkzFsKOGBfr-12htfOuPJccLzUxuoL__PUFnJ-03Q3533noPKNSJfU04EHy0V4Tclh6CS4OwC0j-AV5chpmD-I6_hQb-Ij2l_NbJiCfQwMWzr5kSWlB/w1200-h630-p-k-no-nu/image2.png"
        },
        {
          "id": "http://developers.googleblog.com/2022/04/gdsc-indias-android-study-jams-boost.html",
          "author": null,
          "description": "Posted by Tanvi Somani, Program Manager - Regional Lead, Google Developer Student Clubs, Google Developer Relations India \n \n   \nAndroid Study Jams, hosted by Google Developer Student Clubs (GDSC) chapters across the globe and in India, leverage peer-to-peer teaching to train a new generation of student Android developers. The program aims to help student developers build their careers and put them on a solid path towards earning an Associate Android Developers Certification. Three students from the GDSC community in India, Amsavarthan Lv, Rishi Balamurugan, and Sanjay S. went the extra kilometer to earn their certifications.  \nMeet the newly certified Android developers \n“From childhood onward, I was inspired by my brother to learn to program. He’s also a certified Android developer,” say…",
          "link": "http://developers.googleblog.com/2022/04/gdsc-indias-android-study-jams-boost.html",
          "publishedOn": "2022-04-05T17:06:00.001Z",
          "wordCount": 882,
          "title": "GDSC India’s Android Study Jams Boost Student Career Outcomes",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgxaUl5ByUaVIH6a1h7J6VOqBDaWOziiwM8djsPixG6IO6BNQWy4Ej23c8_7x-pVqaHMpcsgEs-yPI0pkcr-ZgngQGRQkJxE46p--m8MBHYtIee3_ddownxXTIvapFELMgXcgbs5AA4oKjOEXTAcwLJaUETuF0XBbBSJ3R5DlLOzCJEdJu47aFFkhXn/w1200-h630-p-k-no-nu/image2.png"
        }
      ]
    },
    {
      "title": "Many But Finite",
      "feedUrl": "https://feeds.feedburner.com/GustavoDuarte",
      "siteUrl": "https://manybutfinite.com/",
      "articles": []
    },
    {
      "title": "Krister Walfridsson’s old blog",
      "feedUrl": "http://feeds.feedburner.com/KristerWalfridssonsBlog",
      "siteUrl": "https://kristerw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Python Insider",
      "feedUrl": "https://feeds.feedburner.com/PythonInsider",
      "siteUrl": "https://pythoninsider.blogspot.com/",
      "articles": [
        {
          "id": "https://pythoninsider.blogspot.com/2022/04/the-last-python-311-alpha-3110a7-is.html",
          "author": null,
          "description": "Brrrrr… do you feel that? That’s the chill of beta freeze coming closer. Meanwhile, your friendly CPython release team doesn’t rest and we have prepared a shiny new release for you: Python 3.11.0a7.\nhttps://www.python.org/downloads/release/python-3110a7/\n\nMajor new features of the 3.11 series, compared to 3.10\nAmong the new major new features and changes so far:\n\n\nPEP 657 – Include Fine-Grained Error Locations in Tracebacks\nPEP 654 –  Exception Groups and except*\nPEP 673 –   Self Type\nPEP 646 –  Variadic Generics\nPEP 680– tomllib: Support for Parsing TOML in the Standard Library\nPEP 675– Arbitrary Literal String Type\nPEP 655– Marking individual TypedDict items as required or potentially-missing\nbpo-46752– Introduce task groups to asyncio\nThe Faster Cpython Project is already yielding some …",
          "link": "https://pythoninsider.blogspot.com/2022/04/the-last-python-311-alpha-3110a7-is.html",
          "publishedOn": "2022-04-06T10:33:00.002Z",
          "wordCount": 949,
          "title": "The last Python 3.11 alpha (3.11.0a7) is available",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "from www.viva64.com",
      "feedUrl": "http://feeds.feedburner.com/viva64-blog-en",
      "siteUrl": "https://pvs-studio.com",
      "articles": [
        {
          "id": "https://pvs-studio.com/en/blog/posts/0943/",
          "author": null,
          "description": "Welcome all developers and everyone who commiserate. Everyone commented their code at least once — that's for sure. Was it your code or someone else's? Were these comments useful? Or were they made to cheer up teammates and team leads at the next code review? Let's try to discuss a bit and find answers to these questions. Try to understand the motives of people who leave comments in their program. In this article, we focus on non-standard and funny comments. We have some really cool examples for you. Let's go!",
          "link": "https://pvs-studio.com/en/blog/posts/0943/",
          "publishedOn": "2022-05-03T21:00:00.000Z",
          "wordCount": 3683,
          "title": "Code comments as a work of art",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/0943_Code_comments/image1_thm_intoblank_1200x630.png"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/0942/",
          "author": null,
          "description": "Related variables are one of the main problems of static analysis. This article covers this topic and describes how PVS-Studio developers are fighting false positives caused by different relationships between variables.",
          "link": "https://pvs-studio.com/en/blog/posts/csharp/0942/",
          "publishedOn": "2022-04-27T21:00:00.000Z",
          "wordCount": 6141,
          "title": "PVS-Studio evolution: data flow analysis for related variables",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/0942_PVS_evolution_Data-Flow_analysis_related_variables/image1_thm_intoblank_1200x630.png"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0941/",
          "author": null,
          "description": "The PVS-Studio static analyzer is constantly evolving. We enhance various mechanisms, integrate the analyzer with game engines, IDEs, CI/CD instruments, and other systems and services. A few years ago, PVS-Studio learned to analyze Unreal Engine projects. However, one of the important mechanisms — suppression of analyzer messages (baselining, disabling warnings for existing code) — didn't work with Unreal Engine projects. This article is about why we didn't implement it immediately and how we finally did it.",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/0941/",
          "publishedOn": "2022-04-25T21:00:00.000Z",
          "wordCount": 2926,
          "title": "Unreal baselining: PVS-Studio's enhancements for Unreal Engine projects",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/0941_UnrealEngineBaseLining/image1_thm_intoblank_1200x630.png"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/0940/",
          "author": null,
          "description": "\"Use static analysis regularly, not just before releases... The earlier you find errors, the cheaper they are to fix...\" You probably heard this a hundred times. Today we'll answer the \"Why?\" question once again. An error from the Akka.NET project will assist us.",
          "link": "https://pvs-studio.com/en/blog/posts/csharp/0940/",
          "publishedOn": "2022-04-24T21:00:00.000Z",
          "wordCount": 1371,
          "title": "Why use static analysis? Exploring an error from Akka.NET",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/0940_AkkaNET_Error/image1_thm_intoblank_1200x630.png"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0939/",
          "author": null,
          "description": "Fun is fun, but extra caution never hurts anyone. What if it's not completely clear why some of the tips are terrible? Here you can find the relevant explanations.",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/0939/",
          "publishedOn": "2022-04-20T21:00:00.000Z",
          "wordCount": 8865,
          "title": "50 terrible coding tips for a C++ developer: an overview",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/0939_cpp_bad_advice_collection_explanation/image1_thm_intoblank_1200x630.png"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0938/",
          "author": null,
          "description": "Some developers may be dismissive of checks: they deliberately do not check whether the malloc function allocated memory or not. Their reasoning is simple — they think that there will be enough memory. And if there is not enough memory to complete operations, let the program crash. Seems like a bad approach, doesn't it? For a variety of reasons.",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/0938/",
          "publishedOn": "2022-04-19T21:00:00.000Z",
          "wordCount": 5220,
          "title": "Four reasons to check what the malloc function returned",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/0938_malloc_check/image1_thm_intoblank_1200x630.png"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/0937/",
          "author": null,
          "description": "Vulnerabilities produce enormous reputational and financial risks. That's why many companies are fascinated by security and desire to build a secure development life cycle (SSDLC). So, today we're going to discuss SAST — one of the SSDLC components.",
          "link": "https://pvs-studio.com/en/blog/posts/0937/",
          "publishedOn": "2022-04-18T21:00:00.000Z",
          "wordCount": 2560,
          "title": "SAST in Secure SDLC: 3 reasons to integrate it in a DevSecOps pipeline",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/0937_SAST_In_SSDLC/image1_thm_intoblank_1200x630.png"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0936/",
          "author": null,
          "description": "The PVS-Studio static analyzer encompasses the symbolic execution mechanism. And today we have a great opportunity to demonstrate how this feature helps find errors.",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/0936/",
          "publishedOn": "2022-04-17T21:00:00.000Z",
          "wordCount": 1411,
          "title": "How PVS-Studio prevents rash code changes, example N5",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/0936_Blender_prevents_rash_code_changes_N5/image1_thm_intoblank_1200x630.png"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0935/",
          "author": null,
          "description": "We present a new type of attack in which source code is maliciously encoded so that it appears different to a compiler and to the human eye. This attack exploits subtleties in text-encoding standards such as Unicode to produce source code whose tokens are logically encoded in a different order from the one in which they are displayed, leading to vulnerabilities that cannot be perceived directly by human code reviewers. 'Trojan Source' attacks, as we call them, pose an immediate threat both to first-party software and of supply-chain compromise across the industry. We present working examples of Trojan-Source attacks in C, C++, C#, JavaScript, Java, Rust, Go, and Python. We propose definitive compiler-level defenses, and describe other mitigating controls that can be deployed in editors, repositories, and build pipelines while compilers are upgraded to block this attack.",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/0935/",
          "publishedOn": "2022-04-14T21:00:00.000Z",
          "wordCount": 10984,
          "title": "Trojan Source: Invisible Vulnerabilities",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/0935_Trojan_Source/image1_thm_intoblank_1200x630.png"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/0934/",
          "author": null,
          "description": "Meet the latest PVS-Studio release — 7.18. This article will tell you about how we improved the analysis of modern C++, the search of security defects from the OWASP Top 10 list, and a new feature for embedded developers.",
          "link": "https://pvs-studio.com/en/blog/posts/0934/",
          "publishedOn": "2022-04-12T21:00:00.000Z",
          "wordCount": 1765,
          "title": "PVS-Studio 7.18: updates and enhancements",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/0934_Release_7_18/image1_thm_intoblank_1200x630.png"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/0933/",
          "author": null,
          "description": "Researchers from the University of Cambridge described a technique that allows inserting invisible adversarial code in the reviewed source texts. The attack (CVE-2021-42574) is called Trojan Source. It is based on text formatting that makes the code look different for compilers/interpreters and human code reviewers.",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/0933/",
          "publishedOn": "2022-04-11T21:00:00.000Z",
          "wordCount": 1872,
          "title": "Trojan Source attack for introducing invisible vulnerabilities",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/0933_Trojan_source/image1_thm_intoblank_1200x630.png"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/0932/",
          "author": null,
          "description": "Unity is one of the most popular game engines. It helps create many excellent cross-platform projects. It's been 4 years since the last time we checked Unity's source code. Time has come again to see what interesting things we can find.",
          "link": "https://pvs-studio.com/en/blog/posts/csharp/0932/",
          "publishedOn": "2022-04-07T21:00:00.000Z",
          "wordCount": 2925,
          "title": "PVS-Studio static analyzer to recheck Unity",
          "imageUrl": "https://cdn.pvs-studio.com/media/docx/blog/0932_Unity/image1_thm_intoblank_1200x630.png"
        }
      ]
    },
    {
      "title": "Future",
      "feedUrl": "https://future.a16z.com/feed/",
      "siteUrl": "https://future.a16z.com",
      "articles": [
        {
          "id": "https://future.a16z.com/?p=5802",
          "author": "Chris Power, Katherine Boyle, Marc Andreessen and Packy McCormick",
          "description": "These are edited highlights from a recent Clubhouse discussion among Hadrian founder and CEO Chris Power, a16z partners Katherine Boyle and Marc Andreessen, and Not Boring newsletter author Packy McCormick. The dialogue here is part of a broader discussion that touches on a number of issues related to launching a modern manufacturing business, including software... Read More\nThe post Why the Time Is Right to Disrupt Defense and Aerospace appeared first on Future.",
          "link": "https://future.a16z.com/why-the-time-is-right-to-disrupt-defense-and-aerospace/",
          "publishedOn": "2022-05-04T14:00:14.000Z",
          "wordCount": 4630,
          "title": "Why the Time Is Right to Disrupt Defense and Aerospace",
          "imageUrl": "https://future.a16z.com/wp-content/uploads/2022/05/V4_GenericTopic_Infrastructure.jpg"
        },
        {
          "id": "https://future.a16z.com/?p=5771",
          "author": "Amber Atherton",
          "description": "Increasingly, building a successful startup involves not only building a product that people can’t get enough of, but also building an engaged, loyal community around that product. Today, most founders are acutely aware of the value of community. In CMX’s 2021 Community Industry Report, 86% of respondents (community managers from 508 different companies) said community... Read More\nThe post To Start Building a Community, Master These Two Concepts appeared first on Future.",
          "link": "https://future.a16z.com/to-start-building-a-community-master-these-two-concepts/",
          "publishedOn": "2022-05-03T16:11:59.000Z",
          "wordCount": 1789,
          "title": "To Start Building a Community, Master These Two Concepts",
          "imageUrl": "https://future.a16z.com/wp-content/uploads/2022/05/CommunityEngagementFunnelExplainer-Facebook-1.jpg"
        },
        {
          "id": "https://future.a16z.com/?p=5729",
          "author": "Sari Azout",
          "description": "This is an edited version of a post that originally ran here. For most queries, Google search is pretty underwhelming these days. Google is great at answering questions with an objective answer, like “# of billionaires in the world” or “What is the population of Iceland?” It’s pretty bad at answering questions that require judgment... Read More\nThe post The Future of Search Is Boutique appeared first on Future.",
          "link": "https://future.a16z.com/the-future-of-search-is-boutique/",
          "publishedOn": "2022-05-02T14:00:29.000Z",
          "wordCount": 3099,
          "title": "The Future of Search Is Boutique",
          "imageUrl": "https://future.a16z.com/wp-content/uploads/2022/04/BoutiqueSearch-Linkedin.jpg"
        },
        {
          "id": "https://future.a16z.com/?p=5705",
          "author": "Sean Kim",
          "description": "Info Diet offers a peek into the personally curated feeds and media habits of the people shaping the future. In each installment, a different builder spends two days chronicling everything they read, follow, listen to, and watch in order to stay ahead of the curve. This time: Sean Kim, president and chief product officer at... Read More\nThe post Info Diet: Kajabi President Sean Kim appeared first on Future.",
          "link": "https://future.a16z.com/info-diet-sean-kim/",
          "publishedOn": "2022-04-29T15:00:02.000Z",
          "wordCount": 1979,
          "title": "Info Diet: Kajabi President Sean Kim",
          "imageUrl": "https://future.a16z.com/wp-content/uploads/2022/04/Info-Diet-Sean-Kim-FB-FINAL.jpg"
        },
        {
          "id": "https://future.a16z.com/?p=5703",
          "author": "Olivia Moore",
          "description": "Imagine you’re running a marketplace startup — let’s call it ACo — that allows consumers to sell spare items they have around the house. You notice after a few months that only 25% of your new sellers are coming back each month, but they’re selling just as much as they did in that first month.... Read More\nThe post Leaky Bucket or Layer Cake? Why You Can’t Ignore GMV Retention appeared first on Future.",
          "link": "https://future.a16z.com/gmv-retention-marketplace-metric/",
          "publishedOn": "2022-04-28T15:46:50.000Z",
          "wordCount": 2433,
          "title": "Leaky Bucket or Layer Cake? Why You Can’t Ignore GMV Retention",
          "imageUrl": "https://future.a16z.com/wp-content/uploads/2022/04/LeakyBucketRatio-Twitter-R2V1.jpg"
        },
        {
          "id": "https://future.a16z.com/?p=5386",
          "author": "John List and Derrick Harris",
          "description": "John List is chief economist at Walmart (a title he previously held at both Lyft and Uber) and a professor of economics at the University of Chicago. He recently published a book titled The Voltage Effect: How to Make Good Ideas Great and Great Ideas Scale. In this interview, List discusses some of the book’s... Read More\nThe post Will It Scale? Applying Data, Science, and Economics to the Art of Ideas appeared first on Future.",
          "link": "https://future.a16z.com/data-science-and-economics-art-of-ideas/",
          "publishedOn": "2022-04-22T14:00:48.000Z",
          "wordCount": 3725,
          "title": "Will It Scale? Applying Data, Science, and Economics to the Art of Ideas",
          "imageUrl": "https://future.a16z.com/wp-content/uploads/2022/04/00629-John-List-QA-Social-Facebook.jpg"
        },
        {
          "id": "https://future.a16z.com/?p=5669",
          "author": "Jocelynn Pearl",
          "description": "American biotech has traditionally been a centralized industry, with most companies clustered in a handful of cities and operating with teams of in-house scientists. When biotech first gained its footing in the 1980s, there were good reasons for its centralized structure, including geographic proximity to the universities supplying talent and intellectual property. But recent changes... Read More\nThe post A Guide to Decentralized Biotech appeared first on Future.",
          "link": "https://future.a16z.com/a-guide-to-decentralized-biotech/",
          "publishedOn": "2022-04-21T00:16:51.000Z",
          "wordCount": 2820,
          "title": "A Guide to Decentralized Biotech",
          "imageUrl": "https://future.a16z.com/wp-content/uploads/2022/04/DecentralizedBiotechExplainer-Linkedin.jpg"
        },
        {
          "id": "https://future.a16z.com/?p=5369",
          "author": "Frederic Kerrest",
          "description": "This is an excerpt from Zero to IPO: Over $1 Trillion of Actionable Advice from the World’s Most Successful Entrepreneurs by Frederic Kerrest, pp. 164-171, (McGraw Hill, April 2022). Kerrest co-founded Okta – an enterprise identity management company – in 2009 and currently serves as its executive vice chairperson and chief operating officer. I’ve heard a lot... Read More\nThe post Managing Your Mental Health While Running a Startup appeared first on Future.",
          "link": "https://future.a16z.com/managing-your-mental-health-while-running-a-startup/",
          "publishedOn": "2022-04-18T14:00:09.000Z",
          "wordCount": 2123,
          "title": "Managing Your Mental Health While Running a Startup",
          "imageUrl": "https://future.a16z.com/wp-content/uploads/2022/04/V3_GenericTopic_MetricsMindsets-1.png"
        },
        {
          "id": "https://future.a16z.com/?p=5354",
          "author": "Olivia Moore and Brandon Barros",
          "description": "2022 marks our third year releasing the Marketplace 100, a ranking of the largest consumer-facing marketplace startups and private companies.  When we started this series in early 2020 (based on data from 2019), we had no way of knowing how volatile the next few years would be. Many businesses were temporarily shuttered by covid, especially... Read More\nThe post The Marketplace 100: 2022 appeared first on Future.",
          "link": "https://future.a16z.com/marketplace-100/",
          "publishedOn": "2022-04-14T13:00:36.000Z",
          "wordCount": 4956,
          "title": "The Marketplace 100: 2022",
          "imageUrl": "https://future.a16z.com/wp-content/uploads/2022/04/M100-Social-Share-Twitter.jpg"
        },
        {
          "id": "https://future.a16z.com/?p=5202",
          "author": "Patrick Woods",
          "description": "Everyone’s familiar with the concept of a go-to-market (GTM) plan, but in the world of bottom-up adoption and product-led growth, a go-to-community (GTC) plan is equally as important.  As the name suggests, go-to-community is the process of operationalizing and optimizing your community-building efforts to align them with business outcomes. Growing a healthy community can create... Read More\nThe post How to Drive Business Growth By Fostering Your Community appeared first on Future.",
          "link": "https://future.a16z.com/drive-business-growth-by-fostering-community-gtc/",
          "publishedOn": "2022-04-12T14:00:00.000Z",
          "wordCount": 3204,
          "title": "How to Drive Business Growth By Fostering Your Community",
          "imageUrl": "https://future.a16z.com/wp-content/uploads/2022/04/Orbit-GTC-Alignment-FB.jpg"
        },
        {
          "id": "https://future.a16z.com/?p=5163",
          "author": "Connie Chan",
          "description": "When it comes to ecommerce, last year in China often means this year (or next) in the U.S. Numerous online shopping trends have swept China before landing stateside one or two years later. This is happening now with super apps (e.g., WeChat and Doordash), meaning platforms that customers initially use for one purpose (like ordering food... Read More\nThe post Why China’s Version of Email Marketing Is So Effective appeared first on Future.",
          "link": "https://future.a16z.com/private-traffic-is-chinas-version-of-email-marketing/",
          "publishedOn": "2022-04-08T18:45:19.000Z",
          "wordCount": 2122,
          "title": "Why China’s Version of Email Marketing Is So Effective",
          "imageUrl": "https://future.a16z.com/wp-content/uploads/2022/04/601-Future-of-Ecommerce-Facebook.png"
        },
        {
          "id": "https://future.a16z.com/?p=5098",
          "author": "Miles Jennings",
          "description": "The promise of decentralization has been heavily discussed and debated, from why it matters to the bigger question of who will control the software that powers the internet. These questions are critical, because as we have seen, when control is held in the hands of a very few, encroachments on personal freedom, choice, and privacy... Read More\nThe post Decentralization for Web3 Builders: Principles, Models, How appeared first on Future.",
          "link": "https://future.a16z.com/web3-decentralization-models-framework-principles-how-to/",
          "publishedOn": "2022-04-07T16:15:53.000Z",
          "wordCount": 7275,
          "title": "Decentralization for Web3 Builders: Principles, Models, How",
          "imageUrl": "https://future.a16z.com/wp-content/uploads/2022/04/ss-web3decentralization_milesjennings_a16zcrypto-scaled.jpg"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/feeds/posts/default",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2022/04/the-more-you-know-more-you-know-you.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=lhDjYqiy3mZ0x6ROQEUoUw');.lst-kix_qhs0t3wlsx02-8>li{counter-increment:lst-ctn-kix_qhs0t3wlsx02-8}ol.lst-kix_h2vtkcla8l9d-2.start{counter-reset:lst-ctn-kix_h2vtkcla8l9d-2 0}ul.lst-kix_9i24fh2252ug-1{list-style-type:none}.lst-kix_h2vtkcla8l9d-3>li{counter-increment:lst-ctn-kix_h2vtkcla8l9d-3}ul.lst-kix_9i24fh2252ug-0{list-style-type:none}ul.lst-kix_9i24fh2252ug-3{list-style-type:none}ul.lst-kix_9i24fh2252ug-2{list-style-type:none}ul.lst-kix_9i24fh2252ug-5{list-style-type:none}ul.lst-kix_9i24fh2252ug-4{list-style-type:none}ul.lst-kix_9i24fh2252ug-7{list-style-type:none}.lst-kix_czzguda5pqu4-1>li{counter-increment:lst-ctn-kix_czzguda5pqu4-1}ul.lst-kix_9i24fh2252ug-6{list-style-type:none}.lst-kix_jdourvkzhmg1-7>li{counter-increment…",
          "link": "https://googleprojectzero.blogspot.com/2022/04/the-more-you-know-more-you-know-you.html",
          "publishedOn": "2022-04-19T16:06:00.000Z",
          "wordCount": 6268,
          "title": "The More You Know, The More You Know You Don’t Know",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiM4gCoxLJVRGTOOAa0G44m0K7JF0hFFDI02iBV7REJruq3uiZof8wNylU1aNxOte2oEhhj_5JM9tS0VOwgA-eiKIaQ_DdmTQtlC9OUKSRA6kes4_d_-BKyeZsJ2bxISU2HJmZRG-_kVtKguVM8-eo7mbHl1_zs8DUGnY5mD-BiWYz6ayl472_aq7G_wQ/w1200-h630-p-k-no-nu/image1.png"
        },
        {
          "id": "https://googleprojectzero.blogspot.com/2022/04/cve-2021-1782-ios-in-wild-vulnerability.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=lhDjYqiy3mZ0x6ROQEUoUw');ol{margin:0;padding:0}table td,table th{padding:0}.BGLtzooHlW-c13{border-right-style:solid;padding:5pt 5pt 5pt 5pt;border-bottom-color:#e0e0e0;border-top-width:1pt;border-right-width:1pt;border-left-color:#e0e0e0;vertical-align:top;border-right-color:#e0e0e0;border-left-width:1pt;border-top-style:solid;background-color:#fafafa;border-left-style:solid;border-bottom-width:1pt;width:468pt;border-top-color:#e0e0e0;border-bottom-style:solid}.BGLtzooHlW-c3{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:10pt;font-family:Consolas,\"Courier New\";font-style:normal}.BGLtzooHlW-c10{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-fa…",
          "link": "https://googleprojectzero.blogspot.com/2022/04/cve-2021-1782-ios-in-wild-vulnerability.html",
          "publishedOn": "2022-04-14T15:58:00.000Z",
          "wordCount": 8658,
          "title": "CVE-2021-1782, an iOS in-the-wild vulnerability in vouchers",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh5UykytcJVVshEICfc5vF3q6iAkVDug6bFDyqEnEef_apkVCB-AsGKCFPMqa6XZ2RoKPqjuU1CNiWBd4mszC0lGCNmSSby9dVqg_g3VCBM3cJodxCNij4Bqarp7ULqGkonXHyIEne3Uy6s1YcFUvfKmWlBSAvf8axjiw-4mJftHeL39CqTHjHTQ6TjnA/w1200-h630-p-k-no-nu/image1%20%283%29.png"
        },
        {
          "id": "https://googleprojectzero.blogspot.com/2022/04/cve-2021-30737-xerubs-2021-ios-asn1.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=lhDjYqiy3mZ0x6ROQEUoUw');ol{margin:0;padding:0}table td,table th{padding:0}.c5{border-right-style:solid;padding:5pt 5pt 5pt 5pt;border-bottom-color:#e0e0e0;border-top-width:1pt;border-right-width:1pt;border-left-color:#e0e0e0;vertical-align:top;border-right-color:#e0e0e0;border-left-width:1pt;border-top-style:solid;background-color:#fafafa;border-left-style:solid;border-bottom-width:1pt;width:468pt;border-top-color:#e0e0e0;border-bottom-style:solid}.c10{color:#434343;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:14pt;font-family:\"Arial\";font-style:normal}.c2{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:10pt;font-family:Consolas,\"Courier New\";font-style:normal}.c0…",
          "link": "https://googleprojectzero.blogspot.com/2022/04/cve-2021-30737-xerubs-2021-ios-asn1.html",
          "publishedOn": "2022-04-07T16:08:00.000Z",
          "wordCount": 6450,
          "title": "CVE-2021-30737, @xerub's 2021 iOS ASN.1 Vulnerability",
          "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhrv4IkZXgNv7MttlFFE1Gyyr2MQx0T4gzNAybXi3vsMhwT30WK_KaX1pF2zQKPLBoSU5Dtz3tG3yxJqaaE13leIBcnAFOb_HE8FFdy5yMOvoP0a_cB-IDi__SaWH4xL0czURYqdLtxvcKVSAysO0s8lOLrKykDEKEv1Z9fr0wQ7SOCDBcr5pgC-OoHcw/w1200-h630-p-k-no-nu/image2%20%281%29.png"
        }
      ]
    },
    {
      "title": "Two Cents",
      "feedUrl": "https://hur.substack.com/feed",
      "siteUrl": "https://hur.substack.com",
      "articles": [
        {
          "id": "https://hur.substack.com/p/two-cents-52-web3-l1-l2-de-fi-nft",
          "author": "Jin Ho Hur",
          "description": "[Web3 일반] Transition to web3: a guide for non-technical roles - Li Jin Non-tech Web3 입문자를 위한 아주 친절한! 가이드 The New Creator Economy: A guide on Web3 creator platforms | Antler Web3 Onramps for the Next 1 Billion People - Creator Economy by Peter Yang Web3 업계의 다음 미션은 10억 사용자를 on-board 시키는 것.",
          "link": "https://hur.substack.com/p/two-cents-52-web3-l1-l2-de-fi-nft",
          "publishedOn": "2022-04-29T05:00:37.000Z",
          "wordCount": null,
          "title": "[Two Cents #52] Web3 일반; 블록체인 L1 L2; De-Fi, NFT, 게임 메타버스, DAO, dApp; 생각할 꺼리들; Deep Dive - L1/L2",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F73d5f98d-ec0d-4432-8f27-bff249899523_1500x844.png",
            "length": "0",
            "type": "image/jpeg"
          },
          "imageUrl": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F73d5f98d-ec0d-4432-8f27-bff249899523_1500x844.png"
        }
      ]
    },
    {
      "title": "Interrupt",
      "feedUrl": "https://interrupt.memfault.com/feed.xml",
      "siteUrl": "https://interrupt.memfault.com/",
      "articles": [
        {
          "id": "https://interrupt.memfault.com/blog/march-2022-roundup",
          "author": null,
          "description": "Here are the articles, videos, and tools that we’ve been excited about this\nMarch, and we have a few announcements, the first being about Interrupt’s first Quarterly Panel co-hosted with Phillip from Embedded Artistry, and a blurb about this year’s Embedded Online Conference\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/march-2022-roundup",
          "publishedOn": "2022-04-14T00:00:00.000Z",
          "wordCount": 797,
          "title": "What we've been reading in March (+ Announcements)",
          "imageUrl": "https://interrupt.memfault.com/img/interrupt-cover-1200px.png"
        }
      ]
    },
    {
      "title": "News & Blog – IoT Security Foundation",
      "feedUrl": "https://www.iotsecurityfoundation.org/blog/feed",
      "siteUrl": "https://www.iotsecurityfoundation.org",
      "articles": [
        {
          "id": "https://www.iotsecurityfoundation.org/?p=21523",
          "author": "John",
          "description": "The IoT Security Foundation, nquiringMinds and the University of Oxford collaborate to launch the Secure Networking by Design (SNbD) project for the development of advanced, open source, network protections for Internet Service Providers (ISPs) and router vendors. IoTSF has teamed up with nquiringMinds and the University of Oxford to launch the Secure Networking by Design (SNbD)",
          "link": "https://www.iotsecurityfoundation.org/computing-breakthrough-and-cognitive-router-technology-promises-secure-networking-by-design/",
          "publishedOn": "2022-04-11T08:00:10.000Z",
          "wordCount": 850,
          "title": "Computing Breakthrough and Cognitive Router Technology Promises Secure Networking by Design",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "james hunt (.us)",
      "feedUrl": "https://jameshunt.us/feed/",
      "siteUrl": "https://jameshunt.us",
      "articles": []
    },
    {
      "title": "Jay Carlson",
      "feedUrl": "https://jaycarlson.net/feed",
      "siteUrl": "https://jaycarlson.net",
      "articles": []
    },
    {
      "title": "Kwang Yul Seo",
      "feedUrl": "https://kwangyulseo.com/feed/",
      "siteUrl": "https://kwangyulseo.com",
      "articles": []
    },
    {
      "title": "LimitedResults",
      "feedUrl": "https://limitedresults.com/feed/",
      "siteUrl": "https://limitedresults.com",
      "articles": []
    },
    {
      "title": "Lucky Resistor",
      "feedUrl": "https://luckyresistor.me/feed/",
      "siteUrl": "https://luckyresistor.me",
      "articles": []
    },
    {
      "title": "LWN.net",
      "feedUrl": "https://lwn.net/headlines/rss",
      "siteUrl": "https://lwn.net",
      "articles": [
        {
          "id": "https://lwn.net/Articles/893512/",
          "author": "corbet",
          "description": "The folio project is not yet two years old,\nbut it has already resulted in \nsignificant changes to the kernel's memory-management and filesystem\nlayers.  While much work has been done, quite a bit remains.  In the\nopening plenary session at the 2022 Linux Storage,\nFilesystem, Memory-management and BPF Summit, Matthew Wilcox provided\nan update on the folio transition and led a discussion on the work that\nremains to be done.",
          "link": "https://lwn.net/Articles/893512/",
          "publishedOn": "2022-05-04T13:36:21.000Z",
          "wordCount": null,
          "title": "[$] A memory-folio update",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893839/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (openjdk-17), Fedora (chromium and suricata), Oracle (mariadb:10.5), SUSE (amazon-ssm-agent, containerd, docker, java-11-openjdk, libcaca, libwmf, pcp, ruby2.5, rubygem-puma, webkit2gtk3, and xen), and Ubuntu (linux-raspi).",
          "link": "https://lwn.net/Articles/893839/",
          "publishedOn": "2022-05-04T13:33:34.000Z",
          "wordCount": 184,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893756/",
          "author": "corbet",
          "description": "Version\n100.0 of the Firefox browser has been released.  New features include\nvideo caption display on various proprietary sites, multiple-language\nspelling checking, invisible scrollbars, and more.",
          "link": "https://lwn.net/Articles/893756/",
          "publishedOn": "2022-05-04T00:09:55.000Z",
          "wordCount": 1337,
          "title": "Firefox 100 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893193/",
          "author": "jake",
          "description": "Python's match statement, which provides a long-sought C-like\nswitch statement—though it is far more than that—has now been part of the\nlanguage for more than six months.  One of the authors of the series of Python\nEnhancement Proposals (PEPs) that described the \nfeature, Brandt Bucher, came to PyCon 2022 in Salt Lake City, Utah to talk\nabout \nthe feature.  He gave an overview of its history, some of its many-faceted\nabilities, a bit about how it was implemented, and some thoughts on its\nfuture, in a presentation on\nApril 29, which was the first day of talks for the conference.",
          "link": "https://lwn.net/Articles/893193/",
          "publishedOn": "2022-05-03T19:52:07.000Z",
          "wordCount": null,
          "title": "[$] An overview of structural pattern matching for Python",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893682/",
          "author": "corbet",
          "description": "Version 4.7 of the SystemTap tracing system is out.  \"Enhancements to this release include: a new stap-profile-annotate\ntool, a new --sign-module module signing option, -d is now implied for\nprocesses specified with -c/-x\".",
          "link": "https://lwn.net/Articles/893682/",
          "publishedOn": "2022-05-03T13:53:56.000Z",
          "wordCount": 773,
          "title": "SystemTap 4.7 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893681/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (jackson-databind, kernel, openvpn, and twisted), Fedora (xz), Mageia (chromium-browser-stable and curl), Oracle (vim and xmlrpc-c), Red Hat (gzip), Slackware (libxml2), SUSE (git, python39, and subversion), and Ubuntu (libvirt and mysql-5.7, mysql-8.0).",
          "link": "https://lwn.net/Articles/893681/",
          "publishedOn": "2022-05-03T13:51:35.000Z",
          "wordCount": 153,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893024/",
          "author": "corbet",
          "description": "The classic NUMA architecture is built around nodes, each of which contains\na set of CPUs and some local memory; all nodes are more-or-less equal.\nRecently, though, \"tiered-memory\" NUMA systems have begun to appear; these\ninclude CPU-less nodes that contain persistent memory rather than (faster,\nbut more expensive) DRAM.   One possible use for that\nmemory is to hold less-frequently-used pages rather than forcing them out\nto a backing-store device.  There is an interesting problem that emerges\nfrom this use case, though: how does the kernel manage the movement of\npages between faster and slower memory?  Several recent patch sets have\ntaken differing approaches to the problem of rebalancing memory on these\nsystems.",
          "link": "https://lwn.net/Articles/893024/",
          "publishedOn": "2022-05-02T14:31:59.000Z",
          "wordCount": null,
          "title": "[$] NUMA rebalancing on tiered-memory systems",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893452/",
          "author": "corbet",
          "description": "Richard Hughes announces\nthe fwupd 1.8.0 release and notes that the associated Linux Vendor Firmware Service has now shipped\na minimum of 50 million firmware updates.\n\n\n\tJust 7 years ago Christian asked me to “make firmware updates work\n\ton Linux” and now we have a thriving client project that respects\n\tboth your freedom and your privacy, and a thriving ecosystem of\n\thardware vendors who consider Linux users first class citizens. Of\n\tcourse, there are vendors who are not shipping updates for popular\n\thardware, but they’re now in the minority — and every month we have\n\ttwo or three new vendor account requests.",
          "link": "https://lwn.net/Articles/893452/",
          "publishedOn": "2022-05-02T14:02:31.000Z",
          "wordCount": 174,
          "title": "Hughes: fwupd 1.8.0 and 50 million updates",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893440/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (ffmpeg, ghostscript, libarchive, and tinyxml), Fedora (CuraEngine, epiphany, gzip, usd, vim, xen, and xz), Oracle (maven-shared-utils and qemu), Red Hat (gzip, python27-python and python27-python-pip, rh-maven36-maven-shared-utils, rh-python38-python, rh-python38-python-lxml, and rh-python38-python-pip, and zlib), Slackware (pidgin), SUSE (jasper, java-11-openjdk, libcaca, libslirp, mariadb, mutt, nodejs12, opera, and python-Twisted), and Ubuntu (libinput).",
          "link": "https://lwn.net/Articles/893440/",
          "publishedOn": "2022-05-02T13:23:50.000Z",
          "wordCount": 258,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893285/",
          "author": "corbet",
          "description": "Drew DeVault has announced\nthe existence of a new programming language called \"Hare\".\n\n\n\tHare is a systems programming language designed to be simple,\n\tstable, and robust. Hare uses a static type system, manual memory\n\tmanagement, and a minimal runtime. It is well-suited to writing\n\toperating systems, system tools, compilers, networking software,\n\tand other low-level, high performance tasks.",
          "link": "https://lwn.net/Articles/893285/",
          "publishedOn": "2022-05-01T23:34:31.000Z",
          "wordCount": 17531,
          "title": "DeVault: Announcing the Hare programming language",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893284/",
          "author": "corbet",
          "description": "Nathan Willis took\na long look at the Open Source Initiative's 2022 board election and\nwasn't entirely pleased with what he saw.\n\n\n\tSo it’s a troubling ballot to look at. There’s an ostensibly\n\tnon-profit organization that’s an official OSI affiliate trying to\n\trun its CEO as an individual candidate while also running a second\n\tmember (a board director) on the appropriate, affiliate ballot in\n\tthe same election. There’s also two financial sponsors running\n\tcandidates on the individual ballot, one of them (Red Hat) running\n\ttwo candidates at the same time for the two open seats.",
          "link": "https://lwn.net/Articles/893284/",
          "publishedOn": "2022-05-01T23:28:21.000Z",
          "wordCount": 2700,
          "title": "Willis: Engaging with the OSI Elections 2022.1",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893283/",
          "author": "corbet",
          "description": "The 5.18-rc5 kernel prepatch is out for\ntesting.  \"So if rc4 last week was tiny and smaller than usual, it seems to have\nbeen partly timing, and rc5 is now a bit larger than usual.\n\nBut only a very tiny bit larger - certainly not outrageously so, and\nnot something that worries me.\"",
          "link": "https://lwn.net/Articles/893283/",
          "publishedOn": "2022-05-01T22:55:47.000Z",
          "wordCount": 117,
          "title": "Kernel prepatch 5.18-rc5",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893263/",
          "author": "corbet",
          "description": "The 5.15.37 and\n4.19.241\nstable kernel updates have been released; each contains a relatively small\nnumber of important fixes.",
          "link": "https://lwn.net/Articles/893263/",
          "publishedOn": "2022-05-01T20:24:46.000Z",
          "wordCount": 85,
          "title": "Two stable kernel releases",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893133/",
          "author": "corbet",
          "description": "TechRepublic has published an\ninterview with Fedora project leader Matthew Miller.\n\n\n\tBasically, every modern language provides a lot of building blocks\n\tthat usually come from other smaller open-source projects. These\n\tare libraries, and they do things like format text, handle images,\n\tconnect to databases and deal with talking across the\n\tinternet. Projects like Fedora or Debian used to work to try to\n\tpackage up every such library in our own format, made to work\n\tnicely with everything else.\n\n\tNow, every new language — Rust, for example — comes with its own\n\ttools to manage these, and they don’t work nicely together with our\n\told way. The sheer scale is overwhelming — for Rust alone, as I\n\tchecked just now there are 81,541 such libraries. We can’t keep up\n\twith repackaging all of that into our own format, let alone that\n\tplus all of the other languages. We need to approach this\n\tdifferently in order to still provide a good solution to software\n\tdevelopers.\n\n\tI think a lot of that will need machine learning and automation …\n\twe’ll need to keep adjusting so we can provide the value that Linux\n\tdistributions give users in trust, security and coherent\n\tintegration at an exponential scale.",
          "link": "https://lwn.net/Articles/893133/",
          "publishedOn": "2022-04-29T15:09:26.000Z",
          "wordCount": 1168,
          "title": "Fedora project leader Matthew Miller weighs in (TechRepublic)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892743/",
          "author": "corbet",
          "description": "One of the changes merged for the 5.18 kernel was a specialized memory allocator for BPF\nprograms that have been loaded into the kernel.  Since then, though, this\nfeature has \nrun into a fair amount of turbulence and will almost certainly be disabled\nin the final 5.18 release.  This outcome is partly a result of bugs in the\nallocator itself, but this work also had the bad luck to trip some older\nand deeper bugs within the kernel's memory-management subsystem.",
          "link": "https://lwn.net/Articles/892743/",
          "publishedOn": "2022-04-29T13:58:00.000Z",
          "wordCount": null,
          "title": "[$] The BPF allocator runs into trouble",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893102/",
          "author": "corbet",
          "description": "Security updates have been issued by Fedora (dhcp, gzip, podman, rsync, and usd), Mageia (firefox/nss/rootcerts, kernel, kernel-linus, and thunderbird), Oracle (container-tools:2.0, container-tools:3.0, mariadb:10.3, and zlib), Red Hat (Red Hat OpenStack Platform 16.2 (python-twisted), xmlrpc-c, and zlib), SUSE (glib2, nodejs12, nodejs14, python-paramiko, python-pip, and python-requests), and Ubuntu (curl, ghostscript, libsdl1.2, libsdl2, mutt, networkd-dispatcher, and webkit2gtk).",
          "link": "https://lwn.net/Articles/893102/",
          "publishedOn": "2022-04-29T13:12:38.000Z",
          "wordCount": 266,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892611/",
          "author": "corbet",
          "description": "There is a long and growing list of options for getting information out of\nthe kernel but, in the real world, print statements still tend to be the\ntool of choice. The kernel's printk()\nfunction \noften comes up short, despite the fact that it provides a set of\nkernel-specific features, so there has, for some time,  been interest in\nbetter APIs for textual output from the kernel.  The \"printbuf\"\nproposal from Kent Overstreet is one step in that direction, but will\nneed some changes to make it work well with features the kernel already\nhas.",
          "link": "https://lwn.net/Articles/892611/",
          "publishedOn": "2022-04-28T13:42:15.000Z",
          "wordCount": null,
          "title": "[$] Printbuf rebuffed for now",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/893001/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (chromium, golang-1.7, and golang-1.8), Fedora (bettercap, chisel, containerd, doctl, gobuster, golang-contrib-opencensus-resource, golang-github-appc-docker2aci, golang-github-appc-spec, golang-github-containerd-continuity, golang-github-containerd-stargz-snapshotter, golang-github-coredns-corefile-migration, golang-github-envoyproxy-protoc-gen-validate, golang-github-francoispqt-gojay, golang-github-gogo-googleapis, golang-github-gohugoio-testmodbuilder, golang-github-google-containerregistry, golang-github-google-slothfs, golang-github-googleapis-gnostic, golang-github-googlecloudplatform-cloudsql-proxy, golang-github-grpc-ecosystem-gateway-2, golang-github-haproxytech-client-native, golang-github-haproxytech-dataplaneapi, golang-github-instrumenta-kubeval, golang-github-intel-goresctrl, golang-github-oklog, golang-github-pact-foundation, golang-github-prometheus, golang-github-prometheus-alertmanager, golang-github-prometheus-node-exporter, golang-github-prometheus-tsdb, golang-github-redteampentesting-monsoon, golang-github-spf13-cobra, golang-github-xordataexchange-crypt, golang-gopkg-src-d-git-4, golang-k8s-apiextensions-apiserver, golang-k8s-code-generator, golang-k8s-kube-aggregator, golang-k8s-sample-apiserver, golang-k8s-sample-controller, golang-mongodb-mongo-driver, golang-storj-drpc, golang-x-perf, gopass, grpcurl, onionscan, shellz, shhgit, snowcrash, stb, thunderbird, and xq), Oracle (gzip, kernel, and polkit), Slackware (curl), SUSE (buildah, cifs-utils, firewalld, golang-github-prometheus-prometheus, libaom, and webkit2gtk3), and Ubuntu (nginx and thunderbird).",
          "link": "https://lwn.net/Articles/893001/",
          "publishedOn": "2022-04-28T12:44:23.000Z",
          "wordCount": 663,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892107/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for April 28, 2022 is available.",
          "link": "https://lwn.net/Articles/892107/",
          "publishedOn": "2022-04-28T01:12:01.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for April 28, 2022",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892755/",
          "author": "jake",
          "description": "Running code from inside a cloned Git repository is potentially risky, but\nnormally just inspecting such a repository is considered to be safe.  As a\nrecent posting to the Git mailing list shows, however, there are still\nrisks lurking inside these repositories; code that lives in them can be\ntriggered in unexpected ways.  In particular, malicious \"bare\" repositories\ncan be added as a subdirectory of a repository; they can be configured to run\ncode whenever Git commands are executed there, which is something that can\nhappen in surprising ways. There is now an effort\nunderway to try to address the problem in Git, without breaking the\nlegitimate need for including bare repositories into a Git tree.",
          "link": "https://lwn.net/Articles/892755/",
          "publishedOn": "2022-04-27T20:56:00.000Z",
          "wordCount": null,
          "title": "[$] The risks of embedded bare repositories in Git",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892826/",
          "author": "corbet",
          "description": "As was recently reported here, the Fedora\nproject has been considering dropping support for legacy BIOS systems in\nupcoming releases.  The idea was controversial at best, and the minutes from the April 26 FESCo meeting\nshow that it has been rejected, for now at least.  The BIOS SIG will be\nasked for a new plan for BIOS support in Fedora.",
          "link": "https://lwn.net/Articles/892826/",
          "publishedOn": "2022-04-27T14:19:56.000Z",
          "wordCount": 132,
          "title": "Fedora not deprecating legacy BIOS - yet",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892825/",
          "author": "corbet",
          "description": "Version 4.0 of the Yocto\nProject distribution builder is out.  Changes \ninclude a move to the 5.15 kernel, reproducibility fixes, improved\noverlayfs support, numerous security updates, and a long list of new recipes.",
          "link": "https://lwn.net/Articles/892825/",
          "publishedOn": "2022-04-27T14:11:24.000Z",
          "wordCount": 4887,
          "title": "Yocto Project 4.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892810/",
          "author": "corbet",
          "description": "The\n5.17.5,\n5.15.36,\n5.10.113,\n5.4.191,\n4.19.240,\n4.14.277, and\n4.9.312\nstable kernels have all been released, one day earlier than had originally\nbeen expected.\nAs usual, each contains another set of important fixes.",
          "link": "https://lwn.net/Articles/892810/",
          "publishedOn": "2022-04-27T13:42:33.000Z",
          "wordCount": 147,
          "title": "A pile of stable kernel releases",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892802/",
          "author": "corbet",
          "description": "Security updates have been issued by Mageia (virtualbox), Red Hat (container-tools:2.0, container-tools:3.0, gzip, kernel, kernel-rt, kpatch-patch, mariadb:10.3, mariadb:10.5, maven-shared-utils, polkit, vim, xmlrpc-c, and zlib), Scientific Linux (maven-shared-utils), SUSE (ant, go1.17, go1.18, kernel, and xen), and Ubuntu (fribidi, git, libcroco, libsepol, linux, linux-gcp, linux-ibm, linux-lowlatency, openjdk-17, and openjdk-lts).",
          "link": "https://lwn.net/Articles/892802/",
          "publishedOn": "2022-04-27T13:11:29.000Z",
          "wordCount": 270,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892080/",
          "author": "jake",
          "description": "Python's super()\nbuilt-in function can be somewhat confusing, as highlighted by a huge\npython-ideas thread that we started looking\nat last week.  It is used by methods in class hierarchies to access\nmethods and attributes in a parent class, but exactly which class\nthat super() resolves to is perhaps a bit unclear in multiple-inheritance hierarchies.\nThe discussion in the second \"half\" of the thread further highlighted some\nlesser-known parts of the language.",
          "link": "https://lwn.net/Articles/892080/",
          "publishedOn": "2022-04-26T22:23:50.000Z",
          "wordCount": null,
          "title": "[$] Super Python (part 2)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892644/",
          "author": "corbet",
          "description": "Version 19 of the\nAndroid-based LineageOS distribution has been released.\n\n\n\tWith that said, we have been working extremely hard since Android\n\t12’s release last October to port our features to this new version\n\tof Android. Thanks to our hard work adapting to Google’s fairly\n\tlarge changes in Android 11, we were able to rebase our changes\n\tonto Android 12 much more efficiently. This led to a lot of time to\n\tspend on cool new features, as well as adapt our additions to\n\tAndroid 12’s new Material You design language!\n\n\nBeyond the move to Android 12, this release includes improvements to a lot\nof apps, a new setup wizard, and more.  Less happily, this release has had\nto leave a lot of older devices behind; a device must be able to run a 4.9\nor newer kernel to be able to run LineageOS 19.",
          "link": "https://lwn.net/Articles/892644/",
          "publishedOn": "2022-04-26T12:05:42.000Z",
          "wordCount": 243,
          "title": "LineageOS 19 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892674/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (ffmpeg), Fedora (htmldoc, moby-engine, plantuml, and zchunk), Oracle (java-1.8.0-openjdk, java-17-openjdk, and kernel), Red Hat (java-1.8.0-openjdk), Scientific Linux (java-1.8.0-openjdk), Slackware (freerdp), SUSE (kernel, mutt, SUSE Manager Client Tools, and xen), and Ubuntu (barbican and git).",
          "link": "https://lwn.net/Articles/892674/",
          "publishedOn": "2022-04-26T12:04:58.000Z",
          "wordCount": 209,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892216/",
          "author": "corbet",
          "description": "The kernel gained support for the TLS\nprotocol in the 4.13 release, which came out in September 2017.  That\nsupport is incomplete, though, in that it does not provide the kernel with\na way to initiate a TLS connection on its own.  Instead, user space creates\na socket and performs the TLS handshake before handing the socket to the\nkernel, which can then transfer data using TLS.  The situation may be about\nto change as a result of this\npatch series from Chuck Lever — though user space will still need to\nremain in the picture.",
          "link": "https://lwn.net/Articles/892216/",
          "publishedOn": "2022-04-25T14:41:47.000Z",
          "wordCount": null,
          "title": "[$] Extending in-kernel TLS support",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892556/",
          "author": "corbet",
          "description": "Dave Täht has put together a summary of the\nstate of fair queuing and the fight against bufferbloat in general.\n\n\n\tOn a very positive note, while it might seem the negatives are\n\toverwhelming in the list above, I’m confident that there are\n\tbillions of devices for which fq_codel is doing a good job. I’m\n\tconfident there is a rising tide of clued system administrators and\n\tusers applying smart queue management in the right places at the\n\tright times. There’s more than enough products on the market\n\talready that have the right stuff in them to make better networks a\n\tmatter of merely recognising the problem and applying the fix.",
          "link": "https://lwn.net/Articles/892556/",
          "publishedOn": "2022-04-25T13:53:05.000Z",
          "wordCount": 347,
          "title": "Täht: The state of fq_codel and sch_cake worldwide",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892536/",
          "author": "jake",
          "description": "Security updates have been issued by Fedora (kernel, kernel-headers, kernel-tools, libinput, podman-tui, and vim), Mageia (git, gzip/xz, libdxfrw, libinput, librecad, and openscad), and SUSE (dnsmasq, git, libinput, libslirp, libxml2, netty, podofo, SDL, SDL2, and tomcat).",
          "link": "https://lwn.net/Articles/892536/",
          "publishedOn": "2022-04-25T12:01:38.000Z",
          "wordCount": 227,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892481/",
          "author": "corbet",
          "description": "The 5.18-rc4 kernel prepatch is out for\ntesting.  \"Fairly slow and calm week - which makes me just suspect\nthat the other shoe will drop at some point.  But maybe things are just\ngoing really well this release. It's bound to happen _occasionally_, after\nall.\"",
          "link": "https://lwn.net/Articles/892481/",
          "publishedOn": "2022-04-25T02:49:04.000Z",
          "wordCount": 109,
          "title": "Kernel prepatch 5.18-rc4",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/889760/",
          "author": "corbet",
          "description": "Subsystem maintainers routinely use git\nrequest-pull as part of the \nprocess of sending work upstream.  Normally, the result includes a list of\ncommits included in the request and a nice\ndiffstat that shows which files will be touched and how much of each will\nbe changed; examples\nabound on the kernel mailing lists.  Occasionally, though, a repository with a relatively\ncomplicated development history will yield a massive diffstat containing a\ngreat deal of unrelated work.  The result looks ugly and obscures what the\npull request is actually doing.  This document describes what is happening\nand how to fix things up; it is derived from The Wisdom of Linus Torvalds,\nwhich has been posted numerous times over the years (example 1,\nexample 2).",
          "link": "https://lwn.net/Articles/889760/",
          "publishedOn": "2022-04-22T18:23:13.000Z",
          "wordCount": null,
          "title": "[$] Handling messy pull-request diffstats",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892372/",
          "author": "jake",
          "description": "Security updates have been issued by Fedora (composer, golang-x-crypto, rubygem-nokogiri, wavpack, xen, and xz) and SUSE (dnsmasq, openjpeg, swtpm, tomcat, and xen).",
          "link": "https://lwn.net/Articles/892372/",
          "publishedOn": "2022-04-22T13:15:14.000Z",
          "wordCount": 178,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892334/",
          "author": "corbet",
          "description": "OpenBSD 7.1 has been released.  The list of changes and new features is\nlong, as usual; see the full text, below, for all the details.",
          "link": "https://lwn.net/Articles/892334/",
          "publishedOn": "2022-04-22T07:30:09.000Z",
          "wordCount": 9256,
          "title": "OpenBSD 7.1 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892272/",
          "author": "jake",
          "description": "The Ubuntu 22.04 LTS release, codenamed \"Jammy Jellyfish\", is now available.  It comes in several editions (Desktop, Server, Cloud, and Core) and multiple flavors (Ubuntu Budgie, Kubuntu, Lubuntu, Ubuntu Kylin, Ubuntu MATE,\nUbuntuStudio, and Xubuntu).  Lots more information can be found in the release notes.\n\n\nUbuntu Desktop 22.04 LTS gains significant usability, battery and performance\nimprovements with GNOME 42. It features GNOME power profiles and streamlined\nworkspace transitions alongside significant optimisations which can double\nthe desktop frame rate on Intel and Raspberry Pi graphics drivers.\n\nUbuntu 22.04 LTS is the first LTS release where the entire recent Raspberry\nPi device portfolio is supported, from the new Raspberry Pi Zero 2W to the\nRaspberry Pi 4. Ubuntu 22.04 LTS adds Rust for memory-safe systems-level\nprogramming. It also moves to OpenSSL v3, with new cryptographic algorithms\nfor elevated security.",
          "link": "https://lwn.net/Articles/892272/",
          "publishedOn": "2022-04-21T21:12:47.000Z",
          "wordCount": 781,
          "title": "Ubuntu 22.04 LTS (Jammy Jellyfish) released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892226/",
          "author": "jake",
          "description": "The Debian project leader election has completed and Jonathan Carter has been reelected for his third term. For more information, see the Debian vote page.  We looked at the candidates back in March.",
          "link": "https://lwn.net/Articles/892226/",
          "publishedOn": "2022-04-21T16:10:11.000Z",
          "wordCount": 591,
          "title": "Debian Project Leader Election 2022 Results",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/890272/",
          "author": "corbet",
          "description": "The world of music and audio production is largely dominated by\nproprietary software vendors. Among them, Steinberg stands out as a company\nthat created some of the most-used software, including the Cubase and Nuendo digital audio\nworkstations. Steinberg is also known as the creator of the VST plugin API\nthat, largely due to its licensing policy, has irritated developers enough to\ninspire multiple attempts at creating an open-source alternative. Even now,\nwhen the VST3 SDK is available under the\nGPLv3 license, the way the company exercises its control over the SDK\nkeeps pushing developers away toward other open-source solutions.\n\nThis is an introduction to open-source plugin\nAPIs for musicians and sound engineers alike. It focuses on the options in\nthe larger ecosystem and how their shortcomings led to the creation of new\nalternatives with liberal licensing.",
          "link": "https://lwn.net/Articles/890272/",
          "publishedOn": "2022-04-21T15:03:30.000Z",
          "wordCount": null,
          "title": "[$] An introduction to Linux audio plugin APIs",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892214/",
          "author": "jake",
          "description": "Security updates have been issued by Fedora (frr, grafana, gzip, and pdns), Oracle (java-11-openjdk), Red Hat (java-11-openjdk and kernel), Scientific Linux (java-11-openjdk), SUSE (dcraw, GraphicsMagick, gzip, kernel, nbd, netty, qemu, SDL, and xen), and Ubuntu (libinput, linux, linux-aws, linux-aws-5.13, linux-azure, linux-azure-5.13, linux-gcp, linux-gcp-5.13, linux-hwe-5.13, linux-kvm, linux-oracle, linux-oracle-5.13, linux-raspi, linux, linux-aws, linux-aws-hwe, linux-azure, linux-azure-4.15, linux-dell300x, linux-gcp, inux-gcp-4.15, linux-hwe, linux-kvm, linux-oracle, linux-snapdragon, linux, linux-aws, linux-azure, linux-azure-5.4, linux-azure-fde, linux-gcp, linux-gcp-5.4, linux-gke, linux-gke-5.4, linux-gkeop, linux-gkeop-5.4, linux-hwe-5.4, linux-ibm, linux-ibm-5.4, linux-kvm, linux-oracle, linux-oracle-5.4, linux-raspi, linux-raspi-5.4, and linux-oem-5.14).",
          "link": "https://lwn.net/Articles/892214/",
          "publishedOn": "2022-04-21T14:09:25.000Z",
          "wordCount": 288,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892161/",
          "author": "corbet",
          "description": "The OpenWrt 21.02.3\nand 19.07.10\nupdates have been released.  These updates contain some security fixes and\nimproved device support.  It's noting that this is the last 19.07 update:\n\n\n\tOpenWrt 19.07.10 is the final release of the 19.07 release branch,\n\tthis branch is now end of life and we will not fix problems on this\n\tbranch any more, not even severe security problems. We encourage\n\tall users still using OpenWrt 19.07 to upgrade to OpenWrt 21.02 or\n\tmore recent OpenWrt versions.\n\n\nRouter distributions are easy to forget about; now might be a good time to\ncheck any relevant systems and, if needed, doing an upgrade.",
          "link": "https://lwn.net/Articles/892161/",
          "publishedOn": "2022-04-21T12:18:06.000Z",
          "wordCount": 865,
          "title": "Two OpenWrt updates",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891295/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for April 21, 2022 is available.",
          "link": "https://lwn.net/Articles/891295/",
          "publishedOn": "2022-04-21T00:30:12.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for April 21, 2022",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891273/",
          "author": "jake",
          "description": "A proposal to \"deprecate\" support for BIOS-only systems for Fedora, by no longer\nsupporting new installations on those systems, led to a predictably long\ndiscussion on the Fedora devel mailing list.  There are, it seems, quite a few\nusers who still have BIOS-based systems; many do not want to\nhave to switch away from Fedora simply to keep their systems up to date.\nBut, sometime in the future, getting rid of BIOS support seems inevitable since the\nburden on those maintaining the tools for installing and booting\nthose systems is non-trivial and likely to grow over time.  To head\nthat off, a special interest group (SIG) may form to help keep BIOS support\nalive until it really is no longer needed.",
          "link": "https://lwn.net/Articles/891273/",
          "publishedOn": "2022-04-20T21:35:55.000Z",
          "wordCount": null,
          "title": "[$] Fedora considers deprecating legacy BIOS",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892074/",
          "author": "jake",
          "description": "On his blog, Tom Tromey writes about speeding up the startup of the GDB debugger.  He sees 7x improvements in startup time (e.g. 2.2 to 0.3 seconds) for C++ code.\n\nGDB, essentially, had two DWARF readers. They actually shared a surprisingly small amount of code (which was an occasional source of bugs). For example, while abbrev lookup and name generation (more on that later) was shared, the actual DIE [debugging information entry] data structures were not.\n\nThe first DWARF reader created “partial symbols”, which held a name and some associated, easy-to-compute data, like the kind of symbol (variable, function, struct tag, etc). The second DWARF reader (which is still there now) is called when more information was needed about a particular symbol — say, its type. This reader reads all the DIEs in a DWARF compilation unit and expands them into gdb’s symbol table, block, and type data structures.\n\nBoth of these scans were slow, but for the time being I’ve only rewritten the first scan, as it was the one that was first encountered and most obviously painful. (I’ve got a plan to fix up the CU expansion as well, but that’s a lengthy project of its own.)",
          "link": "https://lwn.net/Articles/892074/",
          "publishedOn": "2022-04-20T19:38:33.000Z",
          "wordCount": 265,
          "title": "Tromey: Faster GDB Startup",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/892047/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (condor), Red Hat (389-ds:1.4, container-tools:2.0, kernel, kernel-rt, and kpatch-patch), SUSE (chrony, containerd, expat, git, icedtea-web, jsoup, jsr-305, kernel, libeconf, shadow and util-linux, protobuf, python-libxml2-python, python3, slirp4netns, sssd, vim, and wpa_supplicant), and Ubuntu (bash).",
          "link": "https://lwn.net/Articles/892047/",
          "publishedOn": "2022-04-20T09:51:58.000Z",
          "wordCount": 248,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891996/",
          "author": "corbet",
          "description": "The\n5.17.4,\n5.15.35,\n5.10.112,\n5.4.190,\n4.19.239,\n4.14.276,\nand 4.9.311 stable kernel updates have all been\nreleased; each contains another relatively large set of important fixes.",
          "link": "https://lwn.net/Articles/891996/",
          "publishedOn": "2022-04-20T07:53:45.000Z",
          "wordCount": 95,
          "title": "A pile of stable kernel updates",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891959/",
          "author": "corbet",
          "description": "The Google Project Zero blog is carrying a\nreport on zero-day vulnerabilities found to be exploited during 2021.\n\n\n\t5 of the 7 [Android] 0-days from 2021 targeted GPU drivers. This is\n\tactually \n\tnot that surprising when we consider the evolution of the Android\n\tecosystem as well as recent public security research into\n\tAndroid. The Android ecosystem is quite fragmented: many different\n\tkernel versions, different manufacturer customizations, etc. If an\n\tattacker wants a capability against \"Android devices\", they\n\tgenerally need to maintain many different exploits to have a decent\n\tpercentage of the Android ecosystem covered. However, if the\n\tattacker chooses to target the GPU kernel driver instead of another\n\tcomponent, they will only need to have two exploits since most\n\tAndroid devices use 1 of 2 GPUs: either the Qualcomm Adreno GPU or\n\tthe ARM Mali GPU.",
          "link": "https://lwn.net/Articles/891959/",
          "publishedOn": "2022-04-20T06:19:53.000Z",
          "wordCount": 507,
          "title": "The More You Know, The More You Know You Don’t Know (Project Zero)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891398/",
          "author": "jake",
          "description": "A mega-thread in the python-ideas mailing list is hardly surprising, of\ncourse; we\nhave covered quite a few of them over the years.  A recent example\nhelps shine a light into a dark—or at least dim—corner of the Python\nlanguage: the super()\nbuilt-in function for use by methods in class hierarchies.\nThere are some, perhaps surprising, aspects to super() along with\nwrinkles in how to properly use it.  But it has been part of the language\nfor a long time, so changes to its behavior, as was suggested in the\nthread, are pretty unlikely.",
          "link": "https://lwn.net/Articles/891398/",
          "publishedOn": "2022-04-19T15:01:03.000Z",
          "wordCount": null,
          "title": "[$] Super Python (part 1)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891868/",
          "author": "corbet",
          "description": "Luis Falcon brings the sad news that Pedro Francisco has\npassed on.  \"Pedro created and managed MasGNULinux, a Spanish blog with news about Free\nSoftware and GNU/Linux. MasGNULinux was the best reference in the latest\nFree Software projects for the Spanish speaking community.\"",
          "link": "https://lwn.net/Articles/891868/",
          "publishedOn": "2022-04-19T14:51:32.000Z",
          "wordCount": 274,
          "title": "Mourning Pedro Francisco",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891818/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (gzip and xz-utils), Fedora (dhcp and rsync), Mageia (chromium-browser-stable), openSUSE (chromium), SUSE (gzip, openjpeg2, and zabbix), and Ubuntu (klibc).",
          "link": "https://lwn.net/Articles/891818/",
          "publishedOn": "2022-04-19T10:46:05.000Z",
          "wordCount": 133,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891767/",
          "author": "corbet",
          "description": "Steve McIntyre argues that\nDebian needs to rethink its approach to non-free firmware.\n\n\n\tToday, a user with a new laptop from most vendors will struggle to\n\tuse it at all with our firmware-free Debian installation\n\tmedia. Modern laptops normally don't come with wired ethernet\n\tnow. There won't be any usable graphics on the laptop's screen. A\n\tvisually-impaired user won't get any audio prompts. These\n\texperiences are not acceptable, by any measure.",
          "link": "https://lwn.net/Articles/891767/",
          "publishedOn": "2022-04-19T06:48:49.000Z",
          "wordCount": 5536,
          "title": "McIntyre: Firmware - what are we going to do about it?",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891752/",
          "author": "jake",
          "description": "Over on the blog for the GNU Guix project, which is a \"transactional package manager and an advanced distribution of the GNU system that respects user freedom\", the project reflects on its ten-year journey.  The post consists of  personal accounts from around two dozen contributors about the project, its history, and its community.\n\nIt’s been ten years today since the very first commit to what was already called Guix—the unimaginative name is a homage to Guile and Nix, which Guix started by blending together. On April 18th, 2012, there was very little to see and no actual \"project\". The project formed in the following months and became a collective adventure around a shared vision.\n\nTen years later, it’s amazing to see what more than 600 people achieved, with 94K commits, countless hours of translation, system administration, web design work, and no less than 175 blog posts to share our enthusiasm at each major milestone. It’s been quite a ride!",
          "link": "https://lwn.net/Articles/891752/",
          "publishedOn": "2022-04-18T22:41:54.000Z",
          "wordCount": 257,
          "title": "10 years of stories behind Guix (Guix blog)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891733/",
          "author": "corbet",
          "description": "Version 2.36.0 of the Git\nsource-code management system is out.  As usual, the list of new features\nis long; this GitHub\nblog post covers some of the highlights:\n\n\n\tBut this [merge conflict] output can be understandably difficult to\n\tinterpret. In Git 2.36, --remerge-diff takes a different\n\tapproach. Instead of showing you the diffs between the merge\n\tresolution and each parent simultaneously, --remerge-diff\n\tshows you the diff between the file with merge conflicts, and the\n\tresolution.",
          "link": "https://lwn.net/Articles/891733/",
          "publishedOn": "2022-04-18T17:48:14.000Z",
          "wordCount": 139,
          "title": "Git 2.36.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/889607/",
          "author": "corbet",
          "description": "The ftrace and perf subsystems provide visibility into the workings of the\nkernel; by activating existing tracepoints, interested developers can see\nwhat is happening at specific points in the code.  As much as kernel\ndevelopers may resist the notion, though, not all events of interest on a\nsystem happen within the kernel. Administrators will often want to look\ninside user-space processes as well; they would be even happier with a\nmechanism that allows the simultaneous tracing of events in both the kernel\nand user space.  The user-events\nsubsystem, developed by Beau Belgrave and added\nduring the 5.18 merge window, \npromises that capability, but users will almost certainly have to wait\nanother cycle to gain access to it.",
          "link": "https://lwn.net/Articles/889607/",
          "publishedOn": "2022-04-18T17:25:03.000Z",
          "wordCount": null,
          "title": "[$] User events — but not quite yet",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891725/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (abcm2ps and chromium), Fedora (cacti, cacti-spine, and fribidi), and Mageia (crun, docker-containerd, libarchive, mediawiki, and ruby).",
          "link": "https://lwn.net/Articles/891725/",
          "publishedOn": "2022-04-18T13:09:05.000Z",
          "wordCount": 249,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891697/",
          "author": "corbet",
          "description": "The 5.18-rc3 kernel prepatch is out for\ntesting.  \"It's Sunday afternoon, and you all know what that means. It's time for\nanother release candidate.\n\n(Yes, yes, it's also Easter Sunday, but priorities, people!)\"",
          "link": "https://lwn.net/Articles/891697/",
          "publishedOn": "2022-04-18T06:33:16.000Z",
          "wordCount": 97,
          "title": "Kernel prepatch 5.18-rc3",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891616/",
          "author": "corbet",
          "description": "Anybody who might be considering acquiring a \"Freedom Phone\" might want to have\na look at Matthew\nGarrett's analysis first.\n\n\n\tAnyway. We have a company that seems to be combining blockchain and\n\tMLM [multi-level marketing], has some opinions about Quantum Entanglement, bases the\n\tsecurity of its platform on a set of novel cryptographic primitives\n\tthat seem to have had no external review, has implemented an API\n\tthat just hands out personal information without any authentication\n\tand an app that appears more than happy to upload all your contact\n\tdetails without telling you first, has failed to update this app to\n\tkeep up with upstream security updates, and is violating the\n\tupstream license.",
          "link": "https://lwn.net/Articles/891616/",
          "publishedOn": "2022-04-17T08:25:05.000Z",
          "wordCount": 1318,
          "title": "Garrett: The Freedom Phone is not great at privacy",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891574/",
          "author": "corbet",
          "description": "Version 9.1 of the GNU coreutils package has been released with lots of\nsmall tweaks and improvements.  \"ls no longer colors files with\ncapabilities by default, as file-based capabilities are very rarely used,\nand lookup increases processing per file by about 30%.  It's best to use\ngetcap [-r] to identify files with capabilities.\"",
          "link": "https://lwn.net/Articles/891574/",
          "publishedOn": "2022-04-16T14:42:48.000Z",
          "wordCount": 1243,
          "title": "GNU coreutils 9.1 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/889171/",
          "author": "corbet",
          "description": "Your editor has a certain tendency to accumulate books, to the point that\nthey crowd everything else out of the house.  There is a lot to be said for\nbooks: a physical book has a\nuser interface that has been optimized over centuries, and one can have a\nreasonably high degree of certainty that any given book will still work a\nfew decades from now.  Neither of those can be said for electronic books,\nbut they do have the advantages of taking less shelf space and being more\nportable.  So electronic books are part of the reading menu, which\nnaturally leads to the search for a free reader for those books; KOReader turns out to be an interesting\nalternative.",
          "link": "https://lwn.net/Articles/889171/",
          "publishedOn": "2022-04-15T15:41:11.000Z",
          "wordCount": null,
          "title": "[$] KOReader: a free electronic-book reader for e-ink devices",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891460/",
          "author": "jake",
          "description": "Greg Kroah-Hartman has announced the release of the 5.4.189 and 4.19.238 stable kernels.  As usual, they\ncontain important fixes throughout the tree and users should upgrade.",
          "link": "https://lwn.net/Articles/891460/",
          "publishedOn": "2022-04-15T14:25:00.000Z",
          "wordCount": 94,
          "title": "Stable kernels 5.4.189 and 4.19.238",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891453/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (fribidi and python-django), Fedora (postgresql-jdbc, stargz-snapshotter, and thunderbird), Slackware (git, gzip, and xz), and SUSE (kernel, SDL2, and tomcat).",
          "link": "https://lwn.net/Articles/891453/",
          "publishedOn": "2022-04-15T12:03:52.000Z",
          "wordCount": 136,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/889924/",
          "author": "corbet",
          "description": "Support for developing in the Rust\nlanguage is headed toward the kernel, though just when it\nwill land in the mainline is yet to be determined.  The Rust patches are\nprogressing, though, and beginning to attract attention from beyond the\nkernel community.  When two languages — and two different development\ncommunities — come together, the result can be a sort of cultural clash.\nSome early signs of that are appearing with regard to Rust in the kernel;\nif the resulting impedance mismatches can be worked out, the result could\nbe a better development environment for everybody involved.",
          "link": "https://lwn.net/Articles/889924/",
          "publishedOn": "2022-04-14T18:42:38.000Z",
          "wordCount": null,
          "title": "[$] Rustaceans at the border",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891354/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (lrzip), Fedora (community-mysql, expat, firefox, kernel, mingw-openjpeg2, nss, and openjpeg2), Mageia (ceph, subversion, and webkit2), openSUSE (chromium), Oracle (httpd:2.4), Red Hat (kpatch-patch), Slackware (ruby), SUSE (kernel and netatalk), and Ubuntu (gzip and xz-utils).",
          "link": "https://lwn.net/Articles/891354/",
          "publishedOn": "2022-04-14T12:39:07.000Z",
          "wordCount": 198,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891315/",
          "author": "corbet",
          "description": "SUSE has begun to\ndiscuss its plans for the next version of SUSE Linux Enterprise on the\nopenSUSE lists.  It appears that there will be some significant changes.\n\n\n\tIntending to do radical changes (regarding technology-\n\tbut also design-wise) we choose \"Adaptable Linux Platform\" or short\n\t\"ALP\" as codename for that next generation. This indicates already\n\tthat some things will be quite different than a \"mere \"SLE 15++\n\twould be ;) [...]\n\t\n\tAnother important point is that we intend to split what was a more\n\tgeneric, everything is closely intertwined into two parts: One\n\tsmaller hardware enabling piece, a kind of \"host OS\", and the and\n\tthe layer providing and supporting applications, which will be\n\tcontainer (and VM) based.",
          "link": "https://lwn.net/Articles/891315/",
          "publishedOn": "2022-04-14T10:08:11.000Z",
          "wordCount": 196,
          "title": "A hint on the future direction of SUSE Linux Enterprise",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/890577/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for April 14, 2022 is available.",
          "link": "https://lwn.net/Articles/890577/",
          "publishedOn": "2022-04-14T00:13:27.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for April 14, 2022",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891082/",
          "author": "jake",
          "description": "Using strings with contents that are supplied by users can be fraught with\nperil; SQL injection is a well-known technique for attacking applications\nthat stems from that, for example.  Generally, database frameworks and\nlibraries provide mechanisms that seek to lead programmers toward doing The\nRight Thing, with parameterized queries and the like, but they cannot\nenforce that—inventive developers will seemingly always find ways to inject\nuser input into places it should not go.  A recently adopted Python\nEnhancement Proposal (PEP) provides a way to enforce the use of \nstrings that are untainted by user input, but it uses the optional typing features\nof the language to do so; those wanting to take advantage of it will need\nto be running a type-checking program.",
          "link": "https://lwn.net/Articles/891082/",
          "publishedOn": "2022-04-13T21:01:44.000Z",
          "wordCount": null,
          "title": "[$] A literal string type for Python",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891248/",
          "author": "corbet",
          "description": "The 5.17.3,\n5.16.20,\n5.15.34, and\n5.10.111 stable kernel updates have been\nreleased after a relatively quick review cycle.  Each contains a relatively\nlarge set of important fixes.  Note that 5.16.20 is the final update in the\n5.16.x series.",
          "link": "https://lwn.net/Articles/891248/",
          "publishedOn": "2022-04-13T20:11:43.000Z",
          "wordCount": 131,
          "title": "A set of stable kernel updates",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891182/",
          "author": "corbet",
          "description": "Security updates have been issued by Arch Linux (gzip, python-django, and xz), Debian (chromium, subversion, and zabbix), Red Hat (expat, kernel, and thunderbird), SUSE (go1.16, go1.17, kernel, libexif, libsolv, libzypp, zypper, opensc, subversion, thunderbird, and xz), and Ubuntu (git, linux-bluefield, nginx, and subversion).",
          "link": "https://lwn.net/Articles/891182/",
          "publishedOn": "2022-04-13T13:46:35.000Z",
          "wordCount": 286,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891121/",
          "author": "corbet",
          "description": "Version 6.3 of the Qt\ngraphics library has been released.  \"Qt 6.3 also comes with a decent\nset of new functionality. A total of 250 user stories and tasks\nimplementing new functionality have been completed for 6.3. Those are of\ncourse too many to list individually, and if you want to have all the\ndetails, have a look at our new\nfeatures page and our Release Notes.\"",
          "link": "https://lwn.net/Articles/891121/",
          "publishedOn": "2022-04-13T07:45:18.000Z",
          "wordCount": 136,
          "title": "Qt 6.3 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891112/",
          "author": "jake",
          "description": "Git maintainer Junio C Hamano has \nannounced the\nrelease of v2.35.2, along with  multiple other Git versions\n(\"v2.30.3, v2.31.2, v2.32.1, v2.33.2, and \nv2.34.2\"), to fix a security problem that can happen on multi-user\nmachines (CVE-2022-24765).\nThis GitHub blog\npost has more details, though the GitHub service itself is not\nvulnerable.  The description in the announcement seems a bit\nWindows-centric, but Linux multi-user systems are apparently vulnerable as well:\n\n   On multi-user machines, Git users might find themselves\n   unexpectedly in a Git worktree, e.g. when another user created a\n   repository in `C:\\.git`, in a mounted network drive or in a\n   scratch space. Merely having a Git-aware prompt that runs `git\n   status` (or `git diff`) and navigating to a directory which is\n   supposedly not a Git worktree, or opening such a directory in an\n   editor or IDE such as VS Code or Atom, will potentially run\n   commands defined by that other user.",
          "link": "https://lwn.net/Articles/891112/",
          "publishedOn": "2022-04-13T03:56:30.000Z",
          "wordCount": 3085,
          "title": "Git security fixes released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/890957/",
          "author": "jake",
          "description": "When last we looked in on the proposed\ntrusted_for() system call, which would allow user-space interpreters\nand other tools to ask the kernel whether a file is \"trusted\" for execution, it\nlooked like it was on-track for the mainline.  That was back in\nOctober 2020; the patch has been updated multiple times since then,\nmade its way into linux-next, and a pull\nrequest was made by Mickaël Salaün for the 5.18 merge window.  But\nit seems that there will be more to the story of getting this functionality\ninto the kernel, as Linus Torvalds declined to pull trusted_for(),\nat least partly because he did not like the name, but there were other\nreasons as well.  While he is not opposed\nto the functionality it would provide, he also had strong feelings that a\nnew system call\nwas not the right approach.",
          "link": "https://lwn.net/Articles/890957/",
          "publishedOn": "2022-04-12T20:06:13.000Z",
          "wordCount": null,
          "title": "[$] trusted_for() bounces off the merge window",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891062/",
          "author": "corbet",
          "description": "David Malcolm has posted an\nupdate on the state of static analysis in GCC 12.\n\n\n\tSome other languages, such as Perl, can track input and flag any\n\tvariable that should not be trusted because it was read from an\n\toutside source such as a web form. Flagging variables in this\n\tmanner is called tainting. After a program runs the variable\n\tthrough a check, the variable can be untainted, a process called\n\tsanitization.\n\n\tOur GCC analyzer's taint mode is activated by\n\t-fanalyzer-checker=taint (which should be specified in\n\taddition to -fanalyzer). Taint mode attempts to track\n\tattacker-controlled values entering the program and to warn if they\n\tare used without sanitization.",
          "link": "https://lwn.net/Articles/891062/",
          "publishedOn": "2022-04-12T13:25:09.000Z",
          "wordCount": 1977,
          "title": "Malcolm: The state of static analysis in the GCC 12 compiler",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/891052/",
          "author": "corbet",
          "description": "The 4.9.310 stable kernel update has been\nreleased; the changes consist mostly of backported Spectre mitigation patches.",
          "link": "https://lwn.net/Articles/891052/",
          "publishedOn": "2022-04-12T10:10:45.000Z",
          "wordCount": 81,
          "title": "Stable kernel 4.9.310",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "M0AGX",
      "feedUrl": "https://m0agx.eu/feed/",
      "siteUrl": "https://m0agx.eu",
      "articles": []
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://www.jamesshore.com/v2/books/aoad2/book_club/refactoring",
          "author": null,
          "description": "James Shore's Art of Agile Development is my favorite single-volume\n      book on agile software development. A reason for that is its serious\n      emphasis on the technical practices that are essential to making it work\n      effectively. James and I discuss the role of refactoring for software\n      development, the nature of design changes we see, and how to break down\n      big changes into small pieces.\nmore…",
          "link": "https://www.jamesshore.com/v2/books/aoad2/book_club/refactoring",
          "publishedOn": "2022-04-28T15:33:00.000Z",
          "wordCount": 364,
          "title": "Agile Book Club interview on Refactoring",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/2022-use-twitter.html",
          "author": null,
          "description": "A couple of recent conversations about Twitter were nudging me into writing\n      about how I use Twitter even before The Muskover developed. Twitter has\n      become an important part of my online life, and my online life is a big part\n      of what I do. But like any tool, Twitter can be used in many different ways,\n      and how you use it affects how useful it can be.\nmore…",
          "link": "https://martinfowler.com/articles/2022-use-twitter.html",
          "publishedOn": "2022-04-26T12:50:00.000Z",
          "wordCount": 940,
          "title": "How I use Twitter",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/photos/128.html",
          "author": null,
          "description": "Heian-jingu Shrine\nKyoto, Japan (2004)",
          "link": "https://martinfowler.com/photos/128.html",
          "publishedOn": "2022-04-19T21:58:00.000Z",
          "wordCount": 23,
          "title": "photostream 128",
          "imageUrl": "https://martinfowler.com/photos/128.jpg"
        }
      ]
    },
    {
      "title": "MCU on Eclipse",
      "feedUrl": "https://mcuoneclipse.com/feed/",
      "siteUrl": "https://mcuoneclipse.com",
      "articles": [
        {
          "id": "http://mcuoneclipse.com/?p=34685",
          "author": "Erich Styger",
          "description": "The NXP MCU-Link Pro debug probe includes a LPC804 as an additional microcontroller on the board, including its debug header. The question is: how to debug the on-board extra LPC804 microcontroller with an external debug probe? One easy way to … Continue reading →",
          "link": "https://mcuoneclipse.com/2022/04/28/debugging-the-lpc804-on-the-mcu-link-pro-with-an-external-debug-probe/",
          "publishedOn": "2022-04-28T13:06:40.000Z",
          "wordCount": 603,
          "title": "Debugging the LPC804 on the MCU-Link Pro with an external Debug Probe",
          "imageUrl": "https://mcuoneclipse.files.wordpress.com/2022/04/external-debug-probes-with-mcu-link-pro.png?w=1200"
        },
        {
          "id": "http://mcuoneclipse.com/?p=34667",
          "author": "Erich Styger",
          "description": "Just before the long Easter break, NXP has released an update of the MCUXpresso IDE, the version 11.5.1. This is mainly a maintenance release, fixing a few issues (see list on community), plus updated debug connection binaries. Notably it fixes … Continue reading →",
          "link": "https://mcuoneclipse.com/2022/04/19/mcuxpresso-ide-11-5-1/",
          "publishedOn": "2022-04-19T08:15:25.000Z",
          "wordCount": 926,
          "title": "MCUXpresso IDE 11.5.1",
          "imageUrl": "https://mcuoneclipse.files.wordpress.com/2022/04/mcuxpresso-ide-v11.5.1.png?w=1200"
        }
      ]
    },
    {
      "title": "The ESP Journal - Medium",
      "feedUrl": "https://medium.com/feed/the-esp-journal",
      "siteUrl": "https://blog.espressif.com?source=rss----d5414d5dee73---4",
      "articles": [
        {
          "id": "https://medium.com/p/db1f3eb229e0",
          "author": "ESP BOT",
          "description": "Hi everyone,",
          "link": "https://blog.espressif.com/april-2022-db1f3eb229e0?source=rss----d5414d5dee73---4",
          "publishedOn": "2022-05-02T05:56:17.000Z",
          "wordCount": 554,
          "title": "April 2022",
          "imageUrl": "https://miro.medium.com/max/498/0*9WmLW-5GvFL_-qxp.png"
        },
        {
          "id": "https://medium.com/p/152b6a5ceb6c",
          "author": "Adwait Patankar",
          "description": "Earlier version of ESP Insights Dashboard had a limitation where in the user could check and analyse device reported metrics, for only…",
          "link": "https://blog.espressif.com/esp-insights-in-depth-device-metrics-152b6a5ceb6c?source=rss----d5414d5dee73---4",
          "publishedOn": "2022-04-29T06:16:11.000Z",
          "wordCount": 394,
          "title": "ESP Insights: In-depth device metrics",
          "imageUrl": "https://miro.medium.com/max/1200/1*taJflqX0r3ayYxLrS31VBg.png"
        },
        {
          "id": "https://medium.com/p/bcf4d7d0b2c6",
          "author": "Teo Swee Ann",
          "description": "As many would have heard, Shanghai is now undergoing a major lockdown and quarantine due to COVID-19. In the midst of this lockdown, we…",
          "link": "https://blog.espressif.com/esp32-c2-and-why-it-matter-s-bcf4d7d0b2c6?source=rss----d5414d5dee73---4",
          "publishedOn": "2022-04-19T09:16:19.000Z",
          "wordCount": 873,
          "title": "ESP32-C2 and Why It Matter-s",
          "imageUrl": "https://miro.medium.com/max/1200/1*XNuruOnvm_geYSCEbvfTJw.jpeg"
        },
        {
          "id": "https://medium.com/p/47ce9564807f",
          "author": "Roland Dobai",
          "description": "The ESP USB Bridge is an ESP-IDF project utilizing an ESP32-S2 (or optionally, an ESP32-S3) chip to create a bridge between a computer and…",
          "link": "https://blog.espressif.com/esp-usb-bridge-47ce9564807f?source=rss----d5414d5dee73---4",
          "publishedOn": "2022-04-14T09:47:05.000Z",
          "wordCount": 397,
          "title": "ESP USB Bridge",
          "imageUrl": "https://miro.medium.com/max/1200/1*srV9gXnUtnyN4N0PiqwEHA.png"
        }
      ]
    },
    {
      "title": "/* the devil is in the detail */",
      "feedUrl": "https://minjang.github.io/feed.xml",
      "siteUrl": "http://minjang.github.io/",
      "articles": []
    },
    {
      "title": "mingrammer's note",
      "feedUrl": "https://mingrammer.com/index.xml",
      "siteUrl": "https://mingrammer.com/",
      "articles": []
    },
    {
      "title": "Novel Bits",
      "feedUrl": "https://www.novelbits.io/feed",
      "siteUrl": "https://www.novelbits.io",
      "articles": [
        {
          "id": "https://www.novelbits.io/?p=19156",
          "author": "Mohammad Afaneh",
          "description": "Last Updated on May 2, 2022 by Mohammad Afaneh In a few previous posts (Part 1, Part 2, and Part 3), we covered the basics of designing a secure Over-the-Air Device Firmware Update (OTA DFU) process, an overview of the Nordic nRF52 OTA DFU process, as well as testing out one of the DFU examples…\nThe post Implementing Nordic nRF52 OTA DFU over Bluetooth LE – Part 4 appeared first on Novel Bits.",
          "link": "https://www.novelbits.io/nrf52-ota-dfu-ble-part-4/",
          "publishedOn": "2022-05-02T05:38:35.000Z",
          "wordCount": 3383,
          "title": "Implementing Nordic nRF52 OTA DFU over Bluetooth LE – Part 4",
          "imageUrl": "https://www.novelbits.io/wp-content/uploads/2022/05/nRF-OTA-DFU-Part-4-1.png"
        },
        {
          "id": "https://www.novelbits.io/?p=19080",
          "author": "Mohammad Afaneh",
          "description": "Last Updated on April 25, 2022 by Mohammad Afaneh In a couple of previous posts (here and here), we covered the basics of Bluetooth Low Energy (BLE) advertising and advertisement packets. In this post, we’ll go into more depth on Bluetooth advertisements and specifically the advertising packet payload and the maximum amount of data you…\nThe post What’s the Maximum Data Size you can send in a Bluetooth Advertising Packet? appeared first on Novel Bits.",
          "link": "https://www.novelbits.io/maximum-data-bluetooth-advertising-packet-ble/",
          "publishedOn": "2022-04-25T08:46:55.000Z",
          "wordCount": 2242,
          "title": "What’s the Maximum Data Size you can send in a Bluetooth Advertising Packet?",
          "imageUrl": "https://www.novelbits.io/wp-content/uploads/2022/04/Featured-Image-5.png"
        },
        {
          "id": "https://www.novelbits.io/?p=18944",
          "author": "Mohammad Afaneh",
          "description": "Last Updated on April 18, 2022 by Mohammad Afaneh First, a Short Story… Before I dive into the meat of the topic (Bluetooth Low Energy vs. Bluetooth Classic), I’d like to tell you a little story… A few years ago (circa 2012), a friend of mine came to me with an idea that he wanted…\nThe post Bluetooth Low Energy (BLE) vs. Bluetooth Classic (BR/EDR) appeared first on Novel Bits.",
          "link": "https://www.novelbits.io/bluetooth-low-energy-vs-bluetooth-classic-br-edr/",
          "publishedOn": "2022-04-18T04:27:44.000Z",
          "wordCount": 1211,
          "title": "Bluetooth Low Energy (BLE) vs. Bluetooth Classic (BR/EDR)",
          "imageUrl": "https://www.novelbits.io/wp-content/uploads/2022/04/Bluetooth-Low-Energy-vs-Bluetooth-Classic.png"
        },
        {
          "id": "https://www.novelbits.io/?p=18869",
          "author": "Mohammad Afaneh",
          "description": "This tutorial is an excerpt from a course available within the Bluetooth Developer Academy, developed in collaboration with Anas Imtiaz, Ph.D. For the purpose of this tutorial (separated into two parts), our goal is to create an iOS app that can manage multiple BLE peripherals. Our example will be an app that can be used…\nThe post How to Manage Multiple BLE Peripherals in iOS [SwiftUI] appeared first on Novel Bits.",
          "link": "https://www.novelbits.io/manage-multiple-ble-peripherals-in-ios-swiftui/",
          "publishedOn": "2022-04-11T06:09:15.000Z",
          "wordCount": 5416,
          "title": "How to Manage Multiple BLE Peripherals in iOS [SwiftUI]",
          "imageUrl": "https://www.novelbits.io/wp-content/uploads/2022/04/Featured-Image-2.png"
        }
      ]
    },
    {
      "title": "null program",
      "feedUrl": "https://nullprogram.com/feed/",
      "siteUrl": "https://nullprogram.com",
      "articles": [
        {
          "id": "https://nullprogram.com/blog/2022/04/30/",
          "author": null,
          "description": "Ever been so successful that credit card processing was your bottleneck?\nPerhaps you’ve wondered, “If only I could compute check digits three times\nfaster using the same hardware!” Me neither. But if that ever happens\nsomeday, then this article is for you. I will show how to compute the\nLuhn algorithm in parallel using SIMD within a register, or\nSWAR.\nIf you want to skip ahead, here’s the full source, tests, and benchmark:\nluhn.c\nThe Luhn algorithm isn’t just for credit card numbers, but they do make a\nnice target for a SWAR approach. The major payment processors use 16\ndigit numbers — i.e. 16 ASCII bytes — and typical machines today have\n8-byte registers, so the input fits into two machine registers. In this\ncontext, the algorithm works like so:\nConsider the digits number as an array, and…",
          "link": "https://nullprogram.com/blog/2022/04/30/",
          "publishedOn": "2022-04-30T17:53:05.000Z",
          "wordCount": 1403,
          "title": "Luhn algorithm using SWAR and SIMD",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Preshing on Programming",
      "feedUrl": "http://preshing.com/feed",
      "siteUrl": "https://preshing.com/feed",
      "articles": []
    },
    {
      "title": "research!rsc",
      "feedUrl": "https://research.swtch.com/feed.atom",
      "siteUrl": "http://research.swtch.com/feed.atom",
      "articles": []
    },
    {
      "title": "AEP코리아네트",
      "feedUrl": "https://rss.blog.naver.com/aepkoreanet.xml",
      "siteUrl": "https://blog.naver.com/aepkoreanet",
      "articles": []
    },
    {
      "title": "애자일 이야기",
      "feedUrl": "http://rss.egloos.com/blog/agile",
      "siteUrl": "http://agile.egloos.com",
      "articles": []
    },
    {
      "title": "Embedded Rambling",
      "feedUrl": "http://shadetail.com/blog/feed/",
      "siteUrl": "http://shadetail.com/blog",
      "articles": []
    },
    {
      "title": "Stacey on IoT | Internet of Things news and analysis",
      "feedUrl": "https://staceyoniot.com/feed/",
      "siteUrl": "https://staceyoniot.com",
      "articles": [
        {
          "id": "https://staceyoniot.com/?p=10227",
          "author": "Kevin C. Tofel",
          "description": "Ever since Apple announced Home Key last year, I’ve been anxiously waiting to try a smart lock that supports it. Home Key uses the same NFC technology as ApplePay on iOS devices. With Home Key, an iPhone or Apple Watch acts as a digital key for your smart home. For the past week, I’ve been […]\nThe post Schlage Encode Plus Smart Wi-Fi lock: Apple Home Key arrives appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/schlage-encode-plus-review-with-homekey/",
          "publishedOn": "2022-05-04T17:43:16.000Z",
          "wordCount": 1609,
          "title": "Schlage Encode Plus Smart Wi-Fi lock: Apple Home Key arrives",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/05/IMG_0024.jpg"
        },
        {
          "id": "https://staceyoniot.com/?p=10219",
          "author": "Stacey Higginbotham",
          "description": "This year feels like a fraught one for the smart home. On one hand, there’s the promise of the Matter protocol arriving to help solve persistent interoperability challenges. On the other hand, we’re seeing a wave of companies shut their doors as they assess the landscape post-pandemic. So it seemed like a good time to […]\nThe post Discussing the business of smart things with Nanoleaf’s CEO appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/discussing-the-business-of-smart-things-with-nanoleafs-ceo/",
          "publishedOn": "2022-05-03T16:35:10.000Z",
          "wordCount": 1257,
          "title": "Discussing the business of smart things with Nanoleaf’s CEO",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/05/Shapes_Hex_9x_Meditation-Room.jpg"
        },
        {
          "id": "https://staceyoniot.com/?p=10207",
          "author": "Kevin C. Tofel",
          "description": "On our latest IoT Podcast episode, we take a question that Chris left on our IoT Voicemail hotline. Chris has a pair of Apple TV 4K boxes and one HomePod mini, all of which can be used as an Apple HomeKit hub. You can use HomeKit without a hub, but if you want to run […]\nThe post How to fix an Apple HomeKit hub stuck in Standby mode appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/how-to-fix-an-apple-homekit-hub-stuck-in-standby-mode/",
          "publishedOn": "2022-05-02T18:00:10.000Z",
          "wordCount": 1461,
          "title": "How to fix an Apple HomeKit hub stuck in Standby mode",
          "imageUrl": "https://i0.wp.com/staceyoniot.com/wp-content/uploads/2020/12/HomePod-mini-featured-scaled.jpg?fit=2560%2C1920&ssl=1"
        },
        {
          "id": "https://staceyoniot.com/?p=10216",
          "author": "Stacey Higginbotham",
          "description": "In the run-up to the Russian invasion of Ukraine, we were starting to hear a lot more about vulnerabilities in our industrial controls systems along with the need to secure our infrastructure from cyberattacks. Immediately after the war began, the U.S. government started a program to help utilities, municipal water companies, industrial plants, and more harden their […]\nThe post Industrial software is a prominent target. What should we do? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/industrial-software-is-a-prominent-target-what-should-we-do/",
          "publishedOn": "2022-05-02T16:09:00.000Z",
          "wordCount": 911,
          "title": "Industrial software is a prominent target. What should we do?",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/05/Screen-Shot-2022-04-28-at-2.16.14-PM.png"
        },
        {
          "id": "https://staceyoniot.com/?p=10214",
          "author": "Stacey Higginbotham",
          "description": "Amazon is using data from Alexa for ads: Researchers have discovered that Amazon’s digital assistant uses data from voice utterances to create demographic profiles that it sells to advertisers. Advertisers apparently don’t have access to your individual voice utterances, but information such as the songs you ask Alexa to play or items you add to […]\nThe post IoT news of the week for April 29, 2022 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-april-29-2022/",
          "publishedOn": "2022-04-29T19:02:26.000Z",
          "wordCount": 1484,
          "title": "IoT news of the week for April 29, 2022",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2017/08/iot-news-week.jpg"
        },
        {
          "id": "https://staceyoniot.com/?p=10204",
          "author": "Stacey Higginbotham",
          "description": "We kick off the show this week with Insteon’s comments about its abrupt closure and asset sale before trying to salvage some good news from Arm’s latest chip news. We’re getting a new M-class processor that’s going to be super capable for machine learning at the edge and other jobs. We also give you a preview of next […]\nThe post Podcast: Amazon’s $1B industrial IoT fund appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-amazons-1b-industrial-iot-fund/",
          "publishedOn": "2022-04-28T13:00:36.000Z",
          "wordCount": 702,
          "title": "Podcast: Amazon’s $1B industrial IoT fund",
          "imageUrl": "https://i0.wp.com/staceyoniot.com/wp-content/uploads/2022/04/Screen-Shot-2022-04-27-at-6.16.41-PM.png?fit=776%2C459&ssl=1"
        },
        {
          "id": "https://staceyoniot.com/?p=10181",
          "author": "Kevin C. Tofel",
          "description": "Interested in the air quality of your smart home? Airthings has a product line that fits the bill but if you want smart home integrations based on the data, your options are thin. I’ve been using the $199.99 Airthings View Pollution in my house for the past two weeks. In my experience, the limited sensors […]\nThe post Airthings Wave Pollution review: Good for monitoring but not that smart appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/airthings-wave-pollution-review-good-for-monitoring-but-not-that-smart/",
          "publishedOn": "2022-04-27T14:48:21.000Z",
          "wordCount": 1474,
          "title": "Airthings Wave Pollution review: Good for monitoring but not that smart",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/04/IMG_1486-scaled.jpeg"
        },
        {
          "id": "https://staceyoniot.com/?p=10176",
          "author": "Stacey Higginbotham",
          "description": "LoRaWAN network provider Senet said this week that it has expanded its relationship with the Helium network, a distributed peer-to-peer LoRaWAN network. Senet had started letting its customers roam onto the Helium network in September of last year, but with this move Senet has expanded the deal to include Helium’s global hotspots. And that means Senet customers can roam […]\nThe post Senet’s embrace of Helium shows its confidence in LoRaWAN appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/senets-embrace-of-helium-shows-its-confidence-in-lorawan/",
          "publishedOn": "2022-04-25T13:00:51.000Z",
          "wordCount": 1090,
          "title": "Senet’s embrace of Helium shows its confidence in LoRaWAN",
          "imageUrl": "https://i0.wp.com/staceyoniot.com/wp-content/uploads/2022/04/bigstock-Blue-Digital-Water-Meter-Dirt-439790228.jpg?fit=900%2C505&ssl=1"
        },
        {
          "id": "https://staceyoniot.com/?p=10173",
          "author": "Stacey Higginbotham",
          "description": "This week’s news was compiled and written by Kevin C. Tofel Carbon dioxide could deliver smart home privacy: Chalk up another interesting project from MIT’s Media Lab. The latest is a new approach to getting more privacy in the smart home. It uses a pair of sensors. One is for infrared, which isn’t novel, while the other is for […]\nThe post IoT news of the week for April 22, 2022 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-april-22-2022/",
          "publishedOn": "2022-04-22T18:00:50.000Z",
          "wordCount": 1361,
          "title": "IoT news of the week for April 22, 2022",
          "imageUrl": "https://i0.wp.com/staceyoniot.com/wp-content/uploads/2017/08/iot-news-week.jpg?fit=700%2C400&ssl=1"
        },
        {
          "id": "https://staceyoniot.com/?p=10169",
          "author": "Stacey Higginbotham",
          "description": "Smart home company Insteon has shut off its servers, lost its management team, and on Thursday sent an email to customers explaining how it plans to sell any remaining assets to help pay off creditors as part of a formal dissolution of the business. It has been the most drama-filled end of a consumer IoT company to […]\nThe post The end of Insteon and why the smart home keeps faltering appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/the-end-of-insteon-and-why-the-smart-home-keeps-faltering/",
          "publishedOn": "2022-04-22T14:48:01.000Z",
          "wordCount": 2586,
          "title": "The end of Insteon and why the smart home keeps faltering",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/04/Screen-Shot-2022-04-16-at-8.47.40-AM.png"
        },
        {
          "id": "https://staceyoniot.com/?p=10164",
          "author": "Stacey Higginbotham",
          "description": "This week we start the show with the end of Insteon, which is probably the biggest smart home story this week. We talked about what we know (which isn’t much) and why saving cloud-based smart home services is not as easy as escrowing code and hoping a community continues to support the product. In other […]\nThe post Podcast:  So long Insteon appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-so-long-insteon/",
          "publishedOn": "2022-04-21T13:00:55.000Z",
          "wordCount": 625,
          "title": "Podcast:  So long Insteon",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/04/Screen-Shot-2022-04-20-at-3.42.14-PM.png"
        },
        {
          "id": "https://staceyoniot.com/?p=10144",
          "author": "Kevin C. Tofel",
          "description": "This hasn’t been a good week for the smart home as yet another connected device service seems to have disappeared. It appears anyone using Insteon products has faced a dead-end as the company’s cloud service has gone silent. So too has the company up to this point. What are Insteon device owners and service users […]\nThe post With Insteon down, possibly for good, what options do you have for your devices? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/with-insteon-down-possibly-for-good-what-options-do-you-have-for-your-devices/",
          "publishedOn": "2022-04-20T15:01:58.000Z",
          "wordCount": 2034,
          "title": "With Insteon down, possibly for good, what options do you have for your devices?",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/04/Insteon-Logo-1.jpg"
        },
        {
          "id": "https://staceyoniot.com/?p=10139",
          "author": "Stacey Higginbotham",
          "description": "Y’all know I have been writing about indoor air quality for years, with a particular focus on air purifiers, air quality monitors, and even HVAC systems. And I’m looking forward to bringing air quality data into the smart home as part of the Matter standard (or some standard) so we can tie monitors, purifiers, and HVAC systems together. Ultimately, […]\nThe post Ex-Googler creates clean air startup for the whole home appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/ex-googler-creates-clean-air-startup-for-the-whole-home/",
          "publishedOn": "2022-04-19T16:29:38.000Z",
          "wordCount": 934,
          "title": "Ex-Googler creates clean air startup for the whole home",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/04/0bb300627250b9aad3b8a345814dc4ab_original.png"
        },
        {
          "id": "https://staceyoniot.com/?p=10135",
          "author": "Stacey Higginbotham",
          "description": "Thanks to the Amazon Astro reviews hitting the press, a recent conversation with a co-founder of iRobot, and fundings for startups building construction and medical robots, I’ve been thinking a lot about why we are so obsessed with robots in the smart home. I’ve been thinking about how we are obsessed with a Jetsons-era idea […]\nThe post The smart home doesn’t need a robot — it should be a robot appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/the-smart-home-doesnt-need-a-robot-it-should-be-a-robot/",
          "publishedOn": "2022-04-19T14:33:38.000Z",
          "wordCount": 1907,
          "title": "The smart home doesn’t need a robot — it should be a robot",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/04/astro_lifestyle_leaving-1-scaled.jpeg"
        },
        {
          "id": "https://staceyoniot.com/?p=10128",
          "author": "Stacey Higginbotham",
          "description": "Is your Insteon smart home system down? I’m getting reports from dozens of Insteon users that as of Friday their smart home hubs have stopped working. So far, none of them have heard from the company, and Insteon’s Twitter account hasn’t been updated since June 2021. I reached out to Rob Lilleness, the president and […]\nThe post Insteon is down and may not be coming back appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/insteon-is-down-and-may-not-be-coming-back/",
          "publishedOn": "2022-04-16T16:24:11.000Z",
          "wordCount": 843,
          "title": "Insteon is down and may not be coming back",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/04/Screen-Shot-2022-04-16-at-9.22.48-AM.png"
        },
        {
          "id": "https://staceyoniot.com/?p=10115",
          "author": "Kevin C. Tofel",
          "description": "On our most recent IoT Podcast, we chose an email listener question instead of a voicemail from our IoT Podcast Hotline. This week, Matt wrote in with a fairly specific question but it can be applied to any number of smart homes. Matt’s current setup is built with a “combination of SmartThings, several Echo devices, […]\nThe post What are good wireless Z-Wave switch or button options? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/what-are-good-wireless-z-wave-switch-or-button-options/",
          "publishedOn": "2022-04-16T13:00:16.000Z",
          "wordCount": 1112,
          "title": "What are good wireless Z-Wave switch or button options?",
          "imageUrl": "https://i0.wp.com/staceyoniot.com/wp-content/uploads/2022/04/WallMote-button.jpg?fit=1500%2C844&ssl=1"
        },
        {
          "id": "https://staceyoniot.com/?p=10125",
          "author": "Stacey Higginbotham",
          "description": "Diligent Robotics raises $30M: Diligent Robotics, a company in Austin, Texas that is building the Moxi robot designed for hospitals, has raised more than $30 million in funding. I’ve loved this company and its robot for years, ever since I took a group of fifth graders to the UT Engineering school and ran into a Moxi demo. However, […]\nThe post IoT news of the week for April 15, 2022 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-april-15-2022/",
          "publishedOn": "2022-04-15T19:26:21.000Z",
          "wordCount": 1414,
          "title": "IoT news of the week for April 15, 2022",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2017/08/iot-news-week.jpg"
        },
        {
          "id": "https://staceyoniot.com/?p=10111",
          "author": "Stacey Higginbotham",
          "description": "In this week’s show we question whether or not we want Amazon’s Astro home robot after seeing a few reviews. We then note that Google has introduced gaze as signal to wake up Google Assistant, which is one of the first uses of gaze as a wake-up indicator for the smart home. Then we talk […]\nThe post Podcast: What do you want in a home robot? appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-what-do-you-want-in-a-home-robot/",
          "publishedOn": "2022-04-14T13:00:42.000Z",
          "wordCount": 681,
          "title": "Podcast: What do you want in a home robot?",
          "imageUrl": "https://i0.wp.com/staceyoniot.com/wp-content/uploads/2022/04/astro_lifestyle_comms-scaled.jpeg?fit=2560%2C1896&ssl=1"
        },
        {
          "id": "https://staceyoniot.com/?p=10091",
          "author": "Kevin C. Tofel",
          "description": "Although I’ve gone all-in on HomeKit for personal use, there are still other great smart home options out there. And one of them is Home Assistant, which often gets lost in the connected platform shuffle. If you’re not familiar with it, Home Assistant is an open-source smart home system you self-host on a small computer, […]\nThe post Home Assistant’s newest release is big and awesome appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/home-assistants-newest-release-is-big-and-awesome/",
          "publishedOn": "2022-04-13T15:03:51.000Z",
          "wordCount": 1684,
          "title": "Home Assistant’s newest release is big and awesome",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/04/Home-Assistant-dashboard-featured.jpg"
        },
        {
          "id": "https://staceyoniot.com/?p=10074",
          "author": "Stacey Higginbotham",
          "description": "Last month, the Kwikset smart lock that came installed in the back door of my house when we moved in two years ago broke. I wasn’t in love with the lock, but I was even less happy with the timing of it breaking. I would have preferred to wait for Matter to come out before […]\nThe post Shopping for smart locks is a mess, but here’s what I bought appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/shopping-for-smart-locks-is-a-mess-but-heres-what-i-bought/",
          "publishedOn": "2022-04-12T15:33:16.000Z",
          "wordCount": 1298,
          "title": "Shopping for smart locks is a mess, but here’s what I bought",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/04/eufylock-1.jpg"
        },
        {
          "id": "https://staceyoniot.com/?p=10063",
          "author": "Kevin C. Tofel",
          "description": "On our most recent IoT Podcast, Jonathan called in with an interesting smart home problem to solve. He’s looking for a button or some other simple device that, when pressed, will disable any smart home routines. Jonathan’s wife has an irregular sleep schedule due to her job so he doesn’t want automations or routines to […]\nThe post It’s time the smart home got a do not disturb mode appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/its-time-the-smart-home-got-a-do-not-disturb-mode/",
          "publishedOn": "2022-04-11T18:34:24.000Z",
          "wordCount": 821,
          "title": "It’s time the smart home got a do not disturb mode",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2018/10/00000IMG_00000_BURST20181013192851394_COVER.jpg"
        },
        {
          "id": "https://staceyoniot.com/?p=10072",
          "author": "Stacey Higginbotham",
          "description": "This is a good time to be excited about wireless technology that doesn’t require batteries. As a flush of recent news proves, energy-harvesting technology is poised to move from pilot applications to scaled out use in the real world in the coming year. If we want to deploy trillions of connected sensors, we have to dump batteries. […]\nThe post The battery-free IoT revolution is here! appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/the-battery-free-iot-revolution-is-here/",
          "publishedOn": "2022-04-11T15:29:49.000Z",
          "wordCount": 1251,
          "title": "The battery-free IoT revolution is here!",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2020/11/steam-monitoring.jpg"
        },
        {
          "id": "https://staceyoniot.com/?p=10060",
          "author": "Stacey Higginbotham",
          "description": "The latest on the Sigfox sale: The French court met with bidders for Sigfox’s business and assets on April 5, and apparently only four credible bidders turned up. They were Singapore-based UnaBiz, Actility, a French LoRaWAN provider; OTEIS France, and Greybull Capital, an English venture capital company. For a bit more on the proceedings check out the article, […]\nThe post IoT news of the week for April 8, 2022 appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/iot-news-of-the-week-for-april-8-2022/",
          "publishedOn": "2022-04-08T17:58:13.000Z",
          "wordCount": 1177,
          "title": "IoT news of the week for April 8, 2022",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2017/08/iot-news-week.jpg"
        },
        {
          "id": "https://staceyoniot.com/?p=10054",
          "author": "Stacey Higginbotham",
          "description": "This week’s podcast starts with an update on the state of Bluetooth adoption courtesy of the Bluetooth SIG. We discuss adoption of Bluetooth in the smart home, adoption of Bluetooth mesh and why Kevin prefers NFC to Bluetooth for secure keys. From there we discuss a new effort by the U.S. Congress to make it […]\nThe post Podcast: Meet a robot that weeds your garden appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/podcast-meet-a-robot-that-weeds-your-garden/",
          "publishedOn": "2022-04-07T13:00:43.000Z",
          "wordCount": 692,
          "title": "Podcast: Meet a robot that weeds your garden",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/04/2201_bmu_charts_r4_smart_home_devices.png"
        },
        {
          "id": "https://staceyoniot.com/?p=10039",
          "author": "Kevin C. Tofel",
          "description": "I’ve been testing the new Wyze Gun Safe since a review unit arrived late last month. Although I generally like most Wyze products, this one seems underwhelming. While I’m sure it would keep any firearms in the home as safe as any competing, non-connected products, adding Bluetooth connectivity to this $154.99 (on-sale, normally $169.99) product […]\nThe post Wyze Gun Safe review: Bluetooth doesn’t really add that much value appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/wyze-gun-safe-review-bluetooth-doesnt-really-add-that-much-value/",
          "publishedOn": "2022-04-06T14:40:12.000Z",
          "wordCount": 1437,
          "title": "Wyze Gun Safe review: Bluetooth doesn’t really add that much value",
          "imageUrl": "https://staceyoniot.com/wp-content/uploads/2022/04/IMG_1454-scaled.jpeg"
        },
        {
          "id": "https://staceyoniot.com/?p=10034",
          "author": "Stacey Higginbotham",
          "description": "During the pandemic, we’ve seen major sensor vendors add more intelligence to their sensors. In 2020 Sony launched a vision sensor that can perform people tracking or object detection locally, and last year Bosch announced its BHI260AP sensor, which has accelerometers and gyroscopes along with a processor pre-loaded with activity-tracking algorithms that can actively learn to track new motions. […]\nThe post We’re making sensors smarter — and more complicated appeared first on Stacey on IoT | Internet of Things news and analysis.",
          "link": "https://staceyoniot.com/were-making-sensors-smarter-and-more-complicated/",
          "publishedOn": "2022-04-05T13:00:16.000Z",
          "wordCount": 1046,
          "title": "We’re making sensors smarter — and more complicated",
          "imageUrl": "https://i0.wp.com/staceyoniot.com/wp-content/uploads/2022/04/sonypixel.jpg?fit=600%2C233&ssl=1"
        }
      ]
    },
    {
      "title": "Blog – Modern Embedded Software | Quantum Leaps",
      "feedUrl": "https://www.state-machine.com/category/blog/feed",
      "siteUrl": "https://www.state-machine.com",
      "articles": []
    },
    {
      "title": "IT의 중심에서",
      "feedUrl": "https://subokim.wordpress.com/feed/",
      "siteUrl": "https://subokim.wordpress.com",
      "articles": []
    },
    {
      "title": "Vivonomicon's Blog",
      "feedUrl": "https://vivonomicon.com/feed/",
      "siteUrl": "https://vivonomicon.com",
      "articles": []
    },
    {
      "title": "zserge's blog",
      "feedUrl": "https://zserge.com/rss.xml",
      "siteUrl": "https://zserge.com/",
      "articles": []
    },
    {
      "title": "Big Picture",
      "feedUrl": "https://www.bostonglobe.com/rss/bigpicture",
      "siteUrl": null,
      "articles": []
    },
    {
      "title": "이바닥늬우스",
      "feedUrl": "https://ebadak.news/feed",
      "siteUrl": "https://ebadak.news",
      "articles": [
        {
          "id": "http://ebadak.news/?p=3451",
          "author": "Rick Kim",
          "description": "중국 최대의 VC 젠 펀드(ZhenFund)의 CEO 팡아이즈(方愛之, Anna Fang)이 스타트업 투자를 처음 시작했을 때, 그의 멘토가 해줬던 이야기였습니다. 팡아이즈은 그 충고를 마음에 깊이 새겼습니다. 11년이 흘렀고, 그는 세계에서 가장 성공적인 시드 투자자의 리스트인 마이다스 리스트 1위에 올랐습니다.",
          "link": "https://ebadak.news/2022/05/01/zhenfund-annafang/",
          "publishedOn": "2022-05-01T06:51:14.000Z",
          "wordCount": 918,
          "title": "세계 최고의 시드 투자자, 중국 젠펀드의 팡아이즈 (번역)",
          "imageUrl": "https://ebadak.files.wordpress.com/2022/05/960x0.jpeg"
        },
        {
          "id": "http://ebadak.news/?p=3437",
          "author": "Rick Kim",
          "description": "반복적인 혁신, 이것은 아마존의 모든 팀에 널리 전파되어 있습니다. 광고, 신선식품, 게임, 음악, 헬스케어, 의약 모두에서 이런 혁신의 예를 찾아볼 수 있습니다. 우리의 이야기는 여전히 현재 진행형입니다. 우리가 빠르게 실험하고, 학습하고, 우리의 고객 경험을 좋게 하기 위해 매일같이 노력하기 때문입니다.",
          "link": "https://ebadak.news/2022/04/15/andy-jassy-letter-2021/",
          "publishedOn": "2022-04-14T16:10:38.000Z",
          "wordCount": 957,
          "title": "아마존 앤디 재시의 2021년 첫 연례 주주서한 (번역)",
          "imageUrl": "https://ebadak.files.wordpress.com/2022/04/d496d06690_1612870697.jpeg"
        }
      ]
    },
    {
      "title": "economic view",
      "feedUrl": "http://feeds.feedburner.com/Economic_View",
      "siteUrl": "http://economicview.net",
      "articles": []
    },
    {
      "title": "슬로우뉴스",
      "feedUrl": "https://feeds.feedburner.com/slownews",
      "siteUrl": "https://slownews.kr",
      "articles": [
        {
          "id": "https://slownews.kr/?p=85601",
          "author": "민주언론시민연합",
          "description": "윤석열 대통령 당선자가 4월 13일 2차 내각 인선으로 장관 후보자 8명 등을 발표하자 언론의 관심은 한 사람에게 쏠렸습니다. 법무부 장관 후보자로 지명된 한동훈 사법연수원 부원장인데요. 한동훈 후보자는 윤 당선자가 지난 2월 중앙일보와 인터뷰에서 문재인 정부의 ‘적폐’ 수사를 언급하며 요직에 앉힐 수 있는 측근으로 지목한 인물로, 법무부 탈검찰화에 역행을 가져올 거라는 우려도 나오고 있습니다. 윤 당선자는 […]\nThe post 조선일보가 쏘아올린 ‘한동훈 패션’ 보도 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85601",
          "publishedOn": "2022-05-04T08:55:34.000Z",
          "wordCount": 1455,
          "title": "조선일보가 쏘아올린 ‘한동훈 패션’ 보도",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/05/noun-glasses-1359057.png"
        },
        {
          "id": "https://slownews.kr/?p=85584",
          "author": "한상기",
          "description": "2021년 11월 싱가포르 정부 기술청(GovTech; 고브테크)은 그동안 추진해 온 상용 클라우드를 이용하는 정부 서비스(GCC: Government on Commercial Cloud) 정책을 한 단계 더 개선해 정부 기관이 퍼블릭 클라우드 서비스 사용에 있어서 관리와 보안을 더 쉽게 할 수 있게 한다고 발표했다. 고브테크(GovTech)는 정부 기관으로 싱가포르의 공공 섹터 디지털 전환을 이끄는 조직으로, 이런 새로운 과제 추진을 위해서는 새로운 […]\nThe post 싱가포르의 상용 클라우드 서비스 이용 전략 (GCC 2.0) first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85584",
          "publishedOn": "2022-05-04T07:48:59.000Z",
          "wordCount": 1651,
          "title": "싱가포르의 상용 클라우드 서비스 이용 전략 (GCC 2.0)",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/05/pic_002.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85579",
          "author": "민주언론시민연합",
          "description": "시장근본주의 시대가 다시 이곳에 도착했다. 이명박 정부에 이어 경제적으로는 거대 언론-미디어 자본의 독점을 위한, 정치적으로는 보수언론의 독주를 위한 물적 토대가 다져지는 시대에 우리는 다시 들어섰다. 최근 윤석열 대통령직인수위원회가 발표한 미디어 분야 국정과제 브리핑은 우리 사회에 대한 ‘시장의 성전’을 선포하는 자리였다. 윤석열 당선자 언론-미디어 정책이 모호했던 이유 대통령직인수위원회 미디어 분야 국정과제 브리핑과 더불어 국민의힘의 공영방송 지배구조와 […]\nThe post 시장근본주의의 재림 (ft. 윤 당선자의 미디어 정책이 모호했던 이유) first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85579",
          "publishedOn": "2022-05-03T09:25:38.000Z",
          "wordCount": 1022,
          "title": "시장근본주의의 재림 (ft. 윤 당선자의 미디어 정책이 모호했던 이유)",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/05/noun-brain-wash-406788.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85531",
          "author": "크레센도",
          "description": "유럽 역사에서 수도원은 여성의 지위를 떨어뜨리고 야만적인 사회 풍경을 만들어내는 데 그 어떤 사회 제도보다 큰 영향을 미쳤다. 자연은 주의 깊은 보정을 통해 남녀 출생 비율을 비슷한 수준으로 유지해오면서, 남녀가 서로 짝을 찾을 수 있게 한다. 주기적으로 발발하는 전쟁은 남성의 개체 수를 큰 폭으로 줄인다. 여자도 출산 과정에서 많이 죽기 때문에 남녀 성비는 효과적으로 균형이 맞춰졌다. 이러한 […]\nThe post 기독교가 낳은 서자들: 교황들의 타락과 로마 대약탈 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85531",
          "publishedOn": "2022-05-02T11:03:12.000Z",
          "wordCount": 2912,
          "title": "기독교가 낳은 서자들: 교황들의 타락과 로마 대약탈",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/05/Banquet-of-Chestnuts.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85513",
          "author": "참여연대 사법감시센터",
          "description": "“한쪽 눈을 감고, 우리 편만 바라보고, 내 편만 챙기는 외눈박이 대통령이 되어서는 안됩니다.”(곽상도) “경제부총리가 금융 부분을 확실하게 알지 못하면 정책 수단이 절름발이가 될 수밖에 없다.”(이광재) “국민을 우습게 아는 것이 아니라면 집단적 조현병이 아닌지 의심될 정도”(허은아) “문재인 대통령의 갈팡질팡 대일 인식, 그러니 정신분열적이라는 비판까지 받는 것 아닌가?”(조태용) “다른 것도 아니고 외교 문제에서, 우리 정부를 정신분열적이라고 진단할 […]\nThe post 장애인 비하 발언도 국회의원 면책특권인가 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85513",
          "publishedOn": "2022-04-29T06:07:23.000Z",
          "wordCount": 1351,
          "title": "장애인 비하 발언도 국회의원 면책특권인가",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/noun-candidate-1734789.png"
        },
        {
          "id": "https://slownews.kr/?p=85507",
          "author": "슬로우뉴스",
          "description": "어제(2022년 4월 27일) 개인정보보호위원회(이하 ‘위원회’)는 법무부와 과학기술정보통신부의 인공지능 식별추적시스템 구축사업에 대한 개인정보보호법 위반 여부 조사 결과를 발표했다. 위원회의 조사로 내국인 5,760만 건 및 외국인 1억 2천만 건 등 총 1억 7천만여 건의 민감정보가 정보 주체의 동의나 개별 고지 없이 처리되었다는 사실들이 다시금 확인되었다. 국가가 공적 목적으로 수집보관하던 내국인과 외국인의 민감정보를 사기업들에 대규모로 제공한 이 사건은 […]\nThe post 법무부의 1.7억 건 ‘얼굴 도둑질’에 면죄부 준 개보위 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85507",
          "publishedOn": "2022-04-28T08:58:39.000Z",
          "wordCount": 1564,
          "title": "법무부의 1.7억 건 ‘얼굴 도둑질’에 면죄부 준 개보위",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/noun-face-scanner-385357.png"
        },
        {
          "id": "https://slownews.kr/?p=85500",
          "author": "경실련",
          "description": "어제(27일) 공정거래위원회(이하 공정위)는 ‘2022년 공시대상기업집단 지정현황’ 발표를 하면서, 작년에도 논란이 되었던 쿠팡 김범석 의장을 이번에도 동일인(총수)으로 지정하지 않았다. 공정위는 작년 ‘동일인이란 특정 기업집단의 사업내용을 사실상 지배하는 자’로 보고, 김범석 의장이 사실상 쿠팡을 지배하고 있다는 입장을 이미 밝혔었다. 나아가 당시 ‘김 의장이 쿠팡Inc의 CEO이자 이사회 의장으로 재직 중이며, 한국 쿠팡(주)에서는 사내이사로 재직 중’이라고 지적도 했다. 따라서 […]\nThe post 공정위의 무능? 눈치게임? 재벌 총수(동일인) 지정 제외된 쿠팡 김범석 의장 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85500",
          "publishedOn": "2022-04-28T06:51:30.000Z",
          "wordCount": 1116,
          "title": "공정위의 무능? 눈치게임? 재벌 총수(동일인) 지정 제외된 쿠팡 김범석 의장",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/coopang.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85485",
          "author": "윤대균",
          "description": "전통적인 IT 인프라 운영 관점에서 보안은 네트워크 경계 내부의 사용자 데이터 및 지적 재산, 장비와 같은 자산을 보호하는 것이다. 방화벽 및 보안장비 등을 사용하여 네트워크에 들어오고 나가는 사용자를 감시하고 검증하는 것이 보안의 핵심이다. 그러나 디지털 전환의 가속화, 특히 클라우드로의 급속한 전환으로 인해 네트워크 경계에 의존하는 보안 방식만으로는 충분하지 않게 되었다. 새로운 화두, 제로 트러스트 제로 […]\nThe post 제로 트러스트 기반 보안 실현을 위한 6×2 아키텍처 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85485",
          "publishedOn": "2022-04-27T08:07:00.000Z",
          "wordCount": 1833,
          "title": "제로 트러스트 기반 보안 실현을 위한 6×2 아키텍처",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/network-gd173f017c_640.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85472",
          "author": "민주언론시민연합",
          "description": "4월 16일은 세월호 참사가 일어난 지 8년 된 날입니다. 2014년 사고발생 후부터 진상규명을 위해 8차례 조사 및 수사가 진행됐고, 9월 10일 활동 종료를 앞두고 있는 사회적참사특별조사위원회도 조사를 진행하고 있습니다. 하지만 세월호 침몰 원인에 대한 여러 의견이 제기됐을 뿐 공인된 결과는 아직 발표되지 못했습니다. 안전의 중요성을 되새기자는 의미로 2015년 국가기념일인 ‘국민 안전의 날’로 지정된 4월 […]\nThe post 세월호 8주기 보도 양극 체험: 채널A ‘김건희 스카프’ vs. 뉴스타파 ‘과학적 접근’ first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85472",
          "publishedOn": "2022-04-26T08:13:49.000Z",
          "wordCount": 1514,
          "title": "세월호 8주기 보도 양극 체험: 채널A ‘김건희 스카프’ vs. 뉴스타파 ‘과학적 접근’",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/pic_008-2.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85467",
          "author": "언론인권센터",
          "description": "언론인권센터는 최근 양궁 국가대표 안산 선수를 대상으로 ‘페미 논란’, ‘전장연 논란’ 등의 표제를 뽑아내면서, ‘논란’이라는 단어를 남발하고 있는 일부 언론에 대하여 깊은 유감을 표한다. 아시안게임 출전 기자회견에서 안산 선수는 전국장애인차별철폐연대(이하 ‘전장연’)에 대한 지지를 표명하는 글을 트위터에 올린 이유에 대해 질문받았다. 안산 선수는 이에 대해 자신은 초등특수교육과를 다니고 있으며, 이 자리는 국가대표 선수로서 나온 것이므로 해당 […]\nThe post 양궁 선수가 장애인 단체 후원하면 그게 ‘논란’입니까? first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85467",
          "publishedOn": "2022-04-26T07:04:58.000Z",
          "wordCount": 893,
          "title": "양궁 선수가 장애인 단체 후원하면 그게 ‘논란’입니까?",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/noun-archer-1974831.png"
        },
        {
          "id": "https://slownews.kr/?p=85425",
          "author": "크레센도",
          "description": "십자군 전쟁(1095년-1291년)을 통해 예기치 않게 자신들의 뿌리를 찾은 유럽에는, 급속도로 문자가 확산되기 시작하면서 새로운 문명이 태동한다. 암흑시대를 지배하던 구술 문화·여성적 가치가 새롭게 개화된 문자 문화·남성적 가치가 비교적 균형을 이루며 황금기가 펼쳐진다. 바로 이 시기(1000-1300년)를 유럽 역사에서 중세 성기(中世 盛期; High Middle Age)라고 한다. 암흑에서 깨어난 유럽 풍경: 여성의 활발한 사회 참여   중세 성기 유럽은 전반적으로 […]\nThe post 교황은 왜 사제 결혼을 금지하였나 (ft. 교회 여성 혐오의 기원) first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85425",
          "publishedOn": "2022-04-26T06:10:01.000Z",
          "wordCount": 2635,
          "title": "교황은 왜 사제 결혼을 금지하였나 (ft. 교회 여성 혐오의 기원)",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/Giotto_-_Legend_of_St_Francis_-_-15-_-_Sermon_to_the_Birds.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85418",
          "author": "경실련",
          "description": "윤석열 국민의힘 후보가 20대 대통령 선거에서 대통령 ‘당선자’가 되었다. 그런데 언론에서는 자꾸 ‘당선인’이라고 한다. 언론이 이런 표현을 사용하는 관행은 2007년 12월 이명박 대통령직 인수위가 ‘당선인’으로 불러 달라고 요청하면서 시작되었다. 당선인 vs. 당선자, 어느 쪽이 옳은가?  주장을 관철시키기 위해 당시 인수위 측은 중앙선거관리위원회에 ‘당선자’ 명칭에 대한 유권해석을 의뢰했고, 선관위에서‘당선인’이 맞다는 해석을 내렸는데, 이는 공직선거법과 국회법, […]\nThe post ‘당선인’이 틀리고 ‘당선자’가 옳은 이유 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85418",
          "publishedOn": "2022-04-25T07:03:27.000Z",
          "wordCount": 1343,
          "title": "‘당선인’이 틀리고 ‘당선자’가 옳은 이유",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/14_compressed-1.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85406",
          "author": "민노씨",
          "description": "더불어민주당이 추진 중인 검찰 수사권 폐지 법안(이른바 ‘검수완박; 검찰 수사권 완전 박탈’)을 둘러싼 여야 갈등과 대립이 극적으로 해소될 조짐이 보입니다. 오늘(2022. 4. 22.) 오후 민주당과 국민의힘은 박병석 국회의장 중재안을 수용하기로 결정했습니다. 박 의장의 중재안은 다음과 같은 내용을 담고 있습니다. 검찰의 직접 수사권과 기소권을 분리. 단, 직접 수사권은 한시적으로 유지 6대 중대범죄 중 부정부패와 경제 범죄에 관한 […]\nThe post 박병석 중재안 요약 (ft. 김용민, 민형배, 참여연대 입장) first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85406",
          "publishedOn": "2022-04-22T09:28:51.000Z",
          "wordCount": 1203,
          "title": "박병석 중재안 요약 (ft. 김용민, 민형배, 참여연대 입장)",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/55222_n.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85393",
          "author": "씨앗(CEART)",
          "description": "10,000년 이상 지속되고 가속해 온 인류 문명은 그 진보를 가능하게 해 왔던 ‘지구 기후의 안정’이란 조건을 심각하게 위협하는 지경에 이르렀다. 기후의 물리적 변화 징후는 사회경제적 영향과 함께 맞물려 그 위협이 더욱더 크게 가시화되고 있다. 실질적 온실가스 배출량을 ‘0’으로 하는 탄소중립(net zero) 경제로 전환할 때까지 또한 그사이에 변화하는 기후에 적응하지 않는 한 그 위협은 비선형의 모양으로 […]\nThe post ‘그린’ 클라우드컴퓨팅이란 무엇인가 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85393",
          "publishedOn": "2022-04-21T10:23:45.000Z",
          "wordCount": 1606,
          "title": "‘그린’ 클라우드컴퓨팅이란 무엇인가",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/noun-computer-cloud-2305628.png"
        },
        {
          "id": "https://slownews.kr/?p=85375",
          "author": "민주언론시민연합",
          "description": "검찰 수사권을 폐지해 수사·기소를 분리하는 이른바 더불어민주당의 ‘검수완박’(검찰 수사권 완전 박탈) 추진을 전하는 언론 보도는 차이가 있습니다. 같은 상황을 서로 다르게 보도하기도 하고, 특정 정보를 빼고 더하며 언론별로 다르게 해석하기도 하는데요. 민주언론시민연합은 검찰 수사권 폐지 추진에 관한 언론보도를 살펴봤습니다. KBS ‘검찰 남은 카드 여론전 뿐’…MBC·한겨레 검찰 여론전 비판 KBS [‘검찰 수사권 폐지’ 충돌 격화…파장은?] (4월 […]\nThe post 조선일보의 검수완박 막장론: ‘문 대통령 지키기’라는 근거 없는 틀짓기 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85375",
          "publishedOn": "2022-04-20T08:36:02.000Z",
          "wordCount": 1864,
          "title": "조선일보의 검수완박 막장론: ‘문 대통령 지키기’라는 근거 없는 틀짓기",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/noun-mask-165943.png"
        },
        {
          "id": "https://slownews.kr/?p=85357",
          "author": "참여연대 사법감시센터",
          "description": "지난 3월 치러진 제20대 대통령 선거는 여러 면에서 중요한 의미가 있었다. 그 가운데 ‘잃어버린 참정권’을 되찾아 투표소를 찾은 이들이 있다. 법원의 결정으로 투표보조 편의를 ‘다시’ 제공받게 된 발달장애인들이다. 서울중앙지방법원은 2022년 2월 10일 대한민국에 대해 제20대 대통령 선거에서 발달장애인에 대한 투표보조를 인정하라는 취지의 결정을 내렸다. 지난 2020년 4월 제21대 국회의원 선거를 앞두고 중앙선거관리위원회(이하 “중앙선관위”)가 돌연 투표 […]\nThe post ‘말아톤’ 윤초원 씨는 지난 대선에서 잘 투표했을까 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85357",
          "publishedOn": "2022-04-19T09:19:46.000Z",
          "wordCount": 1422,
          "title": "‘말아톤’ 윤초원 씨는 지난 대선에서 잘 투표했을까",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/sfasdf.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85342",
          "author": "민주언론시민연합",
          "description": "더불어민주당은 검찰의 수사권을 폐지해 수사·기소를 분리하는 이른바 ‘검수완박’을 문재인 대통령 임기 내 실현해야 한다며 검찰개혁 법안처리에 속도를 내고 있습니다. 4월 12일 의원총회를 열어 4월 중 법안처리를 만장일치로 당론으로 의결했는데요. 검찰은 4월 11일 대검찰청에서 18개 지방검찰청 검사장 회의를 열고 한목소리로 반대 의견을 냈으며, 더불어민주당의 당론 채택을 두고는 “현명한 결정을 기대했는데 대단히 유감스럽다”고 입장을 냈습니다. 민주언론시민연합은 주요 […]\nThe post 검수완박 보도, ‘정검언’은 있고 국민은 없다 (ft. 권성동의 천인공노) first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85342",
          "publishedOn": "2022-04-19T07:49:35.000Z",
          "wordCount": 1348,
          "title": "검수완박 보도, ‘정검언’은 있고 국민은 없다 (ft. 권성동의 천인공노)",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/pic_003-3.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85291",
          "author": "크레센도",
          "description": "기독교가 로마의 국교가 된 뒤 ‘교회의 아버지들'(敎父)은 우상 파괴를 명령한다. 광신자들이 커다란 망치와 칼을 휘두르며 거리로 헤집고 다니면서 2000년 동안 축적되어온 고대 문화를 대표하는 귀중한 조각상과 그림들을 모조리 파괴한다. 문제는, 그 대상이 종교적인 작품에만 국한된 것이 아니라는 사실이다. 물론 처음에는 이교적 상징만을 가려서 파괴했지만, 나중에는 구분하는 것이 무의미했다. 실제로 교부들은 이교도 신은 물론, 일체의 형상을 […]\nThe post 고대 유럽문명의 종말(ft. 히파티아 살해)과 이슬람의 확산 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85291",
          "publishedOn": "2022-04-18T09:31:58.000Z",
          "wordCount": 2549,
          "title": "고대 유럽문명의 종말(ft. 히파티아 살해)과 이슬람의 확산",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/Mort_de_la_philosophe_Hypatie.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85268",
          "author": "이상훈",
          "description": "일반인이 생각하는 마케팅에 관한 기본 개념은 ‘광고로 매출 올리기’입니다. 이 생각은 마케팅 모델 중, 퍼널 모델(funnel model)에서 나온 개념입니다. 퍼널 모델은 광고로 고객을 모으고, 모은 고객들을 대상으로 상품을 팔아서 매출을 올린다는 생각을 기반으로 하고 있습니다. 지금까지 대다수 마케팅 이론은 퍼널 모델 중심으로 정리되어 있습니다. 전통적인 대기업들은 대부분 이 모델을 기반으로 사업을 하고 있습니다. 이 […]\nThe post 사업 목표는 매출과 고객? 결국, 시스템과 확률! first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85268",
          "publishedOn": "2022-04-15T06:57:31.000Z",
          "wordCount": 960,
          "title": "사업 목표는 매출과 고객? 결국, 시스템과 확률!",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/noun-donut-chart-172245.png"
        },
        {
          "id": "https://slownews.kr/?p=85259",
          "author": "민주언론시민연합",
          "description": "채널A 검언유착 의혹 사건으로 알려진 ‘취재원 강요 미수’ 사건에 대해 검찰이 한동훈 사법연수원 부원장(검사장)을 불기소 처분했습니다. 검찰은 4월 6일 ‘증거 불충분하여 혐의 없다’고 판단했다며, 핵심 증거인 한 검사장 휴대전화 비밀번호를 푸는 데 실패했다고 밝혔습니다. “현재 기술력으로는 잠금해제 시도가 더 이상 실효성이 없다고 판단했다”는 게 이유입니다. 수사팀은 2020년 12월부터 무혐의 결재를 올렸으나 서울중앙지검은 ‘한 검사장의 휴대전화 […]\nThe post 채널A 검언유착 의혹 사건: 수사 실패인가, 유착 조작인가 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85259",
          "publishedOn": "2022-04-14T10:17:39.000Z",
          "wordCount": 1310,
          "title": "채널A 검언유착 의혹 사건: 수사 실패인가, 유착 조작인가",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/asdfasdf.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85252",
          "author": "민주언론시민연합",
          "description": "4월 12일 서울남부지검에서 초임 검사 A 씨가 숨졌습니다. 검찰은 사망 경위 파악 등을 위한 진상조사에 착수했습니다. 현재까지 사망 원인은 극단적 선택으로 추정되고 있는데요. 언론은 이번에도 해당 소식을 전하며 스스로 마련한 자살보도 윤리강령을 지키지 않았습니다. 사건 당일 하루에만 자살보도 윤리강령을 어긴 100개에 이르는 기사들이 포털사이트 메인을 장식했습니다. 64개 언론사, 96개 기사에서 자살보도 윤리강령 위반  민주언론시민연합은 포털사이트 […]\nThe post ‘극단적 선택’, 어떻게 보도해야 할까: ‘검사 사망’ 보도를 비판함 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85252",
          "publishedOn": "2022-04-13T08:34:36.000Z",
          "wordCount": 1832,
          "title": "‘극단적 선택’, 어떻게 보도해야 할까: ‘검사 사망’ 보도를 비판함",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/dandelion-729693_1920_compressed.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85242",
          "author": "민주언론시민연합",
          "description": "2022년 2월 24일 새벽 러시아가 우크라이나 영토를 침공하면서 전쟁이 시작됐다. 러시아가 우크라이나 동부 돈바스 지역에 군대를 주둔하면서 전쟁을 준비하고 있다는 미국 정부의 공식 발표 직후 상황은 어떠했던가. 나이와 성별, 직업에 상관없이 국가를 지키기 위해 국경 지역 민간인들도 나서서 무장하고 싸우는 법을 익혔고, 갑자기 시작된 전쟁은 전 세계 언론에 생중계됐다. 끝내 전쟁 일으킨 러시아, 평화 빼앗긴 […]\nThe post 러시아의 우크라이나 침공 보도 비판: 인류애와 저널리즘 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85242",
          "publishedOn": "2022-04-13T07:38:25.000Z",
          "wordCount": 1318,
          "title": "러시아의 우크라이나 침공 보도 비판: 인류애와 저널리즘",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/asfa.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85226",
          "author": "참여연대 사법감시센터",
          "description": "‘1층이 있는 삶’이란, 휠체어를 이용하는 장애인이 모든 장소를 1층처럼 접근할 수 있도록 하기 위한 활동에서 비롯된 말이다. 즉, 1층에 대한 접근성을 넘어 본질적으로 제품, 시설, 서비스를 설계할 때 이용하는 사람이 성별, 나이, 장애, 언어 등으로 인해 불편하지 않도록 하는 모두를 위한 디자인, ‘유니버설 디자인’과 일맥상통하는 의미라고 할 수 있다. 우리나라는 1997년 장애인등편의보장법을 제정하여 장애인 등이 […]\nThe post 1층이 있는 삶: GS25 차별 시정 판결의 의미 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85226",
          "publishedOn": "2022-04-12T08:31:38.000Z",
          "wordCount": 1142,
          "title": "1층이 있는 삶: GS25 차별 시정 판결의 의미",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/noun-wheelchair-429785.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85188",
          "author": "크레센도",
          "description": "하느님이 인간을 구원하기 위해 동정녀 마리아의 몸을 통해 독생자 예수를 이 땅에 보냈다는 사도 바울로의 주장은 언뜻 보기에는 매우 그럴듯 해보였다. 제우스가 인간 세멜레를 통해 디오니소스를 낳았다는 신화를 비롯하여 신과 인간이 통정하여 아기를 낳는 이야기는 이미 고대인들에게 익숙한 것이었기 때문이다. 바울로, 일신교 교리를 위해 ‘삼위일체’를 발명하다   하지만 이렇게 유일신 하느님을 핵가족의 가장으로 바꾸고나니 골치아픈 문제가 […]\nThe post 배제된 여신의 부활: 바울로의 삼위일체 vs. 민중의 마리아 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85188",
          "publishedOn": "2022-04-11T09:37:08.000Z",
          "wordCount": 2103,
          "title": "배제된 여신의 부활: 바울로의 삼위일체 vs. 민중의 마리아",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/Nuestra_Senora_de_Czestochowa.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85180",
          "author": "민주언론시민연합",
          "description": "대선이 끝나자마자 검찰과 보수 언론을 중심으로 윤석열 당선자 최측근이자 ‘채널A 검언유착 의혹’ 사건 당사자인 한동훈 사법연수원 부원장(검사장)에 대한 무혐의 처분 주장이 잇달아 나오더니 결국 무혐의 처분으로 수사가 종결됐다. 서울중앙지검은 4월 6일 한동훈 검사장이 ‘나를 팔라’며 이동재 전 채널A 기자와 공모하여 수감 중인 이철 전 밸류인베스트코리아(VIK) 대표를 협박해 유시민 전 노무현재단 이사장의 비리정보를 제공하도록 강요했다는 의혹에 […]\nThe post 채널A 검언유착 의혹: 풀리지 않은 의혹, 성급한 정치적 면죄부 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85180",
          "publishedOn": "2022-04-08T08:25:50.000Z",
          "wordCount": 1002,
          "title": "채널A 검언유착 의혹: 풀리지 않은 의혹, 성급한 정치적 면죄부",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/noun-cellphone-4059317.png"
        },
        {
          "id": "https://slownews.kr/?p=85162",
          "author": "이상훈",
          "description": "코칭을 하다 보면 ‘패시브 인컴’ 얘기를 가끔 듣습니다. “매일 같은 일을 반복하는 게 힘들다. 그간 진짜 열심히 일해서 사업은 좀 안정된 것 같은데, 이젠 여유를 갖고 싶다. 패시브 인컴을 만들 수 있으면 좀 나아질 것 같다.” 패시브 인컴에 관한 ‘착각’  패시브 인컴(Passive Income, 수동 소득)이란 잠자는 동안에도 들어오는, 일을 하지 않아도 따박따박 들어오는 수입을 얘기합니다. […]\nThe post 일 안 해도 생기는 수입? 그런 ‘패시브 인컴’은 없다 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85162",
          "publishedOn": "2022-04-08T07:42:31.000Z",
          "wordCount": 1125,
          "title": "일 안 해도 생기는 수입? 그런 ‘패시브 인컴’은 없다",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/noun-beach-2369585.png"
        },
        {
          "id": "https://slownews.kr/?p=85150",
          "author": "언론인권센터",
          "description": "4월 5일 서울남부지법은 KBS 1TV가 [시사기획 창] ‘누가, 회장님 기사를 지웠나’를 방송하기 몇 시간을 앞두고 호반건설이 낸 이 기획물의 방송금지 가처분 신청을 모두 기각했다. 이에 따라 [시사기획 창] 367회는 이날 밤 10시 예정대로 방영되었다. 호반건설의 방송금지 가처분 신청(기각)   서울신문은 2019년 7월 5일부터 2019년 11월 25일까지 ‘호반건설 대해부’ 시리즈로 65건의 기사를 게재했다. 그 소재와 주제는 다음과 […]\nThe post 서울신문 우리사주조합은 왜 건설재벌에 투항했는가 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85150",
          "publishedOn": "2022-04-08T06:33:20.000Z",
          "wordCount": 1376,
          "title": "서울신문 우리사주조합은 왜 건설재벌에 투항했는가",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/pic_001-3.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85138",
          "author": "민주언론시민연합",
          "description": "윤석열 당선자는 “혼밥하지 않겠다”며 공개오찬을 소통 행보로 내세웠습니다. 이로 인해 지난 한달 간 ‘식사정치’라는 말이 언론에 많이 회자됐는데요. 윤 당선자의 공개오찬 일정은 언론에 수없이 대서특필되며 그가 다녀간 식당 주소와 메뉴까지 공개됐습니다. 윤 당선자에게는 ‘맛집을 섭렵한 대통령’, ‘음식에 진심인 윤석열’이란 수식어가, 식당에는 ‘윤석열 대통령 당선자 인증 맛집’이란 표현까지 붙었습니다. 민주언론시민연합은 윤석열 당선자의 ‘식사 정치’를 보도하고 있는 […]\nThe post 윤석열의 먹방로드: 당선자 먹방에 목멘 언론들 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85138",
          "publishedOn": "2022-04-07T10:51:53.000Z",
          "wordCount": 1964,
          "title": "윤석열의 먹방로드: 당선자 먹방에 목멘 언론들",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/pic_003-2.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85113",
          "author": "참여연대 사법감시센터",
          "description": "2021년 5월 27일 헌법재판소는 정치자금의 수입과 지출 등 회계보고된 자료의 열람기간을 3월간으로 제한한 “정치자금법 제42조 제2항”을 국민의 알 권리를 침해한다는 이유로 위헌 판정하였다(2018헌마1168). 이 판결은 정치자금의 민주적 운영을 위해 필수적인 수입과 지출의 공개를 강화한다는 측면에서 환영할 만하다. 현행 ‘정치자금법’은 정당, 후원회 등의 회계책임자가 회계장부에 모든 정치자금의 수입과 지출에 관한 사항을 기재하도록 의무화하고 있으며(제7장 제37조), 정해진 […]\nThe post 정치자금, 유권자 표현의 자유 vs. 정치적 불평등 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85113",
          "publishedOn": "2022-04-07T09:03:20.000Z",
          "wordCount": 1541,
          "title": "정치자금, 유권자 표현의 자유 vs. 정치적 불평등",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/i_002-4.jpg"
        },
        {
          "id": "https://slownews.kr/?p=85092",
          "author": "한상기",
          "description": "클라우드 게이밍은 구글, 마이크로소프트, 아마존 등 메이저 테크 기업이 몇 년 전부터 의욕적으로 등장을 알리고 새로운 시장 변혁을 일으킬 것 같았으나 아직 태동 중인 분야이다. 클라우드 게이밍 서비스는 TV, 스마트폰, 랩톱, 태블릿 어디서나 우리가 원하는 고급 수준의 게임을 손쉽게 사용할 수 있다는 얘기이다. 모든 렌더링은 클라우드 서버에서 하고 이를 스트리밍으로 보내주기 때문에 저가 장비에서도 고급 […]\nThe post 클라우드 게이밍: 루나, 엑스박스, ​스테이디어, 지포스 나우 등 현황 first appeared on 슬로우뉴스.",
          "link": "https://slownews.kr/85092",
          "publishedOn": "2022-04-06T09:10:39.000Z",
          "wordCount": 2466,
          "title": "클라우드 게이밍: 루나, 엑스박스, ​스테이디어, 지포스 나우 등 현황",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2022/04/iot-g4deebf4d0_1920.png"
        }
      ]
    },
    {
      "title": "꿈꾸는섬",
      "feedUrl": "https://happist.com/feed",
      "siteUrl": "https://happist.com",
      "articles": [
        {
          "id": "https://happist.com/?p=585240",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/585240/sp-500-%ed%8f%ad%eb%9d%bd%ec%9d%80-%ec%9e%a5%ea%b8%b0-%ed%88%ac%ec%9e%90%ec%9e%90%ec%97%90%ea%b2%8c-%ea%b8%b0%ed%9a%8c",
          "publishedOn": "2022-05-04T00:07:47.000Z",
          "wordCount": 526,
          "title": "현재 폭락한 S&P 500은 장기 투자자에게 매력적인 수준에 왔다 by 제레미 시겔교수",
          "imageUrl": "https://happist.com/wp-content/uploads/2022/05/SP-500-PE-Ratio가-35에서-20까지-내려옴.-43-싸짐.jpg"
        },
        {
          "id": "https://happist.com/?p=585237",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/585237/%ea%b8%89%eb%b3%80%ed%95%98%eb%8a%94-%ed%8c%ac%eb%8d%b0%eb%af%b9-%ed%8a%b8%eb%a0%8c%eb%93%9c",
          "publishedOn": "2022-05-03T15:26:10.000Z",
          "wordCount": 941,
          "title": "급변하고 있는 팬데믹 트렌드 두가지",
          "imageUrl": "https://happist.com/wp-content/uploads/2020/03/코로나-팬데믹-코로나-환자를-치료하고-있는-의료진-Image-from-The-Atlantic.jpg"
        },
        {
          "id": "https://happist.com/?p=585223",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/585223/%eb%b2%88%ec%95%84%ec%9b%83%eb%90%9c-%ec%a7%81%ec%9e%a5%ec%9d%b8%ec%9d%b4-%eb%93%a4%ec%9c%bc%eb%a9%b4-%ec%a2%8b%ec%9d%84-%ec%9d%8c%ec%95%85-%ed%95%9c%ec%8a%a4%eb%b0%b4%eb%93%9c-%ec%98%a4%eb%9d%bd",
          "publishedOn": "2022-05-02T02:08:25.000Z",
          "wordCount": 503,
          "title": "번아웃된 직장인이 들으면 좋을 음악, 한스밴드 오락실",
          "imageUrl": "https://happist.com/wp-content/uploads/2020/04/미국-뉴욕-브루클린-브릿지-공원Brooklyn-Bridge-Park-featured-Phot-by-duchac.jpg"
        },
        {
          "id": "https://happist.com/?p=585213",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/585213/sp-500-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2022-05-01T12:50:04.000Z",
          "wordCount": 1012,
          "title": "80년만 최악 폭락한 S&P 500, 무엇을 할 것인가",
          "imageUrl": "https://happist.com/wp-content/uploads/2022/05/주식시장-sp-500-폭락-financial.jpg"
        },
        {
          "id": "https://happist.com/?p=585154",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/585154/%ec%a3%bc%ec%8b%9d-%ed%88%ac%ec%9e%90%eb%a5%bc-%ec%9c%84%ed%95%9c-%ec%a3%bc%ec%9a%94-%ec%a7%80%ed%91%9c",
          "publishedOn": "2022-04-11T13:59:27.000Z",
          "wordCount": 297,
          "title": "주식 투자를 위한 주요 지표",
          "imageUrl": "https://happist.com/wp-content/uploads/2021/01/주식시잘-활황-황소장-Bull-and-Stock-Market.jpg"
        }
      ]
    },
    {
      "title": "NewsPeppermint",
      "feedUrl": "https://newspeppermint.com/feed/",
      "siteUrl": "https://newspeppermint.com",
      "articles": [
        {
          "id": "https://newspeppermint.com/?p=73989",
          "author": "ingppoo",
          "description": "새해가 밝았을 때 올 한해 일정표를 보고 미리 쓸 수 있는 기사 중 하나가 전 세계 선거 일정을 돌아보는 기사죠. 미국 싱크탱크 외교협회(CFR, Council on Foreign Relations)가 정리한 2022년 주요 선거 일정을 두 편에 걸쳐 소개했습니다. 2022년의 1/3이 지난 지금 예정대로 한국과 프랑스는 대통령 선거를 치렀습니다. 아직 남은 선거들도 많습니다. 어느 나라가 선거를 치를지, 쟁점은 무엇인지 함께 살펴보겠습니다.   1. 한국 대통령 선거 (3/9) 한국 대통령의 임기는 5년 단임제로 헌법에 명시돼 → 더 보기",
          "link": "https://newspeppermint.com/2022/05/03/npc_worldelection2022/?utm_source=rss&utm_medium=rss&utm_campaign=npc_worldelection2022",
          "publishedOn": "2022-05-03T22:59:16.000Z",
          "wordCount": 890,
          "title": "[필진 칼럼] 2022년 전 세계 주요 선거 일정 (1)",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73983",
          "author": "veritaholic",
          "description": "새해가 되면 어김없이 새해 다짐들을 하고, 그에 관한 기사들이 나오죠. 운동, 금연, 체중 감량 등은 새해 다짐 단골 메뉴입니다. 지난 1월 3일 프리미엄 콘텐츠에 쓴 글입니다. —– 새해가 밝았습니다. 바야흐로 다이어트의 계절입니다. 수많은 이들의 새해 결심 때문이죠. 아직도 체중 관리에 대해 우리가 모르는 사실들이 남아 있을까요? 식사량을 줄이고 운동을 해야 한다는 두 가지 원칙이 다이어트에 있어 두 개의 절대 기둥(Two pillars of diet)이라는 점은 사실 몇 번의 인터넷 클릭이면 충분히 → 더 보기",
          "link": "https://newspeppermint.com/2022/05/02/npc_diet/?utm_source=rss&utm_medium=rss&utm_campaign=npc_diet",
          "publishedOn": "2022-05-02T22:59:32.000Z",
          "wordCount": 789,
          "title": "[필진 칼럼] 체중 관리에 관해 우리가 모르는 사실",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73974",
          "author": "ingppoo",
          "description": "한해를 정리하는 다양한 방법 중에는 우리 곁을 떠난 이들을 기리는 방법도 있을 겁니다. 오늘은 뉴욕타임스가 꼽은 “2021년 우리 곁을 떠난 사람들”을 소개합니다. 말 그대로 올 한해 쓴 부고 기사를 정리한 건데, 뉴욕타임스는 균형 감각을 잃지 않는 부고 기사를 잘 쓰기로 유명한 신문사라서 아는 사람의 부고 기사는 클릭해서 읽어보셔도 좋습니다. 이 가운데 눈에 띈 몇 명을 골라봤습니다. 12월 E.O. 윌슨(E.O. Wilson) 원래는 진화생물학자 E.O. 윌슨 박사의 부고 기사를 소개하려다가 이 시리즈를 → 더 보기",
          "link": "https://newspeppermint.com/2022/05/01/npc_nytobituaries2021/?utm_source=rss&utm_medium=rss&utm_campaign=npc_nytobituaries2021",
          "publishedOn": "2022-05-01T22:59:03.000Z",
          "wordCount": 919,
          "title": "[필진 칼럼] 2021 뉴욕타임스 부고 기사 모음",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73966",
          "author": "veritaholic",
          "description": "오늘은 조금 가벼운 이야기입니다. 바로 점점 더 눈에 많이 띄는 전기차에 관한 이야기입니다. 기술전문 웹진인 아스테크니카는 피렐리의 품질책임자 이언 코크와의 인터뷰에서 전기차가 요구하는 까다로운 조건에 대해 이야기했습니다. 피렐리는 140년의 역사를 지닌 이탈리아의 타이어 회사로 지난 2015년 중국 국유기업이 인수했습니다. 노란 바탕에 빨간 글자의 P 글자에서 머리가 옆으로 길게 늘여진 피렐리 상표는 누구나 한 번쯤은 보았을 겁니다. 꼭 테슬라가 자동차 시장을 석권하지 않는다 하더라도, 전기차가 자동차의 미래가 될 가능성은 매우 높아 보입니다. → 더 보기",
          "link": "https://newspeppermint.com/2022/04/28/npc_evtire/?utm_source=rss&utm_medium=rss&utm_campaign=npc_evtire",
          "publishedOn": "2022-04-28T22:59:59.000Z",
          "wordCount": 643,
          "title": "[필진 칼럼] 전기차는 타이어도 달라야 한다",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73963",
          "author": "ingppoo",
          "description": "1년 내내 코로나19 팬데믹과 싸워야 했던 2021년을 마무리하는 시점에 워싱턴포스트가 한해를 돌아보며 쓴 사설을 정리한 글입니다. 워싱턴포스트는 2017년부터 매년 한 해를 되돌아보는 사설을 냈는데, 그해 연도만큼 좋은 일을 꼽는 거라서 지난해에는 목록이 21개였습니다. 좀처럼 쉬이 사라지지 않는 코로나19 팬데믹 탓에 모두가 정말 힘들었던 한 해였습니다. 워싱턴포스트 논설위원들도 21개를 채우기 쉽지 않았다고 말합니다. 주요 코로나19 백신 세 가지에 각각 번호를 매기자는 의견도 나왔다고 합니다. 내년에는 숫자가 하나 더 늘어 22개를 채워야 하겠지만, → 더 보기",
          "link": "https://newspeppermint.com/2022/04/27/npc_wp21/?utm_source=rss&utm_medium=rss&utm_campaign=npc_wp21",
          "publishedOn": "2022-04-27T22:59:25.000Z",
          "wordCount": 1031,
          "title": "[필진 칼럼] 워싱턴포스트가 꼽은 2021년에 일어난 좋은 일 21가지",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73956",
          "author": "ingppoo",
          "description": "영어 “Unintended Consequences”를 옮기면 “의도치 않은 결과” 정도가 됩니다. 삶에서 일이 의도한 대로 풀리지 않는 경우는 많지만, 특히 정책을 입안하고 집행하는 과정에서 의도치 않은 결과가 나타나면 문제가 되곤 합니다. 때로는 의도한 것과 정반대 결과가 나오기도 하고, 새로운 정책의 부작용이 너무 커서 결과적으로 안 하느니만 못한 정책이 되기도 합니다. 특히 정책은 목표를 어떻게 설정하고 수립했느냐보다 결과로만 평가받을 때가 많습니다. 오늘은 ‘의도치 않은 결과’의 대표적인 사례로 21세기 들어 미국 공중보건의 최대 위기 중 하나로 → 더 보기",
          "link": "https://newspeppermint.com/2022/04/26/npc_policyopioidcrisis/?utm_source=rss&utm_medium=rss&utm_campaign=npc_policyopioidcrisis",
          "publishedOn": "2022-04-26T22:59:32.000Z",
          "wordCount": 1447,
          "title": "[필진 칼럼] 좋은 의도에서 비롯된 정책이 좋지 않은 결과를 낳을 때",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=74722",
          "author": "veritaholic",
          "description": "생물학적인 성(sex)과 사회적 성(gender) 사이의 간극은 쉬운 문제가 아닙니다. 그리고 그 중 가장 첨예한 갈등은 생물학적 성의 차이가 분명한 스포츠 영역에서 일어납니다. 곧, 우리는 남자와 여자의 육체적 차이를 인정하며, 따라서 대부분 종목에서 남자와 여자를 구분할 뿐 아니라 기록도 따로 관리합니다. 그러나 원래 남자였다가 성전환수술을 받아 여자가 된 트랜스젠더 선수들이 있습니다. 지난 12월 10일, 마이클 셔머는 최근 미국에서 다시 이 문제로 공정성 논란을 일어나게 만든 펜실베니아 대학 소속 수영선수 리아 토마스의 이야기를 → 더 보기",
          "link": "https://newspeppermint.com/2022/04/25/npc_transgenderathletes/?utm_source=rss&utm_medium=rss&utm_campaign=npc_transgenderathletes",
          "publishedOn": "2022-04-25T22:59:12.000Z",
          "wordCount": 595,
          "title": "[필진 칼럼] 트랜스젠더 운동 선수의 경우",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73949",
          "author": "ingppoo",
          "description": "코로나19 백신 이전에도 백신은 수많은 사람의 목숨을 구했습니다. 대표적인 것이 매년 추워질 때쯤 맞는 독감(influenza) 백신이죠. 다만 매년 인플루엔자 바이러스가 변이를 일으켜 조금씩 다르고, 백신 접종으로 생긴 항체의 지속 기간도 반년 정도에 불과해 독감 백신은 매년 맞아야 한다는 중대한 단점이 있습니다. 저도 올해 코로나19 백신만 신경 쓰고, 독감 백신에 관해선 아무런 생각도 안 하고 있다가 다른 일로 병원에 갔을 때 의사의 말을 듣고 바로 백신을 맞았습니다. 그때 의사 선생님께 이렇게 → 더 보기",
          "link": "https://newspeppermint.com/2022/04/24/npc_fluvaccine/?utm_source=rss&utm_medium=rss&utm_campaign=npc_fluvaccine",
          "publishedOn": "2022-04-24T22:59:45.000Z",
          "wordCount": 1203,
          "title": "[필진 칼럼] 매년 맞을 필요 없는 독감 백신은 언제 나올까?",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73925",
          "author": "veritaholic",
          "description": "그동안은 시작이 반이라는 말이 정말 맞는 말이라고 생각하며 살았습니다. 누가 한 말인지 찾아보니 아리스토텔레스라고 나오네요. 믿어지지 않지만, 웬만한 영문 인용구 사이트들도 그렇게 말하는 것으로 봐서 사실인가 봅니다. 정확히는 “Well begun is half done”, 곧 “좋은 시작이 절반”이라고 말했군요. 어쨌든 시작이 정말로 어렵다는 점에서 그 말이 맞는 말이라 생각했다는 것이죠. 그런데 이제 점점 그 말이 틀렸다고 생각하게 되었습니다. 이제 저는 이렇게 생각합니다. 시작은 반이 아니라 전부입니다. 저 역시 이번 글을 쓰기에 → 더 보기",
          "link": "https://newspeppermint.com/2022/04/21/npc_focus/?utm_source=rss&utm_medium=rss&utm_campaign=npc_focus",
          "publishedOn": "2022-04-21T22:59:21.000Z",
          "wordCount": 714,
          "title": "[필진 칼럼] 뇌과학이 알려주는 집중의 요령",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73918",
          "author": "ingppoo",
          "description": "텍사스주 낙태금지법은 우려대로 제정돼 곧바로 발효됐습니다. 이후 텍사스주 여성들은 임신을 중절할 권리를 크게 제한받고 있습니다. 이 법이 미친 부차적인 효과 가운데 하나에 관해 12월 15일 네이버 프리미엄 콘텐츠에 쓴 글을 소개합니다.   지난주 미국 대법원은 텍사스주 낙태금지법을 유지한다고 결정했습니다. 법의 위헌 여부를 다투는 소송은 계속 진행해도 좋다고 했지만, 시민단체들이 처음부터 문제로 지적한 법의 효력, 집행방식 등에는 일단 문제가 없다고 판단한 셈입니다. 현재 미국 대법원의 대법관 구성을 보면, 보수 성향 대법관이 → 더 보기",
          "link": "https://newspeppermint.com/2022/04/20/npc_californiaguncontrol/?utm_source=rss&utm_medium=rss&utm_campaign=npc_californiaguncontrol",
          "publishedOn": "2022-04-20T22:59:44.000Z",
          "wordCount": 1011,
          "title": "[필진 칼럼] 텍사스 낙태금지법 모방한 캘리포니아 총기규제법",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73908",
          "author": "veritaholic",
          "description": "세상을 뒤바꿀 기술, 혁신적인 제품이 매일 쏟아지고 있습니다. 어쩌면 새로운 제품과 기술이 끊임없이 등장하고 있다는 말은 21세기를 나타내는 가장 적절한 묘사 중 하나일 것입니다. 그리고 그런 제품 중 어떤 것이 진짜 세계를 바꿀 것인지 미리 알아볼 수 있는 혜안이 있다면, 그건 정말 대단한 능력일 겁니다. 애플을, 아마존을, 테슬라를 미리 알아보았을 테고, 분명 살림살이도 크게 나아졌을 것입니다. 지난 11월 30일, 미디엄의 기술 블로그 원제로(OneZero)에는 바로 이 질문에 대한 글이 올라왔습니다. 원제로의 필자 → 더 보기",
          "link": "https://newspeppermint.com/2022/04/19/npc_predictingtech/?utm_source=rss&utm_medium=rss&utm_campaign=npc_predictingtech",
          "publishedOn": "2022-04-19T22:59:44.000Z",
          "wordCount": 607,
          "title": "[필진 칼럼] 기술의 미래를 예측하기",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73902",
          "author": "ingppoo",
          "description": "최근 아마존 물류창고 노동자들이 아마존 역사상 처음으로 노동조합을 결성했다는 소식이 언론을 장식했는데요, 그에 앞서 지난해 말에는 스타벅스 바리스타들도 미국 내 직영 매장 최초로 노동조합을 결성했습니다. 이에 관해 미국에서 노동조합을 바라보는 시선이 바뀔지, 노동조합의 미래를 전망하는 글도 프리미엄 콘텐츠에 썼습니다. 오늘은 지난해 12월 10일 쓴 스타벅스 노조 결성에 관한 글을 소개합니다.   팟캐스트 아메리카노 최신화에서는 플랫폼 경제 시대의 노동에 관해 이야기했습니다. 코로나19 팬데믹을 거치면서 구인난이 계속되고 있는 미국에서는 더 많은 급여, → 더 보기",
          "link": "https://newspeppermint.com/2022/04/18/npc_starbucksunion/?utm_source=rss&utm_medium=rss&utm_campaign=npc_starbucksunion",
          "publishedOn": "2022-04-18T22:59:27.000Z",
          "wordCount": 883,
          "title": "[필진 칼럼] 스타벅스 미국 직영 매장에서 첫 노조 결성",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73883",
          "author": "veritaholic",
          "description": "지난 11월 26일 애틀란틱에는 자동차 사고의 책임과 인과관계에 관한 흥미로운 칼럼이 실렸습니다. 하버드 케네디 스쿨의 방문학자이자 교통수단의 미래에 관한 글을 쓰는 데이비드 지퍼는 미국 사회에 지금 “교통사고 대부분은 그 책임이 사람에게 있다”는 오해가 퍼져 있다고 지적했습니다. 다른 선진국과 달리 미국 사회에서는 지난 10년간 교통사고 사망자가 계속 증가했습니다. 특히 2021년 상반기에만 교통사고로 2만 명 이상이 사망했으며, 이는 미국보다 인구가 30% 더 많은 유럽연합(EU)의 지난 1년 간의 사망자 수 18,800명 보다도 많습니다. 지퍼는 → 더 보기",
          "link": "https://newspeppermint.com/2022/04/17/npc_humanerrors/?utm_source=rss&utm_medium=rss&utm_campaign=npc_humanerrors",
          "publishedOn": "2022-04-17T22:59:17.000Z",
          "wordCount": 656,
          "title": "[필진 칼럼] 교통사고에서 ‘실수’의 책임은 누구한테 물어야 할까?",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73876",
          "author": "ingppoo",
          "description": "앞서 네이버 프리미엄 콘텐츠에 ‘왜 미국 사람 중에는 백신 회의론자나 백신을 안 맞으려는 사람이 많을까?’에 관한 글을 몇 편 썼습니다. 그러다 지난주 경제 지표와 체감 경기의 차이에 관한 글을 소개하면서 미국의 코로나19 백신 접종률을 찾아봤는데, 여전히 접종을 완료한 사람이 국민의 60%에 미치지 못했습니다. (백신을 맞을 수 있는 만 5세 이상 인구 중에는 64%.) 미국에는 여전히 코로나19 백신이 남아돕니다. 오미크론 변이가 본격적으로 퍼질 텐데, 아직도 최소 6천만 명 넘는 백신 회의론자들은 → 더 보기",
          "link": "https://newspeppermint.com/2022/04/14/npc_triumphofdoubt/?utm_source=rss&utm_medium=rss&utm_campaign=npc_triumphofdoubt",
          "publishedOn": "2022-04-14T22:59:05.000Z",
          "wordCount": 718,
          "title": "[필진 칼럼] ‘청부과학’의 진화: 의구심 뿌리기",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73865",
          "author": "veritaholic",
          "description": "브랜다이스 대학의 석좌교수인 마리 피츠더프의 새 책 “전쟁하는 뇌(Our Brains at War)”는 인간의 본성인 자기 집단을 위한 이기심이 상상 이상으로 매우 강력하다는 사실을 여러 최신 연구 결과를 가지고 이야기하는 책입니다. 피츠더프 교수는 이를 바탕으로 국민이 자신들을 대표할 정치인을 고르는 방법과 또 국가 간의 전쟁이 시작되는 방식을 바꾸어야 한다고 주장합니다. 여기서 인간의 본성이란, 인간의 생리적, 유전적 특징들이 다른 집단에 대한 반감을 매우 쉽게 가지도록 만들어져 있다는 것입니다. 이런 우리의 본성은 우리가 → 더 보기",
          "link": "https://newspeppermint.com/2022/04/13/npc_brainatwar/?utm_source=rss&utm_medium=rss&utm_campaign=npc_brainatwar",
          "publishedOn": "2022-04-13T22:59:46.000Z",
          "wordCount": 694,
          "title": "[필진 칼럼] 호전적인 우리 뇌와 인간의 약점",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73852",
          "author": "ingppoo",
          "description": "뉴스에서는 경기가 살아나고 있다는데, 내 주머니 사정은 여전히 팍팍하게 느껴진 적 많으실 겁니다. (반대로 여러 지표에서 적신호가 켜졌다는 뉴스가 쏟아지는 와중에도 나는 운이 좋아서 사정이 괜찮을 수도 있겠죠.) 이런 일이 코로나19 팬데믹을 거치면서도 여러 차례 나타났습니다. 오늘은 지난해 12월 1일에 프리미엄 콘텐츠에 쓴 글을 소개합니다. 여러 경제 지표를 보면 미국 경제는 코로나19 팬데믹과 함께 왔던 최악의 침체기를 완전히 벗어난 것처럼 보입니다. 그런데 미국인들은 전혀 이를 느끼지 못하는 것 같습니다. 미국인들이 → 더 보기",
          "link": "https://newspeppermint.com/2022/04/12/economyfeeling/?utm_source=rss&utm_medium=rss&utm_campaign=economyfeeling",
          "publishedOn": "2022-04-12T22:59:21.000Z",
          "wordCount": 1302,
          "title": "[필진 칼럼] 데이터와 체감 경기의 동상이몽 경제",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73831",
          "author": "ingppoo",
          "description": "지난해 가을만 해도 코로나19 종식을 말하는 사람들이 꽤 있었습니다. 그러나 겨울이 되면서 전염력이 강한 오미크론 변이가 빠르게 퍼지기 시작했죠. 오늘은 지난해 11월 28일에 쓴 세계보건기구(WHO)의 오미크론 변이 발표에 관한 내용을 다시 올립니다.   세계보건기구(WHO)가 코로나19 오미크론 변이 바이러스(B.1.1.529)를 ‘우려 변이(VOC, Variant of Concern)’로 지정했습니다. 세계보건기구 코로나19 바이러스 변이 분류표 새로운 변이가 발견되면 여기에 그리스 알파벳 순서대로 이름을 붙이고, 관찰(VBM, Variant Being Monitored), 주의(VOI, Variant of Interest), 우려(VOC), 고위험(VOHC, Variant of → 더 보기",
          "link": "https://newspeppermint.com/2022/04/11/npc_omicron/?utm_source=rss&utm_medium=rss&utm_campaign=npc_omicron",
          "publishedOn": "2022-04-11T22:59:38.000Z",
          "wordCount": 875,
          "title": "[필진 칼럼] 코로나19 오미크론 변이 WHO 발표",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73810",
          "author": "veritaholic",
          "description": "우리에게 ‘생각에 관한 생각’으로 잘 알려진 다니엘 카네만은 심리학자로 2002년 노벨경제학상을 수상했고 행동경제학이라는 분야를 만든 전설적인 학자입니다. 그에게 노벨경제학상을 안겨준 것은 1970년대 아모스 트버스키와 함께 연구한 전망 이론(prospect theory)입니다. 전망 이론에서 가장 중요한 요소는 인간이 같은 양의 이익에 비해 손실의 영향을 더 크게 생각한다는 손실 회피(loss aversion)입니다. 간단하게 줄이면 “손해는 이익보다 아프다”는 말 정도가 되겠죠. 실제로 그는 자서전에서 자신들이 이 분야에 한 가장 큰 기여로 손실 회피의 개념을 꼽았습니다. 손실 → 더 보기",
          "link": "https://newspeppermint.com/2022/04/10/npc_lossaversion/?utm_source=rss&utm_medium=rss&utm_campaign=npc_lossaversion",
          "publishedOn": "2022-04-10T22:59:17.000Z",
          "wordCount": 787,
          "title": "[필진 칼럼] 손실 회피 효과에 대한 논쟁",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73799",
          "author": "veritaholic",
          "description": "평등은 오늘날 가장 중요한 화두 중 하나입니다. 무엇이 평등인지에 관한 생각이 다를 뿐, 평등한 세상을 거부하는 사람이나 사상은 거의 없습니다. 흔히 우파는 개인의 노력을 강조하고, 좌파는 사회의 책임을 강조한다고 말합니다. 그러나 우파와 좌파 모두 인간에 대한 과학적 지식이 축적되면서 드러난 평등에 대한 새로운 사실에 관해서는 게으르거나 의도적으로 무시하는 태도를 보입니다. 그것은 바로 유전자에 의한 불평등입니다. 텍사스 오스틴 대학의 주목받는 유전학자 캐서린 페이지 하든이 지난 9월 출간한 “유전자 복권(Genetic Lottery)”은 제목부터 → 더 보기",
          "link": "https://newspeppermint.com/2022/04/07/npc_geneticlottery/?utm_source=rss&utm_medium=rss&utm_campaign=npc_geneticlottery",
          "publishedOn": "2022-04-07T22:59:15.000Z",
          "wordCount": 677,
          "title": "[필진 칼럼] 유전자 복권",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73785",
          "author": "ingppoo",
          "description": "코로나19 팬데믹 이후에 쓴 예전 글을 다시 소개할 땐 ‘저때는 얼마 지나고 나면 팬데믹이 끝나 있겠지…’ 하고 기대하던 게 생각납니다. 오늘 소개하는 글도 그렇습니다. 지난해 11월에 이 글을 썼을 땐 오미크론 변이가 기승을 부리기 전이었습니다. 엔데믹(endemic)에 관한 희망 섞인 이야기가 나오던 때였죠. 안타깝게도 코로나19는 2022년에도 종식되지 않고 있습니다. 이 글을 쓴 일주일 뒤에는 세계보건기구(WHO)의 오미크론 변이 발표의 주요 내용을 우리말로 옮겨 소개하기도 했네요.   툴루즈 경제대학원이 지난 5월 말에 연 “공공재(common → 더 보기",
          "link": "https://newspeppermint.com/2022/04/06/npc_commongoods/?utm_source=rss&utm_medium=rss&utm_campaign=npc_commongoods",
          "publishedOn": "2022-04-06T22:59:34.000Z",
          "wordCount": 764,
          "title": "[필진 칼럼] 팬데믹의 한가운데서 공공재를 외치는 이유",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=73768",
          "author": "veritaholic",
          "description": "1998년, 심리학자 로이 바우마이스터는 초콜릿 쿠키 냄새가 가득한 방에 자원자들을 들여보낸 다음 어떤 이들에게는 초콜릿 쿠키를 먹게 했고 다른 이에게는 그 옆에 둔 무만 먹게 했습니다. 그리고 이 두 집단에 어려운 퍼즐을 풀게 하고 언제 포기하는지를 보았습니다. 초콜릿 쿠키를 먹은 이들에 비해 쿠키 냄새를 참고 무를 먹은 이들은 시간이 절반도 지나지 않아 퍼즐을 포기했습니다. 바우마이스터의 연구진은 이 결과를 무를 먹은 이들이 초콜릿 쿠키에 대한 유혹을 참는 데 의지력을 이미 많이 → 더 보기",
          "link": "https://newspeppermint.com/2022/04/05/npc_willpower/?utm_source=rss&utm_medium=rss&utm_campaign=npc_willpower",
          "publishedOn": "2022-04-05T22:59:21.000Z",
          "wordCount": 755,
          "title": "[필진 칼럼] 의지력은 한정된 자원이 아니라 하나의 감정",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        }
      ]
    },
    {
      "title": "WALLFLOWER",
      "feedUrl": "http://rss.egloos.com/blog/wallflower",
      "siteUrl": "http://wallflower.egloos.com",
      "articles": [
        {
          "id": "http://wallflower.egloos.com/4207383",
          "author": "이택광",
          "description": "근대 중국을 대표하는 작가 루쉰은 중국인들은 20세기 이전까지 세기의 의미를 몰랐다고 썼다. 물론 이런 역사적 사실을 근거로 중국인들이 미개하고 무지했다고 말하는 것은 손쉬운 인종주의적 해결책이겠지만, 사태를 진단하기에 정확한 방법은 아니다. 루쉰의 발언은 당대 .... 글 전체보기",
          "link": "http://wallflower.egloos.com/4207383",
          "publishedOn": "2022-04-19T03:00:30.000Z",
          "wordCount": 1117,
          "title": "아시아라는 객체",
          "imageUrl": "http://pds20.egloos.com/pds/202204/19/87/a0009187_625e282d6017a.jpeg"
        }
      ]
    },
    {
      "title": "내 마음의 풍경",
      "feedUrl": "https://rss.blog.naver.com/sellars.xml",
      "siteUrl": "https://blog.naver.com/sellars",
      "articles": [
        {
          "id": "https://blog.naver.com/sellars/222720455285",
          "author": "sellars",
          "description": "차연적 사유는 서로 대립하는 것이 동시에 동거할 수 있다는 것을 보여준다. 즉 동(同)/이(異), 유(有)/무(無), 나타남/숨음, 진리/비진리, 현시/은적, 생(生)/사(死), 이 모든 것이 동거적이며, 차연적이다. 이러한 사유는 어느 하나를 선택하는 이성주의의 <택일적 사유>가 아니다. 따라서 <그것은 말한다>는 존재의 말은 이중긍정이다. 원융적 사유의 이중성은 이원성이 아니다. 동시에 일원성도 아니다. 그것은 사유의 자유왕래, 즉 집착이 없는 사유이다. 따라서 이중긍정의 사유는 집착하지 않는다. 그것은 초탈적이며 탈존하는 마음이다. 그러나 이러한 마음은 동시에 집착적이기도 하다. 집착적 사유는 소유하려는 사유이다.......",
          "link": "https://blog.naver.com/sellars/222720455285",
          "publishedOn": "2022-05-04T00:32:28.000Z",
          "wordCount": 8,
          "title": "해탈의 이중부정",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222719414962",
          "author": "sellars",
          "description": "* 장자의 다음 두 글의 주장을 요약하고 평가해 보라. (가) 혜자(惠子)가 장자에게 말했다. 위왕이 큰 박씨를 주길래 그것을 심었더니 자라나 오석(五石)이나 들어갈 정도의 열매가 열렸다. 물을 담자니 무거워서 들을 수 없었고, 돌로 쪼개서 바가지로 쓰자니 납작하고 얕아서 아무 것도 담을 수가 없었다. 크기는 컸지만 아무 쓸모가 없어 부숴버리고 말았다. 장자는 다음처럼 말했다. 당신은 큰 것을 쓰는 방법이 매우 서툴다. 송나라 때 손이 잘 안 트는 약을 만든 사람이 있었다. 그는 대대로 솜을 빠는 일을 가업으로 삼고 있었다. 한 나그네가 그 소문을 듣고 그를 찾아와 약 만드는 방법을 백금으로 사겠다고 했다. 솜 빠는 일을 대대로.......",
          "link": "https://blog.naver.com/sellars/222719414962",
          "publishedOn": "2022-05-03T03:12:43.000Z",
          "wordCount": 8,
          "title": "17. 무용지용(無用之用)",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222718310923",
          "author": "sellars",
          "description": "11강에서 모종삼은 칸트의 형이상학적 연역을 소개하고 있다. 특히 칸트의 범주가 논리적인 것이 아니라, 존재론적임을 강조하고 있다. 즉 칸트의 범주는 형식 논리적인 것이 아니라, 초월 논리적이며, 존재론적이다. 형이상학적 연역에 대한 나름의 해명을 제외하면, 이미 이전 강의에서 했던 주장을 반복하고 있다. 즉 이미 5강, 6강, 7강에서 했던 주장, 즉 동서철학의 회통이 가능하기 위해서는 물자체에 대한, 혹은 본체계에 대한 중국철학적, 혹은 동양철학적 주장을 인정해야만 진정한 중서철학, 혹은 동서철학의 회통이 가능하다는 것이다. <칸트는 주체로부터 우리의 감성의 직각과 하나님의 지적 직각을 서로 대비하여 논하고, 우리.......",
          "link": "https://blog.naver.com/sellars/222718310923",
          "publishedOn": "2022-05-02T04:35:05.000Z",
          "wordCount": 8,
          "title": "11 범주의 발견",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222717117456",
          "author": "sellars",
          "description": "로지 브라이도티, 이름을 처음 들었다. 그런데 검색을 해 보니 그녀의 책들이 번역되어 있다. 그녀에 대한 단행본 책도 있다. 이 여성 철학자가 이렇게 대단한가? 참으로 읽어야 할 철학책들이 많다. 그런데 어떤 경우는 철학자의 책이라기 보기 어려운 경우가 있다. 내가 좋아하지 않은 사유가 유행에 쫓아가는 정형적 사유이다. 가령 남성과 여성의 ‘적대적’ 이분법이 그것이다. 데카르트, 이 자가 주장하는 주체나 자아가 사실 보편적 주체를 빙자한 하얀 남성의 목소리였다. 그런데 진짜 그런가? 나는 데카르트의 <성찰>을 읽으면서 그가 하얀 남성의 목소리를 내고 있다고 전혀 느끼지 못했다. 아마 그것은 네가 둔감하기 때문이라.......",
          "link": "https://blog.naver.com/sellars/222717117456",
          "publishedOn": "2022-04-30T22:49:25.000Z",
          "wordCount": 8,
          "title": "작품에 소문이 선행한다.",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222715165547",
          "author": "sellars",
          "description": "김형효는 하이데거에 대한 두 권의 책을 저술하였다. <하이데거와 마음의 철학>(2000)은 하이데거의 전기 철학에 대해서, 그리고 <하이데거와 화엄의 사유>(2002)는 하이데거의 후기 철학에 대한 것이다. <하이데거와 마음의 철학>은 약 5백 페이지이며, <하이데거와 화엄의 사유>는 8백 페이지 정도 된다. 두꺼운 분량의 이 책들은 모두 불교적 관점에서 하이데거의 사유에 접근하고 있다. 그 이전에 하이데거와 불교에 대한 몇 편의 한글 논문들이 있었지만, 아마 이 책들이 하이데거와 불교를 연결시키고 있는 본격적인 첫 저술일 것이다. (그럼에도 이 책들은 절판되었다. 이 책 이후로 하이데거와 불교에 관한 책이.......",
          "link": "https://blog.naver.com/sellars/222715165547",
          "publishedOn": "2022-04-29T01:29:59.000Z",
          "wordCount": 8,
          "title": "김형효의 하이데거 1",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222714513040",
          "author": "sellars",
          "description": "(1) 모든 견해는 다양한 해석의 하나이다. 즉 모든 견해는 해석이나 관점에 의존적이다. (2) 다양한 해석에서 올바른 것을 골라낼 수 있는 중립적 기준이란 없다. 즉 해석으로부터 독립적인 사실이나 대상은 존재하지 않는다. (3) 따라서 다양한 해석만이 존재한다. 즉 진리란 없다. 그런데 이러한 주장도 다양한 해석의 하나이다. 따라서 그런 주장을 귀담아 들을 필요가 없다. 혹은 다양한 해석만 존재한다는 니체의 주장이 틀렸다. 다양한 해석만 존재한다면, 니체에 대한 해석도 다양할 것이다. 따라서 어떤 해석이 더 설득력이 있는지 더 이상 따질 이유가 없게 된다. 따라서 니체를 아주 부정적으로 바라보는 내 해석도 그 나름의 중요한 가.......",
          "link": "https://blog.naver.com/sellars/222714513040",
          "publishedOn": "2022-04-28T07:55:13.000Z",
          "wordCount": 8,
          "title": "원근법주의 1",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222713032079",
          "author": "sellars",
          "description": "의미가 주어져 있다. 이 주장에 대립되는 것이 의미가 구성된다는 것이다. 그런데 언어적 의미는 도대체 어떻게 구성될 수 있는가? 그 언어적 의미가 전혀 없는 상태에서 그 의미를 약속, 계약, 규약, 협약 등을 통해 만들 수 있는가? 존 설(John Searle)은 그의 <지향성>(2009)뿐만 아니라, <정신, 언어, 사회>(2000)에서 언어의 구성, 혹은 언어적 지위 부여 문제를 다루고 있다. 이 문제는 물리적 소리가 어떻게 언어적 의미가 되는가? 혹은 어떻게 물리학에서 언어학에 이르게 되는가 하는 것이다. 설은 우리의 정신 때문에 그렇게 된다고 주장한다. <언표수행적(illocutionary) 행위를 통해서 할 수 있는 것은 한정되어 있으.......",
          "link": "https://blog.naver.com/sellars/222713032079",
          "publishedOn": "2022-04-27T02:08:24.000Z",
          "wordCount": 8,
          "title": "의미 구성",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222711791463",
          "author": "sellars",
          "description": "고등학생들이 배우는 <생활과 윤리>에 대한 단행본 책을 보면서 <도덕이나 윤리학을 공부함으로써 진짜 우리는 윤리적이며 도덕적 인간이 되는가?>라는 의문이 생겨난다. 이런 교과나 그 평가 시험이 도덕이나 윤리의 문제를 단지 암기의 문제로 변모시키고 있는 것은 아닌가? 실용 윤리학, 혹은 실천 윤리학이라고 할 수 있는 이런 교과에서 가르치는 문제들은 사실 매우 어려운 문제들이다. 가령 안락사나 낙태의 문제를 어떻게 바라보아야 하는가? 나는 잘 모르겠다. 물론 이런 주제에 대한 내 생각이 있지만, 과연 내 생각이 도덕적으로 옳은지 자신할 수 없다. 철학적 주제들에 대해 관심을 갖고 있고, 그런 주제에 대해서 자신.......",
          "link": "https://blog.naver.com/sellars/222711791463",
          "publishedOn": "2022-04-26T01:28:17.000Z",
          "wordCount": 8,
          "title": "도덕교육 인성교육",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222710482115",
          "author": "sellars",
          "description": "(가) 세계에 대한 우리의 경험은 시간과 공간이라는 직관 형식, 그리고 범주라는 지성 형식 때문에 가능하다. 아니다. 메를로 퐁티는 다음처럼 이야기한다. <오랫동안 그리고 최근 저술에 이르기까지 환원은 선험적(transcendental) 의식의 회귀라고 설명되어 왔다. 그 앞에 세계가 활짝 전개되고, 투명하게 되며, 일련의 통각들, 그러한 통각의 결과를 기초해서 재구성하는 것이 철학자의 과제가 되고 있는 그러한 통각을 통해 철저히 활성화되는 그러한 의식에의 회귀로 제시되고 있다.> (<지각의 현상학>의 번역도 있고, 또 <현상학과 예술>에 <지각의 현상학> 서문에 대한 번역이 있다. 어떤 구절은 <현상학과 예.......",
          "link": "https://blog.naver.com/sellars/222710482115",
          "publishedOn": "2022-04-24T22:23:07.000Z",
          "wordCount": 8,
          "title": "<지각의 현상학> 서문 2 - 선험적 환원",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222709182983",
          "author": "sellars",
          "description": "칸트는 자살에 대해서 다음과 같이 이야기한다. <해악이 잇달아 절망에까지 이르러 생에 염증을 느낀 어떤 사람은 자신이 자살하는 것이 가령 자기 자신에 대한 의무에 어긋나는 일이 아닐까 하고 자문할 수 있는 한, 아직 이성을 가지고 있다. 이제 그는 자신의 행위의 준칙이 실로 보편적 자연법칙이 될 수 있는가를 검토한다. 그런데 그의 준칙은 ‘나는 만약 생이 연장되는 기간에 쾌적함을 약속하기 보다는 오히려 해악을 가져올 위험이 있다면, 자기사랑에서 차라리 생을 단축하는 것을 나의 원리로 삼는다’는 것이다. 여기서 한 가지 더 물어질 것은, 과연 이 자기사랑의 원리가 보편적 자연법칙이 될 수 있는가 하는 점이다. 그때 사.......",
          "link": "https://blog.naver.com/sellars/222709182983",
          "publishedOn": "2022-04-23T07:26:54.000Z",
          "wordCount": 8,
          "title": "칸트와 자살 1",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222708237891",
          "author": "sellars",
          "description": "맥아더는 자연주의에 대한 두 권의 선집을, 즉 Naturalism in Question(2004)과 Naturalism and Normativity(2010)를 공편집하고 있다. 그도 후기 비트겐슈타인의 자연주의가 과학적 자연주의가 아니라고 명백하게 밝힌다. 후기 비트겐슈타인은 세계를 과학적 관점으로 보고자 하는 시도에 비판적이다. 이럼에도 맥아더에 의하면, 후기 비트겐슈타인에게 자연주의라고 부를 수 있는 그런 측면이 존재한다. 후기 비트겐슈타인을 자연주의라고 부를 수 있는 그런 측면을 바로 스탠리 카벨이 다음처럼 표현하고 있다. <비트겐슈타인의 <철학적 탐구>는 비트겐슈타인의 작업을 철학을 자연화하는 것으로 제안하고 있다고 할 수 있다.> 여.......",
          "link": "https://blog.naver.com/sellars/222708237891",
          "publishedOn": "2022-04-22T06:19:55.000Z",
          "wordCount": 8,
          "title": "맥아더의 후기 비트겐슈타인 자연주의 1",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222706855672",
          "author": "sellars",
          "description": "* 다음 두 글을 요약하고 평가해 보라. (가) 도덕이란 무엇인가? 진리는 무엇이고 이성이란 무엇인가? 사실 니체에 따르면 이 물음들은 애초부터 잘못이다. 그는 “...란 무엇인가?”라는 질문 형식을 받아들이지 않는다. 가장 명확한 앎을 추구하는 것처럼 보이는 “...란 무엇인가?”는 사실 가장 불명확한 물음이다. 철학뿐만 아니라 학문에서 이러한 질문 형식은 기본이었다. 무엇을 알기 위해서 그 무엇을 대상으로 삼아야 한다. 인식 주체인 내가 인식 대상인 그 무엇을 냉철한 이성으로 관찰하고 검토하고 분석해서 답을 내야 한다. 그 답이 얻어졌을 때 비로소 내가 안다고 말할 수 있다. 주관이나 의도가 섞이면 불순한 앎이며, 객관적.......",
          "link": "https://blog.naver.com/sellars/222706855672",
          "publishedOn": "2022-04-20T23:52:33.000Z",
          "wordCount": 8,
          "title": "니체와 본질",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222705910386",
          "author": "sellars",
          "description": "동이(同異)가 동거한다. 이것을 하이데거가 차연(差延)이라고 한다. 유(有)/무(無), 나타남/숨음, 진리/비진리, 현시/은적, 생(生)/사(死), 이 모든 것이 동거적이며, 차연적이다. 하이데거의 표현으로 <존재의 면사포>이다. 차연은 양가성과 이중성을 이야기하고 있다. <새끼꼬기의 교직성>이다. <그것이 말한다>는 것은 바로 이것이다. 이것을 <그것이 주고 있다.> 이런 주장은 불교에서 말하는 색즉시공(色卽是空), 공즉시색(空卽是色)이다. 모든 것이 무상하고 허무하다. 적어도 이 점에서 소유론적 사유는 해체된다. 그러나 하이데거나 불교의 주장은 단지 소유론적 사유의 해체만을 의미하지 않는다. 공(空)이 모.......",
          "link": "https://blog.naver.com/sellars/222705910386",
          "publishedOn": "2022-04-19T23:16:59.000Z",
          "wordCount": 8,
          "title": "차연(差延)의 이중긍정",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222705041930",
          "author": "sellars",
          "description": "* 다음 글을 논증으로 표현하고, 논평해 보라. 북녘 바다에 물고기가 있다. 그 이름이 곤(鯤)이다. 곤의 크기는 몇 천리가 되는지 알 수 없다. 이 물고기가 변해서 새가 된다. 그 새의 이름은 붕(鵬)이다. 붕의 등 넓이는 몇 천리가 되는지 알 수 없다. 힘차게 날아 오르면 그 날개는 하늘을 드리운 구름과도 같다. 이 새는 바다 기운이 움직여 큰 바람이 일면 그 바람을 타고 남쪽으로 날아가려고 한다. 남쪽 바다는 바로 천지(天地)이다. 재해(齋諧)는 괴이한 일을 아는 사람이다. 그의 말에 의하면, 큰 새 붕이 남쪽 바다로 날아갈 때, 삼천리의 파도를 일으키고, 회오리 바람을 타고 구만리의 하늘을 오르고, 그 큰 바람을 타고 남쪽으로 날.......",
          "link": "https://blog.naver.com/sellars/222705041930",
          "publishedOn": "2022-04-19T03:09:49.000Z",
          "wordCount": 8,
          "title": "16 장자(莊子)의 <소요유(逍遙遊)>",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222703766788",
          "author": "sellars",
          "description": "칸트는 “미결정적(undetermined) 대상” 혹은 “무규정적 대상”이라는 개념을 사용하고 있다. <우리가 대상에 의해 촉발되는 한에서, 대상이 표상능력에 미치는 결과가 감각이다. 감각에 의해 대상과 관계 맺는 그런 직관은 경험적이라고 일컫는다. 경험 직관의 무규정적 대상을 현상이라고 일컫는다.>(A19-20) 경험적 직관의 무규정적 대상은 아직 범주나 개념이 작용하지 않은 표상이고 현상이다. 그러나 현상의 고유한 의미는 범주와 개념이 작용해야만 한다. <지성의 모든 활동은 판단으로 환원할 수 있고, 그래서 지성 일반은 판단하는 능력이라고 표상될 수 있다. 왜냐하면 지성은 사고하는 능력이기 때문이다. 사고란 개념에 의.......",
          "link": "https://blog.naver.com/sellars/222703766788",
          "publishedOn": "2022-04-17T22:55:21.000Z",
          "wordCount": 8,
          "title": "10 미결정적 대상과 결정적 대상",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222702490648",
          "author": "sellars",
          "description": "현상학은 일차적 경험이나 체험을 기술 혹은 서술하는 것이다. 기술하고 서술하는 것은 설명하거나 분석하는 것과 다르다. 따라서 설명하고자 하는 과학과 현상학 혹은 철학은 다르다. 과학은 현상학에 비해 이차적이다. 혹은 과학적 도식화는 추상적이고 파생적인 기호언어에 지나지 않는다. 왜냐하면 과학이 탐구하는 세계에 대한 이론적 근거는 현상학이나 철학이 서술하는 세계에 대한 일차적, 근본적 경험에 의존하고 있기 때문이다. 과학은 이차적이다. 따라서 나는 과학에서 이야기하는 그런 존재가 아니다. 즉 나는 과학에서 이야기하는 생물이 아니다. 나는 과학에서 이야기하는 그런 특성을 지닌 인간이나 의식이 아니다. 나는 더 근본.......",
          "link": "https://blog.naver.com/sellars/222702490648",
          "publishedOn": "2022-04-16T07:06:32.000Z",
          "wordCount": 8,
          "title": "<지각의 현상학> 서문 1",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222701718484",
          "author": "sellars",
          "description": "(A) 만약 윤리적으로 행위하는 것이라면, 그것이 보편화 가능해야 한다. 그런데 합리적인 것은 보편적으로 타당하다. 따라서 합리적인 것은 윤리적으로 행위하는 것이다. 이 논증은 형식적으로 부당하다. 매개념이 모두 부주연되어 있다. 따라서 다음처럼 고쳐야 한다. (B) 만약 보편화 가능하다면, 그것은 윤리적으로 행위하는 것이다. 그런데 합리적인 것은 보편적으로 타당하다. 따라서 합리적인 것은 윤리적으로 행위하는 것이다. 그런데 이렇게 고친 논증은 싱어가 의도하는 논증이 아니다. 윤리의 필요조건이 보편화 가능성이다. 그런데 (B)에서 보편화 가능성이 충분조건으로 되어 있다. 따라서 싱어가 의도하는 것이 바로 (A)이다. 분명.......",
          "link": "https://blog.naver.com/sellars/222701718484",
          "publishedOn": "2022-04-15T07:35:18.000Z",
          "wordCount": 8,
          "title": "이성과 윤리",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222700495171",
          "author": "sellars",
          "description": "Kevin M. Cahill와 Thomas Raleigh는 리빙스턴을 후기 비트겐슈타인의 자연주의를 주장하는 학자로서 언급하고 있지만, 그런데 과연 리빙스턴이 후기 비트겐슈타인의 자연주의를 주장하는지 그렇게 분명하지 않다. 흥미롭게 리빙스턴은 플라톤과 후기 비트겐슈타인의 유사성을 주장한다. 플라톤의 대화록 <크라튈로스>에 나타난 이름과 사물의 관계에 대한 규약주의와 자연주의적 주장에 대해서 플라톤은 우리 언어 사용의 형식 혹은 형상을 강조하는 제3의 주장을 하고 있다고 리빙스턴은 논증한다. 플라톤의 이러한 입장이 바로 규칙 따르기에서 후기 비트겐슈타인이 보여주고 있는 입장과 유사하다는 것이 리빙스턴의 주장이다. 적어도.......",
          "link": "https://blog.naver.com/sellars/222700495171",
          "publishedOn": "2022-04-14T03:25:52.000Z",
          "wordCount": 8,
          "title": "리빙스턴의 후기 비트겐슈타인",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222699369228",
          "author": "sellars",
          "description": "* 다음 글에서 소개된 이리가라이의 주장을 평가해 보라. (이리가라이, 이리가레이, 이리가레 등으로 다양하게 지칭되는) Luce Irigaray는 플라톤의 <국가>에 나오는 동굴 신화를 정신분석학적으로 독해한다. 동굴 안에서 일렁이는 불빛에 의해 벽에 얼룩진 그림자 밖에는 볼 수 없기 때문에, 태양에 비친 진정한 사물의 모습을 보기 원한다면 철학자는 동굴에서 빠져 나와 위쪽 바깥 세계로 올라가야 한다. 전통적으로 로고스 중심주의에 따라서 이 신화는 다음과 같이 이해되었다. 동굴을 빠져 나와 태양을 향하는 오르막길 여행은 참된 철학자가 되기를 원한다면, 누구나 반드시 밟아야 하는 과정을 의미한다. 사물을 단순히 미혹된 현.......",
          "link": "https://blog.naver.com/sellars/222699369228",
          "publishedOn": "2022-04-13T01:15:11.000Z",
          "wordCount": 8,
          "title": "본질과 가족 유사성",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222698478995",
          "author": "sellars",
          "description": "<그것이 말한다.> 이 주장은 라캉의 주장이면서 동시에 하이데거의 주장이다. 김형효는 라캉의 주장을 ‘본능의 언어활동’이라고 규정하고, 하이데거의 주장을 ‘존재의 언어활동’ 혹은 ‘본성의 언어활동’이라고 규정한다. 하이데거의 주장이 ‘존재의 언어활동’이라면, 라캉의 그것은 ‘소유’의 언어활동이다. <그것은 말한다>라는 하이데거의 주장은 7-1 <진리와 비진리의 불일이불이(不一而不二)와 법성(法性)의 성기(性起)>와 7-2 <차연(差延)의 이중긍정과 해탈의 이중부정>으로 해명되고 있다. 7-1은 글의 순서에 따라 다음처럼 요약될 수 있다. (A) 중생의 욕계(欲界)에서 이기심을 치유할 수 있는 방법이.......",
          "link": "https://blog.naver.com/sellars/222698478995",
          "publishedOn": "2022-04-12T03:08:56.000Z",
          "wordCount": 8,
          "title": "<그것이 말한다>와 존재의 언어활동",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222697404993",
          "author": "sellars",
          "description": "* 다음 글을 논증으로 요약하고 평가해 보라. 이 도덕의 역사학자들 가운데 위세를 부리고 싶어하는 선한 정령에게 경의를 표하자. 그러나 유감스럽게도 이들에게는 역사적 정신 자체가 결여되어 있으며, 그들이 바로 역사의 모든 선한 정령 자체에게서 방치되어버렸다는 것은 확실하다. 그들 모두는 낡은 철학자들의 관습이 그러하듯이, 본질적으로 비역사적으로 생각한다. 이 점에 관해서는 의심할 여지가 없다. 그들이 다루는 도덕 계보학의 미숙함은 ‘좋음’이라는 개념과 판단의 유래를 탐구하는 것이 문제될 때, 처음부터 바로 드러난다. 그들은 다음과 같이 선언한다. “원래 비이기적 행위란 그 행위가 표시되어, 즉 그 행위로 인해 이.......",
          "link": "https://blog.naver.com/sellars/222697404993",
          "publishedOn": "2022-04-11T02:48:00.000Z",
          "wordCount": 8,
          "title": "15 니체와 발생적 오류",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222695768753",
          "author": "sellars",
          "description": "특히 인터넷에서 글에 ㅋㅋ나 ㅎㅎ를 습관적으로 자주 쓰는 경우를 본다. 이런 기호를 쓰는 심리 상태가 무엇인가? 그 심리 상태를 어느 정도 추측할 수 있지만, 그의 심리 상태가 무엇이든 간에 그러한 기호는 글의 내용이 정당한지, 그렇지 않은지와 무관하다. 그럼에도 이런 기호들이 자주 나타나는 글은 그다지 진지하지 못한 경우가 대부분이다. 따라서 그런 기호가 자주 나타나는 글은 그냥 무시하는 것이 좋은 방책이다. 철학에서 중요한 것은 상대방에 대한 심리분석이 아니다. 너는 바로 이런 동기에서 그 글을 썼다. 이런 주장에 대해서 “아닌데” 하면 그만이다. 내가 그런 동기에서 썼다는 것을 네가 어떻게 증명할 것인가? 나아가.......",
          "link": "https://blog.naver.com/sellars/222695768753",
          "publishedOn": "2022-04-08T19:18:34.000Z",
          "wordCount": 8,
          "title": "심리분석과 철학",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222694937057",
          "author": "sellars",
          "description": "9강의 제목은 <주관적 표상을 객관화하는 지성주체의 형식>이다. 지성주체의 형식인 범주와 칸트에게 매우 중요한 초월적 연역에 대한 이야기를 기대했지만, 이런 이야기는 나오지 않는다. 8강과 마찬가지로 어떻게 주관적 표상이 객관화될 수 있는지, 칸트가 주관주의인지, 아닌지, 시간과 공간의 형식이 마음의 주관적 형식이라는 것이 무엇을 의미하는지 이야기하고 있다. 칸트가 초월적 연역, 혹은 선험론적 연역에서 보여주는 문제는 선험적, 아프리오리 개념이 어떻게 객관적 실재성을 갖는가 하는 것이다. 아마 모종삼의 표현으로는 “지성주체의 형식이 어떻게 주관적 표상을 객관화하는가”라는 문제가 될 것이다. 어떻게 객관화.......",
          "link": "https://blog.naver.com/sellars/222694937057",
          "publishedOn": "2022-04-08T00:19:40.000Z",
          "wordCount": 8,
          "title": "9 허이공실(虛以控實)",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222694283494",
          "author": "sellars",
          "description": "풍우란의 <중국철학사>에 소개된 승조(僧肇)의 <부진공론(不眞空論)>을 다음처럼 요약할 수 있다. <만물은 유(有)가 아닌 이유가 있으므로 유(有)가 아니다. 만물은 무(無)가 아닌 이유가 있으므로 무(無)가 아니다. 무(無)가 아니므로 절대적 무(無)가 아니고, 유(有)가 아니므로 진유(眞有)가 아니다. 유(有)와 무(無)는 명칭이 달라도 하나이다. 유(有)가 진유(眞有)라면, 영원할 것이다. 그러나 유(有)는 인연에 의해 생겨나므로 영원하지 않다. 따라서 유(有)는 진유(眞有)가 아니다. 무(無)가 진정한 무(無)라면, 영원할 것이다. 그러나 무(無)는 인연에 의해 생겨나므로 영원하지 않다. 따라서 무(無)는 절대적 무(無)가 아.......",
          "link": "https://blog.naver.com/sellars/222694283494",
          "publishedOn": "2022-04-07T06:28:45.000Z",
          "wordCount": 8,
          "title": "승조(僧肇)의 부진공론(不眞空論)",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222693300208",
          "author": "sellars",
          "description": "<그들은 무(無)에 대해서 진지하게 숙고하였다.> 그런데 나는 그럴 필요가 없다고 생각한다. 무(無), 즉 없는 것에 대해서 숙고하는 대신에 차라리 있는 것에 대해서 숙고하고 성찰하는 것이 더 낫다. 가령 ‘존재하는’ 규칙의 규범성을 어떻게 해명해야 하는지 숙고하는 것이 더 낫다. <도대체 왜 존재자이며, 오히려 무(無)가 아닌가?> 진짜 이 질문이 형이상학의 근본물음인가? 루우의 <형이상학 강의>에는 이 물음이 없다. 로이(Lowe)의 책, <형이상학 개관>에도 이 질문을 다루지 않는다. 도대체 이 질문은 무엇을 묻고 있는 것인가? 루이스가 지적하듯이 이 질문은 잘못된 가정, 즉 무(無)가 있다는 가정, 혹은 절.......",
          "link": "https://blog.naver.com/sellars/222693300208",
          "publishedOn": "2022-04-06T06:09:43.000Z",
          "wordCount": 8,
          "title": "무(無)의 존재",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/222692662327",
          "author": "sellars",
          "description": "https://blog.naver.com/sellars/100033129776 비트겐슈타인과 하이데거 1 하이데거에 대한 비트겐슈타인의 글이 <존재와 시간>에 대한 것이라고 리빙스턴이 주장한다. 나는 존재와 불안에 의해서 무엇을 의미하려고 하는지 잘 생각할 수 있다고 이야기하는 비트겐슈타인의 글이 하이데거 후기에 관한 것이라고 막연하게 생각했었다. 그러나 비트겐슈타인의 글은 하이데거의 <존재와 시간>이 나온 이년 후에 작성되었다고 한다. (이럼에도 머레이는 <존재와 시간>보다는 오히려 <형이상학이란 무엇인가>(1929)에 대한 것이라고 주장하고 있다.) 하여튼 무엇이 존재한다. 비트겐슈타인은 존재의 경이에 대해 질문으로 표.......",
          "link": "https://blog.naver.com/sellars/222692662327",
          "publishedOn": "2022-04-05T12:42:12.000Z",
          "wordCount": 8,
          "title": "리빙스턴의 비트겐슈타인과 하이데거",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The ZipCPU by Gisselquist Technology",
      "feedUrl": "https://zipcpu.com/feed",
      "siteUrl": "https://zipcpu.com/",
      "articles": [
        {
          "id": "https://zipcpu.com/blog/2022/04/29/proto-bringup.html",
          "author": null,
          "description": "For those who wonder what a “day in the life of” a digital design engineer\nmight be like, let me offer the following account of “bringup week.”\nThis is the week the team assembled, with all of their various parts and\npieces, to put a hardware design together for the first time.\nI’m getting ahead of myself, though, so let me back up a bit.\nAs background, I’ve had the wonderful fortune and opportunity to help build a\nSONAR\nsystem.  Since I’m just a one-man shop, I’m only working on a portion of this\nsystem.  My portion is simply the FPGA portion with some demonstration software\nthrown in for good effect.  Others had developed and assembled the circuit\nboards, someone else had developed the actual\nSONAR circuitry, and another team had\ndesigned and built the\ntransducers\nwhich would go in the w…",
          "link": "https://zipcpu.com/blog/2022/04/29/proto-bringup.html",
          "publishedOn": "2022-04-29T04:00:00.000Z",
          "wordCount": 10170,
          "title": "Bringing up a new piece of hardware -- what can go wrong?",
          "imageUrl": null
        }
      ]
    }
  ],
  "cliVersion": "1.14.4"
}