{
  "sources": [
    {
      "title": "ACM Queue - All Queue Content",
      "feedUrl": "https://queue.acm.org/rss/feeds/queuecontent.xml",
      "siteUrl": "http://queue.acm.org/",
      "articles": [
        {
          "id": "3664645",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3664645",
          "publishedOn": "2024-05-29T15:15:45.000Z",
          "wordCount": null,
          "title": "Zero Tolerance for Bias",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "3664276",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3664276",
          "publishedOn": "2024-05-29T15:09:15.000Z",
          "wordCount": null,
          "title": "Structuring Success",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "3665220",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3665220",
          "publishedOn": "2024-05-24T12:34:31.000Z",
          "wordCount": null,
          "title": "Trustworthy AI using Confidential Federated Learning",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "3664295",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3664295",
          "publishedOn": "2024-05-23T12:27:12.000Z",
          "wordCount": null,
          "title": "Confidential Computing or Cryptographic Computing?",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "3664293",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3664293",
          "publishedOn": "2024-05-22T15:59:04.000Z",
          "wordCount": null,
          "title": "Confidential Container Groups",
          "itunes": {},
          "imageUrl": null
        },
        {
          "id": "3664275",
          "author": null,
          "description": "",
          "link": "http://queue.acm.org/detail.cfm?ref=rss&id=3664275",
          "publishedOn": "2024-05-20T14:01:26.000Z",
          "wordCount": null,
          "title": "Make Two Trips",
          "itunes": {},
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Arjun Sreedharan",
      "feedUrl": "https://arjunsreedharan.org/rss",
      "siteUrl": "https://arjunsreedharan.org/",
      "articles": []
    },
    {
      "title": "공간주의",
      "feedUrl": "https://attention2.space/feed/",
      "siteUrl": "https://attention2.space",
      "articles": []
    },
    {
      "title": "The Clean Code Blog",
      "feedUrl": "https://blog.cleancoder.com/atom.xml",
      "siteUrl": "http://blog.cleancoder.com/atom.xml",
      "articles": []
    },
    {
      "title": "C++ Stories",
      "feedUrl": "https://www.cppstories.com/index.xml",
      "siteUrl": "https://www.cppstories.com/",
      "articles": [
        {
          "id": "https://www.cppstories.com/2017/08/cpp17-details-filesystem/",
          "author": null,
          "description": "Although C++ is an old programming language, its Standard Library misses a few basic things. Features that Java or .NET had for years were/are not available in STL. With C++17 there’s a nice improvement: for example, we now have the standard filesystem!\nTraversing a path, even recursively, is so simple now!\n\n\n\n     \n    \n\n\nFor the last five episodes/articles, I’ve covered most of the language features. Now it’s time for the Standard Library. I’ve planned three posts on that: Filesystem, Parallel STL and Concurrency, Utils.\nMaybe I was a bit harsh in the introduction. Although the Standard Library lacks some important features, you could always use Boost with its thousands of sub-libraries and do the work. The C++ Committee and the Community decided that the Boost libraries are so important…",
          "link": "https://www.cppstories.com/2017/08/cpp17-details-filesystem/",
          "publishedOn": "2024-06-10T00:00:00.000Z",
          "wordCount": null,
          "title": "C++17 in Detail: Filesystem in The Standard Library",
          "imageUrl": null
        },
        {
          "id": "https://www.cppstories.com/2024/pipe-operator/",
          "author": null,
          "description": "In this blog post, we’ll show how to implement a custom pipe operator and apply it to a data processing example. Thanks to C++23 and std::expectedwe can write a rather efficient framework that easily handles unexpected outcomes.\nThis is a collaborative guest post by prof. Bogusław Cyganek:\n        \n        \n\n        \nProf. Cyganek is a researcher and lecturer at the Department of Electronics, AGH University of Science and Technology in Cracow, Poland. He has worked as a software engineer for a number of companies such as Nisus Writer USA, Compression Techniques USA, Manta Corp. USA, Visual Atoms UK, Wroclaw University in Poland, and Diagnostyka Inc. Poland. His research interests include computer vision and pattern recognition, as well as the development of embedded systems. See his recent…",
          "link": "https://www.cppstories.com/2024/pipe-operator/",
          "publishedOn": "2024-05-27T00:00:00.000Z",
          "wordCount": 3168,
          "title": "Function Composition and the Pipe Operator in C++23 – With std::expected",
          "imageUrl": "https://www.cppstories.com/2024/images/pipe_expected.png"
        }
      ]
    },
    {
      "title": "Sticky Bits – Powered by Feabhas",
      "feedUrl": "https://blog.feabhas.com/feed/",
      "siteUrl": "https://blog.feabhas.com/",
      "articles": []
    },
    {
      "title": "The LLVM Project Blog",
      "feedUrl": "https://blog.llvm.org/index.xml",
      "siteUrl": "https://blog.llvm.org/",
      "articles": []
    },
    {
      "title": "Embedded in Academia",
      "feedUrl": "https://blog.regehr.org/feed",
      "siteUrl": "https://blog.regehr.org",
      "articles": []
    },
    {
      "title": "Siemens Blog Network",
      "feedUrl": "https://blogs.sw.siemens.com/feed/",
      "siteUrl": "https://blogs.sw.siemens.com",
      "articles": []
    },
    {
      "title": "Embedded Software Insights | Latest Embedded Technology News",
      "feedUrl": "https://www.bluefruit.co.uk/blog/feed",
      "siteUrl": "https://bluefruit.co.uk/blog/",
      "articles": [
        {
          "id": "https://bluefruit.co.uk/?p=14079",
          "author": "Tristan Jago",
          "description": "The space industry is among the most innovative in the world. Propelled by communications, exploration, and R&D possibilities, it is estimated […]\nThe post 5 ways aerospace product development solves real-time challenges in space appeared first on Bluefruit Software.",
          "link": "https://bluefruit.co.uk/quality/aerospace-product-development-challenges/",
          "publishedOn": "2024-01-04T15:14:19.000Z",
          "wordCount": 2411,
          "title": "5 ways aerospace product development solves real-time challenges in space",
          "imageUrl": "https://bluefruit.co.uk/content/uploads/2024/01/Space-design-thumb.jpg"
        }
      ]
    },
    {
      "title": "Bartosz Ciechanowski",
      "feedUrl": "https://ciechanow.ski/atom.xml",
      "siteUrl": "https://ciechanow.ski/",
      "articles": []
    },
    {
      "title": "Architectures and Processors blog",
      "feedUrl": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog/rss",
      "siteUrl": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog",
      "articles": [
        {
          "id": "dd9e70c8-6d3c-4c71-b136-2456382a7b5c:65dfa3dd-b3dd-42ee-930d-1301a6ee028b",
          "author": "Zenon Xiu (修志龙）",
          "description": "This blog series provides an introduction to the Arm Scalable Matrix Extension (SME) including SVE and SVE2.(read more)",
          "link": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog/posts/arm-scalable-matrix-extension-introduction",
          "publishedOn": "2024-05-23T09:00:00.000Z",
          "wordCount": null,
          "title": "Part 1: Arm Scalable Matrix Extension (SME) Introduction",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CPUU의 Daydreamin&#039;",
      "feedUrl": "https://cpuu.postype.com/rss",
      "siteUrl": "https://www.postype.com/@cpuu",
      "articles": []
    },
    {
      "title": null,
      "feedUrl": "https://danluu.com/atom.xml",
      "siteUrl": "https://danluu.com/atom/index.xml",
      "articles": [
        {
          "id": "https://danluu.com/bioware/",
          "author": null,
          "description": "This is an archive of some posts in a forum thread titled \"Beware of Bioware\" in a now defunct forum, with comments from that forum as well as blog comments from a now defunct blog that archived that made the first attempt to archive this content. The original posts were deleted shortly after being posted, replaced with \"big scary company vs. li'l ol' me.\"\n\nMilez5858\nEA gets a lot of the grief for their employment history.\nFor anyone considering work at Bioware, beware of them as well.\nThey use seriously cult like tactics to keep their employees towing the company line, but don't be fooled. The second you don't tow that line you'll be walked out the doors.\nThey love out of country workers because they don't understand the Canadian labour laws. They continually fire people with out warning.…",
          "link": "https://danluu.com/bioware/",
          "publishedOn": "2024-05-31T00:00:00.000Z",
          "wordCount": null,
          "title": "Beware of Bioware",
          "imageUrl": null
        },
        {
          "id": "https://danluu.com/ftc-google-antitrust/",
          "author": null,
          "description": "html {\n  max-width: 170ch;\n  padding: 0.5em 0.5em;\n  margin: auto;\n  line-height: 1.5;\n  font-size: 1.15em;\n}\n\n\nThis is a summary of the publicly available documents on the 2011-2012 FTC investigation of Google's allegedly antitcompetive actions in search and ads, followed by a tech-focused analysis of the decision from someone who's worked at the two companies that are discussed in the most detail in the memos (Google and Microsoft), worked in search, and worked closely with ads teams on optimizing ads ranking algorithms. I've seen a number of law-focused and economics-focused analyses, but I haven't seen a tech-focused analysis in a level of detail I find satisfying. In particular, a number of key arguments in the memos rely on evidence and inferences that would've seen implausible to so…",
          "link": "https://danluu.com/ftc-google-antitrust/",
          "publishedOn": "2024-05-26T00:00:00.000Z",
          "wordCount": 31648,
          "title": "Comments on the FTC antitrust investigation of Google",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Dave Cheney",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "Red Hat Developer",
      "feedUrl": "https://developers.redhat.com/blog/feed",
      "siteUrl": "https://developers.redhat.com/",
      "articles": [
        {
          "id": "7bcfd2ee-c9d8-4c8e-91d0-d0178b32e01a",
          "author": "Anshul Behl",
          "description": "In the rapidly evolving field of IT, new roles, titles, and frameworks often emerge, leading to varying terminology across organizations. One such role is the automation developer.\nDespite what the title might suggest, an automation developer is not a traditional software developer. In fact, most automation developers (or automation engineers or platform engineers) don’t have extensive development skills or backgrounds in coding, yet they are creating Ansible content every day and are contributing to the successful adoption of automation within their organization.\nTraditional developers vs. the automation developers\nWhen we think of a traditional software developer, we imagine someone who writes code to build applications. Their work involves designing, coding, testing, and maintaining sof…",
          "link": "https://developers.redhat.com/articles/2024/06/13/demystifying-role-automation-developer-its-not-what-you-think",
          "publishedOn": "2024-06-13T07:00:00.000Z",
          "wordCount": null,
          "title": "Demystifying the role of an automation developer (it's not what you think)",
          "imageUrl": null
        },
        {
          "id": "02af4efc-1a6a-41e2-a47d-88c451288c05",
          "author": "Nick Clifton",
          "description": "The location of code and data in memory can have a big effect on a program's performance. Placing functions that reference each other frequently in the same area of memory can help reduce the need to load and unload pages of memory. Similarly, pieces of data that are used a lot at the same time benefit from being located in the same region of memory.\nAlternatively, sometimes it is better not to group code and data based upon its use, but rather upon its similarity to each other. Placing similar code and data in adjacent memory regions means that the binary image can be compressed to a greater degree, a feature which is often important for mobile applications.\nCompilers attempt to address these needs via the use of profile directed optimizations as well as supporting language features like …",
          "link": "https://developers.redhat.com/articles/2024/06/13/practical-guide-linker-section-ordering",
          "publishedOn": "2024-06-13T07:00:00.000Z",
          "wordCount": null,
          "title": "A practical guide to linker section ordering",
          "imageUrl": null
        },
        {
          "id": "d1be7b84-24e7-42cc-9252-14a96657c986",
          "author": "Abdellatif Bouchama",
          "description": "Have you ever faced the challenge of needing to recreate a Kafka Connector while preserving its offset position? If so, we have fantastic news for you!\nPicture this: your Kafka Connect cluster is perfectly set up, your connectors are finely tuned, and everything is running smoothly. Suddenly, you need to recreate one of your connectors. The thought of losing all the offset information is daunting—nobody wants to risk data duplication or loss.\nBut worry no more, because Red Hat AMQ Streams 2.6 on Red Hat OpenShift (based on Apache Kafka 3.6.0 and Strimzi 0.38.x) has introduced a revolutionary feature: first-class offsets support with KIP-875. This new feature includes REST API endpoints specifically designed for managing connector offsets, making it seamless to preserve your offset position…",
          "link": "https://developers.redhat.com/articles/2024/06/13/how-manage-and-preserve-kafka-connect-offsets-smoothly",
          "publishedOn": "2024-06-13T07:00:00.000Z",
          "wordCount": null,
          "title": "How to manage and preserve Kafka Connect offsets smoothly",
          "imageUrl": null
        },
        {
          "id": "8387d247-7986-4f79-879a-3e47528f344e",
          "author": "Bernard Tison",
          "description": "Red Hat Connectivity Link is a new offering from Red Hat, which brings a Kubernetes/Red Hat OpenShift native solution for complex application connectivity and API management in hybrid and multi-cloud environments. Connectivity Link is based on the upstream Kuadrant project and was released as a Developer Preview at Red Hat Summit 2024, with the goal of going GA in the fall of 2024.\nIn this article, I will demonstrate how to get started with Connectivity Link on Red Hat OpenShift. Connectivity Link is not limited to OpenShift, and can be installed and used on other Kubernetes distributions like EKS. However, the installation is much simpler on OpenShift as the required operators can be installed and managed through the Operator Lifecycle Manager (OLM).\nPrerequisites\nThe first prerequisite i…",
          "link": "https://developers.redhat.com/articles/2024/06/12/getting-started-red-hat-connectivity-link-openshift",
          "publishedOn": "2024-06-12T07:00:00.000Z",
          "wordCount": null,
          "title": "Getting started with Red Hat Connectivity Link on OpenShift",
          "imageUrl": null
        },
        {
          "id": "2ca1d9ab-00cd-4a03-8063-b22f41707281",
          "author": "Francisco De Melo Junior, Alexander Barbosa Ayala",
          "description": "As explained in Deploying your Quarkus applications to OpenShift, there are several approaches for deploying in Red Hat OpenShift Container Platform (RHOCP) 4. Each situation might require different a approach from the ones listed in this article given different (project) requirements.\nWhen doing Quarkus builds for OpenShift, there are several approaches. One of the simplest is the Quarkus Maven plug-in, meaning that the usage of quarkus-openshift extension considerably facilitates the deployment.\nEither via pom.xml setting the following dependency:\n<dependency>\n    <groupId>io.quarkus</groupId>\n    <artifactId>quarkus-openshift</artifactId>\n</dependency>\nOr by adding the extension manually via the command line interface (CLI command) using the Maven Wrapper: \n<-- Below has the latest Quar…",
          "link": "https://developers.redhat.com/articles/2024/06/12/4-ways-deploy-quarkus-applications-openshift-container-platform-4",
          "publishedOn": "2024-06-12T07:00:00.000Z",
          "wordCount": null,
          "title": "4 ways to deploy Quarkus applications in OpenShift Container Platform 4",
          "imageUrl": null
        },
        {
          "id": "c9890276-935c-42b8-aae6-8c44a9326f08",
          "author": "Serhei Makarov",
          "description": "Many profiling tools on Linux have previously been limited by their reliance on stack unwinding algorithms that require commonly-used frame pointer optimizations to be disabled. This article introduces eu-stacktrace, a prototype tool that uses the elfutils toolkit’s unwinding libraries to support a sampling profiler to unwind frame pointer-less stack sample data.\nBackground\nDevelopers and customers find benefit in profiling the performance of their applications in both development and production environments. A typical requirement for useful profile data is an accurate stack trace listing the active functions at every sample in the profile. Commonly used profiling tools try to fulfill this requirement with basic unwinder implementations that assume programs to have been compiled with a sta…",
          "link": "https://developers.redhat.com/articles/2024/06/11/get-system-wide-profiles-binaries-without-frame-pointers",
          "publishedOn": "2024-06-11T07:00:00.000Z",
          "wordCount": null,
          "title": "Get system-wide profiles of binaries without frame pointers",
          "imageUrl": null
        },
        {
          "id": "690d5adc-605a-45d3-8381-b91ac5f83968",
          "author": "Hans-Peter Grahsl, Joshua Wood, Ryan Jarvinen",
          "description": "This is an excerpt from Developer Portals: Prepare to Perform with Red Hat Developer Hub. Download the full e-book.\nAs a cultural initiative, DevOps has probably made software more reliable and its creation more rapid. Its best understood practices have benefited their progenitors, publicizers, and most successful adopters. Developer engagement with deployment concerns engenders a systems thinking that improves application architecture, but DevOps declares for developers an unbounded array of new concepts, terms, and concerns.\nThis increase in cognitive load can make it feel like the early returns from DevOps practices such as automation and “infrastructure as code” and its progression toward GitOps are diminishing and progress slowing. More than 80% of developers say they have some kind o…",
          "link": "https://developers.redhat.com/articles/2024/06/10/platform-building-developer-portals",
          "publishedOn": "2024-06-10T07:00:00.000Z",
          "wordCount": null,
          "title": "A platform for building developer portals",
          "imageUrl": null
        },
        {
          "id": "4d91736c-7cb0-4f30-9ecf-de26ef6c4141",
          "author": "Jerome Marc",
          "description": "Red Hat Satellite is an infrastructure management tool designed for the management and operations of Red Hat Enterprise Linux (RHEL) environments. It allows system administrators to scale the management of their datacenters to thousands of hosts at ease, while implementing and enforcing secure and compliant standard operating environments (SOE).\nIn this article, we investigate the use of Satellite webhooks and automation to interact with third-party tooling and react to events occurring within Satellite. This is traditionally used to improve the overall operational efficiency by either forwarding events to third-party auditing and monitoring tools (e.g., Splunk), or using events as triggers for automation (e.g., Red Hat Ansible Automation Platform, ServiceNow). To this point, we explore ho…",
          "link": "https://developers.redhat.com/articles/2024/06/10/satellite-webhook-and-insights-automation-efficient-rhel-operations",
          "publishedOn": "2024-06-10T07:00:00.000Z",
          "wordCount": null,
          "title": "Satellite webhook and Insights automation for efficient RHEL operations",
          "imageUrl": null
        },
        {
          "id": "3bed29c8-4504-4367-8f96-46bc979c418c",
          "author": "Andriana Theodorakopoulou",
          "description": "RStudio Server is a powerful open source integrated development environment (IDE) that offers a graphical interface for the R programming language, significantly enhancing data analysis and visualization capabilities. With the rise of data-driven decision-making, having a robust tool like RStudio Server becomes crucial for data scientists and analysts. This guide will walk you through the process of setting up RStudio Server on Red Hat OpenShift AI and getting started with its extensive features.\nSetting Up RStudio Server on OpenShift AI\nThe integration of RStudio Server with OpenShift AI provides a scalable and secure environment for data analysis.\nHere’s a step-by-step guide to get you started.\n\nLog in to the cluster. First, access your OpenShift cluster by logging in through the termina…",
          "link": "https://developers.redhat.com/articles/2024/06/06/how-integrate-and-use-rstudio-server-openshift-ai",
          "publishedOn": "2024-06-06T07:00:00.000Z",
          "wordCount": 3686,
          "title": "How to integrate and use RStudio Server on OpenShift AI",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/Red%20Hat%20Openshift%20AI_0.png?itok=EGHltugp"
        },
        {
          "id": "a7dfda04-861d-4593-b806-f4945c3ab857",
          "author": "Luis Falero Otiniano",
          "description": "Using Argo CD to manage your Kubernetes ecosystem is an excellent GitOps approach to continuous deployment (CD). However, it can pose challenges when trying to manage multiple Kubernetes manifests for deployments, services, secrets, configurations, and other files within your Git repository.\nUnlike an Argo CD Application resource that deploys resources from a single Git repository in a single cluster or namespace, ApplicationSet expands upon this use case. An ApplicationSet utilizes template-based automation to create, modify, and manage multiple Argo CD applications simultaneously, targeting multiple clusters and namespaces.\nIn what situations is it more convenient to use an ApplicationSet?\n\n\n\nIt is convenient to use an ApplicationSet when a user or team has too many applications to manag…",
          "link": "https://developers.redhat.com/articles/2024/06/06/enhance-kubernetes-deployment-efficiency-argo-cd-and-applicationset",
          "publishedOn": "2024-06-06T07:00:00.000Z",
          "wordCount": 4175,
          "title": "Enhance Kubernetes deployment efficiency with Argo CD and ApplicationSet",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/ST_argocd_2xpng.png?itok=lh9rIudN"
        },
        {
          "id": "a7bd3f0f-f8f9-4b69-a4e7-b575cbcd0921",
          "author": "Tom Bentley",
          "description": "Over the past decade Apache Kafka has become a commonly deployed piece of data infrastructure. It is considered by many to be the de facto standard for low latency, high throughput, scale out message processing, and data streaming. Kafka is also a data store and therefore subject to many of the same security and compliance obligations as databases, such as encryption at rest.\nEncrypting Kafka data at rest \nApache Kafka does not provide a facility for encrypting sensitive data at rest. Infrastructure providers usually compensate for this by deploying file system or volume encryption. However, encrypting at this level has drawbacks. First, operations personnel and services with file system permissions may view data content. Secondly, file system and volume encryption is not differentiated wi…",
          "link": "https://developers.redhat.com/articles/2024/06/05/encryption-rest-apache-kafka",
          "publishedOn": "2024-06-05T07:00:00.000Z",
          "wordCount": null,
          "title": "Encryption at rest for Apache Kafka",
          "imageUrl": null
        },
        {
          "id": "660179fe-5725-4644-a799-c3783fcc6225",
          "author": "Alberto Filice",
          "description": "This tutorial is designed for developers and who are managing cloud-native applications on Red Hat OpenShift. If you're looking to enhance data availability and resilience across multiple clusters, this guide will walk you through the process of setting up S3-compatible multi-cluster replication using OpenShift Data Foundation's NooBaa. By following these steps, you'll be able to ensure data is replicated across clusters, improving redundancy and fault tolerance in your infrastructure.\nRed Hat OpenShift Data Foundation is a comprehensive storage solution that integrates with OpenShift to provide persistent storage for containerized applications. It supports a variety of storage types, including block, file, and object storage, and is designed to be highly scalable and resilient. OpenShift …",
          "link": "https://developers.redhat.com/articles/2024/06/05/multicluster-replication-red-hat-openshift-data-foundation-s3",
          "publishedOn": "2024-06-05T07:00:00.000Z",
          "wordCount": null,
          "title": "Multicluster replication in Red Hat OpenShift Data Foundation S3",
          "imageUrl": null
        },
        {
          "id": "1d7b25df-8a39-4351-bb45-47d9f9dbb91b",
          "author": "Kevin Buettner",
          "description": "When debugging a program using the GNU Project Debugger (GDB), printing the value of errno should be easy, but sometimes it isn't. This article explains why printing errno might not work and what to do when it doesn't.\nThis article will focus on systems with runtime environments which use the GNU C Library (glibc) as the C library; printing errno on other modern multi-threaded systems which use a different C library implementation should be similar, though some of the details for accessing errno (when it doesn't just work) might be different. This article with be most applicable to GNU/Linux systems running either the Red Hat Enterprise Linux (RHEL) or Fedora distributions. Much of the article should be applicable to other popular Linux distributions too, but be aware that package names ma…",
          "link": "https://developers.redhat.com/articles/2024/06/05/why-your-errno-value-isnt-printing-gdb-and-what-do-about-it",
          "publishedOn": "2024-06-05T07:00:00.000Z",
          "wordCount": null,
          "title": "Why your errno value isn't printing in GDB—and what to do about it",
          "imageUrl": null
        },
        {
          "id": "51e55c52-4926-439d-bb73-cefd398926b5",
          "author": "Markus Eisele",
          "description": "The landscape of software development is constantly evolving. The Cloud Native Computing Foundation (CNCF), a non-profit organization fostering open source technologies, plays a crucial role in this evolution. The CNCF acts as a hub, bringing together developers and companies to create and refine technologies specifically designed for building and running applications in the cloud. These \"cloud-native\" technologies emphasize scalability, resilience, and agility–essential qualities for modern software that needs to adapt to ever-changing demands.\nHowever, the very features that make cloud-native development powerful also introduce layers of complexity. As software development teams leverage a growing ecosystem of services, APIs, and tools, developers can find themselves overwhelmed. Jugglin…",
          "link": "https://developers.redhat.com/articles/2024/06/03/backstage-cncf-project",
          "publishedOn": "2024-06-03T07:00:00.000Z",
          "wordCount": 4693,
          "title": "Unveiling Backstage: A developer's guide to the CNCF project",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/Red%20Hat%20Developer%20Hub_3.png?itok=rR4ZcgN6"
        },
        {
          "id": "9cc090d8-704b-4940-aa3c-0a4e5a30dedd",
          "author": "Austin Cunningham",
          "description": "I was interested in doing some load testing against Red Hat 3scale API Management. After a bit of digging around, I discovered perftest-toolkit, an open source load testing toolkit.\nFigure 1 depicts an infrastructure diagram from the perftest-toolkit repository.\n\n\n\n  \n        \n\n\n\n  \n\nFigure 1: Infrastructure diagram showing how the the load testing tooling relates to 3scale API Management and OpenShift.\n\nAt first look I was unsure what this gave me or what it required. But after playing around with it for a while, I eventually figured it out along with a few pain points.\nWhat do we need?\nPrerequisites:\n\nA Red Hat OpenShift Kubernetes cluster.\nAn instance of 3scale API Management on this cluster.\nAn Amazon Elastic Compute Cloud (EC2) instance that can connect a route on your cluster, and al…",
          "link": "https://developers.redhat.com/articles/2024/06/03/load-testing-3scale-api-management-hyperfoil-and-ansible",
          "publishedOn": "2024-06-03T07:00:00.000Z",
          "wordCount": 4709,
          "title": "Load testing 3scale API Management with Hyperfoil and Ansible",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/SP_3scale_api_1x%20%282%29.png?itok=2xlqSTOU"
        },
        {
          "id": "00c73331-0dfc-460c-8020-a23d38867975",
          "author": "asherman@redhat.com",
          "description": "Managing environments efficiently has become a significant challenge for DevOps engineers, platform engineers, and developers. The concept of Environment as a Service (EaaS) promises agility and scalability but is often challenged with the complexities of provisioning, de-provisioning, applying consistent configurations across namespaces, and managing Day 2 operations. Some of the challenges include ensuring isolation between teams, managing access controls and automating the environment life cycles to support CI/CD (continuous integration/continuous deployment). As organizations strive to streamline these processes, the need for a product that can offer simple, efficient, flexible and expandable solutions is very important. \nIn this article, we will explore how the Multi Tenant Operator b…",
          "link": "https://developers.redhat.com/articles/2024/05/31/simplify-tenant-service-multi-tenant-operator",
          "publishedOn": "2024-05-31T07:00:00.000Z",
          "wordCount": null,
          "title": "Simplify Tenant as a Service with the Multi Tenant Operator",
          "imageUrl": null
        },
        {
          "id": "66991237-1821-4b2c-bf71-14788227dcdf",
          "author": "Russell Zaleski",
          "description": "Red Hat OpenShift Service on AWS (ROSA) is a turn-key and performant solution to run managed Red Hat OpenShift on Amazon Web Services (AWS). It lets users to focus more on their applications and less on the infrastructure or platform it runs on, helping drive developer innovation. \nEnsuring that OpenShift is performant and scalable is a core tenant of the OpenShift Performance and Scale team at Red Hat. Prior to its release (and still to this day), ROSA undergoes a vast array of performance and scale testing to ensure that it delivers industry leading performance. These tests run the gamut from control plane and data path focus, to upgrades, to network performance. These tests have been used to help measure and better the performance of “classic” ROSA, but what happens when we move to host…",
          "link": "https://developers.redhat.com/articles/2024/05/30/ensure-scalable-and-performant-environment-rosa-hosted-control-planes",
          "publishedOn": "2024-05-30T07:00:00.000Z",
          "wordCount": null,
          "title": "Ensure a scalable and performant environment for ROSA with hosted control planes",
          "imageUrl": null
        },
        {
          "id": "05ca9844-4e44-40f2-9528-e2bc24daff78",
          "author": "David Severiano",
          "description": "In my previous articles, I explained how to implement a canary deployment strategy with OpenShift Service Mesh and another article with Argo Rollouts. In this article, we will walk through the same example, this time using both technologies: Red Hat OpenShift Service Mesh and Argo Rollouts.\nArgo Rollouts is a Kubernetes controller and set of CRDs that provide advanced deployment capabilities such as blue/green, canary, canary analysis, experimentation, and progressive delivery features to Kubernetes. In this demo, we are going to use canary capabilities. \nYou can also check this other article for a blue/green deployment strategy with Argo Rollouts.\nIn the next sections, we will see a real example of how to install, deploy, and manage the life cycle of cloud-native applications doing canary…",
          "link": "https://developers.redhat.com/articles/2024/05/28/canary-deployment-strategy-argo-rollouts-and-openshift-service-mesh",
          "publishedOn": "2024-05-28T07:00:00.000Z",
          "wordCount": null,
          "title": "Canary deployment strategy with Argo Rollouts and OpenShift Service Mesh",
          "imageUrl": null
        },
        {
          "id": "76116a09-d358-4b72-a338-0e642225226f",
          "author": "Francisco De Melo Junior",
          "description": "This article is a quick introduction to Red Hat's Shenandoah, a high-performance low-pause-time garbage collector. It covers Shenandoah's basic features, use cases, garbage collection (GC) logging, and basic troubleshooting.\nThis post is meant to be a straightforward overview. For a deeper dive, I recommend going straight to the upstream documentation page. The upstream email list is shenandoah-dev@openjdk.org.\nAbout Shenandoah GC\nHere is a very quick summary of Shenandoah's key characteristics:\n\nConcurrent: This means the application runs together with the garbage collection.\nLocation-based GC: Forwarding pointers enable Shenandoah to collect each region independently without remembered sets.\nNot generational-based: This means the log does not have Young, Tenure, or Old divisions; Therefo…",
          "link": "https://developers.redhat.com/articles/2024/05/28/beginners-guide-shenandoah-garbage-collector",
          "publishedOn": "2024-05-28T07:00:00.000Z",
          "wordCount": null,
          "title": "A beginner's guide to the Shenandoah garbage collector",
          "imageUrl": null
        },
        {
          "id": "0e750f45-625d-460e-8591-9f922c1b562e",
          "author": "Bruno Meseguer",
          "description": "The interaction of AI/ML and edge computing occurs in a variety of businesses. For example, in the retail industry, customer behavior and patterns can be used to determine promotions. In a manufacturing facility, likewise, data inference can help improve processes where machines are failing, products are not up to standard, and so on. The basic premise is that you might collect data and then infer from it in order to make decisions based on it.\nIn the context of this retail use case example, a superstore company has branches spread across the country. Each branch decides the products it wants to sell and can customize an AI/ML intelligent app for customers to use.\nThis article presents a video demonstration illustrating an opinionated solution capable of automating a continuous cycle for r…",
          "link": "https://developers.redhat.com/articles/2024/05/24/implement-ai-driven-edge-core-data-pipelines",
          "publishedOn": "2024-05-24T07:00:00.000Z",
          "wordCount": null,
          "title": "Implement AI-driven edge to core data pipelines",
          "imageUrl": null
        },
        {
          "id": "d8d96b3f-e3b0-47e1-977f-c50b0810079b",
          "author": "Camilla Conte, Adel Zaalouk",
          "description": "Hosted control planes, available via the multi-cluster engine, has been generally available since Red Hat OpenShift 4.14. Hosted control planes reduce costs and improve productivity for organizations adopting a multi-cluster approach.\nOpenShift sandboxed containers, based on Kata Containers, and generally available since OpenShift 4.8, is a native Kubernetes CRI runtime that provides an additional layer of isolation for workloads through hardware virtualization.\nWhen used together, hosted control planes and OpenShift sandboxed containers offer several benefits, such as speed, separation of concerns, and the necessary hardening to run multi-tenant workloads with stringent security constraints. \nThis article provides a detailed guide on how to configure and run sandboxed workloads for OpenSh…",
          "link": "https://developers.redhat.com/articles/2024/05/24/run-openshift-sandboxed-containers-hosted-control-planes",
          "publishedOn": "2024-05-24T07:00:00.000Z",
          "wordCount": null,
          "title": "Run OpenShift sandboxed containers with hosted control planes",
          "imageUrl": null
        },
        {
          "id": "c724ccd6-3b6b-4679-8c6a-3541dd2bf6e7",
          "author": "Alan Cowles",
          "description": "Nobody likes to think about disasters. Surely that won’t happen to you. Often the mantra is to hope for the best and plan for the worst. In today’s IT world, downtime, no matter how small, can have a disastrous effect on a business’ ability to compete in the marketplace. \nWhat is disaster recovery?\nThere are many options to consider when it comes to the concepts of business continuity and disaster recovery. Primarily we find ourselves concerned with two major metrics: the recovery point objective (RPO) and the recovery time objective (RTO). \nThe RPO is what amount of data is considered an acceptable loss in the event of a disaster. If you lose data due to an unforeseen event, and your last successful backup and restore point is three days old, is that an acceptable loss of data? \nThe RTO i…",
          "link": "https://developers.redhat.com/articles/2024/05/24/virtualization-vsphere-disaster-recovery",
          "publishedOn": "2024-05-23T07:00:00.000Z",
          "wordCount": null,
          "title": "OpenShift Virtualization for VMware vSphere admins: Disaster and site recovery",
          "imageUrl": null
        },
        {
          "id": "55dd06bd-950c-41d2-888a-fef10af36296",
          "author": "Gianluca Zuccarelli, Obinna Ezeakachi",
          "description": "Building images for cloud deployments or on-premises servers provides a number of challenges. These include reducing the attack surface, ensuring the images are hardened, and monitoring their compliance on an ongoing basis. We will explore how Red Hat Insights can achieve what no other service can by leveraging Red Hat’s open hybrid cloud strategy. You can use Red Hat Insights image builder to deploy pre-hardened images then monitor the systems with our compliance tool, compared to using custom-built testing frameworks leveraging tools such as AWS Security Hub.\nBuilding images\nInsights image builder makes the process of hardening images much simpler because it leverages OpenSCAP remediations at build time before the image has even been launched. This is desirable since some options, such a…",
          "link": "https://developers.redhat.com/articles/2024/05/23/testing-frameworks-images-built-insights-image-builder",
          "publishedOn": "2024-05-23T07:00:00.000Z",
          "wordCount": null,
          "title": "Testing frameworks for images built via Insights image builder",
          "imageUrl": null
        },
        {
          "id": "e8fa57ec-4e86-49e9-b732-e8ac2fd534f5",
          "author": "Pablo Castelo, Ignacio Lago",
          "description": "Red Hat's single sign-on tool has long been a trusted solution for securing web applications and providing centralized identity management. However, with the introduction of the Red Hat build of Keycloak, a next-generation option has emerged. This article will guide you through how to migrate from Red Hat's single sign-on to Red Hat build of Keycloak, highlighting the benefits and considerations involved in this strategic move.\nWe'll delve into the key advantages of Red Hat build of Keycloak, such as its cloud-native architecture, enhanced performance, and streamlined configuration. Additionally, we'll provide a step-by-step approach to the migration process, ensuring a smooth transition with minimal disruption to your existing infrastructure. Whether you're seeking improved scalability, c…",
          "link": "https://developers.redhat.com/articles/2024/04/23/migrate-sso-red-hat-build-keycloak",
          "publishedOn": "2024-05-23T07:00:00.000Z",
          "wordCount": null,
          "title": "How to install and migrate to Red Hat build of Keycloak",
          "imageUrl": null
        },
        {
          "id": "5ddfc0f2-1d39-4049-975f-c17b04bdd828",
          "author": "Michael Dawson",
          "description": "This is part three in our series on running Node.js applications on the edge with Red Hat Enterprise Linux (RHEL)/Fedora, which includes: \n\nRunning Node.js applications on the edge with RHEL/Fedora\nContainerizing your Node.js applications at the edge on RHEL/Fedora\nAdvanced container management at the edge for Node.js applications (this post)  \n\nIn the first part, we introduced you to the hardware and software for our Node.js-based edge example as well as some of the details on laying the foundation for deploying the application by building and installing the operating system using Fedora IoT.\nIn the second part we dug a bit deeper into the application itself, and how to build, bundle, deploy, and update the Node.js application using Podman and containers.\nIn this third and final part, we'…",
          "link": "https://developers.redhat.com/articles/2024/05/22/advanced-container-management-edge-nodejs-apps",
          "publishedOn": "2024-05-22T07:00:00.000Z",
          "wordCount": 6163,
          "title": "Advanced container management at the edge for Node.js apps",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/nodejs-reference-architecture_2x.png?itok=rToXkOcY"
        },
        {
          "id": "57067f3e-06d2-47e8-ad3f-71028d587598",
          "author": "Luis Falero Otiniano",
          "description": "This article explores how to integrate SOAP and REST services using Quarkus and Apache Camel. Through practical examples, we will learn how to create a Quarkus project, configure and consume SOAP services, and expose RESTful endpoints. Additionally, we will see how to manage JSON data serialization and deserialization using Camel Quarkus.\nQuarkus project creation\nFor project configuration, it is required to create the application named code-with-quarkus-camel-soap, which will be using Quarkus 3.2 with Apache Camel version 4.0.\n\n\nReview the compatibility matrix.\nThere are two options to carry out this configuration, detailed below.\n\n\nCreation through the web interface\nAccess the link https://code.quarkus.redhat.com and fill in the required information as shown in Figure 1. Then, click the G…",
          "link": "https://developers.redhat.com/articles/2024/05/22/configure-soap-web-services-apache-camel-quarkus",
          "publishedOn": "2024-05-22T07:00:00.000Z",
          "wordCount": 3800,
          "title": "Configure SOAP web services with Apache Camel on Quarkus",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/blog/2021/05/camel_quarkus.png?itok=r6IekvEe"
        },
        {
          "id": "df098c45-b3b3-4179-9e8a-3392e93fb731",
          "author": "Maarten Vandeperre",
          "description": "There's no question that artificial intelligence (AI) is the talk of the town these days, overshadowing almost everything else in the world of technology. In this series of articles, we'll explore the road toward AI (Figure 1 ) and how your organization can smoothly transition toward incorporating AI into its platforms and applications. \nClean architecture isn't the only topic I cover, you know! So, welcome aboard as we steer our focus toward artificial intelligence and machine learning (for now, at least, as these principles will map on the domain of AI/ML as well). \n\n\n  \n      \n        \n  \n\n\n  \n\nFigure 1: A visualization of a technical road / learning path toward AI. Created by Maarten Vandeperre. License under Apache 2.0.\n\nDon't worry if AI is still a bit of a mystery to you—we'll start…",
          "link": "https://developers.redhat.com/articles/2024/05/22/ai-fundamentals",
          "publishedOn": "2024-05-22T07:00:00.000Z",
          "wordCount": 5197,
          "title": "The road toward AI: Fundamentals",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/AI-ML%20%281%29.png?itok=QPfkfRfC"
        },
        {
          "id": "ed9656d0-43bb-416f-b522-3f0b1e344f38",
          "author": "Robert Toyonaga",
          "description": "Initial support for native memory tracking (NMT) has recently been added as a feature to GraalVM Native Image. It is currently available in early access builds and will be available in the future GraalVM for JDK 23 release. The addition of NMT will allow users of Native Image to better understand how their applications are using off-heap memory. \nBackground\nThe terminology “native memory” is sometimes used interchangeably with “off-heap memory” or “unmanaged memory.” When a Java application is run on the JVM, \"native memory\" refers to any memory not allocated on the Java heap. Since the the JVM is implemented in C++, this includes the memory that the JVM uses under the hood for its internal operations as well as memory requested with Unsafe#allocateMemory(long), or from external libraries.…",
          "link": "https://developers.redhat.com/articles/2024/05/21/native-memory-tracking-graalvm-native-image",
          "publishedOn": "2024-05-21T07:00:00.000Z",
          "wordCount": null,
          "title": "Native memory tracking in GraalVM Native Image",
          "imageUrl": null
        },
        {
          "id": "4922761c-f16d-4c24-b321-34af7cda0a73",
          "author": "Sandipan Roy",
          "description": "As software becomes increasingly integrated into our daily lives, the importance of secure coding and programming safety cannot be overstated. From online banking to healthcare records, sensitive information is being transmitted and stored in software systems, making them prime targets for cyber attacks. As a result, it's crucial for developers to understand and implement best practices for secure coding to ensure the safety and privacy of user data. In this article, we explore the various techniques and strategies that can be used to make software more secure and resilient to attacks.\nProgramming safety\nProgramming safety is multidimensional and subjective. We consider four types of programming safety: memory safety, null safety, type safety, and thread safety.\nMemory safety\nA service pro…",
          "link": "https://developers.redhat.com/articles/2024/05/21/improve-basic-programming-safety-rust-lang",
          "publishedOn": "2024-05-21T07:00:00.000Z",
          "wordCount": null,
          "title": "Improve basic programming safety with Rust lang",
          "imageUrl": null
        },
        {
          "id": "11adf510-3ef9-4090-9b93-5e930f22613e",
          "author": "Frank Eigler",
          "description": "This article explores how you can leverage application binary interface (ABI) compatibility testing with libabigail to determine the functionality of binaries running on older distributions or versions.\nSoftware evolution and compatibility\nLinux distributions are a living thing. During their lifetime, they are born at release, receive updates, and eventually \"die\" when support ends. They spawn descendant distributions. They sometimes even fight! The whole point of the distribution is to make an interdependent, cohesive whole, so there are many shared components. When those shared components are changed within a distribution, the question of compatibility is imminent.\nApplication binary interface (ABI) compatibility is a specific type of dependency: between separately compiled binaries and …",
          "link": "https://developers.redhat.com/articles/2024/05/20/application-binary-interface-compatibility-testing-libabigail",
          "publishedOn": "2024-05-20T07:00:00.000Z",
          "wordCount": null,
          "title": "Application binary interface compatibility testing with libabigail",
          "imageUrl": null
        },
        {
          "id": "1d5f945e-262d-44f1-b8da-7c6d91e561ce",
          "author": "Jerome Marc",
          "description": "Red Hat Insights is a Software-as-a-Service offering that enables users to obtain actionable intelligence regarding their Red Hat Enterprise Linux environments, helping to identify and address operational and vulnerability risks before an issue occurs. Red Hat Insights requires a client tool to run on the system to collect data and perform necessary analytics to proactively detect misconfiguration and alert system administrators. This article explores how one can leverage the client’s existing functionality to run its own automation using a simple shell script.\nIn its default configuration, Insights client runs daily on each registered Red Hat Enterprise Linux (RHEL) system. For RHEL 7.5 and above, the execution is triggered by a scheduled systemd daemon. The insights-client configuration …",
          "link": "https://developers.redhat.com/articles/2024/05/20/extend-red-hat-insights-client-execute-custom-automation",
          "publishedOn": "2024-05-20T07:00:00.000Z",
          "wordCount": null,
          "title": "Extend Red Hat Insights client to execute custom automation",
          "imageUrl": null
        },
        {
          "id": "f3f4031d-3e05-42c1-b6ad-49b83fee322f",
          "author": "Alan Cowles",
          "description": "For the second entry in our series introducing Red Hat OpenShift Virtualization to VMware vSphere administrators, we are going to discuss storage. In our previous article, we compared OpenShift Virtualization network configurations to how networks are often laid out in most general deployments of VMware vSphere. With this article, we will focus on how a containerized virtualization solution presents an entirely new storage paradigm when compared to what traditional virtualization administrators are used to. \nThe traditional view of hypervisor storage\nIn traditional hypervisor storage paradigms, the anchorpoint is the shared datastore. A datastore is a single large volume presented to our hypervisor as either a block storage device (LUN) through a SAN protocol (iSCSI, FCP, FC-NVMe), or a re…",
          "link": "https://developers.redhat.com/articles/2024/05/20/openshift-virtualization-vsphere-admins-change-traditional-storage-paradigm",
          "publishedOn": "2024-05-20T07:00:00.000Z",
          "wordCount": null,
          "title": "OpenShift Virtualization for vSphere admins: A change in the traditional storage paradigm",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "edykim.com 블로그 RSS 피드: undefined",
      "feedUrl": "https://edykim.com/ko/feed.xml",
      "siteUrl": "https://edykim.com/",
      "articles": []
    },
    {
      "title": "Eli Bendersky's website",
      "feedUrl": "https://eli.thegreenplace.net/feeds/all.atom.xml",
      "siteUrl": "https://eli.thegreenplace.net/",
      "articles": [
        {
          "id": "https://eli.thegreenplace.net/2024/reading-google-sheets-from-a-go-program/",
          "author": null,
          "description": "<p>I recently needed to process some data from a Google Sheet in a Go program, and\nwas looking for the most straightforward way to do so on my local machine. Using\n<tt class=\"docutils literal\">gcloud</tt>'s ADC didn't work for me because it typically doesn't have access to\nsheets or docs.</p>\n<p>The simplest …</p>",
          "link": "https://eli.thegreenplace.net/2024/reading-google-sheets-from-a-go-program/",
          "publishedOn": "2024-06-01T01:07:00.000Z",
          "wordCount": null,
          "title": "Reading Google Sheets from a Go program",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Embedded Artistry",
      "feedUrl": "https://embeddedartistry.com/feed/",
      "siteUrl": "https://embeddedartistry.com/",
      "articles": []
    },
    {
      "title": "Embedded.com",
      "feedUrl": "https://www.embedded.com/feed/",
      "siteUrl": "https://www.embedded.com/",
      "articles": [
        {
          "id": "https://www.embedded.com/?p=4482500",
          "author": "Qualcomm",
          "description": "In a discussion on Qualcomm Technologies’ IoT strategy in Europe, Enrico Salvatori, SVP & President of Qualcomm Europe, highlighted the introduction of innovative product offerings...\nThe post IoT Innovations: Qualcomm debuts new technologies at Embedded World 2024 appeared first on Embedded.com.",
          "link": "https://www.embedded.com/iot-innovations-qualcomm-debuts-new-technologies-at-embedded-world-2024/",
          "publishedOn": "2024-06-12T19:08:56.000Z",
          "wordCount": null,
          "title": "IoT Innovations: Qualcomm debuts new technologies at Embedded World 2024",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482495",
          "author": "Jacob Beningo",
          "description": "As AI becomes more intelligent, it can code faster than developers. That puts developers in a quandary; we love to write code, but if AI...\nThe post Can AI and developers work in harmony? appeared first on Embedded.com.",
          "link": "https://www.embedded.com/can-ai-and-developers-work-in-harmony/",
          "publishedOn": "2024-06-12T10:27:10.000Z",
          "wordCount": null,
          "title": "Can AI and developers work in harmony?",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482488",
          "author": "John Eble",
          "description": "Access to sufficient memory bandwidth will be crucial for engineers and system designers as companies invest further in data centers to meet demand. This article looks at the advances in DDR5 memory that help meet this demand.\nThe post Advancing memory performance with DDR5 appeared first on Embedded.com.",
          "link": "https://www.embedded.com/advancing-memory-performance-with-ddr5/",
          "publishedOn": "2024-06-11T17:44:41.000Z",
          "wordCount": null,
          "title": "Advancing memory performance with DDR5",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482483",
          "author": "Bill Lamie",
          "description": "RTOS functional safety certification benefits not only safety-critical devices but all embedded devices as a means to improve time-to-market, improve product quality, and reduce product...\nThe post How developers can leverage RTOS functional safety certification appeared first on Embedded.com.",
          "link": "https://www.embedded.com/how-developers-can-leverage-rtos-functional-safety-certification/",
          "publishedOn": "2024-06-11T12:41:47.000Z",
          "wordCount": null,
          "title": "How developers can leverage RTOS functional safety certification",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482477",
          "author": "Christian Cruz and Marvin Neil Cabueñas",
          "description": "In a smart battery backup unit, the microcontroller’s software is responsible for guaranteeing the smooth functioning of processes, hence ensuring the unit’s high efficiency and...\nThe post Microcontroller operations in an OCP ORV3 smart battery backup unit appeared first on Embedded.com.",
          "link": "https://www.embedded.com/microcontroller-operations-in-an-ocp-orv3-smart-battery-backup-unit/",
          "publishedOn": "2024-06-10T18:59:21.000Z",
          "wordCount": null,
          "title": "Microcontroller operations in an OCP ORV3 smart battery backup unit",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482473",
          "author": "Nitin Dahad",
          "description": "Get a taste of the happenings at Computex 2024 in Taiwan covered through my daily video roundups at the show – summarized here.\nThe post Computex 2024: a video roundup from Taiwan appeared first on Embedded.com.",
          "link": "https://www.embedded.com/computex-2024-a-video-roundup-from-taiwan/",
          "publishedOn": "2024-06-10T18:52:12.000Z",
          "wordCount": null,
          "title": "Computex 2024: a video roundup from Taiwan",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482457",
          "author": "Nitin Dahad",
          "description": "A look at the announcements in the keynotes at Computex 2024 in Taiwan from Nvidia, AMD, Intel and Qualcomm Technologies.\nThe post Computex 2024 keynotes focus on data centers and AI PCs appeared first on Embedded.com.",
          "link": "https://www.embedded.com/computex-2024-keynotes-focus-on-data-centers-and-ai-pcs/",
          "publishedOn": "2024-06-10T17:33:51.000Z",
          "wordCount": null,
          "title": "Computex 2024 keynotes focus on data centers and AI PCs",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482448",
          "author": "Nitin Dahad",
          "description": "Seamless integration of in-memory computing into existing chip designs is a game-changer, particularly for AI applications, says Hermann Hauser.\nThe post Synthara gets $11m to bring in-memory computing to embedded AI appeared first on Embedded.com.",
          "link": "https://www.embedded.com/synthara-gets-11m-to-bring-in-memory-computing-to-embedded-ai/",
          "publishedOn": "2024-06-10T11:26:13.000Z",
          "wordCount": null,
          "title": "Synthara gets $11m to bring in-memory computing to embedded AI",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482444",
          "author": "Nitin Dahad",
          "description": "Arm Neoverse CSS-based CPU chiplet  delivers features ultra-high-speed interfaces and advanced packaging to help deliver scalable performance for AI, HPC and networking infrastructure.\nThe post Alphawave Semi develops Arm-based compute chiplet appeared first on Embedded.com.",
          "link": "https://www.embedded.com/alphawave-semi-develops-arm-based-compute-chiplet/",
          "publishedOn": "2024-06-09T10:25:49.000Z",
          "wordCount": null,
          "title": "Alphawave Semi develops Arm-based compute chiplet",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482438",
          "author": "Jacob Beningo",
          "description": "Poorly written ISRs can result in systems with race conditions, poor responsiveness, and even excessive CPU use. Nearly every embedded system uses interrupt service routines...\nThe post 5 best practices for writing interrupt service routines appeared first on Embedded.com.",
          "link": "https://www.embedded.com/5-best-practices-for-writing-interrupt-service-routines/",
          "publishedOn": "2024-06-05T11:40:32.000Z",
          "wordCount": null,
          "title": "5 best practices for writing interrupt service routines",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482434",
          "author": "Jason Oberg",
          "description": "The security of AI chips must be ironclad so models behave as expected and end users are protected from harm. Semiconductors in AI have been...\nThe post Why hardware security underlies AI progress appeared first on Embedded.com.",
          "link": "https://www.embedded.com/why-hardware-security-underlies-ai-progress/",
          "publishedOn": "2024-06-04T18:54:21.000Z",
          "wordCount": null,
          "title": "Why hardware security underlies AI progress",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482430",
          "author": "Krizelle Paulene Apostol, Jamila Macagba, and Maggie Maralit",
          "description": "This article will give an overview on how to use and integrate ROS drivers in applications, products, and systems, enabling faster technology evaluation and avoiding...\nThe post Applying robot operating system drivers for motor controllers appeared first on Embedded.com.",
          "link": "https://www.embedded.com/applying-robot-operating-system-drivers-for-motor-controllers/",
          "publishedOn": "2024-06-04T14:26:44.000Z",
          "wordCount": null,
          "title": "Applying robot operating system drivers for motor controllers",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482404",
          "author": "Jim Olsen",
          "description": "There is a menu of options and technologies available to provide timing services in GNSS/GPS-denied environments for extended periods of wide-area outages. Critical infrastructure and...\nThe post Timing alternatives for critical applications in GNSS-denied environments appeared first on Embedded.com.",
          "link": "https://www.embedded.com/timing-alternatives-for-critical-applications-in-gnss-denied-environments/",
          "publishedOn": "2024-05-29T13:31:52.000Z",
          "wordCount": null,
          "title": "Timing alternatives for critical applications in GNSS-denied environments",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482399",
          "author": "Jacob Beningo",
          "description": "Vendor-supplied IDEs will generate makefiles for you, but if you want to leverage modern development practices, you need a tool that can help simplify your...\nThe post 3 tips for using CMake with embedded software appeared first on Embedded.com.",
          "link": "https://www.embedded.com/3-tips-for-using-cmake-with-embedded-software/",
          "publishedOn": "2024-05-29T12:39:10.000Z",
          "wordCount": null,
          "title": "3 tips for using CMake with embedded software",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482396",
          "author": "Gilad David Maayan",
          "description": "Almost all Internet of Medical Things (IoMT) devices are subject to some government regulation and require a compliance effort by manufacturers. The Internet of Medical...\nThe post A 13-step compliance checklist for IoMT regulations appeared first on Embedded.com.",
          "link": "https://www.embedded.com/a-13-step-compliance-checklist-for-iomt-regulations/",
          "publishedOn": "2024-05-29T12:10:16.000Z",
          "wordCount": null,
          "title": "A 13-step compliance checklist for IoMT regulations",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482387",
          "author": "Nitin Dahad",
          "description": "The European Parliament approved the CRA in March 2024, which means companies will now need to step up their preparations or be prepared to pay fines for non-compliance.\nThe post Podcast: a look at the implications of the Cyber Resilience Act (CRA) appeared first on Embedded.com.",
          "link": "https://www.embedded.com/podcast-a-look-at-the-implications-of-the-cyber-resilience-act-cra/",
          "publishedOn": "2024-05-24T16:11:48.000Z",
          "wordCount": null,
          "title": "Podcast: a look at the implications of the Cyber Resilience Act (CRA)",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482382",
          "author": "Nitin Dahad",
          "description": "Infineon Technologies has launched a high-performance NFC I2C bridge tag for single-tap authentication and secured configuration of IoT devices. \nThe post NFC I2C bridge tag enables secure contactless IoT device authentication appeared first on Embedded.com.",
          "link": "https://www.embedded.com/nfc-i2c-bridge-tag-enables-secure-contactless-iot-device-authentication/",
          "publishedOn": "2024-05-24T15:07:50.000Z",
          "wordCount": null,
          "title": "NFC I2C bridge tag enables secure contactless IoT device authentication",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482377",
          "author": "Nitin Dahad",
          "description": "Nodar said its solution is able to combine different independently mounted stereo pairs of cameras around the vehicle to generate high-resolution 3D point clouds.\nThe post Automated parking replaces ultrasonic with vision cameras appeared first on Embedded.com.",
          "link": "https://www.embedded.com/automated-parking-replaces-ultrasonic-with-vision-cameras/",
          "publishedOn": "2024-05-24T14:40:17.000Z",
          "wordCount": null,
          "title": "Automated parking replaces ultrasonic with vision cameras",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482371",
          "author": "Jacob Beningo",
          "description": "There are few topics other than politics and religion that can get an engineering team fired up than trying to decide where to put the...\nThe post Where should you put the { ? appeared first on Embedded.com.",
          "link": "https://www.embedded.com/where-should-you-put-the/",
          "publishedOn": "2024-05-21T12:54:10.000Z",
          "wordCount": null,
          "title": "Where should you put the { ?",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482367",
          "author": "Dennis Kelly",
          "description": "Law enforcement agencies are increasingly turning to cutting-edge connectivity and IoT solutions to improve operational efficiencies, increase transparency and safety, and enhance collaboration. Under mounting...\nThe post How IoT serves public safety and security services appeared first on Embedded.com.",
          "link": "https://www.embedded.com/how-iot-serves-public-safety-and-security-services/",
          "publishedOn": "2024-05-21T12:23:49.000Z",
          "wordCount": null,
          "title": "How IoT serves public safety and security services",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4482361",
          "author": "Christian Cruz, Gary Sapia, and Marvin Neil Cabueñas",
          "description": "This article outlines the system requirements for the Open Compute Project (OCP) Open Rack V3 (ORV3) battery backup unit. This article outlines the system requirements...\nThe post Design of a OCP ORV3 smart battery backup unit appeared first on Embedded.com.",
          "link": "https://www.embedded.com/design-of-a-ocp-orv3-smart-battery-backup-unit/",
          "publishedOn": "2024-05-20T19:13:29.000Z",
          "wordCount": null,
          "title": "Design of a OCP ORV3 smart battery backup unit",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "EmbeddedRelated.com Blogs",
      "feedUrl": "https://www.embeddedrelated.com/blogs_rss.php",
      "siteUrl": "https://www.embeddedrelated.com/blogs.php",
      "articles": [
        {
          "id": "https://www.embeddedrelated.com/showarticle/1669.php",
          "author": null,
          "description": "Introduction\r\nIn a previous blog post (https://embeddedrelated.com/showarticle/1630.php), we learned how we can configure our nRF52840 development kit (https://www.nordicsemi.com/Products/Development-ha...) as a Bluetooth Low Energy (BLE) device using The Zephyr Project. Similarly, we learned how to advertise standard and custom capabilities. \r\n\r\nIn this blog post, we will take...",
          "link": "https://www.embeddedrelated.com/showarticle/1669.php",
          "publishedOn": "2024-06-11T13:16:51.000Z",
          "wordCount": null,
          "title": "ANCS and HID: Controlling Your iPhone From Zephyr",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1653.php",
          "author": null,
          "description": "At least, probably not as often as you think you do. Using a preemptive RTOS can help make a system schedulable (i.e. help all of its tasks meet their deadlines) but it comes at a cost: \"concurrently\" running tasks can interact in unforeseen ways that cause system failures, that dreaded class of errors known as \"race conditions\". In part, this is because humans have difficulty thinking...",
          "link": "https://www.embeddedrelated.com/showarticle/1653.php",
          "publishedOn": "2024-06-03T17:05:04.000Z",
          "wordCount": null,
          "title": "You Don't Need an RTOS (Part 3)",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1668.php",
          "author": null,
          "description": "Previously in this EmbeddedRelated article,\r\n we saw how to\r\nfind an I2C device connected to your board using the i2ctool that is very familiar for people with previous experience with embedded Linux. \r\nToday we will see how to add support to an I2C device (i.e. BMP280 sensor) in your board. So, lets to get started!\r\nNuttX uses a very simple approach to interface with devices connected to the...",
          "link": "https://www.embeddedrelated.com/showarticle/1668.php",
          "publishedOn": "2024-05-28T22:30:04.000Z",
          "wordCount": null,
          "title": "How to use I2C devices in (Apache) NuttX: Adding support for an I2C device in your board",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1666.php",
          "author": null,
          "description": "There is a good, albeit rather general, rule that applies to the management of a successful business: focus on what you do well, then do it better than everyone else. There are numerous examples of how companies have been very successful by following this approach.\nBut the world of embedded software is commonly an exception …\nTo start with, I can cite some examples of good practice:\nHave...",
          "link": "https://www.embeddedrelated.com/showarticle/1666.php",
          "publishedOn": "2024-05-27T07:35:20.000Z",
          "wordCount": null,
          "title": "Core competencies",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1665.php",
          "author": null,
          "description": "Welcome to the fourth part of my two-part article on state machines (1). This post topic has been suggested by\r\n\tMiro Samek, who, in a comment to my first post, wrote: \"The biggest issues are not so much with the state machine implementations [...]. Instead, the biggest issues are with the code surrounding state machines.\".\r\n\r\nIndeed Miro is right, many\r\nproblems come from outside state...",
          "link": "https://www.embeddedrelated.com/showarticle/1665.php",
          "publishedOn": "2024-05-22T12:48:33.000Z",
          "wordCount": null,
          "title": "FSM - Let 'em talk",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Evans Library",
      "feedUrl": "https://evan-moon.github.io/feed.xml",
      "siteUrl": "https://evan-moon.github.io",
      "articles": [
        {
          "id": "20240601-category-theory-for-programmers-10-natural-transformations",
          "author": null,
          "description": "필자는 지금까지 카테고리 사이의 구조를 보존하는 사상으로써의 펑터에 대해 이야기하였다. 펑터는 한 카테고리를 다른 카테고리에 포함(Embeds)한다. 이는 결국 펑터가 여러 대상을 하나로 합칠 수는 있지만, 절대 구조를 변형하지는 않는다는 것을 의미한다. 펑터에 대해 이해하는 방법 중 하나는 함자를 사용하여 하나의 카테고리를 다른 카테고리 내부에서 모델링해보는 것이다.",
          "link": "https://evan-moon.github.io/2024/06/01/category-theory-for-programmers-10-natural-transformations/",
          "publishedOn": "2024-06-01T01:21:26.000Z",
          "wordCount": null,
          "title": "[번역] 프로그래머를 위한 카테고리 이론 - 10. 자연 변환",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Better Embedded System SW",
      "feedUrl": "https://feeds.feedburner.com/BetterEmbeddedSystemSw",
      "siteUrl": "http://betterembsw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Google Developers Blog",
      "feedUrl": "https://feeds.feedburner.com/GDBcode",
      "siteUrl": "https://developers.googleblog.com/rss/",
      "articles": [
        {
          "id": "https://developers.googleblog.com/en/welcome-india-google-wallet-api/",
          "author": null,
          "description": "To all developers in India: Welcome to the Google Wallet API! Now you can create digital assets like boarding passes, event tickets, gift cards, loyalty cards, and more.",
          "link": "https://developers.googleblog.com/en/welcome-india-google-wallet-api/",
          "publishedOn": "2024-06-16T20:13:20.573Z",
          "wordCount": null,
          "title": "Welcome India to the Google Wallet API",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/everything-google-wallet-at-io-24/",
          "author": null,
          "description": "All the new features and enhancements Google Wallet announced at I/O this year, focused on security, wearables, push notifications, and more.",
          "link": "https://developers.googleblog.com/en/everything-google-wallet-at-io-24/",
          "publishedOn": "2024-06-16T20:13:20.573Z",
          "wordCount": null,
          "title": "Everything you need to know about Google Wallet",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/google-io-2024-recap-making-ai-accessible-and-helpful-for-every-developer/",
          "author": null,
          "description": "Thank you for joining us at this year's Google I/O. Check out all of the Google I/O announcements and updates with 150+ sessions and learning content available on demand.",
          "link": "https://developers.googleblog.com/en/google-io-2024-recap-making-ai-accessible-and-helpful-for-every-developer/",
          "publishedOn": "2024-06-15T20:13:56.419Z",
          "wordCount": null,
          "title": "Google I/O 2024 recap: Making AI accessible and helpful for every developer",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/ai-edge-torch-high-performance-inference-of-pytorch-models-on-mobile-devices/",
          "author": null,
          "description": "Released today, AI Edge Torch enables support for PyTorch, JAX, Keras, and TensorFlow with TFLite.",
          "link": "https://developers.googleblog.com/en/ai-edge-torch-high-performance-inference-of-pytorch-models-on-mobile-devices/",
          "publishedOn": "2024-06-15T20:13:56.419Z",
          "wordCount": null,
          "title": "AI Edge Torch: High Performance Inference of PyTorch Models on Mobile Devices",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/checks-now-available-to-all-developers/",
          "author": null,
          "description": "Checks identifies potential privacy issues, provides recommendations, monitors app compliance, and provides results in an intuitive dashboard or directly in your CI/CD.",
          "link": "https://developers.googleblog.com/en/checks-now-available-to-all-developers/",
          "publishedOn": "2024-06-15T20:13:56.419Z",
          "wordCount": null,
          "title": "The power of Checks is now available to all Android and iOS Developers",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/whats-new-in-firebase-io-24/",
          "author": null,
          "description": "Firebase, is evolving to enable you to rapidly build and run AI-powered experiences in your apps across platforms.",
          "link": "https://developers.googleblog.com/en/whats-new-in-firebase-io-24/",
          "publishedOn": "2024-06-15T20:13:56.419Z",
          "wordCount": null,
          "title": "What's new in Firebase at  I/O '24",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/build-for-tomorrow-in-the-gemini-api-developer-competition/",
          "author": null,
          "description": "Build a new app with the Gemini API or integrate our Gemini API into an existing application for a chance to win some really cool prizes.",
          "link": "https://developers.googleblog.com/en/build-for-tomorrow-in-the-gemini-api-developer-competition/",
          "publishedOn": "2024-06-15T20:13:56.419Z",
          "wordCount": null,
          "title": "Build for Tomorrow in the Gemini API Developer Competition",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/start-building-with-project-idx-today/",
          "author": null,
          "description": "We’ve removed the waitlist for Project IDX. Now, anyone can sign up to start building with AI-assistance, collaboration capabilities, and more.",
          "link": "https://developers.googleblog.com/en/start-building-with-project-idx-today/",
          "publishedOn": "2024-06-15T20:13:56.417Z",
          "wordCount": null,
          "title": "Start Building with Project IDX Today",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/how-firebase-genkit-helped-add-ai-to-our-compass-app/",
          "author": null,
          "description": "We used Firebase Genkit – Firebase’s open source framework for building powerful AI features into your apps with familiar patterns and paradigms – to add AI to an existing application.",
          "link": "https://developers.googleblog.com/en/how-firebase-genkit-helped-add-ai-to-our-compass-app/",
          "publishedOn": "2024-06-15T20:13:56.415Z",
          "wordCount": null,
          "title": "How Firebase Genkit helped add AI to our Compass app",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/google-ar-at-io-2024-new-geospatial-ar-features-and-more/",
          "author": null,
          "description": "We've been exploring new ways to create engaging, easy to use, and shareable experiences and connect your Geospatial AR creations with more users.",
          "link": "https://developers.googleblog.com/en/google-ar-at-io-2024-new-geospatial-ar-features-and-more/",
          "publishedOn": "2024-06-15T20:13:56.415Z",
          "wordCount": null,
          "title": "Google AR at I/O 2024: New Geospatial AR features and more",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/home-apis-enabling-all-developers-to-build-for-the-home/",
          "author": null,
          "description": "We've re-envisioned Google Home as a platform for all developers – not just those that build smart home devices – to create innovative experiences for the home.",
          "link": "https://developers.googleblog.com/en/home-apis-enabling-all-developers-to-build-for-the-home/",
          "publishedOn": "2024-06-15T20:13:56.415Z",
          "wordCount": null,
          "title": "Home APIs: Enabling all developers to build for the home",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/making-development-across-platforms-easier-for-developers/",
          "author": null,
          "description": "Do what works best for your business; whether you’re sharing both UI and business logic across multiple platforms with Flutter or development with Kotlin Multiplatform.",
          "link": "https://developers.googleblog.com/en/making-development-across-platforms-easier-for-developers/",
          "publishedOn": "2024-06-14T20:14:08.594Z",
          "wordCount": null,
          "title": "Making development across platforms easier for developers",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/gemma-family-and-toolkit-expansion-io-2024/",
          "author": null,
          "description": "The Gemma family expands further with the introduction of PaliGemma, and a sneak peek into the near future with the announcement of Gemma 2.",
          "link": "https://developers.googleblog.com/en/gemma-family-and-toolkit-expansion-io-2024/",
          "publishedOn": "2024-06-14T20:14:08.593Z",
          "wordCount": null,
          "title": "Introducing PaliGemma, Gemma 2, and an Upgraded Responsible AI Toolkit",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/how-its-made-gentype-alphabet-creator/",
          "author": null,
          "description": "One of our newest experiments in the series is GenTypeGenType. This tool uses generative AI to create an alphabet out of anything you want.",
          "link": "https://developers.googleblog.com/en/how-its-made-gentype-alphabet-creator/",
          "publishedOn": "2024-06-11T20:13:56.413Z",
          "wordCount": null,
          "title": "How it's Made: GenType Alphabet Creator",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/introducing-the-google-developer-program/",
          "author": null,
          "description": "The Google Developer Program gives developers access to a range of new tools and benefits,  to allow them to discover and explore all the Google sponsored communities we already offer.",
          "link": "https://developers.googleblog.com/en/introducing-the-google-developer-program/",
          "publishedOn": "2024-06-04T20:13:44.216Z",
          "wordCount": null,
          "title": "Introducing the Google Developer Program: Unlock New Opportunities",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/gemini-15-pro-and-15-flash-now-available/",
          "author": null,
          "description": "We’re incredibly excited to see what you build with these new models. Get started with Gemini 1.5 Flash and 1.5 Pro free of charge in Google AI Studio.",
          "link": "https://developers.googleblog.com/en/gemini-15-pro-and-15-flash-now-available/",
          "publishedOn": "2024-05-30T20:15:11.266Z",
          "wordCount": null,
          "title": "Gemini 1.5 Pro and 1.5 Flash GA, 1.5 Flash tuning support, higher rate limits, and more API updates",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/whats-new-in-google-pay-io-2024/",
          "author": null,
          "description": "We’re adding new features to Google Pay so you can offer richer and more accessible payment experiences for your customers, and improved APIs to simplify your payments integrations.",
          "link": "https://developers.googleblog.com/en/whats-new-in-google-pay-io-2024/",
          "publishedOn": "2024-05-29T20:14:29.081Z",
          "wordCount": null,
          "title": "What’s new in Google Pay at I/O 2024",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/ai-edge-torch-generative-api-for-custom-llms-on-device/",
          "author": null,
          "description": "AI Edge Torch Generative API enables developers to bring powerful new capabilities on-device, such as summarization, content generation, and more.",
          "link": "https://developers.googleblog.com/en/ai-edge-torch-generative-api-for-custom-llms-on-device/",
          "publishedOn": "2024-05-29T20:14:29.078Z",
          "wordCount": null,
          "title": "AI Edge Torch Generative API for Custom LLMs on Device",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/google-kotlinconf-2024-a-look-inside-multiplatform-development-with-kmp-and-more/",
          "author": null,
          "description": "Following our recent Google I/O announcement recommending Kotlin Multiplatform (KMP) for sharing business logic across mobile, web, server, and desktop platforms, and our move to use KMP in Google Workspace, KotlinConf 2024 was the next moment to share the highlights and connect with the Kotlin community.",
          "link": "https://developers.googleblog.com/en/google-kotlinconf-2024-a-look-inside-multiplatform-development-with-kmp-and-more/",
          "publishedOn": "2024-05-24T20:13:52.290Z",
          "wordCount": null,
          "title": "Google @ KotlinConf 2024: A Look Inside Multiplatform Development with KMP and more",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/whats-new-in-android-development-tools-io-2024/",
          "author": null,
          "description": "Android Studio Koala feature drop (2024.1.2) is now available in the Android Studio canary channel, with productivity enhancements, and more.",
          "link": "https://developers.googleblog.com/en/whats-new-in-android-development-tools-io-2024/",
          "publishedOn": "2024-05-21T20:14:29.963Z",
          "wordCount": null,
          "title": "Google I/O 2024: What’s new in Android Development Tools",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Many But Finite",
      "feedUrl": "https://feeds.feedburner.com/GustavoDuarte",
      "siteUrl": "https://manybutfinite.com/feed.xml",
      "articles": []
    },
    {
      "title": "Krister Walfridsson’s old blog",
      "feedUrl": "http://feeds.feedburner.com/KristerWalfridssonsBlog",
      "siteUrl": "http://kristerw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Python Insider",
      "feedUrl": "https://feeds.feedburner.com/PythonInsider",
      "siteUrl": "https://pythoninsider.blogspot.com/",
      "articles": [
        {
          "id": "https://pythoninsider.blogspot.com/2024/06/python-3124-released.html",
          "author": null,
          "description": "I'm pleased to announce the release of Python 3.12.4:\nhttps://www.python.org/downloads/release/python-3124/\n \nThis is the third maintenance release of Python 3.12\nPython 3.12 is the newest major release of the Python programming \nlanguage, and it contains many new features and optimizations. 3.12.4 is\n the latest maintenance release, containing more than 250 bugfixes, \nbuild improvements and documentation changes since 3.12.3.\n \nMajor new features of the 3.12 series, compared to 3.11\n \nNew features\nMore flexible f-string parsing, allowing many things previously disallowed (PEP 701).\nSupport for the buffer protocol in Python code (PEP 688).\nA new debugging/profiling API (PEP 669).\nSupport for isolated subinterpreters with separate Global Interpreter Locks (PEP 684).\nEven more improved error…",
          "link": "https://pythoninsider.blogspot.com/2024/06/python-3124-released.html",
          "publishedOn": "2024-06-07T01:50:00.002Z",
          "wordCount": null,
          "title": "Python 3.12.4 released",
          "imageUrl": null
        },
        {
          "id": "https://pythoninsider.blogspot.com/2024/06/python-3130-beta-2-released.html",
          "author": null,
          "description": "I'm pleased to announce the release of Python 3.13 beta 2.\nhttps://www.python.org/downloads/release/python-3130b2/\n \nThis is a beta preview of Python 3.13\nPython 3.13 is still in development. This release, 3.13.0b2, is the second of four beta release previews of 3.13.\nBeta release previews are intended to give the wider community the \nopportunity to test new features and bug fixes and to prepare their \nprojects to support the new feature release.\nWe strongly encourage maintainers of third-party Python projects to test with 3.13 during the beta phase and report issues found to the Python bug tracker \n as soon as possible. While the release is planned to be feature \ncomplete entering the beta phase, it is possible that features may be \nmodified or, in rare cases, deleted up until the start o…",
          "link": "https://pythoninsider.blogspot.com/2024/06/python-3130-beta-2-released.html",
          "publishedOn": "2024-06-07T01:46:00.001Z",
          "wordCount": null,
          "title": "Python 3.13.0 beta 2 released",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "from pvs-studio.com",
      "feedUrl": "http://feeds.feedburner.com/viva64-blog-en",
      "siteUrl": "https://pvs-studio.com",
      "articles": [
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1131/",
          "author": null,
          "description": "Many times, we've written about bugs in games, in space flight software, etc. Now we'd like to honor the tradition. This time, we'll take a look at the bugs that have crept into some of the biggest...",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1131/",
          "publishedOn": "2024-06-13T21:00:00.000Z",
          "wordCount": null,
          "title": "Smile while drowning in bugs",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1130/",
          "author": null,
          "description": "C and C++ developers have two bug-related headaches: memory leaks and undefined behavior. As you can guess, I'll talk about undefined behavior—and about \"my\" compiler. To be more precise, I'll talk...",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1130/",
          "publishedOn": "2024-06-10T21:00:00.000Z",
          "wordCount": null,
          "title": "How much UB is in my compiler?",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1129/",
          "author": null,
          "description": "Your attention is invited to the first part of an e-book on undefined behavior. This is not a textbook, as it's intended for those who are already familiar with C++ programming. It's a kind of C...",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1129/",
          "publishedOn": "2024-06-06T21:00:00.000Z",
          "wordCount": null,
          "title": "C++ programmer's guide to undefined behavior: part 1 of 11",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/java/1128/",
          "author": null,
          "description": "What if common knowledge is actually more nuanced, and old familiar things like Double-checked locking are quite controversial? Examining the code of real projects gives this kind of thought. In this...",
          "link": "https://pvs-studio.com/en/blog/posts/java/1128/",
          "publishedOn": "2024-06-04T21:00:00.000Z",
          "wordCount": null,
          "title": "Volatile, DCL, and synchronization pitfalls in Java",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1127/",
          "author": null,
          "description": "If we ask a programmer what bugs are the most common in C and C++ code, they'll name a null pointer dereference, undefined behavior, array overrun, and other typical error patterns. They may name an...",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1127/",
          "publishedOn": "2024-05-29T21:00:00.000Z",
          "wordCount": null,
          "title": "Error on verge of extinction, or why I put if (x = 42) in Red List of C & C++ bugs",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1126/",
          "author": null,
          "description": "LLVM is an open-source project with a pretty large code base. The acme in terms of code quality, considering its size and open-source nature. After all, it's the developers of compiler tools who know...",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1126/",
          "publishedOn": "2024-05-28T21:00:00.000Z",
          "wordCount": null,
          "title": "What errors are lurking in LLVM code?",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1125/",
          "author": null,
          "description": "In this article, we'll look at how to correctly destroy objects in the OOP-based C++ program without redundant operations. This is the final article in the series about the bugs in qdEngine.",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1125/",
          "publishedOn": "2024-05-22T21:00:00.000Z",
          "wordCount": null,
          "title": "C++: freeing resources in destructors using helper functions",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/1124/",
          "author": null,
          "description": "Microsoft has introduced Garnet, an open-source, cross-platform, fast cache-store project written in C#. Let's equip ourselves with a static analyzer to see what bugs and oddities hide in the project...",
          "link": "https://pvs-studio.com/en/blog/posts/csharp/1124/",
          "publishedOn": "2024-05-21T21:00:00.000Z",
          "wordCount": null,
          "title": "Garnet. Does Microsoft's cache -store also store bugs?",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Future",
      "feedUrl": "https://future.a16z.com/feed/",
      "siteUrl": "https://future.com/",
      "articles": []
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/feeds/posts/default",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2024/06/driving-forward-in-android-drivers.html",
          "author": null,
          "description": "@import url(https://themes.googleusercontent.com/fonts/css?kit=MXVwpSGzOOhqOc5hUWJbBLizfYjsfH9XaeDpmRKYJN5bV0WvE1cEyAoIq5yYZlSc);.lst-kix_3dxxrae9diso-3>li:before{content:\"\\0025cf   \"}.lst-kix_m966q2gfyys4-7>li:before{content:\"\" counter(lst-ctn-kix_m966q2gfyys4-7,lower-latin) \". \"}.lst-kix_3dxxrae9diso-2>li:before{content:\"\\0025a0   \"}.lst-kix_3dxxrae9diso-4>li:before{content:\"\\0025cb   \"}.lst-kix_m966q2gfyys4-6>li:before{content:\"\" counter(lst-ctn-kix_m966q2gfyys4-6,decimal) \". \"}.lst-kix_m966q2gfyys4-8>li:before{content:\"\" counter(lst-ctn-kix_m966q2gfyys4-8,lower-roman) \". \"}.lst-kix_kbd3zqh16g9u-4>li{counter-increment:lst-ctn-kix_kbd3zqh16g9u-4}.lst-kix_3dxxrae9diso-1>li:before{content:\"\\0025cb   \"}.lst-kix_3dxxrae9diso-5>li:before{content:\"\\0025a0   \"}ol.lst-kix_m966q2gfyys4-3.start{co…",
          "link": "https://googleprojectzero.blogspot.com/2024/06/driving-forward-in-android-drivers.html",
          "publishedOn": "2024-06-13T18:03:00.000Z",
          "wordCount": null,
          "title": "Driving forward in Android drivers",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Two Cents",
      "feedUrl": "https://hur.substack.com/feed",
      "siteUrl": "https://twocents.hur.xyz",
      "articles": []
    },
    {
      "title": "Interrupt",
      "feedUrl": "https://interrupt.memfault.com/feed.xml",
      "siteUrl": "https://interrupt.memfault.com/",
      "articles": [
        {
          "id": "https://interrupt.memfault.com/blog/diving-into-jtag-part-5",
          "author": null,
          "description": "In previous articles, we have considered the primary uses of JTAG, including\ndebugging and testing boards in production. For firmware developers, the first -\ndebugging - is the most common. In this article, I want to look at two uses of\nJTAG Boundary Scan, which are also common tasks for a firmware developer: board\nbring-up and reverse engineering.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/diving-into-jtag-part-5",
          "publishedOn": "2024-06-12T00:00:00.000Z",
          "wordCount": null,
          "title": "Diving into JTAG — Usage Scenarios (Part 5)",
          "imageUrl": null
        },
        {
          "id": "https://interrupt.memfault.com/blog/may-2024-roundup",
          "author": null,
          "description": "Here are the articles, videos, and tools that we’ve been excited about this May.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/may-2024-roundup",
          "publishedOn": "2024-06-05T00:00:00.000Z",
          "wordCount": 775,
          "title": "What we've been reading in May (2024)",
          "imageUrl": "https://interrupt.memfault.com/img/interrupt-cover-1200px.png"
        }
      ]
    },
    {
      "title": "Jay Carlson",
      "feedUrl": "https://jaycarlson.net/feed",
      "siteUrl": "https://jaycarlson.net",
      "articles": []
    },
    {
      "title": "만화로 나누는 자유/오픈소스 소프트웨어 이야기",
      "feedUrl": "https://joone.net/feed/",
      "siteUrl": "https://joone.net",
      "articles": []
    },
    {
      "title": "Kimchi hill",
      "feedUrl": "https://kimchihill.com/feed/",
      "siteUrl": "https://kimchihill.com",
      "articles": []
    },
    {
      "title": "Kwang Yul Seo",
      "feedUrl": "https://kwangyulseo.com/feed/",
      "siteUrl": "https://kwangyulseo.com",
      "articles": []
    },
    {
      "title": "LimitedResults",
      "feedUrl": "https://limitedresults.com/feed/",
      "siteUrl": "https://limitedresults.com/",
      "articles": []
    },
    {
      "title": "LWN.net",
      "feedUrl": "https://lwn.net/headlines/rss",
      "siteUrl": "https://lwn.net",
      "articles": [
        {
          "id": "https://lwn.net/Articles/978591/",
          "author": "corbet",
          "description": "The\n6.9.5,\n6.6.34,\n6.1.94,\n5.15.161,\n5.10.219,\n5.4.278, and\n4.19.316\nstable kernels have all been released; each contains another set of\nimportant fixes.",
          "link": "https://lwn.net/Articles/978591/",
          "publishedOn": "2024-06-16T19:10:03.000Z",
          "wordCount": null,
          "title": "Some weekend stable kernel updates",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978541/",
          "author": "corbet",
          "description": "The Python Software Foundation has published a\nset of reports from the 2024 Python Language summit.  Topics covered\ninclude version numbering, the limited C API, a new default read-eval-print\nloop, and Python's security model in light of the XZ backdoor:\n\n\n\tFor multiple reasons like being able to fix bugs and\n\tsingle-maintainer modules, CPython doesn't require reviewers on the\n\tpull requests of core developers. This can lead to \"unilateral\n\taction\", meaning that a change is introduced into CPython without\n\tthe review of someone besides the author. Other situations like\n\trelease managers backporting fixes to other branches without review\n\tare common.",
          "link": "https://lwn.net/Articles/978541/",
          "publishedOn": "2024-06-15T19:38:51.000Z",
          "wordCount": null,
          "title": "Reports from the Python Language Summit",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978470/",
          "author": "jzb",
          "description": "Christian Schaller writes about AI and GPU-related features that are in flight and planned for Fedora 41.\nstreamlined user experience in GNOME Software to let you install the binary NVIDIA driver and provide you with an integrated graphical user interface help to sign the kernel module for use with secure boot. This is a bit different than what we for instance are doing in RHEL, where we are working with NVIDIA to provide pre-signed kernel modules, but that is a lot harder to do in Fedora due to the rapidly updating kernel versions and which most Fedora users appreciate as a big plus. So instead what we are for opting in Fedora is as I said to make it simple for you to self-sign the kernel module for use with secure boot. We are currently looking at when we can make this feature available, but no later than Fedora Workstation 41 for sure.",
          "link": "https://lwn.net/Articles/978470/",
          "publishedOn": "2024-06-14T19:09:23.000Z",
          "wordCount": null,
          "title": "Schaller: Fedora Workstation development update – AI edition",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978465/",
          "author": "jzb",
          "description": "KDE developer Nate Graham has announced\na new set of KDE Human\nInterface Guidelines (HIG) for the KDE project. Graham says that the goals\nfor the new HIGs were to reflect how KDE designs software today, make\nthe content 100% actionable, improve navigation, and to improve the\nguidelines so people feel comfortable contributing:\ncontributing!",
          "link": "https://lwn.net/Articles/978465/",
          "publishedOn": "2024-06-14T17:18:17.000Z",
          "wordCount": null,
          "title": "New Human Interface Guidelines for KDE",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977987/",
          "author": "jzb",
          "description": "The openSUSE project recently announced\nthe second release candidate (RC2) of its Aeon Desktop, formerly known\nas MicroOS Desktop GNOME. Aside from the new coat of naming paint,\nAeon breaks ground in a few other ways by dabbling with technologies not found in other openSUSE releases. The goal for Aeon is to provide\nautomated system updates using snapshots that can be applied\natomically, removing the burden of system maintenance for\n\"lazy developers\" who want to focus on their work rather than desktop\nadministration. System-tinkerers need not apply.",
          "link": "https://lwn.net/Articles/977987/",
          "publishedOn": "2024-06-14T14:29:02.000Z",
          "wordCount": null,
          "title": "[$] Aeon: openSUSE for lazy developers",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978441/",
          "author": "corbet",
          "description": "This\nProject Zero article looks at the exploitation of a few Android driver\nbugs in great detail.\n\n\n\tAs it becomes more difficult to find 0-days in core Android,\n\tthird-party Linux kernel drivers continue to become a more and more\n\tattractive target for attackers. While the bulk of present-day\n\tdetected ITW [in-the-wild] Android exploitation targets GPU\n\tdrivers, it's equally important that other third-party drivers are\n\tencouraged towards the same security standards.",
          "link": "https://lwn.net/Articles/978441/",
          "publishedOn": "2024-06-14T14:24:28.000Z",
          "wordCount": null,
          "title": "Driving forward in Android drivers (Project Zero)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978418/",
          "author": "daroc",
          "description": "Security updates have been issued by CentOS (389-ds-base, bind, bind-dyndb-ldap, and dhcp, firefox, glibc, ipa, less, libreoffice, and thunderbird), Debian (cups), Fedora (chromium and cyrus-imapd), Mageia (golang and poppler), Oracle (bind, bind-dyndb-ldap, and dhcp, gvisor-tap-vsock, python-idna, and ruby), Red Hat (dnsmasq and expat), SUSE (libaom, php8, podman, python-pymongo, python-scikit-learn, and tiff), and Ubuntu (h2database and vte2.91).",
          "link": "https://lwn.net/Articles/978418/",
          "publishedOn": "2024-06-14T13:18:50.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977815/",
          "author": "daroc",
          "description": "The BPF verifier is a complex program. This has the unfortunate effect of making\nit simultaneously more difficult for contributors to work on, and more likely\nto harbor unknown bugs. Shung-Hsi Yu had two concrete proposals for how to\nsimplify the verifier to make it easier to maintain that he presented at the 2024\nLinux Storage,\nFilesystem, Memory Management, and BPF Summit. Yu proposed changing how the\nverifier tracks partially known values and cleaning up the interface to\nhide the details of the value-tracker's internal representation.",
          "link": "https://lwn.net/Articles/977815/",
          "publishedOn": "2024-06-13T17:01:13.000Z",
          "wordCount": null,
          "title": "[$] Simplifying the BPF verifier",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977720/",
          "author": "jake",
          "description": "Redirecting execution flow is a common malware\ntechnique that can be used to compromise operating systems. To protect from such attacks,\nthe chip makers of leading architectures like x86 and arm64 have implemented\ncontrol-flow-integrity (CFI) extensions, though they need system\nsoftware support to function. At the Linux\nSecurity Summit North America,  RISC-V kernel developer Deepak Gupta described the CFI\nprotections for that architecture and  invited community input on the\nkernel support for them.",
          "link": "https://lwn.net/Articles/977720/",
          "publishedOn": "2024-06-13T16:25:50.000Z",
          "wordCount": null,
          "title": "[$] Improving control-flow integrity for Linux on RISC-V",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978323/",
          "author": "corbet",
          "description": "Version\n1.79.0 of the Rust language has been released.  Changes this time\ninclude inline const expressions, the \"associated item bounds\nsyntax\", and more.",
          "link": "https://lwn.net/Articles/978323/",
          "publishedOn": "2024-06-13T14:48:28.000Z",
          "wordCount": null,
          "title": "Rust 1.79.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978291/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (firefox-esr), Fedora (nginx-mod-modsecurity, php, and tomcat), Mageia (strongswan), Oracle (389-ds-base, buildah, c-ares, cockpit, containernetworking-plugins, fence-agents, firefox, gdk-pixbuf2, idm:DL1, ipa, kernel, libreoffice, podman, rpm-ostree, and thunderbird), Red Hat (dnsmasq and nghttp2), Slackware (mozilla), SUSE (curl, firefox, kernel, kernel-firmware-nvidia-gspx-G06, nvidia-open- driver-G06-signed, openssl-3, and python-Pillow), and Ubuntu (libmatio, libndp, linux, linux-aws, linux-aws-5.4, linux-azure, linux-azure-5.4, linux-gcp,\n linux-gcp-5.4, linux-gkeop, linux-hwe-5.4, linux-ibm, linux-ibm-5.4,\n linux-kvm, linux-oracle, linux-oracle-5.4, linux-raspi, linux-raspi-5.4,\n linux-xilinx-zynqmp, linux-oem-6.5, and virtuoso-opensource).",
          "link": "https://lwn.net/Articles/978291/",
          "publishedOn": "2024-06-13T14:11:15.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977365/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for June 13, 2024 is available.",
          "link": "https://lwn.net/Articles/977365/",
          "publishedOn": "2024-06-13T01:26:40.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for June 13, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978156/",
          "author": "jzb",
          "description": "The Cockpit project has\nannounced\nthe first release of Cockpit\nFiles, a plugin for Cockpit that allows file management on your server\nvia a web browser:\nMahmoud Hamdy\nand is now under active development by the Cockpit team. The goal is\nto replace the functionality of the cockpit-navigator\nplugin from 45Drives and include automated testing per commit, a\nstandard PatternFly-based interface, and consistency with the rest of\nCockpit.\n\n\nDevelopment builds for Fedora are available via a\nCopr repository, and packages are expected for Arch, Debian, and\nFedora. LWN covered the\nCockpit project in March.",
          "link": "https://lwn.net/Articles/978156/",
          "publishedOn": "2024-06-12T17:17:03.000Z",
          "wordCount": null,
          "title": "Cockpit project releases Cockpit Files plugin",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977762/",
          "author": "jzb",
          "description": "CentOS Linux 7 was first\nreleased in July 2014, and is due to go end-of-life (EOL) on June 30.\nBy now, anyone who pays attention to such things is aware that Red Hat pulled the plug on\nCentOS Linux in late 2020 to be replaced by CentOS Stream\ninstead. CentOS Linux 8\nsupport was wound\ndown at the end of 2021 rather than in 2029 as originally stated.\nCentOS Linux 7 was allowed to serve out its\nfull lifespan—but that EOL is approaching rapidly and\nthere's no direct upgrade path. Users and organizations looking for a lifeline might want to consider\nAlmaLinux's ELevate\nutility, which allows CentOS users to migrate to alternate enterprise\nLinux (EL) operating systems.",
          "link": "https://lwn.net/Articles/977762/",
          "publishedOn": "2024-06-12T15:54:00.000Z",
          "wordCount": null,
          "title": "[$] Elevating CentOS 7 to a new life",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978149/",
          "author": "jzb",
          "description": "The Python Software\nFoundation (PSF) has announced\nthat nominations are open for the PSF Board election through June\n25:\nThe PSF has a video about\nserving on the board for those who might be interested. PSF members\ncan nominate themselves or another member. Candidates\nwill be announced on June 27. Voting begins on July 2 and will end on\nJuly 16.",
          "link": "https://lwn.net/Articles/978149/",
          "publishedOn": "2024-06-12T14:48:31.000Z",
          "wordCount": null,
          "title": "Nominations are open for the PSF Board election",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978010/",
          "author": "corbet",
          "description": "The mseal() system call allows a\nprocess to prevent any future changes to portions of its address space\n(thus \"sealing\" them); it was patterned after the mimmutable() system call in OpenBSD.\nmseal() generated a lot of discussion, but it was finally merged\nfor the upcoming 6.10 kernel release.  While mseal() was initially\naimed at securing the Chrome browser, the hope was that it would be useful\nelsewhere; as a step toward realizing that hope, Adhemerval Zanella has\nposted a\npatch series adding support for — and use of — mseal() to the\nGNU C library (glibc).",
          "link": "https://lwn.net/Articles/978010/",
          "publishedOn": "2024-06-12T13:49:45.000Z",
          "wordCount": null,
          "title": "[$] Memory sealing for the GNU C Library",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978151/",
          "author": "corbet",
          "description": "Systemd 256 has been released.  As usual, the list of changes is long; see\nthis article for an overview, or the\nannouncement for all the details.",
          "link": "https://lwn.net/Articles/978151/",
          "publishedOn": "2024-06-12T13:35:44.000Z",
          "wordCount": null,
          "title": "systemd 256 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978139/",
          "author": "jzb",
          "description": "Greg Kroah-Hartman has announced another round of stable kernel\nupdates: 6.9.4, 6.6.33, and 6.1.93 have been released. Each contains\nanother set of important fixes, users of these kernels are advised to\nupgrade right away.",
          "link": "https://lwn.net/Articles/978139/",
          "publishedOn": "2024-06-12T13:04:24.000Z",
          "wordCount": null,
          "title": "Three mid-week stable kernel updates",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978137/",
          "author": "corbet",
          "description": "The openSUSE\nLeap 15.6 release is available; this is intended to be the last\nLeap 15.x release before Leap 16 comes out.\n\"Leap 15.6 is projected to receive maintenance and security updates\nuntil the end of 2025 to ensure sufficient overlap with the next\nrelease\".  Changes include the addition of the Cockpit server-management tool, a\n6.4 kernel, GNOME 45, and many other upgrades.  This release also\nremoves a long list of unmaintained Python packages.  See the\nrelease notes for details.",
          "link": "https://lwn.net/Articles/978137/",
          "publishedOn": "2024-06-12T12:57:07.000Z",
          "wordCount": null,
          "title": "OpenSUSE Leap 15.6 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978136/",
          "author": "jzb",
          "description": "Security updates have been issued by AlmaLinux (booth), Debian (cyrus-imapd and vlc), Fedora (firefox, libarchive, php, and singularity-ce), Oracle (ipa and ruby:3.3), Red Hat (389-ds-base, buildah, c-ares, cockpit, containernetworking-plugins, fence-agents, gdk-pixbuf2, gvisor-tap-vsock, kernel, kernel-rt, kpatch-patch, libreoffice, podman, protobuf-c, python-idna, rpm-ostree, ruby, and tomcat), Slackware (cups and mozilla), SUSE (bind, cups, iperf, kernel, nano, and poppler), and Ubuntu (libapache-mod-jk, linux-aws, linux-aws-5.15, linux-aws, linux-oracle, linux-intel-iotg-5.15, linux-nvidia, and mysql-8.0).",
          "link": "https://lwn.net/Articles/978136/",
          "publishedOn": "2024-06-12T12:48:59.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/978007/",
          "author": "corbet",
          "description": "The extensible scheduler class\n(\"sched_ext\") framework allows the writing of CPU schedulers as a set of\nBPF programs.  It has been somewhat\ncontroversial, and its merging into the kernel has been blocked despite\na clear level of interest from users.\n\nLinus Torvalds has now let\nit be known that he has made a decision and, overriding the scheduler\nmaintainer, will merge sched_ext for the 6.11 release.\n\n\n\tI honestly see no reason to delay this any more. This whole\n\tpatchset was the major (private) discussion at last year's kernel\n\tmaintainer summit, and I don't find any value in having the same\n\tdiscussion (whether off-list or as an actual event) at the upcoming\n\tmaintainer summit one year later, so to make any kind of sane\n\tprogress, my current plan is to merge this for 6.11.",
          "link": "https://lwn.net/Articles/978007/",
          "publishedOn": "2024-06-11T21:49:49.000Z",
          "wordCount": null,
          "title": "Extensible scheduler class to be merged for 6.11",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977394/",
          "author": "daroc",
          "description": "BPF is in a unique position in terms of security. It runs in a privileged\ncontext, within the kernel, and can have access to many sensitive details of the\nkernel's operation. At the same time, unlike kernel modules, BPF programs aren't signed.\nAdditionally, the mechanisms behind BPF present challenges to implementing\nsigning or other security features. Three nearly back-to-back sessions at the\n2024\nLinux Storage,\nFilesystem, Memory Management, and BPF Summit\naddressed some of the potential security problems.",
          "link": "https://lwn.net/Articles/977394/",
          "publishedOn": "2024-06-11T18:39:22.000Z",
          "wordCount": null,
          "title": "[$] Securing BPF programs before and after verification",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977973/",
          "author": "corbet",
          "description": "Version\n127.0 of the Firefox browser is out.  Changes include support for DNS\nprefetching and the ability to close duplicate tabs in a window.  The\nbrowser will now try to upgrade images and videos with HTTP URLs that are\nfound in an HTTPS page to HTTPS as well; if that fails, the non-HTTPS\nresources will simply fail to load.\n\nUpdate: this\nMozilla Secuirty Blog post describes the HTTPS-related changes in\ndetail.",
          "link": "https://lwn.net/Articles/977973/",
          "publishedOn": "2024-06-11T16:07:22.000Z",
          "wordCount": null,
          "title": "Firefox 127.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977486/",
          "author": "jake",
          "description": "VFS maintainer Christian Brauner led a discussion about the possibility of\nselectively dropping the contents of the page cache for a filesystem in a\nsession at the\n2024 Linux Storage,\nFilesystem, Memory Management, and BPF Summit.  As he described in his\ntopic\nproposal, the use case that started him down this path comes from\nGNOME, which wants to be able to safely suspend access to an encrypted home\ndirectory.  While it is known to kernel\ndevelopers, it is surprising to others that reads from encrypted\nfilesystems that have been suspended will succeed if the data to be read\nstill exists in the \npage cache.",
          "link": "https://lwn.net/Articles/977486/",
          "publishedOn": "2024-06-11T14:28:14.000Z",
          "wordCount": null,
          "title": "[$] Dropping the page cache for filesystems",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977939/",
          "author": "corbet",
          "description": "Security updates have been issued by AlmaLinux (ruby:3.3), Fedora (efifs, libvirt, podman-tui, prometheus-podman-exporter, and strongswan), Red Hat (firefox, idm:DL1, ipa, nghttp2, and thunderbird), SUSE (aws-nitro-enclaves-cli, cdi-apiserver-container, cdi-cloner-container, cdi- controller-container, cdi-importer-container, cdi-operator-container, cdi- uploadproxy-container, cdi-uploadserver-container, containerized-data-importer, frr, glibc, go1.21, go1.22, gstreamer-plugins-base, kernel, kernel-firmware-nvidia-gspx-G06, nvidia-open- driver-G06-signed, libxml2, mariadb, poppler, python-Brotli, python-docker, python-idna, rmt-server, skopeo, sssd, unbound, unrar, util-linux, and webkit2gtk3), and Ubuntu (giflib, libphp-adodb, linux-gkeop, linux-gkeop-5.15, linux-kvm, linux-laptop, linux-oem-6.8, nodejs, and tiff).",
          "link": "https://lwn.net/Articles/977939/",
          "publishedOn": "2024-06-11T13:11:13.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977310/",
          "author": "corbet",
          "description": "P4, short for \"Programming\nProtocol-independent Packet Processors\", is a programming language aimed at\nnetworking devices; it is useful for the configuration of firewalls and\ncomplicated routing architectures.  Since a lot of advanced networking is\ndone with Linux systems, it stands to reason that there would be value in\nsupporting P4 and, indeed, an\nimplementation of P4 in the kernel's traffic-control subsystem was\nfirst posted by Jamal Hadi Salim at the beginning of 2023.  After nearly\n18 months, though, this feature has not been merged, and the chances\nof that happening would appear to be getting worse.",
          "link": "https://lwn.net/Articles/977310/",
          "publishedOn": "2024-06-10T15:11:07.000Z",
          "wordCount": null,
          "title": "[$] P4TC hits a brick wall",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977765/",
          "author": "corbet",
          "description": "Version 5.40.0 of the Perl language has been released.  \"Perl 5.40.0\nrepresents approximately 11 months of development since Perl 5.38.0 and\ncontains approximately 160,000 lines of changes across 1,500 files from 75\nauthors\".  Significant changes include a new __CLASS__\nkeyword, a :reader: attribute for field variables, a new\n\"^^\" logical-XOR operator (because two of those were not enough),\nmoving \"try/catch\" out of the experimental category, and more; see\nthis\npage for lots of details.",
          "link": "https://lwn.net/Articles/977765/",
          "publishedOn": "2024-06-10T15:08:28.000Z",
          "wordCount": null,
          "title": "perl v5.40.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977789/",
          "author": "jake",
          "description": "Security updates have been issued by Fedora (galera and mariadb10.11), Mageia (0-plugins-base and plasma-workspace), Oracle (ruby:3.1 and ruby:3.3), Red Hat (bind, bind-dyndb-ldap, and dhcp), SUSE (apache2, glib2, libvirt, openssl-1_1, openssl-3, opera, python-Jinja2, python-requests, and squid), and Ubuntu (linux, linux-gcp, linux-gcp-5.15, linux-lowlatency,\n linux-lowlatency-hwe-5.15, linux-xilinx-zynqmp, linux, linux-gcp, linux-gcp-6.5, linux-lowlatency,\n linux-lowlatency-hwe-6.5, linux-raspi, linux, linux-ibm, linux-lowlatency, linux-raspi, linux-aws, linux-gcp, linux-azure, linux-azure-6.5, linux-starfive, linux-starfive-6.5, and linux-gke, linux-ibm, linux-intel-iotg, linux-oracle).",
          "link": "https://lwn.net/Articles/977789/",
          "publishedOn": "2024-06-10T14:45:23.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977725/",
          "author": "corbet",
          "description": "The 6.10-rc3 kernel prepatch is out.\n\"So things look good, the water is warm, please jump right in and keep\ntesting,\"",
          "link": "https://lwn.net/Articles/977725/",
          "publishedOn": "2024-06-10T03:04:59.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.10-rc3",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976822/",
          "author": "jzb",
          "description": "Ladybird is an open-source\nproject aimed at building an independent web browser, rather than\nyet another browser based on Chrome. It is written in C++ and licensed under a\ntwo-clause BSD license. The effort \nbegan as part of the SerenityOS project, but\ndeveloper Andreas Kling announced\non June 3 that he was \"forking\" Ladybird as a separate project and stepping away from\nSerenityOS to focus his attention on the browser completely. Ladybird\nis not ready to replace Firefox or Chrome for regular use, but it is showing\ngreat promise.",
          "link": "https://lwn.net/Articles/976822/",
          "publishedOn": "2024-06-07T18:27:32.000Z",
          "wordCount": null,
          "title": "[$] Ladybird browser spreads its wings",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977583/",
          "author": "daroc",
          "description": "According to CrowdStrike, a\n\nvulnerability in the Linux kernel's nftables code\nthat was  discovered earlier this\nyear is being actively exploited in the wild. The vulnerability allows for\nlocal privilege escalation. Most distributions have already released a fix.\n\n\n\nAs noted by the exploit developer, leveraging this POC is dependent on the\nkernel's unprivileged user namespaces feature accessing nf_tables. This access\nis enabled by default on Debian, Ubuntu and kernel capture-the-flag (CTF)\ndistributions. An attacker can then trigger the double-free vulnerability, scan\nthe physical memory for the kernel base address, bypass kernel address-space\nlayout randomization (KASLR) and access the modprobe_path kernel variable with\nread/write privileges. After overwriting the modprobe_path, the exploit drops a\nroot shell.",
          "link": "https://lwn.net/Articles/977583/",
          "publishedOn": "2024-06-07T17:27:03.000Z",
          "wordCount": null,
          "title": "Linux nftables vulnerability exploited in the wild (CrowdStrike)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977013/",
          "author": "daroc",
          "description": "BPF was first\n\ngeneralized beyond packet filtering more than a decade ago. In that time, it\nhas changed a lot, becoming much more capable.\nAlexei Starovoitov kicked off the second day of the BPF track at the 2024\nLinux Storage,\nFilesystem, Memory Management, and BPF Summit by leading a session\ndiscussing which changes to BPF are going to come in the next ten years as it\ncontinues evolving. He proposed several ideas, including expanding the number of\nregisters available to BPF programs, dynamic deadlock detection, and relaxing\nsome existing limits of the verifier.",
          "link": "https://lwn.net/Articles/977013/",
          "publishedOn": "2024-06-07T13:17:30.000Z",
          "wordCount": null,
          "title": "[$] Modernizing BPF for the next 10 years",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977555/",
          "author": "daroc",
          "description": "Security updates have been issued by Mageia (libtiff), Oracle (cockpit, glibc, kernel, less, libxml2, linux-kernel, and tomcat), Red Hat (java-1.8.0-ibm, nghttp2, and ruby:3.3), Slackware (php), SUSE (go1.21, go1.22, and python-docker), and Ubuntu (aom and libvpx).",
          "link": "https://lwn.net/Articles/977555/",
          "publishedOn": "2024-06-07T13:11:29.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976836/",
          "author": "corbet",
          "description": "The kernel's user-space ABI does not lack for ring buffers; they have been\ndefined for subsystems like BPF, io_uring, perf,\nand tracing, for\nexample.  Naturally, each of those ring buffers is unique, with no common\ninterface between them.  The natural response to this ABI proliferation is,\nof course, to add yet another ring buffer as the generic option; that is\nthe intent of this\npatch series from Kent Overstreet adding a new set of system calls for\nring buffers.",
          "link": "https://lwn.net/Articles/976836/",
          "publishedOn": "2024-06-06T16:05:29.000Z",
          "wordCount": null,
          "title": "[$] A generic ring buffer for the kernel",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977442/",
          "author": "jake",
          "description": "Security updates have been issued by AlmaLinux (cockpit, kernel, kernel-rt, libxml2, ruby:3.1, and tomcat), Debian (libarchive, pillow, and tinyproxy), Fedora (apptainer), Mageia (amavisd-new and libxml2), Oracle (edk2), Red Hat (booth, cockpit, kernel-rt, less, libxml2, nghttp2, ruby:3.1, ruby:3.3, and tomcat), Slackware (kernel), and Ubuntu (atril, bluez, frr, gdk-pixbuf, openjdk-17, openjdk-21, openjdk-8, openjdk-lts, qemu, and unixodbc).",
          "link": "https://lwn.net/Articles/977442/",
          "publishedOn": "2024-06-06T16:03:58.000Z",
          "wordCount": 352,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975974/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for June 6, 2024 is available.",
          "link": "https://lwn.net/Articles/975974/",
          "publishedOn": "2024-06-06T01:12:50.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for June 6, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976856/",
          "author": "jake",
          "description": "There are two types of file I/O on Linux, buffered I/O, which goes through\nthe page cache, and direct I/O, which goes directly to the storage device.\nThe performance of buffered I/O was reported to be a lot worse than direct\nI/O, especially for one specific test, in Luis Chamberlain's \ntopic\nproposal for a session at the 2024 Linux Storage,\nFilesystem, Memory Management, and BPF Summit.\nThe proposal resulted in a lengthy mailing-list discussion, \nwhich also came up in Paul McKenney's RCU session the next\nday; Chamberlain led a \ncombined storage and filesystem session to discuss those results with an\neye toward improving buffered I/O performance.",
          "link": "https://lwn.net/Articles/976856/",
          "publishedOn": "2024-06-05T20:22:41.000Z",
          "wordCount": null,
          "title": "[$] Measuring and improving buffered I/O",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977303/",
          "author": "jzb",
          "description": "Version 2024.2 of the Kali Linux penetration testing distribution\nhas been released. This\nrelease includes an update to GNOME\n46, a high-resolution (HiDPI) mode for Xfce, as well as a number\nof new packages such as the AutoRecon network\nreconnaissance tool, pspy command-line utility for\nsnooping on Linux processes, and SploitScan tool for\nfetching and displaying CVE information. Kali Linux is based on Debian\ntesting, and 2024.2 incorporates Debian's work to transition to 64-bit\ntime_t to avoid year 2038 problems. Users with existing Kali\nsystems should be sure to follow the documentation\nwhen upgrading.",
          "link": "https://lwn.net/Articles/977303/",
          "publishedOn": "2024-06-05T19:14:34.000Z",
          "wordCount": null,
          "title": "Kali Linux 2024.2 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977285/",
          "author": "jzb",
          "description": "Version 14.1 of FreeBSD has\nbeen released. This\nis the second release of the 14.x stable branch. Highlights of this\nrelease include upgrades to OpenZFS 2.2.4, Clang/LLVM 18.1.5, and\nOpenSSH 9.7p1. FreeBSD 14.1 also features cloud-init support,\nsound subsystem improvements, and more. See the\nwhat's\nnew blog post from the FreeBSD Foundation, \nrelease\nnotes, and errata for\nmore information.",
          "link": "https://lwn.net/Articles/977285/",
          "publishedOn": "2024-06-05T17:39:05.000Z",
          "wordCount": null,
          "title": "FreeBSD 14.1 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976793/",
          "author": "jzb",
          "description": "Many years ago, the PostgreSQL project started holding regular CommitFests to\nhelp tackle the work of reviewing and committing patches in a more\norganized fashion. That has served the project well, but some in\nthe project are concerned that CommitFests are no longer meeting\nthe needs of PostgreSQL or its contributors. A lengthy discussion on the\npgsql-hackers mailing list turned up a number of complaints, a few\nsuggestions for improvement, but little consensus or momentum toward\na solution.",
          "link": "https://lwn.net/Articles/976793/",
          "publishedOn": "2024-06-05T16:22:44.000Z",
          "wordCount": null,
          "title": "[$] Rethinking the PostgreSQL CommitFest model",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976355/",
          "author": "jake",
          "description": "The GFP_NOFS flag is meant for kernel memory allocations that\nshould not cause a call into the filesystems to reclaim memory because there are\nalready locks held that can potentially cause a deadlock.  The \"scoped\nallocation\" API is a better choice for filesystems to indicate that they\nare holding a lock, so GFP_NOFS has long been on the chopping block, though\nprogress has been slow.  In a filesystem-track session at\nthe 2024 Linux Storage,\nFilesystem, Memory Management, and BPF Summit, Matthew Wilcox wanted to\ndiscuss how to move kernel filesystems away from the flag with the eventual\ngoal of removing it completely.",
          "link": "https://lwn.net/Articles/976355/",
          "publishedOn": "2024-06-05T15:48:08.000Z",
          "wordCount": null,
          "title": "[$] Removing GFP_NOFS",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977174/",
          "author": "jzb",
          "description": "Drew DeVault has published\nan update about the state of the SourceHut software development\nplatform and its plans for the coming months. This is the first update\nsince the January post-mortem\nfollowing a distributed denial-of-service (DDoS) attack that resulted\nin a prolonged\noutage:\nAs you can imagine, it has been a stressful time for us. However, I\nwish to stress that everything we've been dealing with is planned for\nin our models, both technical and financial. There is no existential\nthreat to SourceHut. Nevertheless, we are grateful for your patience\nand support.\n[...] We have been focusing on two things this year: provisioning\nand managing our infrastructure and getting as much rest as\npossible. Our situation has calmed down, and while we still have a lot\nof loose ends to attend to I'm happy to say that we're resuming a\nsense of normalcy here and preparing to resume our work on the\nfeatures you need.",
          "link": "https://lwn.net/Articles/977174/",
          "publishedOn": "2024-06-05T15:09:16.000Z",
          "wordCount": null,
          "title": "The state of SourceHut",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976317/",
          "author": "daroc",
          "description": "Alan Jowett returned for a second remote presentation at the 2024\nLinux Storage,\nFilesystem, Memory Management, and BPF Summit to compare the performance of\ndifferent BPF runtimes. He showed the results of the MIT-licensed BPF\n\nmicrobenchmark suite he has been working on.\nThe benchmark suite does not yet provide a good direct comparison between all\nplatforms, so the results should be\ntaken with a grain of salt. They do\nseem to indicate that there is some significant variation between\nimplementations, especially for different types of BPF maps.",
          "link": "https://lwn.net/Articles/976317/",
          "publishedOn": "2024-06-05T13:50:04.000Z",
          "wordCount": null,
          "title": "[$] Comparing BPF performance between implementations",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977233/",
          "author": "jzb",
          "description": "Security updates have been issued by Fedora (deepin-qt5integration, deepin-qt5platform-plugins, dotnet8.0, dwayland, fcitx-qt5, fcitx5-qt, gammaray, kddockwidgets, keepassxc, kf5-akonadi-server, kf5-frameworkintegration, kf5-kwayland, plasma-integration, python-qt5, qadwaitadecorations, qgnomeplatform, qt5, qt5-qt3d, qt5-qtbase, qt5-qtcharts, qt5-qtconnectivity, qt5-qtdatavis3d, qt5-qtdeclarative, qt5-qtdoc, qt5-qtgamepad, qt5-qtgraphicaleffects, qt5-qtimageformats, qt5-qtlocation, qt5-qtmultimedia, qt5-qtnetworkauth, qt5-qtquickcontrols, qt5-qtquickcontrols2, qt5-qtremoteobjects, qt5-qtscript, qt5-qtscxml, qt5-qtsensors, qt5-qtserialbus, qt5-qtserialport, and qt5-qtspeech), Oracle (389-ds-base and ruby:3.1), Red Hat (389-ds-base, glibc, and kernel), SUSE (python-PyMySQL), and Ubuntu (libarchive).",
          "link": "https://lwn.net/Articles/977233/",
          "publishedOn": "2024-06-05T13:32:19.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977070/",
          "author": "corbet",
          "description": "We have just received the\nsad news that longtime core BSD developer Mike Karels has died; he will\ncertainly be missed.",
          "link": "https://lwn.net/Articles/977070/",
          "publishedOn": "2024-06-04T20:00:10.000Z",
          "wordCount": null,
          "title": "Mike Karels has passed away",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977059/",
          "author": "corbet",
          "description": "Version 6.2 of the Incus container-management system is out.  \"This\nrelease contains the second wave of changes contributed by students of the\nUniversity of Texas at Austin and a few other features and\nimprovements.\"  The features include a new incus top\ncommand, a new API for system load information, and more.",
          "link": "https://lwn.net/Articles/977059/",
          "publishedOn": "2024-06-04T19:31:38.000Z",
          "wordCount": null,
          "title": "Incus 6.2 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/977033/",
          "author": "corbet",
          "description": "In the recent discussion on commenting at\nLWN, several readers asked for the ability to hide subthreads of a long\ncomment stream.  That feature has just been added; it is also integrated\nwith the three comment-display modes and with comment filtering, removing\nthe need for JavaScript for filtering.  Hiding is not persistent; no extra\ndata is stored at either end.\n\nGive it a try; if you have comments on the new mechanism, this is the place\nto put them.",
          "link": "https://lwn.net/Articles/977033/",
          "publishedOn": "2024-06-04T18:14:30.000Z",
          "wordCount": null,
          "title": "New site feature: comment subthread hiding",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975863/",
          "author": "jake",
          "description": "The saga of the i_version field for inodes, which tracks the\noccurrence of changes\nto the data or metadata of a file, continued in a discussion at the 2024 Linux Storage,\nFilesystem, Memory Management, and BPF Summit.  In a session led by\nJeff Layton, who has been doing a lot the work on changing the semantics and functioning of\ni_version over the years, he updated attendees on the status of the effort since a session at last year's summit.  His summary\nwas that things are\n\"pretty much where we started last year\", but the discussion this time\npointed to some possible ways forward.",
          "link": "https://lwn.net/Articles/975863/",
          "publishedOn": "2024-06-04T15:39:26.000Z",
          "wordCount": null,
          "title": "[$] Handling the NFS change attribute",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976071/",
          "author": "daroc",
          "description": "There are few topics as arcane as memory models, so it was a pleasant surprise\nwhen the double-length session on the BPF memory model at the\nLinux Storage,\nFilesystem, Memory Management, and BPF Summit turned out to be\nunderstandable. Paul McKenney led the session, although he was clear that the\nwork he was presenting was also due to Puranjay Mohan, who unfortunately could\nnot attend the summit.\nBPF does not actually have a formalized memory model yet;\ninstead it has relied on a history of talks like this one and a general informal understanding.\nUnfortunately, ignoring memory models does not make them go away, and this has\nalready caused at least one BPF-related bug on weakly-ordered architectures.\nFiguring out what a formal memory model for BPF should define was the focus of\nMcKenney's talk.",
          "link": "https://lwn.net/Articles/976071/",
          "publishedOn": "2024-06-04T13:57:29.000Z",
          "wordCount": null,
          "title": "[$] An instruction-level BPF memory model",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976977/",
          "author": "corbet",
          "description": "Security updates have been issued by Mageia (chromium-browser-stable, git, libreoffice, microcode, python-requests, webkit2, and wireshark), Oracle (container-tools:ol8, glibc, go-toolset:ol8, idm:DL1 and idm:client, less, python39:3.9 and python39-devel:3.9, ruby:3.0, and virt:ol and virt-devel:rhel), Red Hat (nodejs, nodejs:18, python-idna, and ruby:3.1), and SUSE (389-ds, ffmpeg, ffmpeg-4, gnutls, gstreamer-plugins-base, libhtp, mariadb104, poppler, python-python-jose, squid, and unbound).",
          "link": "https://lwn.net/Articles/976977/",
          "publishedOn": "2024-06-04T13:35:01.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976826/",
          "author": "jzb",
          "description": "Version 2.4.0 of the LyX\ndocument processor has been released. LyX is a \"What You See Is What You\nMean\" (WYSIWYM) application that offers GUI editing of LaTeX\ndocuments with import and export to PDF, HTML, OpenDocument, Word, and\nother formats. LyX 2.4.0 is the first major release in six years, and\nbrings support for EPUB, DocBook 5, improved\ntable styles, and now uses Unicode (utf8) as its default encoding. See\nthe full list of new\nfeatures on the LyX wiki, and release\nnotes for information on known issues and caveats for those\nupgrading from earlier versions of LyX.",
          "link": "https://lwn.net/Articles/976826/",
          "publishedOn": "2024-06-03T20:51:21.000Z",
          "wordCount": null,
          "title": "LyX 2.4.0 Released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975565/",
          "author": "jzb",
          "description": "Debian had a major discussion\nabout mounting /tmp as a RAM-based tmpfs in 2012 but inertia\nwon out in the end. Debian systems have continued to\nstore temporary files on disk by default. Until now. A mere \n12 years later, the project will be switching to a RAM-based /tmp in the Debian\n13 (\"Trixie\") release. Additionally, starting with Trixie, the\ndefault will be to periodically clean up temporary files automatically in\n/tmp and /var/tmp. Naturally, it involved a lengthy discussion first.",
          "link": "https://lwn.net/Articles/975565/",
          "publishedOn": "2024-06-03T16:16:56.000Z",
          "wordCount": null,
          "title": "[$] Debian's /tmpest in a teapot",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976782/",
          "author": "jake",
          "description": "Security updates have been issued by AlmaLinux (python39:3.9 and python39-devel:3.9 and ruby:3.0), Debian (chromium, gst-plugins-base1.0, and kernel), Fedora (chromium, glances, glycin-loaders, gnome-tour, helix, helvum, kitty, libarchive, libipuz, librsvg2, loupe, maturin, ntpd-rs, plasma-workspace, and a huge list of Rust-based packages due to a \"mini-mass-rebuild\" that updated the toolchain to Rust 1.78 and picked up fixes for various pieces), Mageia (gifsicle, netatalk, openssl, python-jinja2, and unbound), Red Hat (kernel and kernel-rt), SUSE (bind, glibc, gstreamer-plugins-base, squid, and tiff), and Ubuntu (glibc).",
          "link": "https://lwn.net/Articles/976782/",
          "publishedOn": "2024-06-03T14:49:04.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976498/",
          "author": "corbet",
          "description": "The second 6.10 kernel prepatch is out for\ntesting.  \"Nothing feels particularly odd, but rc2 is usually fairly small and\npeople are only starting to find regressions.\n\nSo please go test some more.\"",
          "link": "https://lwn.net/Articles/976498/",
          "publishedOn": "2024-06-02T23:24:33.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.10-rc2",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976447/",
          "author": "jzb",
          "description": "The Fedora Project has announced\nthe results of the Fedora Linux 40 election cycle. Four seats were\nopen on the Fedora\nEngineering Steering Committee (FESCo), and the winners are Stephen\nGallagher, Neal Gompa, Michel Lind, and Fabio Valentini. The Fedora\nCouncil had two seats open, and the winners\nare Aleksandra Fedorova and Adam Samalik. One seat was open on the\nFedora Mindshare\nCommittee, and the winner\nis Sumantro Mukherjee. Four seats were open for the first election to select\nmembers of the EPEL\nSteering Committee, which went to Troy\nDawson, Kevin Fenzi, Carl George, and Jonathan Wright.",
          "link": "https://lwn.net/Articles/976447/",
          "publishedOn": "2024-06-02T18:44:18.000Z",
          "wordCount": 214,
          "title": "Fedora Linux 40 election results",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976176/",
          "author": "jzb",
          "description": "KDE Eco, a KDE project focused\non reducing software's environmental impact, has announced its Opt\nGreen campaign to reduce e-waste:\nOver the next two years, the \"Opt Green\" initiative will bring what\nKDE Eco has been doing for sustainable software directly to end\nusers. A particular target group for the project is those whose\nconsumer behavior is driven by principles related to the environment,\nand not just price or convenience: the \"eco-consumers\".\nThrough online and offline campaigns as well as installation\nworkshops, we will demonstrate the power of Free Software to drive\ndown resource and energy consumption, and keep devices in use for the\nlifespan of the hardware, not the software.\nOur motto: The most environmentally-friendly device is the\none you already own.\nSee the KDE Eco Get\nInvolved page for more information on how to participate.",
          "link": "https://lwn.net/Articles/976176/",
          "publishedOn": "2024-05-31T19:24:05.000Z",
          "wordCount": null,
          "title": "Opt Green: KDE Eco's New Sustainable Software Project",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976125/",
          "author": "corbet",
          "description": "The \"pidfdfs\" virtual filesystem was added to the 6.9 kernel release as a\nway to export better information about running processes to user space.  It\nreplaced a previous implementation in a way that was, on its surface, fully\ncompatible while adding a number of new capabilities.  This transition,\nwhich was intended to be entirely invisible to existing applications,\nalready ran into trouble in March, when a\nmisunderstanding with SELinux caused systems with pidfdfs to fail to boot\nproperly.  That problem was quickly fixed, but it turns out that there was\none more surprise in store, showing just how hard ABI compatibility can be\nat times.",
          "link": "https://lwn.net/Articles/976125/",
          "publishedOn": "2024-05-31T18:08:05.000Z",
          "wordCount": null,
          "title": "[$] One more pidfdfs surprise",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976319/",
          "author": "corbet",
          "description": "The 2024 Kernel Maintainers Summit will happen on September 17 in\nVienna, Austria; it is an invitation-only event for a small group to\ndiscuss important kernel-development problems.  The call for\nproposals for this gathering has now been posted.  One of the best ways\nto be invited to the event is to propose a topic that needs discussion in\nthat forum.  The deadline for proposals is June 18.",
          "link": "https://lwn.net/Articles/976319/",
          "publishedOn": "2024-05-31T15:37:03.000Z",
          "wordCount": null,
          "title": "CFP: the 2024 Kernel Maintainers Summit",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976211/",
          "author": "corbet",
          "description": "The developers of the Krita painting\napplication are celebrating\n25 years of development with a detailed history of the project.\n\n\n\tA quarter century. That's how long we've been working on\n\tKrita. Well, what would become Krita. It started out as KImageShop,\n\tbut that name was nuked by a now long-dead German lawyer. Then it\n\twas renamed to Krayon, and that name was also nuked. Then it was\n\trenamed to Krita, and that name stuck.",
          "link": "https://lwn.net/Articles/976211/",
          "publishedOn": "2024-05-31T13:31:36.000Z",
          "wordCount": null,
          "title": "25 Years of Krita",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976209/",
          "author": "daroc",
          "description": "Security updates have been issued by AlmaLinux (.NET 7.0, .NET 8.0, 389-ds:1.4, ansible-core bug fix, enhancement, and, bind and dhcp, container-tools:rhel8, edk2, exempi, fence-agents, freeglut, frr, gdk-pixbuf2, ghostscript, git-lfs, glibc, gmp, go-toolset:rhel8, grafana, grub2, gstreamer1-plugins-bad-free, gstreamer1-plugins-base, gstreamer1-plugins-good, harfbuzz, httpd:2.4, Image builder components bug fix, enhancement and, kernel, kernel-rt, krb5, less, LibRaw, libsndfile, libssh, libtiff, libX11, libXpm, linux-firmware, motif, mutt, nghttp2, openssh, pam, pcp, pcs, perl-Convert-ASN1, perl-CPAN, perl:5.32, pki-core:10.6 and pki-deps:10.6, pmix, poppler, python-dns, python-jinja2, python-pillow, python27:2.7, python3, python3.11, python3.11-cryptography, python3.11-urllib3, python39:3.9 and python39-devel:3.9, qt5-qtbase, resource-agents, squashfs-tools, sssd, systemd, tigervnc, traceroute, vorbis-tools, webkit2gtk3, xorg-x11-server, xorg-x11-server-Xwayland, and zziplib), Debian (gst-plugins-base1.0), Fedora (cacti, cacti-spine, roundcubemail, and wireshark), Oracle (.NET 7.0, .NET 8.0, bind and dhcp, gdk-pixbuf2, git-lfs, glibc, grafana, krb5, pcp, python-dns, python3, sssd, tigervnc, xorg-x11-server, and xorg-x11-server-Xwayland), Red Hat (edk2, less, nghttp2, and ruby:3.0), SUSE (gstreamer-plugins-base, Java, kernel, and python-requests), and Ubuntu (ffmpeg, node-browserify-sign, postgresql-14, postgresql-15, postgresql-16, and python-pymysql).",
          "link": "https://lwn.net/Articles/976209/",
          "publishedOn": "2024-05-31T13:05:45.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975830/",
          "author": "daroc",
          "description": "While BPF may be most famous for its use in the Linux kernel, there is actually\na growing effort to standardize BPF for use on other systems. These include\n\neBPF for Windows, but also\n\nuBPF,\n\nrBPF,\n\nhBPF,\n\nbpftime, and\nothers. Some hardware manufacturers are even\nconsidering integrating BPF directly into networking hardware. Dave Thaler\nled two sessions about all of the problems that cross-platform use inevitably\nbrings and the current status of the standardization work at the 2024\nLinux Storage,\nFilesystem, Memory Management, and BPF Summit.",
          "link": "https://lwn.net/Articles/975830/",
          "publishedOn": "2024-05-30T20:19:28.000Z",
          "wordCount": null,
          "title": "[$] Standardizing the BPF ISA",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975444/",
          "author": "jake",
          "description": "A discussion of extensions to the statx()\nsystem call comes up frequently at the Linux Storage,\nFilesystem, Memory Management, and BPF Summit; this year's edition was\nno exception.  Kent Overstreet led the first filesystem-only session at the\nsummit on querying information about filesystems that have subvolumes and\nsnapshots. While it was billed as a discussion on statx()\nadditions, it ranged more widely over new APIs needed for modern filesystems.",
          "link": "https://lwn.net/Articles/975444/",
          "publishedOn": "2024-05-30T13:16:29.000Z",
          "wordCount": null,
          "title": "[$] New APIs for filesystems",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976007/",
          "author": "jake",
          "description": "Greg Kroah-Hartman has announced the release of the 6.9.3 and 6.8.12 stable kernels.  As usual, they contain\nlots of important fixes throughout the tree.  Note that 6.8.12 is the end\nof the line for the 6.8.x stable kernel series.",
          "link": "https://lwn.net/Articles/976007/",
          "publishedOn": "2024-05-30T12:50:45.000Z",
          "wordCount": null,
          "title": "Stable kernels 6.9.3 and 6.8.12",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/976006/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (python-pymysql), Fedora (chromium, mingw-python-requests, and thunderbird), Mageia (perl-Email-MIME and qtnetworkauth5 & qtnetworkauth6), Red Hat (gdisk and python39:3.9 and python39-devel:3.9 modules), SUSE (freerdp, gdk-pixbuf, gifsicle, glib2, java-1_8_0-ibm, kernel, libfastjson, libredwg, nodejs16, python, python3, python36, rpm, warewulf4, and xdg-desktop-portal), and Ubuntu (gst-plugins-base1.0, python-werkzeug, and tpm2-tss).",
          "link": "https://lwn.net/Articles/976006/",
          "publishedOn": "2024-05-30T12:47:19.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974709/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for May 30, 2024 is available.",
          "link": "https://lwn.net/Articles/974709/",
          "publishedOn": "2024-05-30T02:28:31.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for May 30, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975445/",
          "author": "jzb",
          "description": "The Asahi Linux project works\nto support Linux on Apple Silicon hardware. The\nproject's flagship\ndistribution is the Fedora\nAsahi Remix, which has its own installer (rather than Anaconda) to\naccommodate the unique requirements of installing on Apple's\nhardware. Previously the installer was built by the Asahi project, but it has asked for (and received) an exception\nfrom the Fedora\nEngineering Steering Committee (FESCo) to include two binaries\nfrom upstream open-source projects so that the installer can be built on Fedora\ninfrastructure.",
          "link": "https://lwn.net/Articles/975445/",
          "publishedOn": "2024-05-29T18:15:38.000Z",
          "wordCount": null,
          "title": "[$] Fedora approves shipping pre-built macOS binaries",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975807/",
          "author": "jzb",
          "description": "The FreeBSD Foundation has announced\nthe 2024\nFreeBSD Community Survey Report. The report provides a summary of\n1,446 responses to an anonymous online survey of FreeBSD users. It\nprovides insights into user profiles, typical usage, how the FreeBSD\nproject is viewed, as well as recommendations for expanding the\nFreeBSD community and contributor base:\nThe raw\ndata for the survey is available as well.",
          "link": "https://lwn.net/Articles/975807/",
          "publishedOn": "2024-05-29T17:41:25.000Z",
          "wordCount": null,
          "title": "Results from the 2024 FreeBSD Community Survey Report",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975597/",
          "author": "corbet",
          "description": "When redesigning the LWN site in 2002, we thought long and hard about\nwhether the ability to post comments should be part of it; LWN had not\noffered that feature for the first four years of its existence.  There were\nalready plenty of examples of how comments can go bad by then, but we\ndecided to trust our readers to keep things under control.  Much of the\ntime, that trust has proved justified, but there have been times where\nthings have not gone so well.  This time is quickly becoming one of those\nothers.",
          "link": "https://lwn.net/Articles/975597/",
          "publishedOn": "2024-05-29T16:28:02.000Z",
          "wordCount": null,
          "title": "A plea for more thoughtful comments",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975737/",
          "author": "jzb",
          "description": "Security updates have been issued by AlmaLinux (glibc and tomcat), Fedora (chromium, fcitx5-qt, python-pyqt6, qadwaitadecorations, qgnomeplatform, qt6, qt6-qt3d, qt6-qt5compat, qt6-qtbase, qt6-qtcharts, qt6-qtcoap, qt6-qtconnectivity, qt6-qtdatavis3d, qt6-qtdeclarative, qt6-qtgraphs, qt6-qtgrpc, qt6-qthttpserver, qt6-qtimageformats, qt6-qtlanguageserver, qt6-qtlocation, qt6-qtlottie, qt6-qtmqtt, qt6-qtmultimedia, qt6-qtnetworkauth, qt6-qtopcua, qt6-qtpositioning, qt6-qtquick3d, qt6-qtquick3dphysics, qt6-qtquicktimeline, qt6-qtremoteobjects, qt6-qtscxml, qt6-qtsensors, qt6-qtserialbus, qt6-qtserialport, qt6-qtshadertools, qt6-qtspeech, qt6-qtsvg, qt6-qttools, qt6-qttranslations, qt6-qtvirtualkeyboard, qt6-qtwayland, qt6-qtwebchannel, qt6-qtwebengine, qt6-qtwebsockets, qt6-qtwebview, and zeal), Red Hat (glibc, kernel, kernel-rt, kpatch-patch, linux-firmware, mod_http2, pcp, pcs, protobuf, python3, rpm-ostree, and rust), SUSE (git, glibc-livepatches, kernel, libxml2, openssl-1_1, SUSE Manager Client Tools, SUSE Manager Client Tools, salt, and xdg-desktop-portal), and Ubuntu (amavisd-new, firefox, flask-security, frr, git, intel-microcode, jinja2, libreoffice, linux-intel-iotg, unbound, and webkit2gtk).",
          "link": "https://lwn.net/Articles/975737/",
          "publishedOn": "2024-05-29T13:20:17.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975412/",
          "author": "daroc",
          "description": "The GCC project has been working to support compiling to BPF\nfor some time. José Marchesi and David Faust spoke in an extended session at the 2024\nLinux Storage,\nFilesystem, Memory Management, and BPF Summit\nabout how that work has been going, and what is left for GCC to be on-par with\nLLVM with regard to BPF support. They also related tentative plans for how\nGCC BPF support would be maintained in the future.",
          "link": "https://lwn.net/Articles/975412/",
          "publishedOn": "2024-05-28T19:45:04.000Z",
          "wordCount": null,
          "title": "[$] Supporting BPF in GCC",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974958/",
          "author": "jake",
          "description": "The iomap\nblock-mapping abstraction is being used by more filesystems, in part\nbecause of its support for large folios.  But there are some challenges in\nadopting iomap, which was the topic of a discussion led by Ritesh Harjani\nin a combined storage and filesystem session at the 2024 Linux Storage,\nFilesystem, Memory Management, and BPF Summit.  One of the main trouble\nspots is how to handle metadata, which is not an area that iomap has been aimed\nat.",
          "link": "https://lwn.net/Articles/974958/",
          "publishedOn": "2024-05-28T13:56:57.000Z",
          "wordCount": null,
          "title": "[$] Filesystems and iomap",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974943/",
          "author": "corbet",
          "description": "In the final session in the memory-management track of the 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit, the exhausted group of\ndevelopers looked one more time at the use of huge pages and the associated\nproblem of memory fragmentation.  At its worst, this problem can make huge\npages harder (and more expensive) to allocate.  Luis Chamberlain, who ran\nthe session, felt that people were worried about this problem, but that\nthere was little data on how severe it truly is.",
          "link": "https://lwn.net/Articles/974943/",
          "publishedOn": "2024-05-28T13:29:41.000Z",
          "wordCount": null,
          "title": "[$] Measuring memory fragmentation",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974939/",
          "author": "corbet",
          "description": "A longstanding tradition in the memory-management track of the Linux Storage,\nFilesystem, Memory-Management and BPF Summit is a session with\nmaintainer Andrew Morton to discuss the overall state of the community and\nthe development process.  The 2024 gathering upheld that tradition toward\nthe end of the final day of the event.  It seems that Morton and the\nassembled developers were all happy with how memory-management work is\ngoing, but there is always room for improvement.",
          "link": "https://lwn.net/Articles/974939/",
          "publishedOn": "2024-05-28T13:28:49.000Z",
          "wordCount": null,
          "title": "[$] The state of the memory-management community in 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975529/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (less), Mageia (chromium-browser-stable), SUSE (apache2, java-1_8_0-openj9, kernel, libqt5-qtnetworkauth, and openssl-3), and Ubuntu (netatalk and python-cryptography).",
          "link": "https://lwn.net/Articles/975529/",
          "publishedOn": "2024-05-28T13:19:58.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975454/",
          "author": "corbet",
          "description": "Geoff Huston suggests\nthat it is time to give up on DNSSEC and look for a better way to secure\nthe Internet namespace.\n\n\n\tWhat appears to be very clear (to me at any rate!) is that DNSSEC\n\tas we know it today is just not going anywhere. It's too complex,\n\ttoo fragile and just too slow to use for the majority of services\n\tand their users. Some value its benefits highly enough that they\n\tare prepared to live with its shortcomings, but that's not the case\n\tfor the overall majority of name holders and for the majority of\n\tusers, and no amount of passionate exhortations about DNSSEC will\n\tchange this.",
          "link": "https://lwn.net/Articles/975454/",
          "publishedOn": "2024-05-27T21:56:10.000Z",
          "wordCount": null,
          "title": "Huston: Calling Time on DNSSEC?",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974945/",
          "author": "daroc",
          "description": "Alan Jowett gave a remote presentation at the 2024\nLinux Storage,\nFilesystem, Memory Management, and BPF Summit about what features could be\nadded to LLVM to make writing BPF programs easier. While there is nothing specific\nto LLVM about BPF code (and the next session in the track was led by GCC\ndeveloper José Marchesi about better support for that compiler), LLVM is currently the most\ncommon way to turn C code into BPF bytecode. That translation, however, runs\ninto problems when the BPF verifier cannot understand the code LLVM's\noptimizations produce.",
          "link": "https://lwn.net/Articles/974945/",
          "publishedOn": "2024-05-27T17:04:36.000Z",
          "wordCount": null,
          "title": "[$] LLVM improvements for BPF verification",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974937/",
          "author": "corbet",
          "description": "One of the long-term goals of the folio conversion in the kernel's\nmemory-management subsystem is the replacement of the page\nstructure, which describes a page of physical memory, with an eight-byte\n\"memory descriptor\".  This change would reduce the overhead of tracking\nphysical memory, increase type safety, and make memory management more\nflexible.  Thus far, though, details on what the memory-descriptor future\nwill look like have been relatively scarce.  At the 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit, Matthew Wilcox led a\ndiscussion to try to fill in the picture somewhat.",
          "link": "https://lwn.net/Articles/974937/",
          "publishedOn": "2024-05-27T13:39:04.000Z",
          "wordCount": null,
          "title": "[$] Fleshing out memory descriptors",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975399/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (apache2, bluez, chromium, fossil, libreoffice, python-pymysql, redmine, and ruby-rack), Fedora (buildah, crosswords, dotnet7.0, glycin-loaders, gnome-tour, helix, helvum, libipuz, loupe, maturin, mingw-libxml2, ntpd-rs, perl-Email-MIME, and a huge list of Rust-based packages due to a \"mini-mass-rebuild\" that updated the toolchain to Rust 1.78 and picked up fixes for various pieces), Mageia (chromium-browser-stable, mariadb, and roundcubemail), Oracle (kernel, libreoffice, nodejs, and tomcat), and SUSE (cJSON, libfastjson, opera, postgresql15, python3, and qt6-networkauth).",
          "link": "https://lwn.net/Articles/975399/",
          "publishedOn": "2024-05-27T13:35:26.000Z",
          "wordCount": 1317,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974869/",
          "author": "corbet",
          "description": "Linus Torvalds released 6.10-rc1 and closed\nthe 6.10 merge window on May 26.  By that time, 11,534 non-merge\nchangesets had been pulled into the mainline for the next release; nearly\n5,000 of those came in after \"The first half of\nthe 6.10 merge window\" was written.  While the latter half of the merge\nwindow tends to focus more on fixes, there was also a lot of new\nfunctionality that landed during this time.",
          "link": "https://lwn.net/Articles/974869/",
          "publishedOn": "2024-05-27T13:04:13.000Z",
          "wordCount": null,
          "title": "[$] The rest of the 6.10 merge window",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974860/",
          "author": "corbet",
          "description": "The maple tree data structure was added\nduring the 6.1 development cycle; since then, it has taken its\nplace at the core of the kernel's memory-management subsystem.\nUnsurprisingly, work on maple trees is not yet done.  Maple-tree maintainer\nLiam Howlett ran a session in the memory-management track of the 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit to discuss the current\nstate of the maple tree and which features can be expected next.",
          "link": "https://lwn.net/Articles/974860/",
          "publishedOn": "2024-05-27T12:48:13.000Z",
          "wordCount": null,
          "title": "[$] The next steps for the maple tree",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975145/",
          "author": "corbet",
          "description": "Linus has released\n6.10-rc1 and closed the merge window for this release.  For reasons\nthat have not been spelled out, the codename for the release has been\nchanged to \"Baby Opossum Posse\".",
          "link": "https://lwn.net/Articles/975145/",
          "publishedOn": "2024-05-26T22:55:37.000Z",
          "wordCount": 145,
          "title": "Kernel prepatch 6.10-rc1",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/975072/",
          "author": "jzb",
          "description": "The 6.9.2, 6.8.11, 6.6.32, 6.1.92, 5.15.160, 5.10.218, 5.4.277, and 4.19.315\nstable kernel updates have all been released. Each contains an\nimportant set of fixes. Users of those kernels should upgrade.",
          "link": "https://lwn.net/Articles/975072/",
          "publishedOn": "2024-05-26T00:07:16.000Z",
          "wordCount": null,
          "title": "Eight weekend stable kernel updates",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974826/",
          "author": "corbet",
          "description": "Using huge pages has been known for years to improve the performance of\nmany workloads.  But traditional huge pages, often sized by the CPU at 2MB,\ncan be difficult to allocate and can waste memory due to internal\nfragmentation.  Driven by both the folio transition and hardware\nimprovements, attention to smaller, multi-size transparent huge pages\n(mTHPs) has been on the rise.  In two memory-management-track sessions at\nthe 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit, developers discussed the\nkernel's ability to reliably allocate mTHPs and the performance gains that\nresult.",
          "link": "https://lwn.net/Articles/974826/",
          "publishedOn": "2024-05-25T16:38:04.000Z",
          "wordCount": null,
          "title": "[$] Two talks on multi-size transparent huge page performance",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974578/",
          "author": "jake",
          "description": "John Garry and Ted Ts'o led a discussion about supporting atomic writes for buffered\nI/O, without any torn (or partial) writes to the device, at the 2024 Linux Storage,\nFilesystem, Memory Management, and BPF Summit.  It is something of a\ncontinuation of a discussion at last year's\nsummit. The goal is to help PostgreSQL, which writes its data using\n16KB buffered I/O; it currently has to do a lot of extra work to ensure\nthat its data is safe on disk.  A promise of non-torn, 16KB buffered writes\nwould allow the database \nto avoid doing double writes.",
          "link": "https://lwn.net/Articles/974578/",
          "publishedOn": "2024-05-24T21:33:35.000Z",
          "wordCount": null,
          "title": "[$] Atomic writes without tears",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974636/",
          "author": "corbet",
          "description": "The original Linux kernel, posted in 1991, ran on a system with a 4KB page\nsize.  Over 30 years later, most of us are still running on systems\nwith 4KB pages, even though the amount of installed memory has grown by a\nfew orders of magnitude.  It is generally accepted that using large page\nsizes results in better performance for most applications, but allocating\nlarger pages is often difficult.  During a memory-management session at the 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit, Yu Zhao presented his\nideas on improving the allocation of huge pages in the kernel.",
          "link": "https://lwn.net/Articles/974636/",
          "publishedOn": "2024-05-24T20:42:27.000Z",
          "wordCount": null,
          "title": "[$] Allocator optimizations for transparent huge pages",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974848/",
          "author": "daroc",
          "description": "Kui-Feng Lee spoke early in the BPF track at the 2024\nLinux Storage,\nFilesystem, Memory Management, and BPF Summit about some of the\nrecent improvements to BPF. These changes were largely driven by the\nsched_ext work that David Vernet had covered in\nthe previous talk. Lee focused on changes relevant to struct_ops\nprograms, but several of those changes apply to all BPF programs.",
          "link": "https://lwn.net/Articles/974848/",
          "publishedOn": "2024-05-24T19:37:18.000Z",
          "wordCount": null,
          "title": "[$] Recent improvements to BPF's struct_ops mechanism",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/969640/",
          "author": "jzb",
          "description": "With the release of Fedora 40 it's time to\nstart looking ahead to what Fedora 41 has in store. One of the largest\nchanges planned for the next release is a switch to\nDNF5, a C++ rewrite of the DNF\npackage manager. A previous attempt to make the switch, during the Fedora 39 cycle, was called off, and\ndeferred to Fedora 41. The developers have had nearly a year to address\ncompatibility problems and bring DNF5 to a state suitable to replace DNF4. Signs point to a successful switch in\nthe upcoming release, though there may be a few surprises lurking for Fedora users.",
          "link": "https://lwn.net/Articles/969640/",
          "publishedOn": "2024-05-24T16:51:04.000Z",
          "wordCount": null,
          "title": "[$] Readying DNF5 for Fedora 41",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974630/",
          "author": "corbet",
          "description": "The kernel contains a pair of related filesystems that, among other things,\ncan be used for shared-memory applications; shmem is an internal mechanism\nused within the kernel, while the tmpfs filesystem is mounted and\naccessible from user space.  As is the case elsewhere in the kernel, these\nsubsystems would benefit from the addition of large-folio support.  During\na joint storage, filesystem, and memory-management session at the 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit, Daniel Gomez talked about\nthe work he is doing to add that support.",
          "link": "https://lwn.net/Articles/974630/",
          "publishedOn": "2024-05-24T14:02:20.000Z",
          "wordCount": null,
          "title": "[$] Large-folio support for shmem and tmpfs",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974914/",
          "author": "corbet",
          "description": "This\nGraphite blog post retells the history of the BitKeeper fiasco and the\ndawn of the Git era.\n\n\n\tWhen we think of history, we often romanticize it as being born of\n\ta sudden stroke of inspiration. But the creation of git shows the\n\tfar harsher reality of invention: a slowly escalating disagreement\n\tover a license; the need for a scrappy backup solution to unblock\n\twork; and then continued polishing and iteration through years and\n\tyears, led not by the inventor, but rather a community.\n\n\nFor those who weren't around in those days, a perusal of the LWN coverage\nfrom the time might be of interest too, including:\n\n\n Our first mention of BitKeeper\n     in October 1998\n Not quite open source,\n     1999\n Linus tries out BitKeeper, 2002\n The free software community and proprietary\n     packages, 2002\n The kernel and BitKeeper part ways,\n     2005\n How Tridge reverse engineered\n     BitKeeper, 2005\n The guts of Git, 2005\n\n\n...and a lot more for those who care to search for it.",
          "link": "https://lwn.net/Articles/974914/",
          "publishedOn": "2024-05-24T13:34:17.000Z",
          "wordCount": null,
          "title": "BitKeeper, Linux, and licensing disputes: How Linus wrote Git in 14 days \n(Graphite blog)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974913/",
          "author": "daroc",
          "description": "Security updates have been issued by Fedora (chromium, libreoffice, and thunderbird), Red Hat (.NET 7.0, .NET 8.0, gdk-pixbuf2, git-lfs, glibc, python3, and xorg-x11-server-Xwayland), SUSE (firefox, opensc, and ucode-intel), and Ubuntu (cjson and gnome-remote-desktop).",
          "link": "https://lwn.net/Articles/974913/",
          "publishedOn": "2024-05-24T13:16:45.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974587/",
          "author": "corbet",
          "description": "Swapping may be a memory-management technique at its core, but its\nimplementation also involves the kernel's filesystem and storage layers.\nSo it is not surprising that a session on the kernel's swap abstraction\nlayer, led by Chris Li at the 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit, was held jointly by all\nthree of those tracks.  Li has some ambitious ideas for an improved\nsubsystem, but getting to a workable implementation may not be easy.",
          "link": "https://lwn.net/Articles/974587/",
          "publishedOn": "2024-05-23T19:27:21.000Z",
          "wordCount": null,
          "title": "[$] A new swap abstraction layer for the kernel",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974387/",
          "author": "daroc",
          "description": "David Vernet's second talk at the 2024\nLinux Storage,\nFilesystem, Memory Management, and BPF Summit was a summary of the state of\nsched_ext, the extensible BPF scheduler that LWN\ncovered a in early May. In short, sched_ext is intended as a platform for\nrapid experimentation with schedulers, and a tool to let performance-minded\nadministrators customize the scheduler to their workload. The patch set has seen\nseveral revisions, becoming more generic and powerful over time.\nVernet spoke about what has been done in the past year,\nand what is still missing before sched_ext can be considered pretty much\ncomplete.",
          "link": "https://lwn.net/Articles/974387/",
          "publishedOn": "2024-05-23T17:34:22.000Z",
          "wordCount": null,
          "title": "[$] What's scheduled for sched_ext",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974708/",
          "author": "jzb",
          "description": "The KDE Project has announced the\nrelease of KDE Gear 24.05.0, with new features and updates for the\nmore than 200 applications that\nare part of the project. In addition to new versions of the Dolphin\nfile manager, Kdenlive video\neditor, and Elisa music player, this\nrelease includes five applications new to KDE Gear: the Audex CD-ripper application,\nan application Accessibility\nInspector, the Francis\nPomodoro timer, Kalm to teach breathing techniques, and a Sokoban-like game\ncalled Skladnik. See the\nfull\nchangelog for a complete list of changes.",
          "link": "https://lwn.net/Articles/974708/",
          "publishedOn": "2024-05-23T14:16:47.000Z",
          "wordCount": null,
          "title": "KDE Gear 24.05.0",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974575/",
          "author": "corbet",
          "description": "Almost immediately after the merging of control\ngroups, kernel developers set their sights on reimplementing them\nproperly.  The second version of the control-group API started trickling\ninto the kernel around the 3.16 release in 2014 and users have long since\nbeen encouraged to migrate, but support for (and users of) the initial API\nremain.  At the 2024\nLinux Storage, Filesystem, Memory-Management and BPF Summit,\nmemory-management developers discussed whether (and when) it might be\npossible to remove the version-1 memory controller.  The session was led by\nShakeel Butt and (participating remotely) Roman Gushchin.",
          "link": "https://lwn.net/Articles/974575/",
          "publishedOn": "2024-05-23T14:03:20.000Z",
          "wordCount": null,
          "title": "[$] The twilight of the version-1 memory controller",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974824/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (chromium), Fedora (chromium, libxml2, pgadmin4, and python-libgravatar), Mageia (ghostscript), Red Hat (389-ds:1.4, ansible-core, bind and dhcp, container-tools:rhel8, edk2, exempi, fence-agents, freeglut, frr, ghostscript, glibc, gmp, go-toolset:rhel8, grafana, grub2, gstreamer1-plugins-bad-free, gstreamer1-plugins-base, gstreamer1-plugins-good, harfbuzz, httpd:2.4, idm:DL1, idm:DL1 and idm:client modules, kernel, kernel-rt, krb5, LibRaw, libreoffice, libsndfile, libssh, libtiff, libX11, libxml2, libXpm, linux-firmware, motif, mutt, openssh, osbuild and osbuild-composer, pam, pcp, pcs, perl-Convert-ASN1, perl-CPAN, perl:5.32, pki-core:10.6 and pki-deps:10.6 modules, pmix, poppler, postgresql-jdbc, python-dns, python-jinja2, python-pillow, python27:2.7, python3.11, python3.11-cryptography, python3.11-urllib3, python39:3.9 and python39-devel:3.9 modules, qt5-qtbase, resource-agents, squashfs-tools, sssd, systemd, tigervnc, tomcat, traceroute, varnish:6, virt:rhel and virt-devel:rhel modules, vorbis-tools, webkit2gtk3, xorg-x11-server, xorg-x11-server-Xwayland, and zziplib), SUSE (chromium, perl, postgresql14, and python-sqlparse), and Ubuntu (klibc, linux-aws-hwe, openssl, and vlc).",
          "link": "https://lwn.net/Articles/974824/",
          "publishedOn": "2024-05-23T13:58:59.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/973888/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for May 23, 2024 is available.",
          "link": "https://lwn.net/Articles/973888/",
          "publishedOn": "2024-05-23T01:25:41.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for May 23, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974219/",
          "author": "jake",
          "description": "In a \ncombined storage and filesystem session at the 2024\nLinux Storage,\nFilesystem, Memory Management, and BPF Summit, Luis Chamberlain led a\ndiscussion on filesystem support for block sizes larger than the usual 4KB\npage size, \nwhich followed up on  discussion from last year.  While the\nsession was meant to look at the intersection of larger block sizes\nwith atomic block writes  that avoid torn\n(partial) writes (which was also discussed last year), it mostly focused on the\nfilesystem side.  Over time, the\nblock sizes offered by storage devices have risen from the original\n512 bytes; Chamberlain\nwanted to discuss filesystem support for block sizes larger than 4KB.",
          "link": "https://lwn.net/Articles/974219/",
          "publishedOn": "2024-05-22T20:10:22.000Z",
          "wordCount": null,
          "title": "[$] Supporting larger block sizes in filesystems",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974517/",
          "author": "corbet",
          "description": "The term \"memory model\" is used in a couple of ways within the kernel.\nPerhaps the more obscure meaning is the memory-management subsystem's view\nof how physical memory is organized on a given system.  A proper\nrepresentation of physical memory will be more efficient in terms of memory\nand CPU use.  Since hardware comes in numerous variations, the kernel\nsupports a number of memory models to match; see this article for details.  At the 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit, Oscar Salvador,\npresenting remotely, made the case for removing one of those models.",
          "link": "https://lwn.net/Articles/974517/",
          "publishedOn": "2024-05-22T18:58:04.000Z",
          "wordCount": null,
          "title": "[$] The path to deprecating SPARSEMEM",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974518/",
          "author": "corbet",
          "description": "Compute\nExpress Link (CXL) is a data-center-oriented memory solution that,\naccording to some in the industry, will yield large cost savings and\nperformance improvements.  Others are more skeptical.  At the 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit, two sessions covered CXL\nand how it will be supported in future kernels.",
          "link": "https://lwn.net/Articles/974518/",
          "publishedOn": "2024-05-22T18:56:17.000Z",
          "wordCount": null,
          "title": "[$] Two sessions on CXL memory",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974515/",
          "author": "corbet",
          "description": "For every page of memory in the system, the kernel maintains a set of page\nflags describing how the page is used and various aspects of its current\nstate.  Space for page flags has been in chronic short supply, leading to a desire to\neliminate or consolidate them whenever possible.  That objective, though,\nis hampered by the fact that the purpose of many page flags is not well\nunderstood.  In a memory-management-track session at the 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit, Matthew Wilcox set out to\ncooperatively update the page-flag documentation to improve that situation.",
          "link": "https://lwn.net/Articles/974515/",
          "publishedOn": "2024-05-22T17:26:15.000Z",
          "wordCount": null,
          "title": "[$] Documenting page flags by committee",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974512/",
          "author": "corbet",
          "description": "The problem of sharing page tables across processes has been discussed\nnumerous times over the years, Khaled Aziz said at the beginning of his 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit session on the topic.  He\nwas there to, once again, talk about the proposed mshare() system call (which, in its\ncurrent form, is no longer actually a system call but the feature still\ngoes by that name) and to see what can be done to finally get it into the\nmainline.",
          "link": "https://lwn.net/Articles/974512/",
          "publishedOn": "2024-05-22T17:25:13.000Z",
          "wordCount": null,
          "title": "[$] Merging msharefs",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974491/",
          "author": "corbet",
          "description": "The kernel's hugetlbfs\nsubsystem was the first mechanism by which the kernel made huge pages\navailable to user space; it was added to the 2.5.46 development kernel in\n2002.  While hugetlbfs remains useful, it is also viewed as a sort of\nsecond memory-management subsystem that would be best unified with the rest\nof the kernel.  At the 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit, Peter Xu raised the\nquestion of what that unification would involve and what the first steps\nmight be.",
          "link": "https://lwn.net/Articles/974491/",
          "publishedOn": "2024-05-22T16:53:09.000Z",
          "wordCount": null,
          "title": "[$] Toward the unification of hugetlbfs",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/973782/",
          "author": "jzb",
          "description": "KeePassXC is an open-source (GPLv3),\ncross-platform password manager with local-only data storage. The\nproject comes with a number of build\noptions that can be used to toggle optional features, such as browser\nintegration and password\ndatabase sharing. However, controversy ensued when Debian Developer Julian Klode decided to\nmake use of these compile flags to disable these features to improve security in the\nkeepassxc package uploaded to Debian unstable for the\nupcoming Debian 13 (\"Trixie\") release.",
          "link": "https://lwn.net/Articles/973782/",
          "publishedOn": "2024-05-22T16:30:54.000Z",
          "wordCount": null,
          "title": "[$] The KeePassXC kerfuffle",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974487/",
          "author": "corbet",
          "description": "The 2024 Linux\nStorage, Filesystem, Memory-Management and BPF Summit was a development\nconference, where discussion was prioritized and presentations with a lot\nof slides were discouraged.  Paul McKenney seemingly flouted this\nconvention in a joint session of the storage, filesystem, and\nmemory-management tracks where he presented about 50 slides — in five\nminutes, twice.  The subject was the use of the read-copy-update (RCU)\nmechanism in the memory-reclaim process, and whether changes to RCU would\nbe needed for that purpose.",
          "link": "https://lwn.net/Articles/974487/",
          "publishedOn": "2024-05-22T15:40:03.000Z",
          "wordCount": null,
          "title": "[$] The interaction between memory reclaim and RCU",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974576/",
          "author": "jzb",
          "description": "Version\n3.20.0 of the Alpine Linux\ndistribution has been released with initial support for 64-bit\nRISC-V. Other important changes include updates to GNOME 46, \nKDE Plasma 6, and replacing Redis with Valkey due to Redis's\nadoption of a non-free\nlicense model. See the release\nnotes for more on this release.",
          "link": "https://lwn.net/Articles/974576/",
          "publishedOn": "2024-05-22T15:09:27.000Z",
          "wordCount": 165,
          "title": "Alpine Linux 3.20.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974392/",
          "author": "corbet",
          "description": "Looking up a virtual memory area (VMA) in a process's address space, for\nthe handling of page faults or any of a number of other tasks, in\nmulti-threaded processes has long been bedeviled by lock contention in the\nkernel.  As a result, developer gatherings have been subjected to many\nsessions on how to improve the situation.  At the 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit, developers in the\nmemory-management track met, in a session led by Liam Howlett, to talk\nabout a situation that has improved considerably in recent times, but which\nstill offers opportunities for optimization.",
          "link": "https://lwn.net/Articles/974392/",
          "publishedOn": "2024-05-22T13:55:33.000Z",
          "wordCount": null,
          "title": "[$] Faster page faults with RCU-protected VMA walks",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974572/",
          "author": "jzb",
          "description": "Security updates have been issued by Debian (webkit2gtk), Fedora (kernel), Mageia (chromium-browser-stable, djvulibre, gdk-pixbuf2.0, nss & firefox, postgresql15 & postgresql13, python-pymongo, python-sqlparse, stb, thunderbird, and vim), Red Hat (go-toolset:rhel8, nodejs, and varnish:6), SUSE (gitui, glibc, and kernel), and Ubuntu (libspreadsheet-parseexcel-perl, linux-aws, linux-aws-5.15, linux-gke, linux-gcp, python-idna, and thunderbird).",
          "link": "https://lwn.net/Articles/974572/",
          "publishedOn": "2024-05-22T13:28:38.000Z",
          "wordCount": 261,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974363/",
          "author": "daroc",
          "description": "Vineeth Pillai gave a remote talk at the 2024\nLinux Storage,\nFilesystem, Memory Management, and BPF Summit explaining how BPF could be\nused to improve the performance of virtual machines (VMs). Pillai has\n\na patch\nset designed to let guest and host machines share scheduling information in\norder to eliminate some of the overhead of running in a VM. The assembled\ndevelopers had several comments on the design, but seemed overall to approve of\nthe prospect.",
          "link": "https://lwn.net/Articles/974363/",
          "publishedOn": "2024-05-22T13:18:31.000Z",
          "wordCount": null,
          "title": "[$] Virtual machine scheduling with BPF",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974390/",
          "author": "corbet",
          "description": "Brendan Jackman started his memory-management-track session at the 2024 Linux Storage,\nFilesystem, Memory-Management and BPF Summit by saying that, for some\nyears now, the kernel community has been stuck in a reactive posture with\nregard to hardware vulnerabilities.  Each problem shows up with its own\nscary name, and kernel developers find a way to mitigate it, usually losing\nperformance in the process.  Jackman said that it is time to take back the\ninitiative against these vulnerabilities by reconsidering the more\ngeneral use of address-space isolation.",
          "link": "https://lwn.net/Articles/974390/",
          "publishedOn": "2024-05-21T22:35:12.000Z",
          "wordCount": null,
          "title": "[$] Another try for address-space isolation",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974380/",
          "author": "corbet",
          "description": "Optimizing the kernel's memory use is made much easier if developers have\nan accurate idea of how memory is being used, but the kernel's\ninstrumentation is not as good as it could be.  When Suren Baghdasaryan and\nKent Overstreet presented their\nmemory-allocation profiling work, which is meant to address this\nshortcoming, at the 2023 Linux Storage, Filesystem, Memory Management, and\nBPF Summit, their objective was uncontroversial but the proposed solution\nran into opposition that played out at length on the mailing lists (example)\nover the last year.  So it may be a bit surprising that, when the two\nreturned to the memory-management track in the 2024 gathering, the\ncontroversy was gone and the discussion focused on improving details of the\nimplementation.",
          "link": "https://lwn.net/Articles/974380/",
          "publishedOn": "2024-05-21T20:34:35.000Z",
          "wordCount": null,
          "title": "[$] Memory-allocation profiling for the kernel",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974488/",
          "author": "jzb",
          "description": "The AlmaLinux project has announced\nthe formation of the AlmaLinux Engineering\nSteering Committee (ALESCo):\nThe initial members of ALESCo appointed by the AlmaLinux OS\nFoundation board are Andrew Lukoshko, Ben Thomas, Cody Robertson,\nElkhan Mammadli, Jonathan Wright, and Neal Gompa. The AlmaLinux Wiki has\nmore information on the committee's activities and how to get involved.",
          "link": "https://lwn.net/Articles/974488/",
          "publishedOn": "2024-05-21T16:11:22.000Z",
          "wordCount": null,
          "title": "AlmaLinux forms engineering steering committee",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974367/",
          "author": "corbet",
          "description": "The kernel stack is a scarce and tightly constrained resource; kernel\ndevelopers often have to go far out of their way to avoid using too much\nstack space.  The size of the stack is also fixed, leading to situations\nwhere it is too small for some code paths, while wastefully large for\nothers.  At the 2024 Linux Storage,\nFilesystem, Memory Management, and BPF Summit, Pasha Tatashin proposed\nmaking the kernel stack size dynamic, making more space available when\nneeded while saving memory overall.  This change is not as easy to\nimplement as it might seem, though.",
          "link": "https://lwn.net/Articles/974367/",
          "publishedOn": "2024-05-21T15:37:03.000Z",
          "wordCount": null,
          "title": "[$] Dynamically sizing the kernel stack",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974223/",
          "author": "corbet",
          "description": "The page\nstructure is a complicated beast, but some parts of it are more\nintimidating than others.  The mapcount field is one of the\nscarier parts.  It allegedly records the number of references to the page\nin page tables, but, as David Hildenbrand described during the\nmemory-management track at the 2024 Linux Storage,\nFilesystem, Memory Management, and BPF Summit, things are more\ncomplicated than that.  Few people truly understand the semantics of this\nfield, but the situation will hopefully get better over time.",
          "link": "https://lwn.net/Articles/974223/",
          "publishedOn": "2024-05-21T12:54:06.000Z",
          "wordCount": null,
          "title": "[$] Facing down mapcount madness",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974450/",
          "author": "corbet",
          "description": "Security updates have been issued by AlmaLinux (firefox, nodejs, and thunderbird), Fedora (uriparser), Oracle (firefox and thunderbird), Slackware (mariadb), SUSE (cairo, gdk-pixbuf, krb5, libosinfo, postgresql14, and python310), and Ubuntu (firefox, linux-aws, linux-aws-5.15, and linux-azure).",
          "link": "https://lwn.net/Articles/974450/",
          "publishedOn": "2024-05-21T12:52:17.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974138/",
          "author": "corbet",
          "description": "There are two fundamental levels of memory allocator in the Linux kernel:\nthe page allocator, which allocates memory in units of pages, and the slab\nallocator, which allocates arbitrarily-sized chunks that are usually (but\nnot necessarily) smaller than a page.  The slab allocator is the one that\nstands behind commonly used kernel functions like kmalloc().  At\nthe 2024 Linux\nStorage, Filesystem, Memory Management, and BPF Summit, slab maintainer\nVlastimil Babka provided an update on recent changes at the slab level and\ndiscussed the changes that are yet to come.",
          "link": "https://lwn.net/Articles/974138/",
          "publishedOn": "2024-05-20T18:28:56.000Z",
          "wordCount": null,
          "title": "[$] What's next for the SLUB allocator",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974102/",
          "author": "daroc",
          "description": "David Vernet kicked off the BPF track at 2024's BPF track at the\nLinux Storage,\nFilesystem, Memory Management, and BPF Summit\nwith a\ntalk about polymorphic kfuncs — or, with less jargon, kernel functions that can\nbe called from BPF which use different implementations depending on context.\nHe explained how this would be useful to\nthe sched_ext BPF scheduling framework,\nbut expected it to be helpful in\nother areas as well.",
          "link": "https://lwn.net/Articles/974102/",
          "publishedOn": "2024-05-20T15:58:17.000Z",
          "wordCount": null,
          "title": "[$] A plan to make BPF kfuncs polymorphic",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974126/",
          "author": "corbet",
          "description": "The term \"memory tiering\" refers to the management of memory placement on\nsystems with multiple types of memory, each of which has its own\nperformance characteristics.  On such systems, poor placement can lead to\nsignificantly worse performance.  A memory-management-track discussion at\nthe 2024 Linux Storage,\nFilesystem, Memory Management, and BPF Summit took yet another look at\ntiering challenges with a focus on upcoming technologies that may simplify\n(or complicate) the picture.",
          "link": "https://lwn.net/Articles/974126/",
          "publishedOn": "2024-05-20T14:21:07.000Z",
          "wordCount": null,
          "title": "[$] Better support for locally-attached-memory tiering",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/973130/",
          "author": "jzb",
          "description": "As the shiny new KDE Plasma 6 desktop makes its way into distribution\nreleases, a small group of developers is still trying to preserve the\nKDE experience circa 2008. The Trinity Desktop Environment\n(TDE), is a continuation of KDE 3 that has maintained the\nold-school desktop with semi-regular releases since 2010. The most\nrecent release, R14.1.2,\nwas announced\non April 28. TDE does deliver a usable retro desktop, but with\nsome limitations that hamper its usability on modern systems.",
          "link": "https://lwn.net/Articles/973130/",
          "publishedOn": "2024-05-20T14:14:36.000Z",
          "wordCount": null,
          "title": "[$] Trinity keeps KDE 3 on life support",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974341/",
          "author": "corbet",
          "description": "Jens Axboe describes\nthe new io_uring features that will be a part of the 6.10 kernel\nrelease.\n\n\n\tBundles are multiple buffers used in a single operation. On the\n\treceive side, this means a single receive may utilize multiple\n\tbuffers, reducing the roundtrip through the networking stack from N\n\tper N buffers to just a single one. On the send side, this also\n\tenables better handling of how an application deals with sends from\n\ta socket, eliminating the need to serialize sends on a single\n\tsocket. Bundles work with provided buffers, hence this feature also\n\tadds support for provided buffers for send operations.",
          "link": "https://lwn.net/Articles/974341/",
          "publishedOn": "2024-05-20T13:09:46.000Z",
          "wordCount": null,
          "title": "Axboe: What's new with io_uring in 6.10",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974339/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (bind9, chromium, and thunderbird), Fedora (buildah, chromium, firefox, mingw-python-werkzeug, and suricata), Mageia (golang), Oracle (firefox and nodejs:20), Red Hat (firefox, httpd:2.4, nodejs, and thunderbird), and SUSE (firefox, git-cliff, and ucode-intel).",
          "link": "https://lwn.net/Articles/974339/",
          "publishedOn": "2024-05-20T12:54:25.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/973964/",
          "author": "corbet",
          "description": "Non-uniform memory access (NUMA) systems are organized with their CPUs\ngrouped into nodes, each of which has memory attached to it.  All memory in\nthe system is accessible from all CPUs, but memory attached to the local\nnode is faster.  The kernel's memory-policy\n(\"mempolicy\") interface allows threads to inform the kernel about how\nthey would like their memory placed to get the best performance.  In recent\nyears, the NUMA concept has been extended to support the management of\ndifferent types of memory in a system, pushing the limits of the mempolicy\nsubsystem.  In a remotely presented session at the 2024 Linux Storage,\nFilesystem, Memory Management, and BPF Summit, Gregory Price discussed\nthe ways in which the kernel's memory-policy support should evolve to\nhandle today's more-complex systems.",
          "link": "https://lwn.net/Articles/973964/",
          "publishedOn": "2024-05-18T14:10:29.000Z",
          "wordCount": null,
          "title": "[$] Extending the mempolicy interface for heterogeneous systems",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "M0AGX / LB9MG",
      "feedUrl": "https://m0agx.eu/feeds/all.rss.xml",
      "siteUrl": "https://m0agx.eu/",
      "articles": [
        {
          "id": "tag:m0agx.eu,2024-06-08:/parallel-adc-and-sam-e70.html",
          "author": null,
          "description": "ADCs come in all shapes and sizes. Converters built into MCUs made great progress across the years\nbut sometimes you need a dedicated discrete ADC. At the extremes of the \"speed spectrum\"\nthere are \"slow but precise\" ADCs (that tend to use SPI or I2C),\nand absolute monsters with SerDes outputs that can only be consumed by an FPGA.\nMy application needed an ADC from the middle ground but with multiple channels and simultaneous sampling.\nInterfacing a medium-speed multichannel ADC to an SAM E70 MCU turned out more interesting than I wished for. 😊",
          "link": "https://m0agx.eu/parallel-adc-and-sam-e70.html",
          "publishedOn": "2024-06-08T00:00:00.000Z",
          "wordCount": null,
          "title": "Connecting a high speed parallel ADC to SAM E70",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://martinfowler.com/articles/tdd-html-templates.html#Round-tripToTheServer",
          "author": null,
          "description": "Matteo Vaccari completes his article on testing\n         template-generated HTML, by looking at how to use TDD with pages that make\n         calls to the server.\nmore…",
          "link": "https://martinfowler.com/articles/tdd-html-templates.html#Round-tripToTheServer",
          "publishedOn": "2024-06-05T13:00:00.000Z",
          "wordCount": null,
          "title": "Testing server calls in generated HTML",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/tdd-html-templates.html#Level3TestingHtmlBehaviour",
          "author": null,
          "description": "In the story so far, Matteo Vaccari has shown how\n         to test the behaviour of the HTML templates,\n         by checking the structure of the generated HTML. That's good, but what\n         if we want to test the behavior of the HTML itself, plus any CSS and\n         JavaScript it may use?\nmore…",
          "link": "https://martinfowler.com/articles/tdd-html-templates.html#Level3TestingHtmlBehaviour",
          "publishedOn": "2024-05-30T12:42:00.000Z",
          "wordCount": null,
          "title": "Testing the behavior of generated HTML",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/tdd-html-templates.html#MakeItEasyToAddNewTests",
          "author": null,
          "description": "Testing templates for generating HTML leads to tests that are very\n        similar. Matteo Vaccari wisely likes to separate the\n        common elements of tests from those that vary. He continues\n        his article to show how he does this by\n        parameterizing the tests. The resulting tests are\n        easier to write, and more importantly, faster to understand and modify.\nmore…",
          "link": "https://martinfowler.com/articles/tdd-html-templates.html#MakeItEasyToAddNewTests",
          "publishedOn": "2024-05-29T14:44:00.000Z",
          "wordCount": null,
          "title": "Parameterizing HTML template tests",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/data-fetch-spa.html#prefetching",
          "author": null,
          "description": "Juntao Qiu's completes his set of data fetching\n      patterns for single-page applications. Prefetching involves fetching data\n      before it's called for in the application flow. Although this can mean\n      data is fetched unnecessarily, it reduces latency should the data be needed.\nmore…",
          "link": "https://martinfowler.com/articles/data-fetch-spa.html#prefetching",
          "publishedOn": "2024-05-29T14:24:00.000Z",
          "wordCount": null,
          "title": "Prefetching in Single-Page Applications",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/data-fetch-spa.html#IntroducingUserdetailcardComponent",
          "author": null,
          "description": "Single-Page Applications often require a lot of code to be downloaded\n       to the browser, which can delay a page's initial\n       appearance. Juntao Qiu's next pattern, Code Splitting,\n       describes how this code can be divided up, so that modules are only\n       loaded if they are going to be needed, and the dangers of doing so.\nmore…",
          "link": "https://martinfowler.com/articles/data-fetch-spa.html#IntroducingUserdetailcardComponent",
          "publishedOn": "2024-05-23T14:26:00.000Z",
          "wordCount": null,
          "title": "Code Splitting in Single-Page Applications",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/2024-footnote-rendering.html",
          "author": null,
          "description": "Last week I added a small feature to this website, changing the way it\n       renders footnotes. That prompted me to write this quick note about how I\n       use footnotes, and how that influences the best way to render them.\nmore…",
          "link": "https://martinfowler.com/articles/2024-footnote-rendering.html",
          "publishedOn": "2024-05-22T18:17:00.000Z",
          "wordCount": 727,
          "title": "A short note on how I use and render footnotes",
          "imageUrl": "https://martinfowler.com/logo-sq.png"
        },
        {
          "id": "https://martinfowler.com/articles/tdd-html-templates.html#Level2TestingHtmlStructure",
          "author": null,
          "description": "Matteo Vaccari continues his testing of\n       template-generated HTML by describing tests for the contents of that\n       HTML. He shows how to gradually build up the template, using Test-Driven\n       Development in Go and Java. \nmore…",
          "link": "https://martinfowler.com/articles/tdd-html-templates.html#Level2TestingHtmlStructure",
          "publishedOn": "2024-05-22T14:14:00.000Z",
          "wordCount": 3330,
          "title": "Testing the contents of generated HTML",
          "imageUrl": "https://martinfowler.com/articles/tdd-html-templates/card.png"
        },
        {
          "id": "https://martinfowler.com/articles/data-fetch-spa.html#fallback-markup",
          "author": null,
          "description": "Juntao Qiu's next data fetching pattern looks at how to specify\n       fallback behavior using markup. This allows developers to\n       pull such declarations out of the JavaScript components and into the\n       markup they use while laying out the rest of the page. Juntao's React\n       example shows how this works with the Suspense element, with a similar\n       approach in vue.js.\nmore…",
          "link": "https://martinfowler.com/articles/data-fetch-spa.html#fallback-markup",
          "publishedOn": "2024-05-21T15:30:00.000Z",
          "wordCount": null,
          "title": "Using markup for fallbacks when fetching data",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/tdd-html-templates.html",
          "author": null,
          "description": "When building a server-side rendered web application, it's valuable\n       to test the HTML that's generated through templates. While these can be\n       tested through end-to-end tests running in the browser, such tests are\n       slow and more work to maintain than unit tests. My colleague\n       Matteo Vaccari has written an article on how to use TDD\n       to test drive these templates using xunit-style tools which can be run\n       easily from the command line or as part of build scripts.\nIn this first installment Matteo describes how such tests can check the\n       generated HTML for validity, with examples in Java and Go.\nmore…",
          "link": "https://martinfowler.com/articles/tdd-html-templates.html",
          "publishedOn": "2024-05-21T15:06:00.000Z",
          "wordCount": null,
          "title": "Test-Driving HTML Templates",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "MCU on Eclipse",
      "feedUrl": "https://mcuoneclipse.com/feed/",
      "siteUrl": "https://mcuoneclipse.com",
      "articles": [
        {
          "id": "http://mcuoneclipse.com/?p=40717",
          "author": "Erich Styger",
          "description": "The NXP i.MX RT685 features an ARM Cortex M33 with a Cadence Xtensa audio DSP. To use the NXP EVK board with pyOCD, additional device support is required. By installing the RT685 packs, it becomes easy to debug with pyOCD using Eclipse/MCUXpresso for the NXP i.MX RT685 target board. Happy debugging! Continue reading →",
          "link": "https://mcuoneclipse.com/2024/06/14/using-nxp-i-mx-rt685-with-pyocd-device-support-and-debugging-configuration/",
          "publishedOn": "2024-06-13T23:17:00.000Z",
          "wordCount": null,
          "title": "Using NXP i.MX RT685 with pyOCD: Device Support and Debugging Configuration",
          "imageUrl": null
        },
        {
          "id": "http://mcuoneclipse.com/?p=40522",
          "author": "Erich Styger",
          "description": "In Europe, companies are focusing on sustainability due to the ongoing energy crisis. Embedded engineers are taking action to minimize energy consumption from electronic devices. This article demonstrates the possibility of reducing energy consumption by factor 100 or more and provides insights on low power optimizations using the ARM Cortex microcontroller. It uses tools such as NXP MCUXpresso IDE and MCU-Link Pro for measurements and demonstrations. The article explores low power optimization steps such as reducing voltage, frequency, and using low power modes, achieving significant energy savings. It provides a comprehensive overview of the concepts and practical techniques for reducing energy consumption. The project is shared on GitHub for reference. Continue reading →",
          "link": "https://mcuoneclipse.com/2024/05/22/low-power-optimization-techniques-for-arm-cortex-m0-microcontrollers/",
          "publishedOn": "2024-05-22T00:28:00.000Z",
          "wordCount": 7950,
          "title": "Low-Power Optimization Techniques for ARM Cortex-M Microcontrollers",
          "imageUrl": "https://mcuoneclipse.com/wp-content/uploads/2024/05/freertos-with-wfi.jpg"
        },
        {
          "id": "http://mcuoneclipse.com/?p=40588",
          "author": "Erich Styger",
          "description": "Eclipse offers various ways to build projects, including a built-in builder, external tools like make or cmake, and custom scripts for advanced needs. By setting the C/C++ Build settings to 'External Builder,' a script can be used in place of the compiler for custom steps. However, portability issues may arise between different host machines. Nonetheless, using custom scripts allows for flexibility in the build process. Continue reading →",
          "link": "https://mcuoneclipse.com/2024/05/21/building-eclipse-projects-with-custom-external-shell-scripts/",
          "publishedOn": "2024-05-21T08:20:57.000Z",
          "wordCount": null,
          "title": "Building Eclipse Projects with custom external Shell Scripts",
          "imageUrl": null
        },
        {
          "id": "http://mcuoneclipse.com/?p=40503",
          "author": "Erich Styger",
          "description": "The new PCBs for the MCU-Link MR for drones and robots have arrived. With the parts populated, it serves as a UART bridge and debug probe for the PixHawk. The main improvement was fixing the UART connection, and changes include a new PCB color and a push button replacing the ISP firmware update jumper. Files and BOM on GitHub have been updated.  Continue reading →",
          "link": "https://mcuoneclipse.com/2024/05/19/mcu-link-mr-v0-2-drone-and-robot-debug-probe-with-uart-2-usb-bridge/",
          "publishedOn": "2024-05-19T08:17:00.000Z",
          "wordCount": null,
          "title": "MCU-Link-MR v0.2 Drone and Robot Debug Probe with UART-2-USB Bridge",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The ESP Journal - Medium",
      "feedUrl": "https://medium.com/feed/the-esp-journal",
      "siteUrl": "https://blog.espressif.com?source=rss----d5414d5dee73---4",
      "articles": []
    },
    {
      "title": "/* the devil is in the detail */",
      "feedUrl": "https://minjang.github.io/feed.xml",
      "siteUrl": "http://minjang.github.io/",
      "articles": []
    },
    {
      "title": "mingrammer's note",
      "feedUrl": "https://mingrammer.com/index.xml",
      "siteUrl": "https://mingrammer.com/",
      "articles": []
    },
    {
      "title": "Novel Bits",
      "feedUrl": "https://www.novelbits.io/feed",
      "siteUrl": "https://novelbits.io/",
      "articles": []
    },
    {
      "title": "null program",
      "feedUrl": "https://nullprogram.com/feed/",
      "siteUrl": "https://nullprogram.com",
      "articles": [
        {
          "id": "https://nullprogram.com/blog/2024/05/25/",
          "author": null,
          "description": "I continue to streamline an arena-based paradigm, and stumbled\nupon a concise technique for dynamic growth — an efficient, generic\n“concatenate anything to anything” within an arena built atop a core of\n9-ish lines of code. The key insight originated from a reader suggestion\nabout dynamic arrays. The subject of concatenation can be a string,\ndynamic array, or even something else. The “system” is extensible, and\nespecially useful for path handling.\nContinuing from last time, the examples are in light, C-style C++.\nI chose it because templates and function overloading express the concepts\nsuccinctly. It uses no standard library functionality, so converting to C,\nor similar, should be straightforward. The core concatenation “operator”:\n\ntemplate<typename T>\nT concat(arena *a, T head, T tail)\n…",
          "link": "https://nullprogram.com/blog/2024/05/25/",
          "publishedOn": "2024-05-25T00:00:00.000Z",
          "wordCount": 1666,
          "title": "Arenas and the almighty concatenation operator",
          "imageUrl": null
        },
        {
          "id": "https://nullprogram.com/blog/2024/05/24/",
          "author": null,
          "description": "Occasionally we need to compute the size of an object that does not yet\nexist, or a subscript that may fall out of bounds. It’s easy to miss\nthe edge cases where results overflow, creating a nasty, subtle bug, even\nin the presence of type safety. Ideally such computations happen in\nspecialized code, such as inside an allocator (calloc, reallocarray)\nand not outside by the allocatee (i.e. malloc). Mitigations exist with\ndifferent trade-offs: arbitrary precision, or using a wider fixed integer\n— i.e. 128-bit integers on 64-bit hosts. In the typical case, working only\nwith fixed size-type integers, I’ve come up with a set of guidelines to\navoid overflows in the edge cases.\nRange check before computing a result. No exceptions.\nDo not cast unless you know a priori the operand is in range.\nNever…",
          "link": "https://nullprogram.com/blog/2024/05/24/",
          "publishedOn": "2024-05-24T22:25:10.000Z",
          "wordCount": 1145,
          "title": "Guidelines for computing sizes and subscripts",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Almost Secure",
      "feedUrl": "https://palant.info/rss.xml",
      "siteUrl": "https://palant.info/",
      "articles": []
    },
    {
      "title": "Preshing on Programming",
      "feedUrl": "http://preshing.com/feed",
      "siteUrl": "https://preshing.com/feed",
      "articles": []
    },
    {
      "title": "research!rsc",
      "feedUrl": "https://research.swtch.com/feed.atom",
      "siteUrl": "http://research.swtch.com/feed.atom",
      "articles": []
    },
    {
      "title": "AEP코리아네트",
      "feedUrl": "https://rss.blog.naver.com/aepkoreanet.xml",
      "siteUrl": "https://blog.naver.com/aepkoreanet?fromRss=true&trackingCode=rss",
      "articles": []
    },
    {
      "title": "애자일 이야기",
      "feedUrl": "http://rss.egloos.com/blog/agile",
      "siteUrl": "http://agile.egloos.com",
      "articles": []
    },
    {
      "title": "The Shape of Code",
      "feedUrl": "https://shape-of-code.com/feed/",
      "siteUrl": "https://shape-of-code.com",
      "articles": [
        {
          "id": "https://shape-of-code.com/?p=8852",
          "author": "Derek Jones",
          "description": "How much source code exists in a particular language? Traditionally, indicators of the quantity of source in a language is the number of people making a living working on software written in the language. Job adverts are a proxy for the number of people employed to write/support programs implemented in a language (i.e., number of […]",
          "link": "https://shape-of-code.com/2024/06/09/quantity-of-source-in-a-given-language/",
          "publishedOn": "2024-06-09T22:00:55.000Z",
          "wordCount": null,
          "title": "Quantity of source in a given language",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=8824",
          "author": "Derek Jones",
          "description": "Training a large language model to be a coding assistant requires huge amounts of source code. Github is a very well known publicly available repository of code, and various sites have created substantial collections of GitHub repos, e.g., GitTorrent, and Google’s BigQuery. Since 2017 the Software Heritage has been amassing the world’s source code, and […]",
          "link": "https://shape-of-code.com/2024/06/02/obtaining-source-code-for-training-llms/",
          "publishedOn": "2024-06-02T21:41:12.000Z",
          "wordCount": null,
          "title": "Obtaining source code for training LLMs",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=8811",
          "author": "Derek Jones",
          "description": "In the physical sciences, measurement error occurs because of accuracy limits on the device used to make the measurement and the interpretation of the data by the person doing the measurement. In software engineering, some measurements appear to be error free. For instance, lines of code is a discrete value that is easily counted. While […]",
          "link": "https://shape-of-code.com/2024/05/26/sampling-error-in-software-engineering/",
          "publishedOn": "2024-05-26T21:39:19.000Z",
          "wordCount": null,
          "title": "Sampling error in software engineering",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=8779",
          "author": "Derek Jones",
          "description": "When estimating the time needed to implement a task, the time previously needed to implement similar tasks provides useful guidance. The implementation time for these previous tasks may itself be estimated, because the actual time was not measured or this information is currently unavailable. How accurate are developer time estimates of previously completed tasks? I […]",
          "link": "https://shape-of-code.com/2024/05/19/a-surprising-retrospective-task-estimation-dataset/",
          "publishedOn": "2024-05-19T21:22:07.000Z",
          "wordCount": null,
          "title": "A surprising retrospective task estimation dataset",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Stacey on IoT | Internet of Things news and analysis",
      "feedUrl": "https://staceyoniot.com/feed/",
      "siteUrl": "https://staceyoniot.com/",
      "articles": []
    },
    {
      "title": "Blog – Modern Embedded Software | Quantum Leaps",
      "feedUrl": "https://www.state-machine.com/category/blog/feed",
      "siteUrl": "https://www.state-machine.com",
      "articles": []
    },
    {
      "title": "IT의 중심에서",
      "feedUrl": "https://subokim.wordpress.com/feed/",
      "siteUrl": "https://subokim.wordpress.com",
      "articles": []
    },
    {
      "title": "코드쓰는사람",
      "feedUrl": "https://taegon.kim/feed",
      "siteUrl": "https://taegon.kim",
      "articles": []
    },
    {
      "title": "The Pasture",
      "feedUrl": "https://thephd.dev/feed",
      "siteUrl": "https://thephd.dev/",
      "articles": [
        {
          "id": "https://thephd.dev/just-put-raii-in-c-bro-please-bro-just-one-more-destructor-bro-cmon-im-good-for-it",
          "author": null,
          "description": "Ever since I finished publishing the “defer” paper and successfully defended it on its first go-around (it now has tentative approval to go to a Technical Specification, I just need to obtain the necessary written boilerplate to do so), an old criticism",
          "link": "https://thephd.dev/just-put-raii-in-c-bro-please-bro-just-one-more-destructor-bro-cmon-im-good-for-it",
          "publishedOn": "2024-05-21T00:00:00.000Z",
          "wordCount": null,
          "title": "Why Not Just Do Simple C++ RAII in C?",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Vivonomicon's Blog",
      "feedUrl": "https://vivonomicon.com/feed/",
      "siteUrl": "https://vivonomicon.com",
      "articles": []
    },
    {
      "title": "zserge's blog",
      "feedUrl": "https://zserge.com/rss.xml",
      "siteUrl": "https://zserge.com/",
      "articles": []
    },
    {
      "title": "The Boston Globe",
      "feedUrl": "https://www.bostonglobe.com/rss/bigpicture",
      "siteUrl": "https://www.bostonglobe.com",
      "articles": []
    },
    {
      "title": "이바닥늬우스",
      "feedUrl": "https://ebadak.news/feed",
      "siteUrl": "https://ebadak.news",
      "articles": []
    },
    {
      "title": "economic view",
      "feedUrl": "http://feeds.feedburner.com/Economic_View",
      "siteUrl": "http://economicview.net",
      "articles": []
    },
    {
      "title": "슬로우뉴스.",
      "feedUrl": "https://feeds.feedburner.com/slownews",
      "siteUrl": "https://slownews.kr",
      "articles": [
        {
          "id": "https://slownews.kr/?p=110180",
          "author": "이정환",
          "description": "[슬로우리포트] SPC 사망 사고 그 이후. 제빵 원료를 만드는 공장에서 일하던 노동자가 소스 배합기에 끼어 숨지는 사고가 있었다. 사람이 죽어나간 그 자리에서 동료 노동자들은 계속 공장을 돌렸다. 다음날 빈소에 찾아온 회사 직원들은 크림빵과 단팥빵을 두 상자 내려놓고 갔다. 한국 최대 규모 제빵 프랜차이즈를 거느린 SPC 그룹 계열사 SPL에서 벌어진 일이다. 유족들은 울부짖었다. “우리 아이가 이...\nThe post SPC라고 왜 말을 못하나: 우리는 피에 젖은 빵을 먹고 있다. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/110180",
          "publishedOn": "2024-06-14T09:25:14.000Z",
          "wordCount": null,
          "title": "SPC라고 왜 말을 못하나: 우리는 피에 젖은 빵을 먹고 있다.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=110169",
          "author": "민주언론시민연합",
          "description": "전북 부안에서 6월 12일 오전 8시 26분경 규모 4.8의 지진이 발생했습니다. 2016년 경북 경주의 규모 5.8 지진을 시작으로 경북 포항, 충북 괴산에 이어 전북 부안에서 올해 들어 최대 규모의 지진이 일어난 것입니다. 수도권 등에서도 감지될 만큼 강진이었는데요. 지진 규모와 더불어 한반도가 더 이상 지진 안전지대가 아니라는 위기감에 언론도 긴급히 보도했습니다. 그러나 KBS는 해외순방 중인 대통령의...\nThe post 석열바라기 KBS: 순방 중에도 “지진 피해 신속 파악” 개별 보도 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/110169",
          "publishedOn": "2024-06-14T04:33:36.000Z",
          "wordCount": null,
          "title": "석열바라기 KBS: 순방 중에도 “지진 피해 신속 파악” 개별 보도",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=110142",
          "author": "이정환",
          "description": "존재감 없는 국민의힘. 쟁점과 현안. 이화영 재판 판사, 이재명 재판도 맡는다. “나도 ‘배우자’더러 받으라고 해야겠네.” 나쁜 풍선인지 좋은 풍선인지 까봐야 안다? 더 깊게 읽기. 탄핵은 훨씬 더 어려워졌다. 탄핵이 불행인가. “언론이 없으면 얼마나 좋겠나.” 당심과 민심 8:2. 더 깊게 읽기. 경찰 판 ‘스포트라이트’. 우리 PB 상품을 맨 위에. 오늘의 TMI. 요즘 개인택시 수입 월 700만...\nThe post 탄핵 훨씬 어려워졌다 Vs. 더 큰 불행 막아야 한다: 슬로우레터 6월14일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/110142",
          "publishedOn": "2024-06-13T22:20:29.000Z",
          "wordCount": null,
          "title": "탄핵 훨씬 어려워졌다 Vs. 더 큰 불행 막아야 한다: 슬로우레터 6월14일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109384",
          "author": "민노씨",
          "description": "[제네바 오전 8시] 이상헌(ILO 고용정책국장)의 노동과 세계 그리고 인간에 관한 이야기 강약약강 국회가 5인 미만 사업장에 대한 근로기준법 전면 적용 논의를 본격적으로 시작한다. 1989년 최저임금, 주휴수당, 퇴직금 등 일부 조항만 예외적으로 적용하기로 개정한 지 32년 만이다. 김윤나영(경향신문), 노동권 사각지대 ‘5인 미만 사업장’ 근로기준법 적용, 이번엔 될까?, 2021.12.15. 중대재해처벌법은 2022년 1월부터 50명 이상 사업장을 대상으로 시행됐다....\nThe post 5인 미만 사업장은 언제나 시기상조 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109384",
          "publishedOn": "2024-06-13T05:48:29.000Z",
          "wordCount": null,
          "title": "5인 미만 사업장은 언제나 시기상조",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=110089",
          "author": "이정환",
          "description": "이재명 다섯번째 기소. 핵심은 ‘보고 받았나’. 일주일에 사흘은 법원에서. 쟁점과 현안. 재판 속도에 달렸다. ‘이재명 대통령’이라는 코끼리. “디올 백 준 게 외국인이라.” 더 깊게 읽기. 고용률은 역대 최고, 청년 취업은 하락 전환. 8표 이탈, 김건희 특검법이 가능성 높다. 다르게 읽기. “심판도 선출해야.” 어머니의 편지와 사단장의 탄원서. 헌재는 대북 전단 방관하라고 한 적 없다. 해법과 대안....\nThe post “외국인에게 받은 디올 백이라”… 권익위의 상상초월 답변: 슬로우레터 6월13일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/110089",
          "publishedOn": "2024-06-12T22:10:43.000Z",
          "wordCount": null,
          "title": "“외국인에게 받은 디올 백이라”… 권익위의 상상초월 답변: 슬로우레터 6월13일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=110066",
          "author": "슬로우뉴스",
          "description": "[특별 기고] 우토로 마을 방화 사건(2021) 피해자 재일조선인 변호인 도요후쿠 세이지를 비언론인 최초로 안종필 언론상을 받은 김보라미 변호사가 인터뷰했습니다. 왜 재일 한국·조선인에 대한 증오가 눈에 띄는 걸까요. 정부가, 헤이트를 뒤에서 지지하고 있는, 말하자면 ‘정부가 승인한다’라고 하는, ‘위로부터의 헤이트’, ‘관제 헤이트’라고 하는 현상이 있다고 생각합니다. 조선학교만 고교 무상화에서 제외된 사례가 전형적인 예입니다. 왜 국가는 재일조선인 차별에...\nThe post 국가에서 배운 혐오: 조선인 마을을 불태운 증오는 어디에서 왔는가 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/110066",
          "publishedOn": "2024-06-12T16:49:16.000Z",
          "wordCount": null,
          "title": "국가에서 배운 혐오: 조선인 마을을 불태운 증오는 어디에서 왔는가",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=110050",
          "author": "민주언론시민연합",
          "description": "※ 민주언론시민연합은 2차 가해에 해당하는 선정적이고 자극적인 보도에는 바로보기 링크를 걸지 않습니다. 한국성폭력상담소는 6월 5일 ‘2004년 밀양에서 발생한 여자 중학생 집단 성폭행 사건 가해자 신상 공개’에 나선 A유튜브가 피해자(가족) 측 동의를 구했다는 것은 사실이 아니라는 입장을 밝혔습니다. 한국성폭력상담소는 다음과 같은 사실을 알렸습니다. 피해자 의사존중과는 거리가 먼 일방적 영상에 우려를 표하며, 언론 역시 자극적 보도행태를 자제해달라고...\nThe post 밀양 사건 폭로전: 사이버렉카의 거짓말 돈벌이, 언론의 잔인한 받아쓰기 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/110050",
          "publishedOn": "2024-06-12T06:00:53.000Z",
          "wordCount": null,
          "title": "밀양 사건 폭로전: 사이버렉카의 거짓말 돈벌이, 언론의 잔인한 받아쓰기",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=110018",
          "author": "이정환",
          "description": "개원 6일 만에 국회의장 사퇴 결의안. 쟁점과 현안. 조민의 장학금과 김건희의 디올 백. “배우자에 금품, 권익위가 괜찮답니다.” 종결 8표, 송부 7표였다. 더 깊게 읽기. 모든 뉴스는 연결돼 있다. “문제는 속도다.” 경향신문과 한겨레의 논조가 미묘하게 다르다. 다르게 읽기. “800만 달러는 주가 조작 자금.” 다시 등장한 방송 3법. 판사 선출제. 박정훈 변호인이 던진 두 가지 질문. 해법과...\nThe post 9개월 동안 거짓말, 윤석열이 감추려는 진짜 비밀이 뭘까: 슬로우레터 6월12일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/110018",
          "publishedOn": "2024-06-11T22:19:53.000Z",
          "wordCount": null,
          "title": "9개월 동안 거짓말, 윤석열이 감추려는 진짜 비밀이 뭘까: 슬로우레터 6월12일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109996",
          "author": "참여연대 사법감시센터",
          "description": "동의도, 영장도 없이 국가가 내 위치를 추적한다면? 나의 중요한 권리인 사생활의 비밀과 자유는 침해될 수밖에 없습니다. 2020년 5월, 코로나19 팬데믹 당시 정부는 이태원 일대에 있었던 약 1만 명의 위치 정보를 동의 없이 수집했습니다. 수집의 근거가 된 감염병예방법 제76조의2에는 누구를 감염의심자로 볼지, 어떤 정보까지 추적할지, 과도한 사생활 침해는 없는지 제어할 수 있는 보호장치조차 없었습니다. 이에 시민사회단체들은...\nThe post 동의도 영장도 없는 방역 만능주의? 절차와 사생활 보호도 중요하다 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109996",
          "publishedOn": "2024-06-11T05:34:51.000Z",
          "wordCount": null,
          "title": "동의도 영장도 없는 방역 만능주의? 절차와 사생활 보호도 중요하다",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109989",
          "author": "민주언론시민연합",
          "description": "[민언련 이달의 좋은 보도상 인터뷰] 한국일보 세월호 10주기 ‘산 자들의 10년’ 특별기획팀 (2024년 5월 수상자) 2014년 4월 16일. 우리 모두의 아픔으로 남은 세월호 참사가 일어났다. 그러나 정부, 언론, 수사기관 등은 제 역할을 하지 못했다. 가려진 진실, 정부의 책임 회피, 미흡한 책임자 처벌, 유족과 생존자를 향한 왜곡된 비난 속에 온전한 진상규명은 지금도 현재진행형이다. 세 번의 공적...\nThe post 세월호 10년: 세 번의 조사, 가려진 진실, 책임 없는 정부 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109989",
          "publishedOn": "2024-06-11T03:15:43.000Z",
          "wordCount": null,
          "title": "세월호 10년: 세 번의 조사, 가려진 진실, 책임 없는 정부",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109953",
          "author": "이정환",
          "description": "‘배우자’는 받아도 되나. 권익위는 왜 그랬을까. 에코백을 들었다. 쟁점과 현안. 국민의힘이 깔아준 판, 민주당이 상임위 싹쓸이. “법사위만 달라”, 국민의힘 마지막 제안도 거부. 이재명 맞춤형 당헌 개정. 더 깊게 읽기. 대북 전단 왜 안 막나. 대북 확성기 일단 중지. 바이든-트럼프 초박빙 판세. 유럽에서는 극우의 약진. 다르게 읽기. 헌법 84조 논란, 현직 대통령을 법정에 세울 수 있나....\nThe post 디올 백 대신 에코백, 김건희의 발걸음이 가벼웠던 이유: 슬로우레터 6월11일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109953",
          "publishedOn": "2024-06-10T22:11:03.000Z",
          "wordCount": null,
          "title": "디올 백 대신 에코백, 김건희의 발걸음이 가벼웠던 이유: 슬로우레터 6월11일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109903",
          "author": "이정환",
          "description": "풍선 전쟁에 확성기, 그다음은? 1조 원 풀었는데, 의료 대란 최악의 상황. 쟁점과 현안. 3자 뇌물 혐의, 이재명의 네 번째 리스크. 이화영 미스터리. 대북 송금 특검법 갈 수 있을까. 더 깊게 읽기. 이재명의 네 가지 재판. 이재명 재판의 경우의 수. “형사상 소추를 받지 않는다.” 정청래와 최민희 등 선수들 전면 배치. 다르게 읽기. 20% 가능성의 근거는? 설명...\nThe post 이화영 유죄 변수로 보는 이재명 재판의 경우의 수: 슬로우레터 6월10일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109903",
          "publishedOn": "2024-06-09T22:12:03.000Z",
          "wordCount": null,
          "title": "이화영 유죄 변수로 보는 이재명 재판의 경우의 수: 슬로우레터 6월10일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109833",
          "author": "이정환",
          "description": "슬로우레터 구독자 여러분, 안녕하세요. 슬로우뉴스 재창간 1년을 맞아 보내려던 인사가 벌써 몇 달이 지났습니다.슬로우레터는 벌써 300회를 앞두고 있습니다. 오늘은 지난 1년을 돌아보고 슬로우뉴스의 새로운 계획을 말씀드리려고 합니다. 이 글은 세 가지를 담고 있습니다. 슬로우레터의 1년, Q&A으로 풀어볼까요? 아침에 몇 시에 일어나세요? 뉴스를 잘 읽는 방법이 있나요? 좀 더 의견이 들어가도 좋을 것 같습니다. 편향적이라고 비판하는...\nThe post 신호와 소음을 구분하는 방법: 슬로우뉴스의 새로운 제안. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109833",
          "publishedOn": "2024-06-09T05:00:00.000Z",
          "wordCount": 8493,
          "title": "신호와 소음을 구분하는 방법: 슬로우뉴스의 새로운 제안.",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/06/iStock-1168877485.jpg"
        },
        {
          "id": "https://slownews.kr/?p=109811",
          "author": "이정환",
          "description": "[슬로우리포트] 한류 스타들의 일탈? 자본과 권력의 구조적 유착을 봐야 한다. 영국의 공영 방송 BBC가 한국 K-팝의 그늘을 조명했다. ‘버닝썬: K팝 스타들의 비밀 대화방을 폭로한 여성들’이라는 다큐멘터리다. 5년 전 사건을 다룬 영상에 페이지뷰가 1000만 뷰에 육박한다는 건 세상의 관심이 살아있다는 이야기다. 우리가 이미 충분히 잘 알고 있다고 생각했던 사건을 외부의 시선으로 들여다 보니 우리가 놓치고 있는...\nThe post 버닝썬 게이트, 우리가 놓치고 있었던 이야기들. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109811",
          "publishedOn": "2024-06-08T04:22:52.000Z",
          "wordCount": null,
          "title": "버닝썬 게이트, 우리가 놓치고 있었던 이야기들.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109773",
          "author": "이정환",
          "description": "“평화는 힘으로 지킨다.” 오늘 액트지오 기자회견. 영일만 브리핑, 산업부 패싱 논란. 쟁점과 현안. 17일부터 서울대병원 전면 휴진. 방통위원장 탄핵 간다. 다시 나온 언론보도 징벌적 손배 법안. ‘어대한’? 힘 빠진 국민의힘 전당대회. 더 깊게 읽기. 원조 친명과 신친명의 갈등. 44명의 가해자, 누구도 처벌받지 않았다. 사이버 자경단의 사적 제재. 다르게 읽기. “최태원은 일부일처제를 깬 게 아니다.” 저출산과...\nThe post 이재명의 우향우? “민주당이 무섭다”는 말이 나오는 이유: 슬로우레터 6월7일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109773",
          "publishedOn": "2024-06-06T22:07:50.000Z",
          "wordCount": null,
          "title": "이재명의 우향우? “민주당이 무섭다”는 말이 나오는 이유: 슬로우레터 6월7일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109322",
          "author": "민노씨",
          "description": "[홍윤희 스토리] 잘 다니던 회사 그만두고 지금은 장애인 이동권을 위한 사단법인 ‘무의’ 이사장. 지민이 엄마로, 활동가로, 자유기고가에서 이사장까지. 대체로 바쁘고 힘겹고 지겹지만 가끔씩 찬란한 ‘홍윤희의 그 길’에 관한 이야기. 홍윤희? 근데 누구세요? 장애가 ‘무의미’해지는 세상을 꿈꾸는, 아니 계획하고 실행하며 그걸 알리는 ‘무의’라는 단체가 있습니다. 처음에는 ‘진짜’ 직업 따로인 자원봉사 1인 활동가 단체였지만, 협동조합의 테두리를 갖추고,...\nThe post 홍윤희 스토리 1. 이제 회사 가서 좀 쉬어 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109322",
          "publishedOn": "2024-06-06T05:23:35.000Z",
          "wordCount": null,
          "title": "홍윤희 스토리 1. 이제 회사 가서 좀 쉬어",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109706",
          "author": "이정환",
          "description": "“더 이상 가망이 없다고 생각한다.” S&P도 “희망과 꿈일 뿐.” 쟁점과 현안. 헌정사상 첫 야당 단독 국회 개원. 국민의힘이 법사위에 목매는 이유. 법사위 기피증. 더 깊게 읽기. “다른 국정 운영도 이렇게 하는 것 같아 걱정.” 국가채무 비율 딜레마. “이런 사건은 범인 못 잡아요.” 언더커버를 합법 수사로. 다르게 읽기. 종부세와 재산세 통합하자는 주장 따져보니. 한국 사람들이 돈을...\nThe post “내가 해봐서 아는데”, 백종원과 윤석열의 차이: 슬로우레터 6월6일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109706",
          "publishedOn": "2024-06-05T22:06:14.000Z",
          "wordCount": null,
          "title": "“내가 해봐서 아는데”, 백종원과 윤석열의 차이: 슬로우레터 6월6일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109641",
          "author": "오병일",
          "description": "[기고] 라인야후 사태를 공공성과 인권 관점에서 살펴봅니다. 오병일(진보네트워크센터 대표)은 국가주의 프레임에 빠져 라인야후 사태를 보면 타국의 보호주의를 비난하면서 자국의 보호주의를 요구하는 모순에 빠질 수 있다고 지적합니다. 라인야후 대주주인 A홀딩스의 네이버 지분을 매각하라는 일본 정부의 요구를 둘러싸고 논란이 뜨겁다. 한국의 기업과 기술을 강탈하려는 일본과 이를 수수방관하는 듯한 한국 정부에 대한 비난의 목소리가 높다. 급기야 일본 정부의...\nThe post 라인야후 사태, 국가주의 프레임을 넘어서 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109641",
          "publishedOn": "2024-06-05T02:52:02.000Z",
          "wordCount": null,
          "title": "라인야후 사태, 국가주의 프레임을 넘어서",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109617",
          "author": "이정환",
          "description": "김건희 서면 진술서, 소명 부족했다. 탈탈 털지 않았다. 쟁점과 현안. 산유국의 꿈? 반응이 미지근한 이유. 구멍가게 수준? 세계적인 시추 전문가? 전공의 복귀 출구 전략. 더 깊게 읽기. 국가채무 비율 줄여서 발표했나. 민주당의 감세 드라이브, “상속세 부담 줄인다.” 다르게 읽기. 쌀값이 오르는 이유. 물가 2.7%라는데 농산물은 19% 급등. 해법과 대안. 의대 증원 이후가 문제다. 4대 개혁...\nThe post 김건희 주가조작, “탈탈 털었는데 안 나온 것” 아니었다: 슬로우레터 6월5일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109617",
          "publishedOn": "2024-06-04T22:19:06.000Z",
          "wordCount": null,
          "title": "김건희 주가조작, “탈탈 털었는데 안 나온 것” 아니었다: 슬로우레터 6월5일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109592",
          "author": "민주언론시민연합",
          "description": "사직서를 내고 진료현장을 이탈한 전공의 대부분은 전문의 자격취득을 위한 복귀 시한인 5월 20일에도 돌아오지 않았습니다. 의사 수를 늘려 의료공백을 개선하겠다는 정부 정책이 무색하게 당장 내년부터 의료인력 부족이 예고된 것이나 다름없는데요. 의료계 이탈은 정부가 2월 6일 지방의료 붕괴와 필수의료 강화 등을 위해 2025년 대입부터 의대 정원을 대폭 늘리겠다고 선포하면서 시작됐습니다. 의료계는 정부 정책에 항의하며 의료현장을 떠났고,...\nThe post 환자는 없었다: 정부 vs. 의료계 보도 22,224건 분석 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109592",
          "publishedOn": "2024-06-04T06:23:14.000Z",
          "wordCount": null,
          "title": "환자는 없었다: 정부 vs. 의료계 보도 22,224건 분석",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109542",
          "author": "이정환",
          "description": "산유국의 꿈, 어느 신문이 가장 흥분했나. 삼성전자 시가총액 5배라고? 동해 가스전의 씁쓸한 추억. 7광구는? 천공의 예언? 쟁점과 현안. VIP 격노설, 해명을 내놨는데. 9.19합의 효력 정지, 완충 구역이 사라졌다. 더 깊게 읽기. 이원석이 “성역은 없다”고 한 이유. “은밀하게 전달만 해드리고 싶어요.” 오늘 전공의 사표 받는다. 다르게 읽기. 탄핵을 정치적 반전 카드로? 1일1특검, 어제는 대북송금 수사 특검....\nThe post 140억 배럴 산유국의 꿈? 어느 신문이 가장 흥분했나: 슬로우레터 6월4일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109542",
          "publishedOn": "2024-06-03T21:53:15.000Z",
          "wordCount": null,
          "title": "140억 배럴 산유국의 꿈? 어느 신문이 가장 흥분했나: 슬로우레터 6월4일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=108616",
          "author": "민노씨",
          "description": "[제네바 오전 8시] 이상헌(ILO 고용정책국장)의 노동과 세계 그리고 인간에 관한 이야기 인트로 & 요약 (2분) 1.스웨덴 모델인지 여부가 왜 중요한가? 스웨덴 모델인지 아닌지, 스웨덴에서 성공했는지 실패했는지는 중요하지 않다(스웨덴에서 실패했다는 지적은 대체로 사실이 아니다). 중요한 건 이제 한국은 외국 모델을 수입할 수준은 이미 넘어섰다. 우리 제도에서 어떻게 적용될 수 있을지에 관한 논의가 중요하다. 2.노조와 메커니즘의 문제....\nThe post 사회연대임금: 탐욕의 풍선 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/108616",
          "publishedOn": "2024-06-03T06:57:02.000Z",
          "wordCount": null,
          "title": "사회연대임금: 탐욕의 풍선",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109475",
          "author": "이정환",
          "description": "윤석열 지지율 21%. 쟁점과 현안. 종합부동산세 “개편” 꺼냈더니 “폐지”. 가뜩이나 세수 줄어드는데. 종부세와 재산세를 합친다면? 한국판 ‘하우스 오브 카드’, 복수가 시작된다. 다르게 읽기. 최태원-노소영 재산 분할의 세 가지 관점. 노태우 비자금 팩트체크. “버립니다.” 더 깊게 읽기. 김정숙 특검법? 여당이 검찰 못 믿나. “이재명이 대통령처럼 보이기 시작한다.” 어떤 중산층을 말하나. 오물 풍선과 대북 확성기. 오늘의 TMI....\nThe post 지지율 21% 윤석열, 그날 꼭 술을 마셨어야 했나: 슬로우레터 6월3일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109475",
          "publishedOn": "2024-06-02T22:09:45.000Z",
          "wordCount": null,
          "title": "지지율 21% 윤석열, 그날 꼭 술을 마셨어야 했나: 슬로우레터 6월3일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109404",
          "author": "이정환",
          "description": "[슬로우데이터] 누적 물가 상승률 역대 2위… 인플레이션의 의미가 달라졌다. 조 바이든(미국 대통령)이 재선에 실패한다면 물가 때문일 가능성이 크다. 경제는 좋은데 물가가 엉망이라는 비판이 많다. 그런데!! 한국은 경제 성장률은 더 낮고 물가는 더 높다. 오늘은 정치와 물가의 상관관계를 살펴본다. 대파 875원 논란. 총선에 얼마나 영향을 미쳤을까. 대파 원가가 1000원이 넘는다고 하지 않았나. 문재인 정부 때 더...\nThe post ‘대파 게이트’의 악몽, 물가가 모든 걸 삼킨다. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109404",
          "publishedOn": "2024-06-01T04:03:01.000Z",
          "wordCount": null,
          "title": "‘대파 게이트’의 악몽, 물가가 모든 걸 삼킨다.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109388",
          "author": "이정환",
          "description": "[토론회 지상 중계] 혐오와 차별을 넘어: 대구 이슬람 사원 논란이 드러낸 한국의 갈등 구조. 대구 이슬람 사원은 아직도 공사를 시작하지 못하고 있다. 대한변호사협회가 조사단을 꾸려서 무슬림 학생들과 지역 주민, 대구 북구청 관계자 등을 면담하고 보고서를 냈다. 다음은 5월31일 대한변협 주최 토론회 내용을 정리한 것이다. 이게 왜 중요한가. 생각해 볼 부분. 조사단 보고서의 핵심 제안. 주민들은...\nThe post 이슬람 사원 앞 바베큐 파티, 누가 이들을 극단으로 내모는가. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109388",
          "publishedOn": "2024-05-31T08:42:33.000Z",
          "wordCount": 5835,
          "title": "이슬람 사원 앞 바베큐 파티, 누가 이들을 극단으로 내모는가.",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/05/4134487052_55dbfa765a_b.jpg"
        },
        {
          "id": "https://slownews.kr/?p=109356",
          "author": "이정환",
          "description": "성 추문 은폐, 트럼프 34건 유죄. 최태원 노소영에게 1조3808억 원 분할. SK 경영권 위협에 주가는 폭등. 노태우 비자금 300억 원. 배신 맞지만 배임 아니다, 민희진 해임 금지. 쟁점과 현안. 민주당 1호 법안은 채 상병 특검법. 이재명 대권 맞춤당 된다. “뼈가 빠지게 뛰겠다.” 다르게 읽기. 대통령 개인 폰 괜찮나. 1분기 성장률 1.3%의 비밀. ‘즉강끝’의 한계. 더...\nThe post 민희진의 반전, “배신 맞지만 배임 아니다”: 슬로우레터 5월31일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109356",
          "publishedOn": "2024-05-30T22:29:07.000Z",
          "wordCount": 6109,
          "title": "민희진의 반전, “배신 맞지만 배임 아니다”: 슬로우레터 5월31일.",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/05/20240425050006_0.jpg"
        },
        {
          "id": "https://slownews.kr/?p=109330",
          "author": "이정환",
          "description": "거부, 거부, 거부, 거부. 22대 국회 첫날 1호 법안은 채 상병 특검법. 윤석열-이종섭 통화기록, 탄핵 태블릿될까. 공수처의 고민. 군 사망 사고의 구멍. 쟁점과 현안. 김건희 수사 검사들 모두 남았다. 북한에서 넘어온 ‘오물 풍선’. 더 깊게 읽기. 지난해보다 더 적다. 지역은 솔로 지옥. 다르게 읽기. 충주 사과 미국에서 반값에 팔리는 이유. 호미로 막을 걸 가래로 막아야...\nThe post 식물 정권의 세 가지 무기, ‘레임덕’ 막으려다 ‘데드덕’ 간다: 슬로우레터 5월30일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109330",
          "publishedOn": "2024-05-29T22:03:10.000Z",
          "wordCount": null,
          "title": "식물 정권의 세 가지 무기, ‘레임덕’ 막으려다 ‘데드덕’ 간다: 슬로우레터 5월30일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109284",
          "author": "이정환",
          "description": "특검법 부결, 여기서 끝이 아니다. 22대 국회에서 다시 간다. 쟁점과 현안. 윤석열-이종섭 통화 기록도 나왔다. 또 거부권? “민생 법안 날렸다.” 다르게 읽기. 윤석열을 지킬 수 있을까. 더 깊게 읽기. 30년 뒤 서울 중위 연령은 56세. 생성형 AI는 ‘돈 먹는 하마’. “뭉개면서 가겠죠.” 오늘의 TMI. 수도권 거주자, 서울 출근에 평균 71분. 성심당, “임대료 1억 넘으면 대전역점...\nThe post 일찍 찾아온 조중동의 ‘헤어질 결심’, 손절 타이밍은 언제일까: 슬로우레터 5월29일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109284",
          "publishedOn": "2024-05-28T22:05:25.000Z",
          "wordCount": null,
          "title": "일찍 찾아온 조중동의 ‘헤어질 결심’, 손절 타이밍은 언제일까: 슬로우레터 5월29일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109254",
          "author": "이정환",
          "description": "채 상병 특검법 이탈표 최소 5명. “대통령이 격노한 게 죄냐.” 간단한 복습. 쟁점과 현안. 한일 vs 중 대화. 북한 정찰 위성은 실패. ‘비윤’ 나경원의 질주, “개헌 논의도 가능.” 연금 개혁 불발. 언론은 압도적으로 이재명 편이다. 더 깊게 읽기. 법안 63%가 버려졌다. 대통령은 해결사, 장관은 희생양. 민정수석은 대통령 뒤 봐주는 자리가 아니다. 다르게 읽기. 윤석열이 기시다에게...\nThe post “대통령이 격노한 게 죄냐”, 국민의힘 이탈표 17표에 윤석열의 운명이 걸렸다: 슬로우레터 5월28일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109254",
          "publishedOn": "2024-05-27T22:05:02.000Z",
          "wordCount": null,
          "title": "“대통령이 격노한 게 죄냐”, 국민의힘 이탈표 17표에 윤석열의 운명이 걸렸다: 슬로우레터 5월28일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=105879",
          "author": "민노씨",
          "description": "[제네바 오전 8시] 이상헌(ILO 고용정책국장)의 노동과 세계 그리고 인간에 관한 이야기. 인트로 & 요약 (약 3분) 지난 인터뷰들 오늘은 세계화 인터뷰, 그 네 번째 마지막 편이다. 그동안 이상헌 박사와 함께 폴 콜리어의 책 [자본주의의 미래] (2018, 한글 2020)을 매개로 ‘세계화’의 문제에 관해 이야기했다. 국제적 관계: 라인야후 사태와 호혜성 오늘 주제는 국제 관계다. 여러 국제기구를 이야기하고,...\nThe post 세계화의 딜레마, 탈출을 꿈꾸는 청년 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/105879",
          "publishedOn": "2024-05-27T10:13:15.000Z",
          "wordCount": null,
          "title": "세계화의 딜레마, 탈출을 꿈꾸는 청년",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109234",
          "author": "참여연대 사법감시센터",
          "description": "호주제 폐지, 낙태죄 헌법소원 등 ‘공익소송’은 우리 사회에 전향적인 변화를 일으켜 왔습니다. 소송에서의 승패를 넘어서서, 국가기관이나 대기업 등을 향한 소송 제기 자체가 사회의 변화를 촉구하는 공익적 목적을 가지는데요. 하지만 패소한다면 막대한 소송비용을 오롯이 떠맡아야 합니다. 현행 민사소송법이 예외 없이 소송비용은 무조건 패소한 측이 부담한다고 규정하고 있기 때문입니다(패소자부담주의). 이에 공익소송 당사자들이 헌법소원을 제기했지만, 헌법재판소는 해당 법조항이...\nThe post 공익소송의 가치, 돈으로 막아서도 괜찮은가 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109234",
          "publishedOn": "2024-05-27T04:48:25.000Z",
          "wordCount": null,
          "title": "공익소송의 가치, 돈으로 막아서도 괜찮은가",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109185",
          "author": "이정환",
          "description": "술은 없었지만 화기애애했다. “국민 분노 비웃나.” 쟁점과 현안. 윤석열 지지율은 여전히 24%. 특검법 이탈표 4명으로 늘었다. “라인 사태 외교 사안 아니다.” 더 깊게 읽기. “44% 받겠다” 이재명 제안에 국민의힘 ‘움찔’. “연금 개혁은 코끼리 옮기기 같은 것.” 모수 개혁과 구조 개혁. 다르게 읽기. 대북 송금 사건? 쌍방울 주가조작 사건이다. 엥겔 지수의 함정. 시진핑은 왜 안 왔을까....\nThe post 윤석열의 계란말이 파티, 기자들은 아무것도 묻지 않았다: 슬로우레터 5월27일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109185",
          "publishedOn": "2024-05-26T22:04:12.000Z",
          "wordCount": null,
          "title": "윤석열의 계란말이 파티, 기자들은 아무것도 묻지 않았다: 슬로우레터 5월27일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109158",
          "author": "이정환",
          "description": "[슬로우리포트] 국민연금 막판 협상, 누가 거짓말을 하나: 더 내고 더 받는 개혁, 이것이 최선일까. 이재명(민주당 대표)이 승부수를 던졌다. 국회에서 기자간담회를 열고 “여당이 제시한 소득대체율 44%를 전적으로 수용하겠다”고 말했다. “꼭 해야 할 일인데 시간은 없으니 불가피하게 민주당이 다 양보하겠다”면서 “1%포인트 차이 때문에 연금 개혁안을 무산시킬 수는 없다”고 강조했다. 이게 왜 중요한가. 핵심 쟁점. 충돌하는 지점. 말이...\nThe post 모처럼 조선일보가 이재명을 칭찬하는 이유. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109158",
          "publishedOn": "2024-05-26T07:09:14.000Z",
          "wordCount": null,
          "title": "모처럼 조선일보가 이재명을 칭찬하는 이유.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=108188",
          "author": "민노씨",
          "description": "[캡:콜드케이스] 미디어를 통해 반영·증폭·구성되는 문제적 현상과 사고방식을 ‘캡콜드’ 김낙호 교수가 분석합니다. 이번 케이스는 MBTI(두둥!). “MBTI의 핵심은 내 성격을 내가 안다는 게 아니에요. 내가 세상 모든 사람을 MBTI 하나로 다 알 수 있다고 생각(착각)하는 거죠.” (캡콜드) MBTI, 더 말이 필요한가. 그 열풍에 관해 캡콜드(김낙호 펜실베이니아주립대학교 커뮤니케이션학과 교수)에게 물었다. MBTI 개요 MBTI 누가 만들었나. MBTI는 ‘마이어스-브리그스 유형 지표'(Myers-Briggs...\nThe post MBTI? 30점짜리 심리테스트, 100점짜리 예능 소품 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/108188",
          "publishedOn": "2024-05-24T06:47:14.000Z",
          "wordCount": null,
          "title": "MBTI? 30점짜리 심리테스트, 100점짜리 예능 소품",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109076",
          "author": "이정환",
          "description": "김계환 녹취 파일, ‘스모킹 건’이 될까. ‘격노’ 이후 모든 게 달라졌다. 김계환의 양심선언이 필요할 때다. 쟁점과 현안. 연금 개혁은 다음 국회로. 반도체 산업에 26조 원 투입. 물가 때문에… 기준 금리 동결. 가계 실질 소득, 7년 만에 최대폭 감소. 더 깊게 읽기. 4년 중임제 개헌, 해볼 만하다. “외롭습니다.” 다르게 읽기. 이종섭 출국 금지는 공수처 작품이었다. ‘버닝썬’이...\nThe post 윤석열 ‘격노’ 담긴 녹음 파일, ‘스모킹 건’이 될까: 슬로우레터 5월24일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109076",
          "publishedOn": "2024-05-23T22:07:15.000Z",
          "wordCount": null,
          "title": "윤석열 ‘격노’ 담긴 녹음 파일, ‘스모킹 건’이 될까: 슬로우레터 5월24일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=109022",
          "author": "이정환",
          "description": "[슬로우리포트] 최대 실적 내고도 주가가 안 오르는 이유: 검색 광고 시장 위축에 한 발 늦은 AI 전략, 새로운 성장 엔진이 필요한 시점. 누구나 잘 아는 것 같지만 의외로 잘 모르는 기업. 오늘 슬로우리포트에서는 네이버의 위기를 살펴봅니다. 국민주 네이버는 왜 사상 최대의 실적을 기록하고도 주가가 지지부진할까요? 라인야후 사태도 심각하지만 근본적으로 전망이 안 보인다는 관측이 많습니다. 한동안...\nThe post 네이버의 진짜 위기는 라인이 아니다. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109022",
          "publishedOn": "2024-05-23T09:32:15.000Z",
          "wordCount": 6415,
          "title": "네이버의 진짜 위기는 라인이 아니다.",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/05/original-1000x637.jpg"
        },
        {
          "id": "https://slownews.kr/?p=109000",
          "author": "윤지명",
          "description": "심리학 및 사회학 연구에 뿌리를 둔 ‘희생양 이론’은 개인이나 집단이 자신의 문제나 실패에 관해 부당하게 다른 사람이나 집단을 비난하는 현상을 말한다. 희생양 메커니즘의 본질은 한 개인이나 단체·사회가 서로의 이해관계가 충돌했을 때 또는 그저 그들의 욕망이 충돌해서 문제가 드러날 때 힘없는 또는 상대적으로 미약한 희생양에게 책임을 전가함으로써 진짜 문제의 원인인 가해자가 자신의 죄책감, 좌절감 또는 무능함을...\nThe post ‘희생양 이론’으로 보는 학생인권조례 폐지 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/109000",
          "publishedOn": "2024-05-23T06:21:58.000Z",
          "wordCount": 5522,
          "title": "‘희생양 이론’으로 보는 학생인권조례 폐지",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/04/GettyImages-jv11370137.jpg"
        },
        {
          "id": "https://slownews.kr/?p=108962",
          "author": "이정환",
          "description": "‘VIP 격노’ 들은 사람이 또 있다. “이탈 표 10명은 나올 것.” “박정훈 기소 취소하자” 보고서 뭉갰다. 쟁점과 현안. “공매도 재개는 이복현 개인 의견.” 카드 연체율 9년 만에 최고. “전통과 권위의 정론지, 조선일보.” 더 깊게 읽기. 정권 말 복지부동이 벌써 시작됐다. 윤석열에게는 ‘레드팀’이 필요하다. 다르게 읽기. 나이 들면 운전 제한? 하루 만에 말 바꾼 이유. 안보동맹이...\nThe post “검사 위에 여사, 이게 나라냐”, 동아일보 김순덕의 분노: 슬로우레터 5월23일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/108962",
          "publishedOn": "2024-05-22T22:05:09.000Z",
          "wordCount": 6976,
          "title": "“검사 위에 여사, 이게 나라냐”, 동아일보 김순덕의 분노: 슬로우레터 5월23일.",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/05/nhdbrqzFPsg764277b77094cd1.14958434-1000x614.jpeg"
        },
        {
          "id": "https://slownews.kr/?p=108917",
          "author": "이정환",
          "description": "결국 채 상병 특검법에 거부권 행사. 조선일보도 ‘쉴드’가 안 된다. “국민에게도 불행한 일.” 핵심은 윤석열의 ‘격노’. 벌써 3명 이탈. 국회 입법조사처가 못을 박았다. 쟁점과 현안. 책을 함부로 버리면 벌어지는 일. 책은 버리고 디올 백만 보관했다고? 김건희는 오랜만에 단독 행보. 윤석열 탈당설을 흘리는 이유. 다르게 읽기. 이명박은 어떻게 지지율을 끌어올렸을까. 더 깊게 읽기. “굳이 읽을 필요...\nThe post 책은 버리고 디올 백은 남겼다? 김건희의 결정적 실수: 슬로우레터 5월22일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/108917",
          "publishedOn": "2024-05-21T22:06:15.000Z",
          "wordCount": 7205,
          "title": "책은 버리고 디올 백은 남겼다? 김건희의 결정적 실수: 슬로우레터 5월22일.",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/05/KgzQYY3hq2Zv664c66a785f394.37422791-1000x640.jpeg"
        },
        {
          "id": "https://slownews.kr/?p=108886",
          "author": "이정환",
          "description": "탄핵 마일리지가 쌓이고 있다. 거부권 행사? 28일 재표결 들어간다. 가족 방탄에 이은 셀프 면죄부. 더 깊게 읽기. 잘못 건드렸다. ‘안방 호랑이’의 참사. 또 격노했나. 고질병처럼 반복되는 당정 소통 부재. 잠룡 경쟁이 시작됐다. 민심이 부르면 출마한다. 쟁점과 현안. 이란 대통령 사망. 국민의힘 총선 백서, 왜 시끄러울까. ‘개딸’의 분노? 1만 명 탈당 러시. 다르게 읽기. 카카오 지분...\nThe post 차갑게 식은 조중동, 이제는 아무도 신경쓰지 않는 윤석열의 격노: 슬로우레터 5월21일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/108886",
          "publishedOn": "2024-05-20T22:13:37.000Z",
          "wordCount": null,
          "title": "차갑게 식은 조중동, 이제는 아무도 신경쓰지 않는 윤석열의 격노: 슬로우레터 5월21일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=108860",
          "author": "이정환",
          "description": "직구 금지, 사흘 만에 없던 일로. 6조8000억 원. 할 말은 한다. 쟁점과 현안. R&D 예타 폐지? 민주당은 반대. 국민이 실험 대상인가. 다르게 읽기. “‘빼박’ 탄핵 사유다.” “임계점을 넘는 순간이 온다.” 채 상병 특검법, 내일 거부권 쓴다. 더 깊게 읽기. “김 여사 공이 컸다.” 전공의 복귀 시한 한 달 늦추나. 전직 검사 전성시대. 늙어가는 한국, 정부...\nThe post ‘빼박’ 탄핵 사유, 윤석열이 모를 리 없다: 슬로우레터 5월20일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/108860",
          "publishedOn": "2024-05-19T22:03:20.000Z",
          "wordCount": null,
          "title": "‘빼박’ 탄핵 사유, 윤석열이 모를 리 없다: 슬로우레터 5월20일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=108807",
          "author": "이정환",
          "description": "[슬로우리포트] 언론의 객관성을 둘러싼 오래된 고민: 바이든이 뉴욕타임스와 인터뷰하지 않는 이유. 진실과 정의 가운데 무엇을 선택할 것인가. 누군가는 정의가 곧 진실이라고 말할 것이다. 애초에 정의가 아닌 진실에 관심이 없는 사람들도 있고 진실 역시 상대적인 개념 아니냐고 말하는 사람들도 있다. 세마포(Semafor)의 벤 스미스(Ben Smith)가 뉴욕타임스 편집국장 조셉 칸(Joseph Kahn)을 인터뷰했다. 벤 스미스의 질문은 “왜 뉴욕타임스는 조...\nThe post 왜 행동하지 않나, 뉴욕타임스가 맞닥뜨린 복잡한 질문. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/108807",
          "publishedOn": "2024-05-19T06:45:30.000Z",
          "wordCount": 8019,
          "title": "왜 행동하지 않나, 뉴욕타임스가 맞닥뜨린 복잡한 질문.",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/05/5964358212_4685b11293_k-1000x750.jpg"
        }
      ]
    },
    {
      "title": "꿈꾸는섬",
      "feedUrl": "https://happist.com/feed",
      "siteUrl": "https://happist.com",
      "articles": [
        {
          "id": "https://happist.com/?p=595028",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595028/%eb%af%b8%ea%b5%ad%ec%9d%b8-%ec%a0%84%ea%b8%b0%ec%b0%a8-%ec%84%a0%ed%98%b8",
          "publishedOn": "2024-06-16T01:53:47.000Z",
          "wordCount": null,
          "title": "블름버그인텔리전스, 미국인 전기차 선호는 여전하나 내연기관 대체는 어렵다",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595019",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595019/6-15-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-06-15T09:43:40.000Z",
          "wordCount": null,
          "title": "6/15, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594547",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594547/%eb%84%88%eb%ac%b4-%eb%8a%a6%ec%97%88%eb%8d%98-%ec%96%91%ed%8f%89-%ec%9a%a9%eb%ac%b8%ec%82%ac-%ec%9d%80%ed%96%89%eb%82%98%eb%ac%b4-%ec%b6%9c%ec%82%ac%ea%b8%b0",
          "publishedOn": "2024-06-15T08:48:23.000Z",
          "wordCount": null,
          "title": "너무 늦었던 양평 용문사 은행나무 출사기",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595001",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595001/%ec%9d%bc%eb%a1%a0-%eb%a8%b8%ec%8a%a4%ed%81%ac-%eb%b3%b4%ec%83%81-%ed%8c%a8%ed%82%a4%ec%a7%80",
          "publishedOn": "2024-06-14T03:37:28.000Z",
          "wordCount": null,
          "title": "6/14, 테슬라 주총과 이론 머스크 보상 패키지 승인을 보는 월가의 시선",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594989",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594989/6-12-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-06-13T03:45:52.000Z",
          "wordCount": null,
          "title": "6/12, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594983",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594983/%ec%95%a0%ed%94%8c-%ec%84%b8%ea%b3%84%ea%b0%9c%eb%b0%9c%ec%9e%90%ed%9a%8c%ec%9d%98",
          "publishedOn": "2024-06-12T09:34:44.000Z",
          "wordCount": null,
          "title": "애플 세계개발자회의(WWDC24)를 보는 월가의 시선",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594975",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594975/%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%95%a1%eb%a9%b4%eb%b6%84%ed%95%a0-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%a3%bc%ea%b0%80-%ec%83%81%ec%8a%b9",
          "publishedOn": "2024-06-08T14:19:57.000Z",
          "wordCount": null,
          "title": "배런스, 엔비디아 액면분할 후 엔비디아 주가 상승 랠리는 지속될 것",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594968",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594968/%ea%b1%b4%ea%b0%95%ea%b4%80%eb%a6%ac-%ea%b1%b8%ec%9d%8c%ec%88%98",
          "publishedOn": "2024-06-08T13:39:28.000Z",
          "wordCount": null,
          "title": "은퇴자 건강을 위한 건강 걸음수 가이드",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594962",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594962/%ec%95%84%eb%a7%88%ec%a1%b4-%ec%8b%9c%ea%b0%80%ec%b4%88%ec%95%a1-3%ec%a1%b0%eb%8b%ac%eb%9f%ac-%ea%b0%80%eb%8a%a5%ec%84%b1",
          "publishedOn": "2024-06-08T08:16:33.000Z",
          "wordCount": null,
          "title": "배런스, 아마존은 시가총액 3조 달러 클럽에 가입할 수 있을까요? 어떻게 가능할까요?",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594906",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594906/6-8-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-06-08T03:48:46.000Z",
          "wordCount": null,
          "title": "6/8, 월가의 투자의견 및 주가 전망 보고",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594904",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594904/%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d-4",
          "publishedOn": "2024-06-07T13:56:52.000Z",
          "wordCount": null,
          "title": "[The Motley Fool]엔비디아 액면분할은 엔비디아 매수 이유가 될 수 없다. 엔비디아 주가에서 주목할 3가지 요인",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594897",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594897/%ec%8b%9c%ea%b0%80%ec%b4%9d%ec%95%a1-5%ec%a1%b0-%eb%8b%ac%eb%9f%ac-%ea%b8%b0%ec%97%85",
          "publishedOn": "2024-06-07T08:13:40.000Z",
          "wordCount": null,
          "title": "[The Motley Fool] 월스트리트 최초 시가총액 5조 달러 기업이 될 아마존",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594893",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594893/%eb%a9%94%ed%83%80-%ec%8b%9c%ea%b0%80%ec%b4%9d%ec%95%a1-2%ec%a1%b0%eb%8b%ac%eb%9f%ac-%ea%b0%80%eb%8a%a5%ec%84%b1",
          "publishedOn": "2024-06-07T05:55:48.000Z",
          "wordCount": null,
          "title": "[The Motley Fool]시총 2조달러 클럽 후보, 3년내 메타 시가총액 2조달러 가능성",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594886",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594886/%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%eb%aa%a9%ed%91%9c%ec%a3%bc%ea%b0%80-1500%eb%8b%ac%eb%9f%ac",
          "publishedOn": "2024-06-07T05:24:48.000Z",
          "wordCount": null,
          "title": "BofA, 엔비디아는 향후 10년간 컴퓨팅 시장을 지배할 것이며, 엔비디아 목표주가 1,500달러 제시",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594877",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594877/6-7-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-06-07T00:24:39.000Z",
          "wordCount": null,
          "title": "6/7, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594863",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594863/%ed%81%ac%eb%9d%bc%ec%9a%b0%eb%93%9c%ec%8a%a4%ed%8a%b8%eb%9d%bc%ec%9d%b4%ed%81%ac-%ec%8b%a4%ec%a0%81-%ed%8f%89%ea%b0%80",
          "publishedOn": "2024-06-06T06:14:20.000Z",
          "wordCount": null,
          "title": "크라우드스트라이크 실적을 읽는 월가의 시선",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594859",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594859/6-6-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-06-06T06:02:35.000Z",
          "wordCount": null,
          "title": "6/6, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594849",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594849/%ec%9c%a0%ed%8a%9c%eb%b8%8c%ea%b0%80-%ed%97%90%eb%a6%ac%ec%9a%b0%eb%93%9c-%ec%95%95%eb%8f%84-%ec%9d%b4%ec%9c%a0",
          "publishedOn": "2024-06-05T01:33:42.000Z",
          "wordCount": null,
          "title": "사이먼 오웬스, 유튜브가 헐리우드를 계속 압도할 수 있는 이유",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594836",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594836/6-4-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-06-05T00:43:50.000Z",
          "wordCount": null,
          "title": "6/5, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594834",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594834/%ea%b8%88%eb%a6%ac%ec%9d%b8%ed%95%98-%ed%9b%84-%ec%a3%bc%ec%8b%9d-%eb%a7%a4%eb%8f%84",
          "publishedOn": "2024-06-03T23:53:43.000Z",
          "wordCount": null,
          "title": "BofA 마이클 하트넷, 금리 인하 후 행동강령 : 채권 매수와 주식 매도",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594827",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594827/6-3-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-06-03T06:34:00.000Z",
          "wordCount": null,
          "title": "6/3, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594816",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594816/5-30-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-05-30T02:24:39.000Z",
          "wordCount": null,
          "title": "5/30, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594811",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594811/ubs-sp-500-%ec%a0%84%eb%a7%9d%ec%b9%98",
          "publishedOn": "2024-05-29T01:59:16.000Z",
          "wordCount": null,
          "title": "UBS, S&P 500 전망치를 5,600으로 상향 조정",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594808",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594808/amd-%ec%a3%bc%ea%b0%80-%ec%a0%84%eb%a7%9d",
          "publishedOn": "2024-05-29T01:44:05.000Z",
          "wordCount": null,
          "title": "배런스, 만년 2등이었던 AMD, AMD 주가는 승자가 될 수 있다.",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594799",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594799/5-29-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-05-29T01:21:02.000Z",
          "wordCount": null,
          "title": "5/29, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594796",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594796/5-27-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-05-27T17:33:52.000Z",
          "wordCount": null,
          "title": "5/27, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594788",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594788/%ec%83%81%ec%a0%84%ec%a0%84%ec%9e%90-%ea%b8%b0%ec%88%a0%ed%83%88%ec%b7%a8",
          "publishedOn": "2024-05-26T13:03:07.000Z",
          "wordCount": null,
          "title": "한미반도체 HBM 기술 관련 삼성전자 기술탈취 소송을 정리",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594786",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594786/1%eb%b6%84%ea%b8%b0-%ec%8a%a4%eb%85%b8%ec%9a%b0%ed%94%8c%eb%a0%88%ec%9d%b4%ed%81%ac-%ec%8b%a4%ec%a0%81-%ed%8f%89%ea%b0%80",
          "publishedOn": "2024-05-24T08:22:48.000Z",
          "wordCount": null,
          "title": "스노우플레이크 실적을 읽는월가의 시선",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594784",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594784/5-24-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-05-24T08:17:26.000Z",
          "wordCount": null,
          "title": "5/24, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594776",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594776/1%eb%b6%84%ea%b8%b0-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%8b%a4%ec%a0%81-%ed%8f%89%ea%b0%80",
          "publishedOn": "2024-05-24T00:22:50.000Z",
          "wordCount": null,
          "title": "엔비디아 실적을 읽는 월가의 시선, 이보다 더 좋을 순 없다, 목표주가 1400$까지 상향",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594774",
          "author": "happist",
          "description": "마케팅 경영 사례 연구 및 트렌드 탐구",
          "link": "https://happist.com/594774/1%eb%b6%84%ea%b8%b0-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%8b%a4%ec%a0%81-2",
          "publishedOn": "2024-05-23T03:33:29.000Z",
          "wordCount": 6458,
          "title": "엔비디아 실적 정리",
          "imageUrl": "https://happist.com/wp-content/uploads/2024/02/im-97167846.jpeg"
        },
        {
          "id": "https://happist.com/?p=594772",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594772/%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%8b%a4%ec%a0%81",
          "publishedOn": "2024-05-22T16:54:00.000Z",
          "wordCount": null,
          "title": "엔비디아 실적에서 살펴볼 5가지 요소",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594751",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594751/5-22-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-05-21T22:22:37.000Z",
          "wordCount": null,
          "title": "5/22, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594737",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594737/%ea%b8%88%eb%a6%ac%ec%9d%b8%ed%95%98-%ec%88%98%ed%98%9c%ec%9e%90",
          "publishedOn": "2024-05-21T09:52:39.000Z",
          "wordCount": null,
          "title": "[베런스]점점 다가오는 금리인하. 금리인하 수혜자는 누구일까",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594726",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594726/5-21-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-05-21T02:34:17.000Z",
          "wordCount": null,
          "title": "5/21, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=594713",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/594713/%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%8b%a4%ec%a0%81%ea%b3%bc-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ed%88%ac%ec%9e%90",
          "publishedOn": "2024-05-20T10:01:41.000Z",
          "wordCount": null,
          "title": "[개인투자일지] 엔비디아 실적을 기다리며",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "NewsPeppermint",
      "feedUrl": "https://newspeppermint.com/feed/",
      "siteUrl": "https://newspeppermint.com",
      "articles": [
        {
          "id": "https://newspeppermint.com/?p=79516",
          "author": "NewsPeppermint",
          "description": "이미 고령화 사회를 지나 초고령화 사회를 향해 빠르게 나아가는 한국 사회에서 나타나는 문제의 많은 부분을 풀 수 있는 열쇠는 나이 든 기성세대가 쥐고 있다고 할 수 있습니다. 노화를 우아하게 수용하는 법에 관해 찰스 블로우가 쓴 글을 번역하고, 해설을 썼습니다. 기성세대가 세상이 바뀌었다는 걸 이해하고, 바뀐 세상에서 살아가야 할 다음 세대의 어려움을 함부로 재단하지 않는 모습을 보여줬으면 좋겠습니다. 전문 번역: 눈가 주름이 지혜와 우아함의 대가라니! – 우아하게 노화를 수용한다는 것 해설: “라떼는 → 더 보기",
          "link": "https://newspeppermint.com/2024/06/15/npsp_aging/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_aging",
          "publishedOn": "2024-06-16T00:45:31.000Z",
          "wordCount": null,
          "title": "‘인구소멸’ 한국을 위해 할 수 있는 일",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79211",
          "author": "rukahs",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 4월 24일 스프에 쓴 글입니다. 저는 한국에서 의과대학 교육을 받고, 미국에서 일하고 있는 정신과 의사입니다. 미국에서는 정신질환 및 정신건강 서비스를 향한 낙인이 많이 사라졌습니다. 제가 처음 태평양을 건너온 10년 전과 비교하면 피부로 느껴질 정도입니다. → 더 보기",
          "link": "https://newspeppermint.com/2024/06/14/npsp_mindsos/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_mindsos",
          "publishedOn": "2024-06-14T22:59:59.000Z",
          "wordCount": 2374,
          "title": "[뉴페@스프] 데이트 상대로 ‘심리 상담’ 받는 사람을 선호한다고? 운동만 자기 관리가 아니다",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=79168",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 4월 22일 스프에 쓴 글입니다. 하마스가 이스라엘을 상대로 테러 공격을 벌인 뒤 그에 대한 반격으로 시작된 이스라엘의 가자지구 군사 작전 혹은 이스라엘과 팔레스타인의 전쟁이 벌써 반년이 더 지났습니다. 평화적인 해결은커녕 잠시 총을 내려놓고 민간인들의 → 더 보기",
          "link": "https://newspeppermint.com/2024/06/10/npsp_openletters/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_openletters",
          "publishedOn": "2024-06-10T22:59:32.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] ‘사이다 발언’에 박수 갈채? 그에 앞서 생각해 볼 두 가지 용기",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79498",
          "author": "NewsPeppermint",
          "description": "한류를 시작으로 대한민국의 국가 브랜드를 뜻하는 “K-시리즈”는 많은 이들에게 긍지를 안겨줬습니다. 그러나 전례를 찾아보기 힘든 저출생 문제와 그 원인의 하나로 꼽히는 젠더 규범을 둘러싼 갈등 문제에 있어서는 우리나라가 소위 “안 좋은 일로 세계에서 1등”을 달리고 있습니다. 미국의 젊은 세대도 연애도, 섹스도, 결혼도 덜한다는 통계가 꾸준히 나오는데, 이에 관한 우려를 담은 글에서 반면교사로 삼아야 할 사례로 한국이 등장하곤 합니다. 닉 크리스토프의 칼럼을 번역하고, 해설을 썼습니다. 전문 번역: 결혼도, 섹스도 덜 하는 → 더 보기",
          "link": "https://newspeppermint.com/2024/06/10/npsp_birthrategendernorm/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_birthrategendernorm",
          "publishedOn": "2024-06-10T04:00:35.000Z",
          "wordCount": null,
          "title": "미국이 자칫하면 ‘한국 꼴’ 될 수 있다고? 달갑지 않은 최신 ‘K-트렌드’",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79147",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 4월 17일 스프에 쓴 글입니다. 미국 대선에 관해 이야기할 때마다 반드시 언급되는 단골 소재가 바로 선거인단(electoral college)입니다. 우리나라처럼 대통령제를 채택한 나라에서도 쉽게 찾아볼 수 없는 독특한 제도라서 더욱 그렇습니다. 투표권이 있는 유권자들의 표를 더해 → 더 보기",
          "link": "https://newspeppermint.com/2024/06/07/npsp_electoralcollege/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_electoralcollege",
          "publishedOn": "2024-06-07T22:59:10.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 선거제 허점 악용해도 견제할 방법, 저기도 없네?!",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79483",
          "author": "NewsPeppermint",
          "description": "불로초를 찾으려 했던 진시황의 이야기는 다들 잘 아실 겁니다. 굳이 진시황이 아니라도 인류 역사에 이름을 남긴 권력자 가운데는 다시 젊어지려고 애쓴 사람이 많습니다. 오늘날 우리는 돈이 곧 권력의 중요한 원천이 되거나 아예 그 자체로 권력이 되는 자본주의 사회를 살고 있습니다. 자본주의의 첨단을 달린다는 미국의 부자들은 불로초와 비슷한 효과를 내는 비법을 독점적으로 터득했습니다. 비결이 뭘까요? 이번에도 역시 돈입니다. 전문 번역: 젊어지려고 아들 피 수혈한 백만장자…돈으로 ‘불로장생’을 사다 해설: ‘억만장자들만의 세상’, 이제는 대놓고 펼쳐진다",
          "link": "https://newspeppermint.com/2024/06/05/npsp_buylongerlife/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_buylongerlife",
          "publishedOn": "2024-06-05T22:00:07.000Z",
          "wordCount": null,
          "title": "‘억만장자들만의 세상’, 이제는 대놓고 펼쳐진다",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79136",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 4월 15일 스프에 쓴 글입니다. 로스 더우댓(Ross Douthat)은 지난해 말 대한민국은 사라지고 있는가?라는 칼럼을 쓴 뉴욕타임스 칼럼니스트입니다. 제목만으로도 당연히 한국에서 큰 관심을 받을 수밖에 없던 글인데, 많은 선진국에서 공통으로 나타나는 저출생 경향이 유난히 두드러지는 나라가 → 더 보기",
          "link": "https://newspeppermint.com/2024/06/03/npsp_birthdearth/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_birthdearth",
          "publishedOn": "2024-06-03T22:59:38.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 계속 심각하니 어느새 간과하는 걸까, 저출생 문제",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79462",
          "author": "NewsPeppermint",
          "description": "인공지능이 나날이 발달하면서 인간의 외로움도 AI 챗봇이 해결해주는 날이 머지않아 오리라는 기대 섞인 말도 많이 나옵니다. 그러나 인공지능 기술이 아무리 좋아져도 다른 사람과 관계에서 오는 연결감을 해소해주는 데는 한계가 있을 수 있다는 지적도 있습니다. 제시카 그로스의 칼럼을 번역하고, 연결감과 ‘나를 필요로 하는 경험’에 대해 예일대학교 정신의학과 나종호 교수에게 해설을 청했습니다. 전문 번역: ‘그녀’라면 여친보다 나을 것이라고?… AI가 외로움까지 해결할 수 있을까 해설: AI와 같이 살아도 ‘외로움’을 느낄 수밖에 없는 이유는 이렇다",
          "link": "https://newspeppermint.com/2024/06/02/npsp_aillmloneliness/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_aillmloneliness",
          "publishedOn": "2024-06-03T00:05:05.000Z",
          "wordCount": null,
          "title": "AI와 같이 살아도 ‘외로움’을 느낄 수밖에 없는 이유",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79102",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 4월 10일 스프에 쓴 글입니다. 올해는 전 세계 수많은 나라에서 다양한 층위의 선거가 치러지는 해입니다. 우리나라도 총선을 치르고, 스브스프리미엄을 통해 자주 관련 소식을 전해드린 미국 대선도 오는 11월입니다. 오늘날 여러 민주주의 국가에서 찾아볼 수 → 더 보기",
          "link": "https://newspeppermint.com/2024/05/31/npsp_democracyelection/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_democracyelection",
          "publishedOn": "2024-05-31T22:59:46.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 선거 패자도 ‘정치 보복’ 걱정 안 해도 되는 미국",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79434",
          "author": "NewsPeppermint",
          "description": "요즘 미국 스포츠의 아이콘으로 떠오른 인물 가운데 대학을 갓 졸업한 프로 1년차 농구 선수 케이틀린 클락(Caitlin Clark)이 있습니다. NCAA 통산 득점 3,951점으로 역대 1위, 각종 기록은 물론 엄청난 인기로 흥행 측면에서도 전대미문이라 할 만한 기록을 세운 살아 있는 레전드지만, 그의 프로 첫 시즌 연봉은 76,535달러. 우리돈 약 1억 원입니다. 이름에서 추측할 수 있는 그는 여자 농구선수이기 때문입니다. 명시적인 차별이 있다기보다는 여자 프로농구리그(WNBA) 시장이 미국을 넘어 전 세계적으로 인기를 구가하는 NBA에 → 더 보기",
          "link": "https://newspeppermint.com/2024/05/28/npsp_caitlinclark/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_caitlinclark",
          "publishedOn": "2024-05-28T23:15:01.000Z",
          "wordCount": null,
          "title": "전례 없는 흥행 돌풍의 벌써 ‘레전드’…그런데 프로 되니까 수익 증발했다?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79082",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 4월 8일 스프에 쓴 글입니다. 인공지능(AI), 범용 인공지능(AGI) 같은 단어가 더는 낯설지 않은 용어가 된 요즘입니다. 인류의 삶을 근본적으로 바꿔놓을 수 있는 잠재력을 지닌 강력하고 새로운 기술인 만큼 인공지능 시대를 맞아 논의하고 대비해야 할 → 더 보기",
          "link": "https://newspeppermint.com/2024/05/27/npsp_aijobs/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_aijobs",
          "publishedOn": "2024-05-27T22:59:43.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 인간보다 로봇에 더 혜택이 많은 미국, 우리는?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79414",
          "author": "NewsPeppermint",
          "description": "이달 초 뉴욕타임스가 공개한 대선 여론조사 결과를 보면, 바이든 대통령이 트럼프 전 대통령에게 계속 뒤처지는 거로 나왔습니다. 여러 가지 원인이 지목되는 가운데, 지난달 맨해튼 법정에서 시작된 트럼프 전 대통령의 소위 “입막음용 뒷돈” 재판은 트럼프에게 오히려 득이 되고 있다는 주장이 설득력을 얻고 있습니다. 로스 더우댓이 그런 주장을 담은 칼럼을 썼습니다. 칼럼을 번역하고, 여론조사 결과를 해설로 덧붙였습니다. 전문 번역: 야당 대통령 후보 향한 이런 식의 법정 공세, 정치 과잉의 부조리 아닌가: 이것은 → 더 보기",
          "link": "https://newspeppermint.com/2024/05/26/npsp_trumptrialelection/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_trumptrialelection",
          "publishedOn": "2024-05-26T22:35:17.000Z",
          "wordCount": null,
          "title": "“정의 구현” 대 “마녀사냥”, 프레임 전쟁의 승자와 패자는",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79059",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 4월 3일 스프에 쓴 글입니다. 지난 3월 초, 엿새간 아르헨티나에 다녀왔습니다. 다소 촉박하게 일정이 잡혀서 처음 가보는 나라, 지역임에도 미리 충분히 공부하고 준비하지 못한 채 비행기에 몸을 실었습니다. 사실 열정적인 축구팬인 저는 “현재 월드컵 → 더 보기",
          "link": "https://newspeppermint.com/2024/05/23/npsp_javiermilei/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_javiermilei",
          "publishedOn": "2024-05-23T22:59:29.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 환율도 제각각, 음식값도 매일 달라지는 ‘메시의 나라’, “다시 위대”해질 수 있을까",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79391",
          "author": "NewsPeppermint",
          "description": "오는 11월 미국 대선에서 맞붙을 바이든과 트럼프가 의외로 같은 목소리를 내는 분야가 몇 가지 있는데, 그중 하나가 대중국 무역정책입니다. 물론 세부적인 방침은 다를 수 있지만, 기본적으로 중국이 미국을 상대로 불공정 무역을 하고 있으므로, 이를 바로잡겠다는 의지는 같으며, 이를 숨기지 않고 오히려 적극적으로 드러낸다는 점도 비슷합니다. 다만 트럼프가 직접적으로 관세를 매기고, 중국과 전면적인 관세 전쟁을 매겼다면, 바이든의 정책은 미국이 전략적으로 중국에 뒤처져선 안 되는 분야를 정해놓고 미국의 동맹국을 동원해 중국을 압박하는 → 더 보기",
          "link": "https://newspeppermint.com/2024/05/21/npsp_chinashock/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_chinashock",
          "publishedOn": "2024-05-22T02:40:03.000Z",
          "wordCount": null,
          "title": "둘이 같은 목소리 낼 때도 있네? ‘두 번째 차이나 쇼크’ 어떻게 될까",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79039",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 4월 1일 스프에 쓴 글입니다. 경영대학원 회계 수업에서 교수님은 늘 같은 질문으로 수업을 시작했습니다. 이건 학생의 의견을 묻거나 토론을 위한 발제를 기대하고 하는 질문이 아니었습니다. 오히려 그 반대였습니다. 답이 정해져 있는, 전형적인 ‘답정너’ 문항이었죠. → 더 보기",
          "link": "https://newspeppermint.com/2024/05/20/npsp_techlayoffs/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_techlayoffs",
          "publishedOn": "2024-05-20T22:59:25.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 자본주의가 가장 마지막에 줄여야 하는 비용은 이것",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79376",
          "author": "NewsPeppermint",
          "description": "봄철의 불청객 꽃가루 알레르기는 정말 “안 겪어본 사람은 모르는” 일입니다. 올봄 몇 년 만에 극심한 꽃가루 알레르기가 도져서 고생했는데, 뉴욕타임스에 꽃가루 알레르기와 기후변화의 상관관계를 짚어본 칼럼이 실렸습니다. 칼럼을 쓴 마가렛 렝클이 겪은 고초에 공감하면서 글을 번역하고 나서 우리도 모르는 사이에 이미 너무 많이 진척된 기후변화 문제를 살펴봤습니다. 최근에 대서양의 거대한 해류의 속도가 느려지고 있다는 충격적인 사실을 알게 됐는데, 그 이야기를 해설로 담았습니다. 전문 번역: ‘느낌적 느낌’ 아니다, 봄이 최악의 계절인 사람들에겐 → 더 보기",
          "link": "https://newspeppermint.com/2024/05/20/npsp_pollenallergy/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_pollenallergy",
          "publishedOn": "2024-05-20T19:00:38.000Z",
          "wordCount": null,
          "title": "만악의 근원은 그놈이었네… “이미 늦었다”면 뭘 할 수 있을까",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "WALLFLOWER",
      "feedUrl": "http://rss.egloos.com/blog/wallflower",
      "siteUrl": "http://wallflower.egloos.com",
      "articles": []
    },
    {
      "title": "내 마음의 풍경",
      "feedUrl": "https://rss.blog.naver.com/sellars.xml",
      "siteUrl": "https://blog.naver.com/sellars?fromRss=true&trackingCode=rss",
      "articles": []
    },
    {
      "title": "The ZipCPU by Gisselquist Technology",
      "feedUrl": "https://zipcpu.com/feed",
      "siteUrl": "https://zipcpu.com/",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}