{
  "sources": [
    {
      "title": "ACM Queue - All Queue Content",
      "feedUrl": "https://queue.acm.org/rss/feeds/queuecontent.xml",
      "siteUrl": "http://queue.acm.org/Curmudgeon",
      "articles": []
    },
    {
      "title": "Arjun Sreedharan",
      "feedUrl": "https://arjunsreedharan.org/rss",
      "siteUrl": "https://arjunsreedharan.org/",
      "articles": []
    },
    {
      "title": "공간주의",
      "feedUrl": "https://attention2.space/feed/",
      "siteUrl": "https://attention2.space",
      "articles": [
        {
          "id": "https://attention2.space/?p=4127",
          "author": "attention2space",
          "description": "동시에 그는 말리노프스키(Bronisław Kasper Malinowski)가  파푸아뉴기니 남동부의 여러 섬들 사이의 교환 체계인 쿨라링(Kula Ring)을 따라 이동하며 연구했던 점을 지적하면서 다현장 연구가 아주 최근의 것만은 아님을 지적하기도 한다. 그럼에도 문화기술지 쓰기가 '가능성의 예술'이라면, 오늘날 어떠한 방식의 방법론적 변화가 가능할 것인가?",
          "link": "https://attention2.space/2024/multisite/",
          "publishedOn": "2024-08-11T09:20:46.000Z",
          "wordCount": null,
          "title": "[쇼트] 가능성의 예술로서 다현장문화기술지",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Clean Code Blog",
      "feedUrl": "https://blog.cleancoder.com/atom.xml",
      "siteUrl": "http://blog.cleancoder.com/atom.xml",
      "articles": []
    },
    {
      "title": "C++ Stories",
      "feedUrl": "https://www.cppstories.com/index.xml",
      "siteUrl": "https://www.cppstories.com/",
      "articles": [
        {
          "id": "https://www.cppstories.com/2024/cpp-query-file-attribs-faster/",
          "author": null,
          "description": "Imagine you’re developing a tool that needs to scan for file changes across thousands of project files. Retrieving file attributes efficiently becomes critical for such scenarios. In this article, I’ll demonstrate a technique to get file attributes that can achieve a surprising speedup of over 50+ times compared to standard Windows methods.\nLet’s dive in and explore how we can achieve this.\n\n\n\n     \n    \n\n\nThe inspiration for this article came from a recent update for Visual Assist - a tool that heavily improves Visual Studio experience and productivity for C# and C++ developers.\nIn one of their blog post, they shared:\nThe initial parse is 10..15x faster!\nWhat’s New in Visual Assist 2024—Featuring lightning fast parser performance [Webinar] - Tomato Soup\nAfter watching the webinar, I notic…",
          "link": "https://www.cppstories.com/2024/cpp-query-file-attribs-faster/",
          "publishedOn": "2024-08-11T00:00:00.000Z",
          "wordCount": null,
          "title": "Boost File Scanning Speed: Query File Attributes on Windows 50x Faster",
          "imageUrl": null
        },
        {
          "id": "https://www.cppstories.com/2024/enum-improvements/",
          "author": null,
          "description": "The evolution of the C++ language continues to bring powerful features that enhance code safety, readability, and maintainability. Among these improvements, we got changes and additions to enum class functionalities across C++17, C++20, and C++23. In this blog post, we’ll explore these advancements, focusing on initialization improvements in C++17, the introduction of the using enum keyword in C++20, and the std::to_underlying utility in C++23.\nLet’s go.\n\n\n\n     \n    \n\n\nBefore diving into the enhancements, let’s briefly recap what enum class is. An enum class (scoped enumeration) provides a type-safe way of defining a set of named constants. Unlike traditional (unscoped) enums, enum class does not implicitly convert to integers or other types, preventing accidental misuse. Here’s a basic e…",
          "link": "https://www.cppstories.com/2024/enum-improvements/",
          "publishedOn": "2024-08-04T00:00:00.000Z",
          "wordCount": null,
          "title": "Enum class improvements for C++17, C++20 and C++23",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Sticky Bits – Powered by Feabhas",
      "feedUrl": "https://blog.feabhas.com/feed/",
      "siteUrl": "https://blog.feabhas.com/",
      "articles": []
    },
    {
      "title": "The LLVM Project Blog",
      "feedUrl": "https://blog.llvm.org/index.xml",
      "siteUrl": "https://blog.llvm.org/",
      "articles": [
        {
          "id": "https://blog.llvm.org/posts/2024-08-09-libc-gpu-benchmarking/",
          "author": null,
          "description": "Hey everyone! My name is James and I worked on LLVM this summer through GSoC. My project is called GPU Libc Benchmarking. The main objective of this project was to develop microbenchmarking infrastructure for libc on the GPU.\nBackground\nThe LLVM libc project was designed as an alternative to glibc that aims to be modular, configurable, and sanitizer-friendly. Currently, LLVM libc is being ported to Nvidia and AMD GPUs to give libc functionality (e.g. printf(), malloc(), and math functions) on the GPU. As of March 2024, programs can use GPU libc in offloading languages (CUDA, OpenMP) or through direct compilation and linking with the libc library.\nWhat We Did\nDuring this project, we developed a microbenchmarking framework that is directly compiled for and run on the GPU, using libc function…",
          "link": "https://blog.llvm.org/posts/2024-08-09-libc-gpu-benchmarking/",
          "publishedOn": "2024-08-09T00:00:00.000Z",
          "wordCount": null,
          "title": "GSoC 2024: GPU Libc Benchmarking",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Embedded in Academia",
      "feedUrl": "https://blog.regehr.org/feed",
      "siteUrl": "https://blog.regehr.org",
      "articles": []
    },
    {
      "title": "Siemens Blog Network",
      "feedUrl": "https://blogs.sw.siemens.com/feed/",
      "siteUrl": "https://blogs.sw.siemens.com",
      "articles": []
    },
    {
      "title": "Embedded Software Insights | Latest Embedded Technology News",
      "feedUrl": "https://www.bluefruit.co.uk/blog/feed",
      "siteUrl": "https://bluefruit.co.uk/blog/",
      "articles": [
        {
          "id": "https://bluefruit.co.uk/?p=14079",
          "author": "Tristan Jago",
          "description": "The space industry is among the most innovative in the world. Propelled by communications, exploration, and R&D possibilities, it is estimated […]\nThe post 5 ways aerospace product development solves real-time challenges in space appeared first on Bluefruit Software.",
          "link": "https://bluefruit.co.uk/quality/aerospace-product-development-challenges/",
          "publishedOn": "2024-01-04T15:14:19.000Z",
          "wordCount": 2411,
          "title": "5 ways aerospace product development solves real-time challenges in space",
          "imageUrl": "https://bluefruit.co.uk/content/uploads/2024/01/Space-design-thumb.jpg"
        }
      ]
    },
    {
      "title": "Bartosz Ciechanowski",
      "feedUrl": "https://ciechanow.ski/atom.xml",
      "siteUrl": "https://ciechanow.ski/",
      "articles": []
    },
    {
      "title": "Architectures and Processors blog",
      "feedUrl": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog/rss",
      "siteUrl": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog",
      "articles": [
        {
          "id": "dd9e70c8-6d3c-4c71-b136-2456382a7b5c:56463e5b-511a-4cf0-9b93-3559823e3980",
          "author": "Khalid Saadi",
          "description": "This blog post describes how to implement the same matrix-matrix multiplication algorithm using three different Arm technologies: Neon, SVE, and SME.(read more)",
          "link": "https://community.arm.com/arm-community-blogs/b/architectures-and-processors-blog/posts/matrix-matrix-multiplication-neon-sve-and-sme-compared",
          "publishedOn": "2024-08-06T14:00:00.000Z",
          "wordCount": null,
          "title": "Part 3: Matrix-matrix multiplication. Neon, SVE, and SME compared",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "CPUU의 Daydreamin&#039;",
      "feedUrl": "https://cpuu.postype.com/rss",
      "siteUrl": "https://www.postype.com/@cpuu",
      "articles": []
    },
    {
      "title": null,
      "feedUrl": "https://danluu.com/atom.xml",
      "siteUrl": "https://danluu.com/atom/index.xml",
      "articles": [
        {
          "id": "https://danluu.com/codenames/",
          "author": null,
          "description": "About eight years ago, I was playing a game of Codenames where the game state was such that our team would almost certainly lose if we didn't correctly guess all of our remaining words on our turn. From the given clue, we were unable to do this. Although the game is meant to be a word guessing game based on word clues, a teammate suggested that, based on the physical layout of the words that had been selected, most of the possibilities we were considering would result in patterns that were \"too weird\" and that we should pick the final word based on the location. This worked and we won.\n\n[Click to expand explanation of Codenames if you're not familiar with the game]\nCodenames is played in two teams. The game has a 5x5 grid of words, where each word is secretly owned by one of {blue team, re…",
          "link": "https://danluu.com/codenames/",
          "publishedOn": "2024-08-11T00:00:00.000Z",
          "wordCount": null,
          "title": "How good can you be at Codenames without knowing any words?",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Dave Cheney",
      "feedUrl": "https://dave.cheney.net/feed/atom",
      "siteUrl": "https://dave.cheney.net",
      "articles": []
    },
    {
      "title": "Red Hat Developer",
      "feedUrl": "https://developers.redhat.com/blog/feed",
      "siteUrl": "https://developers.redhat.com/",
      "articles": [
        {
          "id": "7add97cb-07f7-4578-bce6-fb3a2a3b4a50",
          "author": "Dylan Orzel",
          "description": "In this article we'll explore how to make use of the built-in build capabilities available in Red Hat OpenShift 4 in a multi-arch compute environment, and how to make use of nodeSelectors to schedule builds on nodes of the architecture of our choosing. \nIn OpenShift, we can make use of the built-in Build, BuildConfig, and Build Strategies (Understanding Image Builds, Understanding BuildConfigs) objects to build container images on cluster nodes.\nIn a multi-arch compute cluster we can target nodes of a specific architecture with these build objects, and collect these architecture-specific container images into manifest lists of built images that can run anywhere in the cluster. These capabilities can lead to cost savings by enabling workloads to run on more cost-effective CPUs, as well as p…",
          "link": "https://developers.redhat.com/articles/2024/08/27/building-multi-architecture-container-images-openshift-container-platform",
          "publishedOn": "2024-08-27T07:00:00.000Z",
          "wordCount": null,
          "title": "Building multi-architecture container images on OpenShift Container Platform clusters",
          "imageUrl": null
        },
        {
          "id": "46002878-1316-4b3d-b780-2ef219d3e29e",
          "author": "Michael Dawson, Costas Papastathis",
          "description": "With the growth in the use of containers, the need to bundle your application into a container has never been stronger. Many Red Hat customers will be familiar with Source-to-Image (S2I) as an easy way to build container images from application source code. While S2I is a convenient way to build images on Red Hat OpenShift, Red Hat works to support our customers when using a variety of approaches, and we’ve recently seen an increasing interest in building applications using Cloud Native Computing Foundation (CNCF) Buildpacks.  \nThis is the second in a 5-part series of articles on building your applications with CNCF Buildpacks and Red Hat Universal Base Image (UBI). The series will include:\n\nBuilding applications with Paketo Buildpacks and Red Hat UBI container images \nRunning applications…",
          "link": "https://developers.redhat.com/articles/2024/08/26/running-applications-paketo-buildpacks-and-red-hat-ubi-container-images",
          "publishedOn": "2024-08-26T07:00:00.000Z",
          "wordCount": null,
          "title": "Running applications with Paketo Buildpacks and Red Hat UBI container images in OpenShift",
          "imageUrl": null
        },
        {
          "id": "9238ff3b-7314-45b2-9436-902d19ef618a",
          "author": "Kenny Ge",
          "description": "Using the algorithm for prefix sum/scan, covered in the previous module, we’re going to now write an algorithm for quicksort.\nThis is part 3 of a 4-part series. Catch up on the previous articles:\n\nWhat is GPU programming\n\nYour first GPU algorithm: Scan/prefix sum\n\nThe quicksort algorithm\nThe reason we’re doing quicksort, rather than something like merge sort, is that it’s very easy to parallelize– once you partition the array, each partition can be sorted completely independently. Plus, it is efficient in the average case, especially if you use randomness to select your pivot. \nRecall that the pseudocode for quicksort is as follows:\ndef quicksort(array, BLOCK_SIZE):\n\tp = randomly select pivot from array\n\tlet below_arr = global, reused array that stores the number of items in each block les…",
          "link": "https://developers.redhat.com/articles/2024/08/22/write-gpu-algorithm-quicksort",
          "publishedOn": "2024-08-22T07:00:00.000Z",
          "wordCount": null,
          "title": "Your second GPU algorithm: Quicksort",
          "imageUrl": null
        },
        {
          "id": "e8daa423-226f-44f0-947e-74711bd17892",
          "author": "Benjamin Schmeling, Andrea Peruffo",
          "description": "Operators are the standard way to package software and to automate day 1 and 2 operations for applications running on Red Hat OpenShift. Even the platform itself is based on cluster operators that encapsulate a single aspect of the OpenShift platform (e.g., how to deploy and update the DNS, API server, etc.), database or the internal registry. There is also a huge ecosystem of third party providers that are delivering their software via an operator. \nThe general idea behind the concept of operators is to automate installation, updates, backups, configuration, and many other operational tasks that are specific to the application the operator is managing. A concept that will also be useful for managing your own applications on the OpenShift platform. But how to start writing your own operato…",
          "link": "https://developers.redhat.com/articles/2024/08/21/design-kubernetes-operator-rest-resources",
          "publishedOn": "2024-08-22T07:00:00.000Z",
          "wordCount": null,
          "title": "Designing K8s operators for managing REST resources",
          "imageUrl": null
        },
        {
          "id": "788ec1d5-4de5-422f-ad23-e7ff2de65d40",
          "author": "Matthew Arnold",
          "description": "If you are planning a move to Red Hat OpenShift Virtualization, you may have a list of features that need to be checked to demonstrate similar capabilities to more established virtualization platforms. This article will guide you through one such feature: backing up and restoring virtual machines. There are several partner products that can simplify this operation, but these steps show a quick way to get started directly with the OpenShift APIs for Data Protection, provided by Red Hat.\nPreparation\nThese instructions assume you have administrative access to an OpenShift cluster. On this cluster, install and configure the following three Operators:\n\nRed Hat OpenShift Virtualization: Refer to these instructions to install OpenShift Virtualization and create a HyperConverged Operator instance.…",
          "link": "https://developers.redhat.com/articles/2024/08/21/how-back-and-restore-virtual-machines-openshift",
          "publishedOn": "2024-08-21T07:00:00.000Z",
          "wordCount": 4787,
          "title": "How to back up and restore virtual machines with OpenShift",
          "imageUrl": "https://developers.redhat.com/sites/default/files/styles/share/public/Secure_Coding_B_A.png?itok=8NSmwUJu"
        },
        {
          "id": "2479ff32-6704-4cce-b2a3-dcf6156297f2",
          "author": "Ian Tewksbury",
          "description": "The Operator Framework was paradigm shifting for managing infrastructure and providing services to users on Kubernetes by introducing a methodology for capturing a human operator's knowledge as a Kubernetes-native application, an Operator. The Operator Lifecycle Manager (OLM) brought systematic installation, removal, and update management for Operators. In parallel, the rise and recognition of the power and need for Git-based operations (GitOps) has brought much needed consistent, repeatable, and scalable management of not only Kubernetes and its surrounding ecosystem, but the management of the entire platform as a software product with full software development lifecycle (SLDC) for all the reasons end user applications have been refining their SDLC for all these years.\nChallenge\nOLM only …",
          "link": "https://developers.redhat.com/articles/2024/08/20/git-based-operations-gitops-operators-managed-operator-lifecycle-manager-olm",
          "publishedOn": "2024-08-20T07:00:00.000Z",
          "wordCount": null,
          "title": "Git-based operations (GitOps) for Operators managed by Operator Lifecycle Manager (OLM)",
          "imageUrl": null
        },
        {
          "id": "c0c9fef6-8188-4523-8358-9b7e538f965e",
          "author": "Vivian Chinoda",
          "description": "Red Hat OpenShift Local is a development environment where Red Hat OpenShift applications run on a local machine, and it provides a sandbox environment for developers to build, test, and iterate on applications without requiring access to a full-scale cloud infrastructure. And it’s just been made better with the addition of Red Hat OpenShift Lightspeed!\nRed Hat OpenShift Lightspeed is a generative AI virtual chat assistant that exists to improve productivity and accessibility for OpenShift users of all skill levels, from novices to experts. \nOpenShift Lightspeed on OpenShift Local\nOpenShift Lightspeed is easy to access since it’s integrated directly into the OpenShift web console. Furthermore, it allows you to bring your own large language models (LLMs) through the following supported prov…",
          "link": "https://developers.redhat.com/articles/2024/08/19/supercharge-your-red-hat-openshift-local-environment-red-hat-openshift",
          "publishedOn": "2024-08-19T07:00:00.000Z",
          "wordCount": null,
          "title": "Supercharge your Red Hat OpenShift local environment with Red Hat OpenShift Lightspeed",
          "imageUrl": null
        },
        {
          "id": "da421abc-57e1-408a-a5c6-c622cb5ef954",
          "author": "Leonardo Araujo",
          "description": "This article will teach you how to install and configure the Grafana Operator and integrate it with the openshift-monitoring stack using user-workload-monitoring. At the end of the article, we will import a dashboard with general metrics about Red Hat OpenShift Virtualization, which will give us an overview of the amount of resources in use, virtual machines (VMs) created, and their consumption.\nIn this article we use the following versions:\n\nRed Hat OpenShift v4.13.4\nRed Hat OpenShift Virtualization Operator v4.13.7\nGrafana Operator v5.6.0\n\nPrerequisites\n\nUser with the cluster-admin cluster role.\nGrafana Operator.\nUser-Defined Projects enabled.\n\nEnable user-defined projects\n\nExecute this command to add enableUserWorkload: true under data/config.yaml:\noc -n openshift-monitoring patch confi…",
          "link": "https://developers.redhat.com/articles/2024/08/19/monitoring-openshift-virtualization-using-user-defined-projects-and-grafana",
          "publishedOn": "2024-08-19T07:00:00.000Z",
          "wordCount": null,
          "title": "Monitoring OpenShift Virtualization using user-defined projects and Grafana",
          "imageUrl": null
        },
        {
          "id": "0e072e19-b716-47b1-b9f7-0fb60153663c",
          "author": "Valentina Rodriguez Sosa",
          "description": "In the previous articles in these series, we demonstrated how Red Hat OpenShift Virtualization and Red Hat Developer Hub can increase developer productivity by building virtual machines with a click of a button and showcased the user experience for developers when building a new virtual machine based on the definitions of platform engineering and operations. In this installment, we explore software templates concepts, architecture, and how to use them to build virtual machines (VMs).\nThe technology stack \nFigure 1 depicts the various technologies used in this solution.\n\n\n  \n      \n        \n  \n\n\n  \n\nFigure 1: The technology stack used for this solution.\n\nRed Hat OpenShift is a unified platform to build, modernize, and deploy applications at scale. Work smarter and faster with a complete set…",
          "link": "https://developers.redhat.com/articles/2024/08/16/create-software-templates-vms-openshift-virtualization",
          "publishedOn": "2024-08-16T07:00:00.000Z",
          "wordCount": null,
          "title": "Create software templates for VMs with OpenShift Virtualization",
          "imageUrl": null
        },
        {
          "id": "6fd190c3-184b-4315-98a4-058673f98711",
          "author": "Ramon Roman Nissen",
          "description": "We are pleased to announce the general availability of Red Hat’s Migration Toolkit for Applications (MTA) 7.1.\nIf you are not familiar with this tool, know that this tool is designed to help you replatform or refactor your existing applications to run on Red Hat OpenShift or Red Hat Application Foundations. With containerization-readiness, source-code analysis, and project management capabilities this tool can help your organization benefit from faster, safer legacy application modernization.\nThis new release is focused on improving the overall user experience and performance of the tool while introducing new features that address needs coming from modernization and migration field practitioners.\nOn top of that, the analysis engine that powers MTA has been fine tuned to considerably increa…",
          "link": "https://developers.redhat.com/articles/2024/08/15/whats-new-version-71-red-hats-migration-toolkit-applications",
          "publishedOn": "2024-08-15T07:00:00.000Z",
          "wordCount": null,
          "title": "What's new in version 7.1 of Red Hat’s Migration Toolkit for Applications",
          "imageUrl": null
        },
        {
          "id": "47d9832d-59e9-4551-9873-487790be950f",
          "author": "Kenny Ge",
          "description": "In Part 1 of this series, I explained what GPU programming is on a high level. Now we can move on to exploring your first GPU algorithm: scan/prefix sum.\nIf you've ever tried programming a GPU before, you're probably familiar with vector addition. This is the use case where you have two large arrays of numbers, and you want to build a new array, representing the element-wise sum. This algorithm is normally used to demonstrate the power of GPU programming, by showcasing one way to exploit its massively parallel capabilities. However, although this example is useful, it misses out on the techniques involved in more advanced GPU programming, because it views parallel programming as simply a tool that exists to parallelize certain workloads, rather than a language or set of computational tools…",
          "link": "https://developers.redhat.com/articles/2024/08/15/your-first-gpu-algorithm-scanprefix-sum",
          "publishedOn": "2024-08-15T07:00:00.000Z",
          "wordCount": null,
          "title": "Your first GPU algorithm: Scan/prefix sum",
          "imageUrl": null
        },
        {
          "id": "d5a20b96-6f09-4e8a-8a85-f91d06e8f967",
          "author": "Valentina Rodriguez Sosa",
          "description": "In Red Hat Developer Hub using Red Hat OpenShift Virtualization, developers can build and deploy their applications and build new virtual machines (VMs) by creating a component and choosing a pre-defined template. \nPlatform engineers and operations can extend self-service of creating VMs for developers and enable each software template via RBAC. \nIn the previous article in this series, we demonstrated how Red Hat OpenShift Virtualization and Red Hat Developer Hub can increase developer productivity by building virtual machines with a click of a button. In this article, we showcase the user experience for developers when building a new virtual machine based on the definitions of platform engineering and operations. We will define the developer experience, such as how much a developer can co…",
          "link": "https://developers.redhat.com/articles/2024/08/14/self-service-approach-building-virtual-machines-scale",
          "publishedOn": "2024-08-14T07:00:00.000Z",
          "wordCount": null,
          "title": "A self-service approach to building virtual machines at scale",
          "imageUrl": null
        },
        {
          "id": "5ca1298e-548f-4e01-ab7c-9b679d2daa58",
          "author": "Andreas Gerstmayr",
          "description": "Starting with Red Hat OpenShift distributed tracing 3.2 (tempo-operator v0.10.0), the Tempo operator supports an additional mode of deploying Tempo: the Tempo Monolithic mode, as a tech preview feature.\nIn this article, we introduce Tempo Monolithic mode, describe the pros and cons, and present example deployment manifests.\nWhat is Tempo Monolithic mode?\nIn Tempo Monolithic mode all core components such as compactor, distributor, ingester, querier, and query-frontend of Tempo are contained in a single binary, in a single container. This vastly simplifies the deployment, as only a single pod is created, and avoids potential issues arising from distributed deployments such as connectivity issues between pods or nodes, scheduling issues, etc. Additionally, this mode supports storing traces in…",
          "link": "https://developers.redhat.com/articles/2024/08/14/introducing-tempo-monolithic-mode",
          "publishedOn": "2024-08-14T07:00:00.000Z",
          "wordCount": null,
          "title": "Introducing Tempo Monolithic mode",
          "imageUrl": null
        },
        {
          "id": "173632a6-e43f-4a47-933b-d865d6d42123",
          "author": "Evan Shortiss",
          "description": "This article will take you through the process of getting started with Podman Desktop, creating a Node.js application (you can use your preferred programming language instead, if you like) and building it into a container using Podman Desktop, and configuring a continuous integration (CI) pipeline to build and push your container images to Quay.io using GitHub Actions workflows. In essence this is an introduction to the inner and outer loops of cloud-native development.\nTo get started, install Podman Desktop. This step is pretty straightforward, owing to the fact that Podman Desktop has a downloads page that supports typical installation flows for Linux, macOS, and Windows and has setup guides for each platform. Once installed, it will look something like this (Figure 1).\n\n\n\n  \n        \n\n\n…",
          "link": "https://developers.redhat.com/articles/2024/08/13/podman-desktop-containers-production",
          "publishedOn": "2024-08-13T07:00:00.000Z",
          "wordCount": null,
          "title": "From Podman Desktop to containers in production",
          "imageUrl": null
        },
        {
          "id": "6aa6d960-df0e-4eba-80d1-40e7e47541b1",
          "author": "Eliane Pereira, Eric Curtin, Micah Abbott, Sayan Paul",
          "description": "In mid-July, a faulty configuration update caused a significant global IT disruption, leading to transportation delays, point-of-sale issues, telecommunications outages and more. Affected machines entered a boot loop or boot recovery mode, rendering them inoperative; this underscores  the critical need for robust automated recovery mechanisms in IT infrastructure. One answer being iterated upon by the open source community is Greenboot, which is currently available in Red Hat Enterprise Linux (RHEL) for Edge, Red Hat In-Vehicle Operating System and Fedora IoT.\nGreenboot is designed to automatically recover from failed upgrades by integrating with systemd and atomically updated distros. It acts as a guardian for your system’s health, so that if an update goes awry, the system can automatica…",
          "link": "https://developers.redhat.com/articles/2024/08/12/greenboot-automate-rollbacks-atomically-updated-systems",
          "publishedOn": "2024-08-12T07:00:00.000Z",
          "wordCount": null,
          "title": "Greenboot: Automate rollbacks for atomically updated systems",
          "imageUrl": null
        },
        {
          "id": "5e1e4057-01f3-481f-9f5f-e763e17870a3",
          "author": "Ilya Buziuk, Manuel Hahn",
          "description": "Unsurprisingly, developers are looking for ways to include powerful new technologies like AI assistants to improve their workflow and productivity. However, many companies are reluctant to allow such technology due to privacy, security, and IP law concerns. \nThis activity addresses the concerns about privacy and security and describes how to deploy and integrate a private AI assistant in the emulated air-gapped on-premise environment. We will guide you through setting up a CDE (cloud development environment) using Ollama, Continue, Llama3, and Starcoder2 large language models (LLMs) with Red Hat OpenShift Dev Spaces, empowering you to code faster and more efficiently.  \nReady to streamline your cloud development workflow and bring some AI into it? Grab your favorite beverage, and let's emb…",
          "link": "https://developers.redhat.com/articles/2024/08/12/integrate-private-ai-coding-assistant-ollama",
          "publishedOn": "2024-08-12T07:00:00.000Z",
          "wordCount": null,
          "title": "Integrate a private AI coding assistant into your CDE using Ollama, Continue, and OpenShift Dev Spaces",
          "imageUrl": null
        },
        {
          "id": "4e0d9b7b-d792-441c-86aa-cf75af7d3244",
          "author": "Steven Lee",
          "description": "Network Observability 1.6 was released in June 2024. Even though this is considered a minor version upgrade from 1.5, it is a significant release that could lower the barrier to adoption into production.\nBut before we go further, for those of you new to Network Observability, it is an optional operator that provides a slew of capabilities to track and provide insight into your network traffic flows. While it works on any Kubernetes cluster, it works even better in a Red Hat OpenShift environment, which is what I will focus on in this article. I will only discuss the new features in this release so if you want the full feature list, read the documentation on About Network Observability.\nGraphs and logs without Loki and Storage\nPrior to 1.4, Network Observability required an external compone…",
          "link": "https://developers.redhat.com/articles/2024/08/12/whats-new-network-observability-16",
          "publishedOn": "2024-08-12T07:00:00.000Z",
          "wordCount": null,
          "title": "What's new in Network Observability 1.6",
          "imageUrl": null
        },
        {
          "id": "bbbd5780-a5de-4cf2-92aa-1671287bf566",
          "author": "Valentina Rodriguez Sosa",
          "description": "Red Hat OpenShift Virtualization enables teams to run and deploy their new and existing virtual machine (VM) workloads into Red Hat OpenShift. OpenShift Virtualization offers a path for infrastructure and application modernization, taking advantage of the simplicity and speed of a cloud-native application platform and aims to preserve existing virtualization investments while embracing modern management principles.\nWhat are the main benefits of Red Hat OpenShift Virtualization?\nRed Hat OpenShift Virtualization offers developers, IT operations, and platform engineers a comprehensive solution that simplifies VM migration and deployment, speeds up time to production, and unifies management across VMs, containers, and serverless workloads (Figure 1). Integrating existing virtual machines with …",
          "link": "https://developers.redhat.com/articles/2024/08/09/building-virtual-machines-red-hat-developer-hub-what-why-and-how",
          "publishedOn": "2024-08-09T07:00:00.000Z",
          "wordCount": null,
          "title": "Building virtual machines with Red Hat Developer Hub: The what, why, and how",
          "imageUrl": null
        },
        {
          "id": "928f76cf-1c65-4c3e-8c9f-097b04ddfabf",
          "author": "Guinevere Larsen",
          "description": "Time traveling is an extremely useful tool for developers that found a bug in their code. Beyond wanting to travel to a future where the bug is fixed, developers will usually try to slow down time with a debugger, so they can examine where things go wrong. But what if even with a debugger, it is still too late and the bug has already happened? Wouldn’t it be nice to be able to go back in time and see it happening in real time?\nLet’s talk about time travel debugging. In this post, I’ll go over the following commands:\n\nrecord\nrecord stop\nrecord save\nrecord full restore\nreverse-next (rn)\nreverse-step (rs)\nset exec-direction\nreverse-continue (rc)\n\nAs a final note, there are many implementations on many different debuggers, but this post will be focusing on GNU Debugger’s (GDB) record-full impl…",
          "link": "https://developers.redhat.com/articles/2024/08/08/using-gdb-time-travel",
          "publishedOn": "2024-08-08T07:00:00.000Z",
          "wordCount": null,
          "title": "Using GDB to time travel",
          "imageUrl": null
        },
        {
          "id": "c2913360-d3d6-403e-9695-1b5b0ed59b57",
          "author": "Justin Kulikauskas",
          "description": "We introduced OperatorPolicy as a tech preview feature in Red Hat Advanced Cluster Management for Kubernetes (RHACM) version 2.10 to improve the management of Kubernetes-native applications packaged with the Operator Lifecycle Manager (OLM) across a fleet of clusters. With the RHACM 2.11 release, this feature is now ready for you to try, with improvements in the following scenarios:\n\nGetting started: you have fewer required fields, lowering your barrier to entry.\nControlling upgrades: an initial installation is treated separately from later upgrades, and you can have either restricted to specific versions of the operator.\nAlert control: you can configure which situations are considered as violations, or are just informational for your specific needs.\nUninstallation: you have new tools to a…",
          "link": "https://developers.redhat.com/articles/2024/08/08/getting-started-operatorpolicy",
          "publishedOn": "2024-08-08T07:00:00.000Z",
          "wordCount": null,
          "title": "Getting started with OperatorPolicy",
          "imageUrl": null
        },
        {
          "id": "f773cd03-dec8-4c51-bffd-04599a174f03",
          "author": "Kenny Ge",
          "description": "Welcome! This guide will help you get started with general purpose graphics processing unit (GPU) programming, otherwise known as GPGPU. It is intended to:\n\nTeach you the basics of parallel GPU programming, such as the SIMD model.\nWalk you through some key algorithms, such as scan/prefix sum, quicksort, and game of life.\nShow you working examples of code from OpenAI’s Triton, CUDA, OpenCL, torch.compile, Numba, and HIP/HCC.\nHelp you determine which framework to use, and go over any common pitfalls.\n\nThis guide focuses more on the algorithms and architecture, with a heavy emphasis on how to effectively use the computational model. In my personal experience, I found GPU programming to be a fascinating concept, although many of the existing resources seemed to be focused primarily on system-l…",
          "link": "https://developers.redhat.com/articles/2024/08/07/what-gpu-programming",
          "publishedOn": "2024-08-07T07:00:00.000Z",
          "wordCount": null,
          "title": "What is GPU programming",
          "imageUrl": null
        },
        {
          "id": "ce00ac7e-132c-4801-9d1d-a7644d946f3e",
          "author": "Gaurav Midha",
          "description": "In today's data-driven world, organizations are always looking for new ways to get insightful information from their new or existing data in order to spread their business. Red Hat OpenShift AI enables data scientists and developers to efficiently collaborate and create solid, scalable, and reproducible data science projects in response to this demand. \nArchitecture of Red Hat OpenShift AI\nRed Hat OpenShift AI helps you build out an enterprise grade AI and MLOps platform to create and deliver GenAI and predictive models by providing supported AI tooling on top of OpenShift. It’s based on Red Hat OpenShift, a container based application platform that efficiently scales to handle workload demands of AI operations and models. You can run your AI workloads across the hybrid cloud, including ed…",
          "link": "https://developers.redhat.com/articles/2024/08/06/red-hat-openshift-ai-and-machine-learning-operations",
          "publishedOn": "2024-08-06T07:00:00.000Z",
          "wordCount": null,
          "title": "Red Hat OpenShift AI and machine learning operations",
          "imageUrl": null
        },
        {
          "id": "5ee8f3d8-91af-47f8-aac5-483a7e5e6fc8",
          "author": "Cedric Clyburn, Legare Kerrison",
          "description": "Adapting large language models (LLMs) for specific use cases traditionally requires extensive resources and expertise. While Gartner says more than 80% of enterprises will have deployed generative AI-enabled applications by 2026, the challenge of customizing these models for domain-specific tasks remains significant. InstructLab, an open-source project developed by IBM and Red Hat, aims to address this gap by democratizing LLM tuning. Let’s take a look at how InstructLab enables developers (and domain experts) to enhance and specialize language models efficiently, even on consumer-grade hardware, potentially accelerating the adoption of tailored AI solutions across industries. This article is accompanied by a conference presentation given by Legare Kerrison and Cedric Clyburn at WeAreDevel…",
          "link": "https://developers.redhat.com/articles/2024/08/05/how-instructlab-enables-accessible-model-fine-tuning-gen-ai",
          "publishedOn": "2024-08-05T07:00:00.000Z",
          "wordCount": null,
          "title": "How InstructLab enables accessible model fine-tuning for gen AI",
          "imageUrl": null
        },
        {
          "id": "ae9ecad3-fa26-4c36-b0c7-13f072dfbb10",
          "author": "Cedric Clyburn",
          "description": "As developers, we're always looking for ways to be more productive and write higher-quality code. While tools like GitHub Copilot have gained popularity as AI pair programmers, the downside is they run on closed models and you might have to pay a subscription to use them. Imagine instead being able to use state-of-the-art free AI coding assistants right on your local machine using powerful open source models, with auto-completions and confidence that your data stays private! \nLet’s take a look at how to integrate an AI code assistant into your IDE using a combination of open source tools, including Continue (an extension for VS Code and JetBrains), Ollama or InstructLab as a local model server, and the Granite family of code models to supercharge your development workflow without any cost …",
          "link": "https://developers.redhat.com/articles/2024/08/01/open-source-ai-coding-assistance-granite-models",
          "publishedOn": "2024-08-01T07:00:00.000Z",
          "wordCount": null,
          "title": "Open source AI coding assistance with the Granite models",
          "imageUrl": null
        },
        {
          "id": "4b523a23-28b5-4e53-bd32-45d5e56a8702",
          "author": "Christina Xu",
          "description": "Detoxifying or preventing toxic content generation from large language models (LLMs) is challenging. Data used to train these models is usually scraped from the internet which often contains toxic content. Without proper guardrails, a model can learn undesirable properties and in turn, generate toxic text. Removing toxic samples from training data can be expensive as it usually requires data annotators to manually identify samples that align with human values. Inherent bias in the annotators themselves can also affect the data labeling process in a negative way. By using the open source project TrustyAI Detoxify in conjunction with Hugging Face's SFTTrainer (Supervised Fine-Tuning Trainer) on Red Hat OpenShift AI, we can help lower the costs of detoxifying LLMs during training. \nIn this ar…",
          "link": "https://developers.redhat.com/articles/2024/08/01/trustyai-detoxify-guardrailing-llms-during-training",
          "publishedOn": "2024-08-01T07:00:00.000Z",
          "wordCount": null,
          "title": "TrustyAI Detoxify: Guardrailing LLMs during training",
          "imageUrl": null
        },
        {
          "id": "8f690152-28e1-42b3-9eb4-d084ae1e9055",
          "author": "Vamsi Ravula",
          "description": "According to Gartner, despite the growing trend towards cloud migration and container adoption, a significant portion of datacenter x86 workloads will remain hypervisor-based virtualization through 2027, albeit reduced from previous years. See this e-book for more information on this topic. Managing a hybrid infrastructure that includes both hypervisor-based virtual machines and Kubernetes clusters can be a daunting task.\nFor platform teams, the challenge lies in efficiently managing diverse environments while optimizing existing investments. Red Hat OpenShift Virtualization offers a compelling solution by allowing organizations to run both virtual machines (VMs) and containers on a single, unified platform. This enables them to have a platform that addresses their current needs while also…",
          "link": "https://developers.redhat.com/articles/2024/08/01/minimize-downtime-when-migrating-vmware-openshift-virtualization",
          "publishedOn": "2024-08-01T07:00:00.000Z",
          "wordCount": null,
          "title": "Minimize downtime when migrating from VMware to OpenShift Virtualization",
          "imageUrl": null
        },
        {
          "id": "e6d51a6d-803f-45f4-bfec-27f5d25a97bb",
          "author": "Ramon Acedo Rodriguez",
          "description": "Adding nodes to Red Hat OpenShift clusters on-premises is a laborious and sometimes complex endeavor. With various methods available, each with different levels of automation, users often find themselves navigating through complex and even unsupported solutions, leading to a less-than-ideal user experience. \nA new feature is now available as a Developer Preview in OpenShift 4.16, that makes cluster expansions faster, simpler, and more user-friendly than ever before.\nThis new method leverages the Agent Based Installer technology under the hood, but doesn’t need the cluster to have been installed by it, it will work on any cluster where its nodes can be installed from an ISO image.\nIt first gets information of the cluster to be expanded, then it provides a bootable ISO image, and after booti…",
          "link": "https://developers.redhat.com/articles/2024/07/31/easily-expanding-red-hat-openshift-clusters",
          "publishedOn": "2024-07-31T07:00:00.000Z",
          "wordCount": null,
          "title": "Easily expanding Red Hat OpenShift clusters",
          "imageUrl": null
        },
        {
          "id": "11ed32d2-2b95-4194-aa59-1f3bb41441b5",
          "author": "Fernando Lozano",
          "description": "If you develop applications with a cloud-first mindset, you probably use (or plan to use) object storage with the S3 API from Amazon Web Services (AWS). Even if you do not use AWS, all large and smaller public cloud providers offer object storage compatible with the S3 API.\nIf you plan to work with artificial intelligence (AI), most AI tools require S3 storage to store data from models, training, and tuning, besides the raw data on which AI models make inferences and the results of such inferences.\nBut, if you have to work on premises, or have to create applications which must work both on premises and on cloud, you require something that provides an S3-compatible API outside of cloud providers. Red Hat OpenShift Data Foundation is a nice alternative proven to support large scale deploymen…",
          "link": "https://developers.redhat.com/articles/2024/07/31/red-hat-openshift-data-foundation-developers-and-data-scientists",
          "publishedOn": "2024-07-31T07:00:00.000Z",
          "wordCount": null,
          "title": "Red Hat OpenShift Data Foundation for developers and data scientists",
          "imageUrl": null
        },
        {
          "id": "1ef09165-659e-4bc1-81e6-09ab9d398e39",
          "author": "Himanshu Yadav",
          "description": "Red Hat Developer Hub is an enterprise-grade internal developer portal (IDP). It allows platform engineering teams to offer software templates based on your best practices to maximize developer skills, ease onboarding, increase development productivity, and focus on writing great code by reducing friction and frustration for development teams.\nRed Hat is constantly curating a set of plug-ins and ensuring the best experience on Red Hat Developer Hub. Red Hat supported and validated  plug-ins let you extend the Red Hat Developer Hub environment with confidence, eliminating compatibility and operational issues.\nAs part of these efforts, we are pleased to announce Technology Preview of Ansible plug-ins for Red Hat Developer Hub. With Ansible plug-ins, organizations using Red Hat Developer Hub …",
          "link": "https://developers.redhat.com/articles/2024/07/30/announcing-ansible-plug-ins-red-hat-developer-hub",
          "publishedOn": "2024-07-30T16:04:11.000Z",
          "wordCount": null,
          "title": "Announcing Ansible plug-ins for Red Hat Developer Hub",
          "imageUrl": null
        },
        {
          "id": "d924849e-4059-4a9a-8620-3258d7dfdbd9",
          "author": "Romain Pelisse",
          "description": "Based on the project Apache Kafka, streams for Apache Kafka is a powerful, innovative distributed event streaming platform. Using a fully distributed architecture, a streams for Apache Kafka cluster requires you to setup and deploy numerous services, ensure they are all properly configured and, even more importantly, that each component is functional and can communicate with each other. \nFor all these reasons, applying an automation solution such as Red Hat Ansible Automation Platform to deploy and manage streams for Apache Kafka makes a lot of sense, especially as Ansible now has a collection dedicated for the product.\nOverview\nAs mentioned, a typical implementation of streams for Apache Kafka includes several components, each deployed on numerous target systems. Depending on the organiza…",
          "link": "https://developers.redhat.com/articles/2024/07/30/set-streams-apache-kafka-cluster-ansible",
          "publishedOn": "2024-07-30T07:00:00.000Z",
          "wordCount": null,
          "title": "Set up a streams for Apache Kafka cluster with Ansible",
          "imageUrl": null
        },
        {
          "id": "8d98dd31-6c94-44f2-a54f-26d1452b6962",
          "author": "Yashwanth Maheshwaram",
          "description": "As AI and machine learning become integral to modern applications, developers need robust platforms that simplify the development and deployment process. Red Hat OpenShift AI offers a powerful and flexible environment tailored for these needs, making it easier for AI engineers and DevOps teams to collaborate and deliver high-quality AI solutions. In this blog post, we’ll explore how to set up a fraud detection system using Red Hat OpenShift AI, complete with a practical example and a demo API.\nDeveloper experience with OpenShift\nOpenShift AI simplifies the journey for teams working on AI applications. Utilizing OpenShift AI and Red Hat OpenShift, developers can enjoy a streamlined and efficient workflow. Let's take a look at an overview of the process:\n\n\n\n\n  \n\nAccess Jupyter Notebook: Begi…",
          "link": "https://developers.redhat.com/articles/2024/07/29/creating-ai-powered-service-detecting-fraudulent-card-transactions",
          "publishedOn": "2024-07-29T14:57:45.000Z",
          "wordCount": null,
          "title": "Creating an AI-powered service for detecting fraudulent card transactions",
          "imageUrl": null
        },
        {
          "id": "8d98dd31-6c94-44f2-a54f-26d1452b6962",
          "author": "Yashwanth Maheshwaram",
          "description": "As AI and machine learning become integral to modern applications, developers need robust platforms that simplify the development and deployment process. Red Hat OpenShift AI offers a powerful and flexible environment tailored for these needs, making it easier for AI engineers and DevOps teams to collaborate and deliver high-quality AI solutions. In this blog post, we’ll explore how to set up a fraud detection system using Red Hat OpenShift AI, complete with a practical example and a demo API.\nDeveloper Experience with OpenShift\nOpenShift AI simplifies the journey for teams working on AI applications. Utilising OpenShift AI and Red Hat OpenShift, developers can enjoy a streamlined and efficient workflow. Let's take a look  overview of the process:\n\n\n\n\n  \n\nAccess Jupyter Notebook: Begin by …",
          "link": "https://developers.redhat.com/articles/2024/07/29/creating-ai-powered-service-detecting-fraudulant-card-transactions",
          "publishedOn": "2024-07-29T14:57:45.000Z",
          "wordCount": null,
          "title": "Creating an AI powered service for detecting fraudulant card transactions",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "edykim.com 블로그 RSS 피드",
      "feedUrl": "https://edykim.com/ko/feed.xml",
      "siteUrl": "https://edykim.com/",
      "articles": []
    },
    {
      "title": "Eli Bendersky's website",
      "feedUrl": "https://eli.thegreenplace.net/feeds/all.atom.xml",
      "siteUrl": "https://eli.thegreenplace.net/",
      "articles": [
        {
          "id": "https://eli.thegreenplace.net/2024/sentencepiece-bpe-tokenizer-in-go/",
          "author": null,
          "description": "<p>Earlier this year I wrote a <a class=\"reference external\" href=\"https://eli.thegreenplace.net/2024/tokens-for-llms-byte-pair-encoding-in-go/\">post about implementing BPE tokenization in Go</a>,\nwhich made it possible to reproduce OpenAI's tokenizer.</p>\n<p>Today I want to mention a new project I've been hacking on recently:\n<a class=\"reference external\" href=\"https://github.com/eliben/go-sentencepiece\">go-sentencepiece</a>\n- a pure Go implementation of the <a class=\"reference external\" href=\"https://github.com/google/sentencepiece\">SentencePiece</a> tokenizer\nthat's used for Google AI's models like …</p>",
          "link": "https://eli.thegreenplace.net/2024/sentencepiece-bpe-tokenizer-in-go/",
          "publishedOn": "2024-08-23T17:35:00.000Z",
          "wordCount": null,
          "title": "SentencePiece BPE Tokenizer in Go",
          "imageUrl": null
        },
        {
          "id": "https://eli.thegreenplace.net/2024/building-static-binaries-with-go-on-linux/",
          "author": null,
          "description": "<p>One of Go's advantages is being able to produce statically-linked\nbinaries <a class=\"footnote-reference\" href=\"#footnote-1\" id=\"footnote-reference-1\">[1]</a>. This doesn't mean that Go always produces such binaries by default,\nhowever; in some scenarios it requires extra work to make this happen.\nSpecifics here are OS-dependent; here we focus on Unix systems.</p>\n<div class=\"section\" id=\"basics-hello-world\">\n<h2>Basics - hello world</h2>\n<p>This post …</p></div>",
          "link": "https://eli.thegreenplace.net/2024/building-static-binaries-with-go-on-linux/",
          "publishedOn": "2024-07-30T21:35:00.000Z",
          "wordCount": null,
          "title": "Building static binaries with Go on Linux",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Embedded Artistry",
      "feedUrl": "https://embeddedartistry.com/feed/",
      "siteUrl": "https://embeddedartistry.com/",
      "articles": [
        {
          "id": "https://embeddedartistry.com/?p=42412",
          "author": "Phillip Johnston",
          "description": "31 July 2024 by Phillip JohnstonDuring 2022-2023, Embedded Artistry and Memfault teamed up to run a series of embedded-focused discussion panels. These discussion panels were rich with insight and advice for embedded teams. Even if you missed the live broadcasts, we hope you will take time to watch the recordings. Building Embedded Systems at Scale … \nContinue reading \"2022-2023 Quarterly Discussion Panel Archives\"\nThe post 2022-2023 Quarterly Discussion Panel Archives appeared first on Embedded Artistry.",
          "link": "https://embeddedartistry.com/blog/2024/07/31/2022-2023-quarterly-discussion-panel-archives/",
          "publishedOn": "2024-07-31T19:07:47.000Z",
          "wordCount": null,
          "title": "2022-2023 Quarterly Discussion Panel Archives",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Embedded",
      "feedUrl": "https://www.embedded.com/feed/",
      "siteUrl": "https://www.embedded.com/",
      "articles": [
        {
          "id": "https://www.embedded.com/?p=4490678",
          "author": "Nitin Dahad",
          "description": "For years, Linux has dominated the embedded and IoT landscape, lauded for its flexibility and mature ecosystem. However, a renaissance is unfolding in real-time operating systems (RTOS). Propelled by open-source initiatives, big tech backing, and a growing demand for low-latency and resource-constrained applications, RTOS development environments are rapidly closing the gap with their more established […]\nThe post The RTOS renaissance: closing the OS gap with Linux in IoT appeared first on Embedded.",
          "link": "https://www.embedded.com/the-rtos-renaissance-closing-the-os-gap-with-linux-in-iot/",
          "publishedOn": "2024-08-21T14:45:00.000Z",
          "wordCount": null,
          "title": "The RTOS renaissance: closing the OS gap with Linux in IoT",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490671",
          "author": "Stephen Evanczuk",
          "description": "As someone who has spent over two decades in the embedded systems industry, I’ve seen the vast evolution of technology—from 8-bit microcontrollers to today’s sophisticated, multicore systems. Yet, one thing remains constant: pointers in C and C++. They are a double-edged sword that can lead to incredible flexibility in memory management but can also wreak […]\nThe post Best practices to safely navigate pointers in C/C++ appeared first on Embedded.",
          "link": "https://www.embedded.com/best-practices-to-safely-navigate-pointers-in-c-c/",
          "publishedOn": "2024-08-20T22:36:52.000Z",
          "wordCount": null,
          "title": "Best practices to safely navigate pointers in C/C++",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490665",
          "author": "Stephen Evanczuk",
          "description": "Electronics are expected to comprise roughly half the cost of a new car by 2030, which ups the ante for automotive engineers tasked with “designing in” more features and functionality in the same or less space while meeting rigorous demands for enhanced reliability. Fueling this challenge are four transformational trends: connectivity, autonomous driving, in-vehicle experience […]\nThe post Optimizing vehicle design through rugged, miniaturized connectors appeared first on Embedded.",
          "link": "https://www.embedded.com/optimizing-vehicle-design-through-rugged-miniaturized-connectors/",
          "publishedOn": "2024-08-20T22:10:09.000Z",
          "wordCount": null,
          "title": "Optimizing vehicle design through rugged, miniaturized connectors",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490657",
          "author": "Nitin Dahad",
          "description": "Two separate announcements around the Wi-Fi HaLow standard caught our eye over the last few weeks. One is the collaboration between Milesight and Morse Micro to launch Wi-Fi HaLow variants of smart IoT products, and the other was the announcement by the Wireless Broadband Alliance of successful completion of real-world field trials of Wi-Fi HaLow […]\nThe post Wi-Fi HaLow smart IoT products emerge, and real world field trials’ success appeared first on Embedded.",
          "link": "https://www.embedded.com/wi-fi-halow-smart-iot-products-emerge-and-real-world-field-trials-success/",
          "publishedOn": "2024-08-19T13:31:29.000Z",
          "wordCount": null,
          "title": "Wi-Fi HaLow smart IoT products emerge, and real world field trials’ success",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490652",
          "author": "Nitin Dahad",
          "description": "Akeana, a well-funded, 150-strong configurable RISC-V processor startup came out of stealth mode earlier this month to challenge the ‘status quo’ of the semiconductor industry, hoping to unseat both Arm as well as RISC-V companies like SiFive and Andes from design sockets. In the briefing to announce its launch, Akeana CEO Rabin Sugumar said it […]\nThe post Startup comes out of stealth with RISC-V processors to challenge Arm and others appeared first on Embedded.",
          "link": "https://www.embedded.com/startup-comes-out-of-stealth-with-risc-v-processors-to-challenge-arm-and-others/",
          "publishedOn": "2024-08-16T20:22:37.000Z",
          "wordCount": null,
          "title": "Startup comes out of stealth with RISC-V processors to challenge Arm and others",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490648",
          "author": "Catherine C Lanucha",
          "description": "The latest PSA Certified report for 2024 indicates that 71 percent of AI-driven cyber threats are a significant cause for concern and that while AI innovation maybe be beneficial, its proliferation at the edge also significantly increases attack surfaces. Overall, the report found a gap in AI-security integration that needs to be addressed if organizations […]\nThe post AI innovation is outpacing security appeared first on Embedded.",
          "link": "https://www.embedded.com/ai-innovation-is-outpacing-security/",
          "publishedOn": "2024-08-15T18:38:15.000Z",
          "wordCount": null,
          "title": "AI innovation is outpacing security",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490633",
          "author": "Stephen Evanczuk",
          "description": "The rising popularity of time of flight (TOF) cameras in industrial applications, particularly in robotics, is attributed to their exceptional depth computing and infrared (IR) imaging capabilities. Despite these advantages, the inherent complexity of the optical system often constrains the field of view, limiting standalone functionality. This article discusses a 3D image stitching algorithm designed […]\nThe post Enhancing vision sensor capabilities with a 3D image stitching algorithm appeared first on Embedded.",
          "link": "https://www.embedded.com/enhancing-vision-sensor-capabilities-with-a-3d-image-stitching-algorithm/",
          "publishedOn": "2024-08-14T14:58:46.000Z",
          "wordCount": null,
          "title": "Enhancing vision sensor capabilities with a 3D image stitching algorithm",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490622",
          "author": "Stephen Evanczuk",
          "description": "Global data usage has skyrocketed since the launch of the first smartphones. In 2010 the figure stood at just 2 ZB. Fast forward to now and it has reached 120 ZB and this figure is predicted to increase by a further 150% by the end of 2025. It is estimated that 90% of this data […]\nThe post The need for change in mobile radio front end design appeared first on Embedded.",
          "link": "https://www.embedded.com/the-need-for-change-in-mobile-radio-front-end-design/",
          "publishedOn": "2024-08-14T14:29:35.000Z",
          "wordCount": null,
          "title": "The need for change in mobile radio front end design",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490616",
          "author": "Stephen Evanczuk",
          "description": "Learning Embedded Rust requires understanding high-level language concepts and the low-level details to interact with hardware. I recommend starting at the high level by reading The Rust Programming Language book. Once you understand those concepts, diving into the embedded side of the equation is easier. We’re not going to take that approach, though, in this […]\nThe post Embedded Rust: The Cortex-M QuickStart Template appeared first on Embedded.",
          "link": "https://www.embedded.com/embedded-rust-the-cortex-m-quickstart-template/",
          "publishedOn": "2024-08-14T13:47:41.000Z",
          "wordCount": null,
          "title": "Embedded Rust: The Cortex-M QuickStart Template",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490592",
          "author": "Stephen Evanczuk",
          "description": "Once again, opening social media or your favorite news application is impossible without hearing about the latest security incident. This time, it wasn’t a security breach that caught headlines; it was a security company that rolled out an update that crashed Windows computers, causing a massive IT outage that affected 8.5 million computers. Those customers […]\nThe post 7 lessons every developer should learn from CrowdStrike’s Doomsday update appeared first on Embedded.",
          "link": "https://www.embedded.com/lessons-every-developer-should-learn-from-crowdstrikes-doomsday-update/",
          "publishedOn": "2024-08-06T16:46:15.000Z",
          "wordCount": null,
          "title": "7 lessons every developer should learn from CrowdStrike’s Doomsday update",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490572",
          "author": "Stephen Evanczuk",
          "description": "The backup battery shelf is an important feature of power management systems in an Open Compute Project (OCP) Open Rack V3 (ORV3) battery backup unit (BBU) architecture and data center application, especially in the field of uninterruptible power supplies (UPSs). These shelves, with a precise design focused on housing and organizing backup batteries, emerge as […]\nThe post Shelf operation of an OCP ORV3 smart battery backup unit appeared first on Embedded.",
          "link": "https://www.embedded.com/shelf-operation-of-an-ocp-orv3-smart-battery-backup-unit/",
          "publishedOn": "2024-08-06T12:04:36.000Z",
          "wordCount": null,
          "title": "Shelf operation of an OCP ORV3 smart battery backup unit",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490558",
          "author": "Nitin Dahad",
          "description": "TDK Corporation has formed a new wholly owned corporate legal entity to focus on solutions for industry 4.0 and particularly the intersection of artificial intelligence (AI) and sensor fusion at the edge for machine and production health. Headquartered in Singapore, the new entity, called TDK SensEI, will create industry 4.0 solutions combining multiple TDK assets […]\nThe post TDK forms new entity to bring edge AI and sensor fusion to industry 4.0 appeared first on Embedded.",
          "link": "https://www.embedded.com/tdk-forms-new-entity-to-bring-edge-ai-and-sensor-fusion-to-industry-4-0/",
          "publishedOn": "2024-08-05T14:17:31.000Z",
          "wordCount": null,
          "title": "TDK forms new entity to bring edge AI and sensor fusion to industry 4.0",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490563",
          "author": "Nitin Dahad",
          "description": "Microchip Technology has launched a new family of digital signal controllers (DSCs) which offer faster computation and precision in real-time control applications. Built around a 32-bit central processing unit (CPU) architecture with a 200 MHz operating speed, the new dsPIC33A family’s advanced core includes a double-precision floating-point unit (DP FPU) and DSP instructions for numerically […]\nThe post Microchip digital signal controller enhances precision real-time control appeared first on Embedded.",
          "link": "https://www.embedded.com/microchip-digital-signal-controller-enhances-precision-real-time-control/",
          "publishedOn": "2024-08-05T12:30:00.000Z",
          "wordCount": null,
          "title": "Microchip digital signal controller enhances precision real-time control",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490546",
          "author": "Nitin Dahad",
          "description": "Advanced printed circuit boards (PCBs) are so complex, OEMs often scratch their heads and wonder if they are going down the right path with their PCB assemblies. With many challenges for their specific board applications, not all assembly houses are equipped to deal with one key area, the radio frequency (RF) PCB. When an RF […]\nThe post How to avoid too much solder on your RF PCB appeared first on Embedded.",
          "link": "https://www.embedded.com/how-to-avoid-too-much-solder-on-your-rf-pcb/",
          "publishedOn": "2024-08-05T10:59:11.000Z",
          "wordCount": null,
          "title": "How to avoid too much solder on your RF PCB",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490505",
          "author": "Nitin Dahad",
          "description": "The flying taxis with smart assistants from the Fifth Element, a stunning Audi RSQ, custom built by Audi for I, Robot, and the Lexus 2054 with advanced biometric systems and automatic driving mode from Minority Report: it seems automakers from around the world are racing to be the first to make these dreams come true. While such advanced hi-tech vehicles have […]\nThe post Poor roads, money, and cybercriminals: why sci-fi cars are not here yet appeared first on Embedded.",
          "link": "https://www.embedded.com/poor-roads-money-and-cybercriminals-why-sci-fi-cars-are-not-here-yet/",
          "publishedOn": "2024-07-31T17:27:25.000Z",
          "wordCount": null,
          "title": "Poor roads, money, and cybercriminals: why sci-fi cars are not here yet",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490486",
          "author": "Nitin Dahad",
          "description": "Amidst the many disruptions faced by the global semiconductor industry, the relentless pursuit of higher performance silicon to power the ever-evolving landscape of modern technology has only increased. While Covid-19 underscored the vulnerability of the semiconductor supply chain, the demand for innovative silicon remains steadfast, driving continual advancements in product development . For semiconductor organizations […]\nThe post A software-connected approach to automated post-silicon device validation appeared first on Embedded.",
          "link": "https://www.embedded.com/a-software-connected-approach-to-automated-post-silicon-device-validation/",
          "publishedOn": "2024-07-31T12:50:55.000Z",
          "wordCount": null,
          "title": "A software-connected approach to automated post-silicon device validation",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490482",
          "author": "Nitin Dahad",
          "description": "Alphawave Semi said it has launched the industry’s first successful silicon bring-up of Universal Chiplet Interconnect Express (UCIe) die-to-die (D2D) IP with TSMC’s 3nm chip-on-wafer-on-substrate (CoWoS) advanced packaging technology. The complete PHY and controller subsystem was developed in collaboration with TSMC and targets applications such as hyperscaler, high-performance computing (HPC) and artificial intelligence (AI). Using […]\nThe post Alphawave Semi launches 3nm UCIe IP for chiplet ecosystem appeared first on Embedded.",
          "link": "https://www.embedded.com/alphawave-semi-launches-3nm-ucie-ip-for-chiplet-ecosystem/",
          "publishedOn": "2024-07-31T11:32:12.000Z",
          "wordCount": null,
          "title": "Alphawave Semi launches 3nm UCIe IP for chiplet ecosystem",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490476",
          "author": "Nitin Dahad",
          "description": "A new community-driven open source project based on a derivative of Debian and designed to deliver enterprise-grade Linux for edge-to-cloud deployments has launched its first release. The eLxr project, spearheaded by Wind River and supported by AWS, Intel, Supermicro, SAIC, and Capgemini, is an enterprise-grade Linux distribution that addresses the challenges of near-edge networks and […]\nThe post Debian derivative eLxr addresses simplifies and enhance edge-to-cloud appeared first on Embedded.",
          "link": "https://www.embedded.com/debian-derivative-elxr-addresses-simplifies-and-enhance-edge-to-cloud/",
          "publishedOn": "2024-07-31T10:36:10.000Z",
          "wordCount": null,
          "title": "Debian derivative eLxr addresses simplifies and enhance edge-to-cloud",
          "imageUrl": null
        },
        {
          "id": "https://www.embedded.com/?p=4490453",
          "author": "Nitin Dahad",
          "description": "As cars have become intelligent, manufacturers have focused on implementing certain smart features at the expense of others. Sensors tied to rear view cameras and blind spot warnings are now nearly ubiquitous, but other safety tools have lagged behind. This is delaying the progress of advanced driver assistance systems (ADAS), a suite of technologies that […]\nThe post How multi-sensory data enhances advanced driver assistance systems (ADAS) appeared first on Embedded.",
          "link": "https://www.embedded.com/how-multi-sensory-data-enhances-advanced-driver-assistance-systems-adas/",
          "publishedOn": "2024-07-30T09:37:58.000Z",
          "wordCount": null,
          "title": "How multi-sensory data enhances advanced driver assistance systems (ADAS)",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "EmbeddedRelated.com Blogs",
      "feedUrl": "https://www.embeddedrelated.com/blogs_rss.php",
      "siteUrl": "https://www.embeddedrelated.com/blogs.php",
      "articles": [
        {
          "id": "https://www.embeddedrelated.com/showarticle/1688.php",
          "author": null,
          "description": "Like most people nowadays, I have a selection of electronic devices that have become part of the fabric of my life. I have certain expectations: I want a device to do what it is supposed to do. I want it to be easy to use. I am after reliability. I want it to consume the minimum amount of power – either to conserve battery life or to simply be environmentally friendly. Lastly, I want the...",
          "link": "https://www.embeddedrelated.com/showarticle/1688.php",
          "publishedOn": "2024-08-08T06:49:41.000Z",
          "wordCount": null,
          "title": "Stand-by or boot-up",
          "imageUrl": null
        },
        {
          "id": "https://www.embeddedrelated.com/showarticle/1685.php",
          "author": null,
          "description": "Contents\r\n\r\n\t\nIntroduction\n\r\n\t\nSoftware block diagrams\r\n\t\n\r\n\t\t\nWhat is it?\n\r\n\t\t\nHow do I draw one?\n\r\n\t\t\nImplementing a block diagram in code\n\r\n\t\t\nReady for a small challenge?\n\r\n\t\n\r\n\t\nFlowcharts\r\n\t\n\r\n\t\t\nWhat is it?\n\r\n\t\t\nHow do I draw one?\n\r\n\t\t\nImplementing a flowchart in...",
          "link": "https://www.embeddedrelated.com/showarticle/1685.php",
          "publishedOn": "2024-08-01T18:33:15.000Z",
          "wordCount": null,
          "title": "Write Better Code with Block Diagrams and Flowcharts",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Evans Library",
      "feedUrl": "https://evan-moon.github.io/feed.xml",
      "siteUrl": "https://evan-moon.github.io",
      "articles": []
    },
    {
      "title": "Better Embedded System SW",
      "feedUrl": "https://feeds.feedburner.com/BetterEmbeddedSystemSw",
      "siteUrl": "http://betterembsw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Google Developers Blog",
      "feedUrl": "https://feeds.feedburner.com/GDBcode",
      "siteUrl": "https://developers.googleblog.com/rss/",
      "articles": [
        {
          "id": "https://developers.googleblog.com/en/how-we-built-the-io-crossword/",
          "author": null,
          "description": "Adding a helpful twist to a classic crossword puzzle with the power of Flutter, Firebase, and the Gemini API.",
          "link": "https://developers.googleblog.com/en/how-we-built-the-io-crossword/",
          "publishedOn": "2024-08-27T20:16:08.493Z",
          "wordCount": null,
          "title": "How We Built It: The I/O Crossword",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/model-explorer-simplifying-ml-models-for-edge-devices/",
          "author": null,
          "description": "Model Explorer, a new graph visualization tool from Google AI Edge, enables developers to overcome the complexities of optimizing models for edge devices.",
          "link": "https://developers.googleblog.com/en/model-explorer-simplifying-ml-models-for-edge-devices/",
          "publishedOn": "2024-08-27T20:16:08.493Z",
          "wordCount": null,
          "title": "Model Explorer: Simplifying ML models for Edge devices",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/gemma-explained-new-in-gemma-2/",
          "author": null,
          "description": "Gemma 2 is a new suite of open models that sets a new standard for performance and accessibility, outperforming popular models more than twice its size.",
          "link": "https://developers.googleblog.com/en/gemma-explained-new-in-gemma-2/",
          "publishedOn": "2024-08-22T20:15:18.792Z",
          "wordCount": 1310,
          "title": "Gemma explained: What’s new in Gemma 2",
          "imageUrl": "https://storage.googleapis.com/gweb-developer-goog-blog-assets/images/Untitled_1600_x_873_px.2e16d0ba.fill-1200x600.png"
        },
        {
          "id": "https://developers.googleblog.com/en/5-years-of-innovation-student-developers-solving-real-world-problems-using-google-tech/",
          "author": null,
          "description": "Google Developer Student Clubs globally are tackling the United Nations' Sustainable Development Goals",
          "link": "https://developers.googleblog.com/en/5-years-of-innovation-student-developers-solving-real-world-problems-using-google-tech/",
          "publishedOn": "2024-08-21T20:15:16.569Z",
          "wordCount": 1557,
          "title": "5 Years of Innovation: Student developers solving real-world problems using Google tech",
          "imageUrl": "https://storage.googleapis.com/gweb-developer-goog-blog-assets/images/GDSC-Social_1.2e16d0ba.fill-1200x600.png"
        },
        {
          "id": "https://developers.googleblog.com/en/google-url-shortener-links-will-no-longer-be-available/",
          "author": null,
          "description": "Understand how you will be impacted by our decision to turn off the serving portion of Google URL Shortener.",
          "link": "https://developers.googleblog.com/en/google-url-shortener-links-will-no-longer-be-available/",
          "publishedOn": "2024-08-18T20:13:42.773Z",
          "wordCount": null,
          "title": "Google URL Shortener links will no longer be available",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/the-io-journey-continues-in-bengaluru/",
          "author": null,
          "description": "Google's I/O Connect event in Bengaluru highlighted India's contributions to AI and introduced new tools for app development, including AI agents for coding and testing.",
          "link": "https://developers.googleblog.com/en/the-io-journey-continues-in-bengaluru/",
          "publishedOn": "2024-08-17T20:14:16.968Z",
          "wordCount": null,
          "title": "The I/O journey continues in Bengaluru",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/gemma-for-streaming-ml-with-dataflow/",
          "author": null,
          "description": "Use the Gemma language model to gauge customer sentiment, summarize conversations, and assist with crafting responses in near real-time with minimal latency.",
          "link": "https://developers.googleblog.com/en/gemma-for-streaming-ml-with-dataflow/",
          "publishedOn": "2024-08-17T20:14:16.966Z",
          "wordCount": null,
          "title": "Gemma for Streaming ML with Dataflow",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/introducing-genkit-for-go-build-scalable-ai-powered-apps-in-go/",
          "author": null,
          "description": "Genkit for Go is an open source framework for building AI-powered applications in Go. It leverages Go's simplicity, scalability, and security, and is currently in alpha.",
          "link": "https://developers.googleblog.com/en/introducing-genkit-for-go-build-scalable-ai-powered-apps-in-go/",
          "publishedOn": "2024-08-17T20:14:16.966Z",
          "wordCount": null,
          "title": "Introducing Genkit for Go: Build scalable AI-powered apps in Go",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/indie-games-fund-google-plays-2m-fund-in-latin-america-is-back/",
          "author": null,
          "description": "Google Play's Indie Games Fund is back in Latin America for 2024, offering up to $2 million in funding and hands-on support to small game studios.",
          "link": "https://developers.googleblog.com/en/indie-games-fund-google-plays-2m-fund-in-latin-america-is-back/",
          "publishedOn": "2024-08-16T20:15:15.945Z",
          "wordCount": null,
          "title": "Indie Games Fund: Google Play’s $2m fund in Latin America is back",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/gemma-explained-overview-gemma-model-family-architectures/",
          "author": null,
          "description": "Learn more about the different variations of Gemma models, how they are designed for different use cases, and the core parameters of their architecture.",
          "link": "https://developers.googleblog.com/en/gemma-explained-overview-gemma-model-family-architectures/",
          "publishedOn": "2024-08-15T20:15:06.405Z",
          "wordCount": null,
          "title": "Gemma explained: An overview of Gemma model family architectures",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/build-a-text-based-adventure-game-with-gemma-2/",
          "author": null,
          "description": "Create a text-based adventure game using Gemma 2. Here are code snippets and tips for designing the game world, enhancing interactivity and replayability, and more.",
          "link": "https://developers.googleblog.com/en/build-a-text-based-adventure-game-with-gemma-2/",
          "publishedOn": "2024-08-14T20:14:32.234Z",
          "wordCount": null,
          "title": "Build a text-based adventure game with Gemma 2",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/streamlining-llm-inference-at-the-edge-with-tflite/",
          "author": null,
          "description": "XNNPack, the default TensorFlow Lite CPU inference engine, has been updated to improve performance and memory management, allow cross-process collaboration, and simplify the user-facing API.",
          "link": "https://developers.googleblog.com/en/streamlining-llm-inference-at-the-edge-with-tflite/",
          "publishedOn": "2024-08-13T20:14:43.218Z",
          "wordCount": null,
          "title": "Streamlining LLM Inference at the Edge with TFLite",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/how-its-made-gentype-alphabet-creator/",
          "author": null,
          "description": "One of our newest experiments in the series is GenType. This tool uses generative AI to create an alphabet out of anything you want.",
          "link": "https://developers.googleblog.com/en/how-its-made-gentype-alphabet-creator/",
          "publishedOn": "2024-08-12T20:14:35.684Z",
          "wordCount": null,
          "title": "How it's Made: GenType Alphabet Creator",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/enabling-more-private-gen-ai/",
          "author": null,
          "description": "Google has developed a number of technologies that you can use to start experimenting with and exploring the potential of generative AI to process data that needs to stay private.",
          "link": "https://developers.googleblog.com/en/enabling-more-private-gen-ai/",
          "publishedOn": "2024-08-11T20:14:12.101Z",
          "wordCount": null,
          "title": "Enabling more private generative AI",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/3-fun-gemma-project-ideas/",
          "author": null,
          "description": "Use Gemma models to translate an old language, brainstorm game design ideas, and write a letter to Santa.",
          "link": "https://developers.googleblog.com/en/3-fun-gemma-project-ideas/",
          "publishedOn": "2024-08-10T20:14:10.811Z",
          "wordCount": null,
          "title": "3 fun Gemma project ideas",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/get-started-with-gemma-on-ray-on-vertex-ai/",
          "author": null,
          "description": "Use Gemma Supervised tuning on Ray on Vertex AI to train and serve machine learning models efficiently and effectively.",
          "link": "https://developers.googleblog.com/en/get-started-with-gemma-on-ray-on-vertex-ai/",
          "publishedOn": "2024-08-09T20:15:19.586Z",
          "wordCount": null,
          "title": "Get started with Gemma on Ray on Vertex AI",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/how-we-built-purrfect-code/",
          "author": null,
          "description": "Purrfect Code is a sokoban style box pushing puzzler Purrfect based on Google tech (Flutter, IDX, FLAME, Firebase) and designed to be playable on web browsers. Open the game in Project IDX, earn badges for each level, and showcase your badges on your Developer Profile.",
          "link": "https://developers.googleblog.com/en/how-we-built-purrfect-code/",
          "publishedOn": "2024-08-08T20:15:27.158Z",
          "wordCount": null,
          "title": "How We Built Purrfect Code: A Puzzle Game for Developers",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/gemini-15-flash-updates-google-ai-studio-gemini-api/",
          "author": null,
          "description": "Gemini 1.5 Flash is now available to developers at more than 70% lower prices. Set up billing for Gemini API in Google AI Studio and access other new features like 1.5 Flash tuning.",
          "link": "https://developers.googleblog.com/en/gemini-15-flash-updates-google-ai-studio-gemini-api/",
          "publishedOn": "2024-08-08T20:15:27.157Z",
          "wordCount": null,
          "title": "Gemini 1.5 Flash price drop with tuning rollout complete, and more",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/introducing-the-google-developer-program/",
          "author": null,
          "description": "The Google Developer Program gives developers access to a range of new tools and benefits,  to allow them to discover and explore all the Google sponsored communities we already offer.",
          "link": "https://developers.googleblog.com/en/introducing-the-google-developer-program/",
          "publishedOn": "2024-08-05T20:14:24.665Z",
          "wordCount": null,
          "title": "Introducing the Google Developer Program: Unlock New Opportunities",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/gemini-15-pro-and-15-flash-now-available/",
          "author": null,
          "description": "We’re incredibly excited to see what you build with these new models. Get started with Gemini 1.5 Flash and 1.5 Pro free of charge in Google AI Studio.",
          "link": "https://developers.googleblog.com/en/gemini-15-pro-and-15-flash-now-available/",
          "publishedOn": "2024-07-31T20:14:19.665Z",
          "wordCount": null,
          "title": "Gemini 1.5 Pro and 1.5 Flash GA, 1.5 Flash tuning support, higher rate limits, and more API updates",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/smaller-safer-more-transparent-advancing-responsible-ai-with-gemma/",
          "author": null,
          "description": "ShieldGemma is a suite of safety content classifiers models built upon Gemma2 designed to keep users safe. GemmaScope is a new model interpretability tool that offers unparalleled insight into our models' inner workings.",
          "link": "https://developers.googleblog.com/en/smaller-safer-more-transparent-advancing-responsible-ai-with-gemma/",
          "publishedOn": "2024-07-31T20:14:19.664Z",
          "wordCount": null,
          "title": "Smaller, Safer, More Transparent: Advancing Responsible AI with Gemma",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/ai-edge-torch-generative-api-for-custom-llms-on-device/",
          "author": null,
          "description": "AI Edge Torch Generative API enables developers to bring powerful new capabilities on-device, such as summarization, content generation, and more.",
          "link": "https://developers.googleblog.com/en/ai-edge-torch-generative-api-for-custom-llms-on-device/",
          "publishedOn": "2024-07-30T20:13:36.471Z",
          "wordCount": null,
          "title": "AI Edge Torch Generative API for Custom LLMs on Device",
          "imageUrl": null
        },
        {
          "id": "https://developers.googleblog.com/en/whats-new-in-google-pay-io-2024/",
          "author": null,
          "description": "We’re adding new features to Google Pay so you can offer richer and more accessible payment experiences for your customers, and improved APIs to simplify your payments integrations.",
          "link": "https://developers.googleblog.com/en/whats-new-in-google-pay-io-2024/",
          "publishedOn": "2024-07-30T20:13:36.471Z",
          "wordCount": null,
          "title": "What’s new in Google Pay at I/O 2024",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Many But Finite",
      "feedUrl": "https://feeds.feedburner.com/GustavoDuarte",
      "siteUrl": "https://manybutfinite.com/feed.xml",
      "articles": []
    },
    {
      "title": "Krister Walfridsson’s old blog",
      "feedUrl": "http://feeds.feedburner.com/KristerWalfridssonsBlog",
      "siteUrl": "http://kristerw.blogspot.com/",
      "articles": []
    },
    {
      "title": "Python Insider",
      "feedUrl": "https://feeds.feedburner.com/PythonInsider",
      "siteUrl": "https://pythoninsider.blogspot.com/",
      "articles": [
        {
          "id": "https://pythoninsider.blogspot.com/2024/08/python-3125-released.html",
          "author": null,
          "description": "I'm pleased to announce the release of Python 3.12.5:\nhttps://www.python.org/downloads/release/python-3125/\n\n \nThis is the fifth maintenance release of Python 3.12\nPython 3.12 is the newest major release of the Python programming \nlanguage, and it contains many new features and optimizations. 3.12.5 is\n the latest maintenance release, containing more than 250 bugfixes, \nbuild improvements and documentation changes since 3.12.4.\nThis version of Python 3.12 also comes with pip 24.2 by default. However,\n due to an incompatibility with older macOS versions, macOS 10.9 through\n 10.12 will downgrade their version of pip to 24.1.2 during the \ninstallation process (in the Install Certificates step). See the installer ReadMe and the pip issue on the matter\n for more information. Versions of macOS o…",
          "link": "https://pythoninsider.blogspot.com/2024/08/python-3125-released.html",
          "publishedOn": "2024-08-07T13:17:00.001Z",
          "wordCount": null,
          "title": "Python 3.12.5 released",
          "imageUrl": null
        },
        {
          "id": "https://pythoninsider.blogspot.com/2024/08/python-3130-release-candidate-1-released.html",
          "author": null,
          "description": "I'm pleased to announce the release of Python 3.13 release candidate 1.\nhttps://www.python.org/downloads/release/python-3130rc1/\n \nThis is the first release candidate of Python 3.13.0\nThis release, 3.13.0rc1, is the penultimate release \npreview. Entering the release candidate phase, only reviewed code \nchanges which are clear bug fixes are allowed between this release \ncandidate and the final release. The second candidate (and the last \nplanned release preview) is scheduled for Tuesday, 2024-09-03, while the\n official release of 3.13.0 is scheduled for Tuesday, 2024-10-01.\nThere will be no ABI changes from this point forward in the 3.13 series, and the goal is that there will be as few code changes as possible.\nCall to action\nWe strongly encourage maintainers of third-party Python projects…",
          "link": "https://pythoninsider.blogspot.com/2024/08/python-3130-release-candidate-1-released.html",
          "publishedOn": "2024-08-01T09:30:00.001Z",
          "wordCount": null,
          "title": "Python 3.13.0 release candidate 1 released",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "from pvs-studio.com",
      "feedUrl": "http://feeds.feedburner.com/viva64-blog-en",
      "siteUrl": "https://pvs-studio.com",
      "articles": [
        {
          "id": "https://pvs-studio.com/en/blog/posts/1157/",
          "author": null,
          "description": "The concept of clean code is familiar to many people. Some programmers support it, while others think it hurts the industry. Casey Muratori, who's in the second group, stated that clean code is...",
          "link": "https://pvs-studio.com/en/blog/posts/1157/",
          "publishedOn": "2024-08-26T21:00:00.000Z",
          "wordCount": null,
          "title": "Clean code: blessing or curse? Act I. Confrontation",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1156/",
          "author": null,
          "description": "Your attention is invited to the fourth part of an e-book on undefined behavior. This is not a textbook, as it's intended for those who are already familiar with C++ programming. It's a kind of C...",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1156/",
          "publishedOn": "2024-08-22T21:00:00.000Z",
          "wordCount": null,
          "title": "C++ programmer's guide to undefined behavior: part 4 of 11",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/1155/",
          "author": null,
          "description": "PVS-Studio 7.32 has been released. Discover enhanced C++ analysis optimization, new plugins and features, and a host of other updates! See more details in this note.",
          "link": "https://pvs-studio.com/en/blog/posts/1155/",
          "publishedOn": "2024-08-15T21:00:00.000Z",
          "wordCount": null,
          "title": "PVS-Studio 7.32: enhanced analysis, new plugins and more",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/java/1154/",
          "author": null,
          "description": "Static analysis is a robust tool that helps developers to control code quality. Let's try to develop a simple analyzer for Lua using Java and see what's under the static analyzer hood.",
          "link": "https://pvs-studio.com/en/blog/posts/java/1154/",
          "publishedOn": "2024-08-13T21:00:00.000Z",
          "wordCount": null,
          "title": "How to develop code analyzer in 48 hours",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1153/",
          "author": null,
          "description": "\"It's like Unreal and Unity had a baby,\" as the GameDev community has affectionately described the engine. Not only is that a cute way to describe the engine, but it's also quite spot-on. It's...",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1153/",
          "publishedOn": "2024-08-12T21:00:00.000Z",
          "wordCount": 6654,
          "title": "Flax Engine. Exploring game engine & analyzing its source code",
          "imageUrl": "https://files.pvs-studio.com/media/docx/blog/1153_FlaxEngine/image1_thm_intoblank_1200x630.png?ver=08-13-2024-10-08-08"
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/1152/",
          "author": null,
          "description": "The PVS-Studio plugin for SonarQube has been around for a long time. However, in the latest update, we've turned one plugin into two plugins! This post will explain why it happened, what's new, and...",
          "link": "https://pvs-studio.com/en/blog/posts/1152/",
          "publishedOn": "2024-08-11T21:00:00.000Z",
          "wordCount": null,
          "title": "Get me two! PVS-Studio plugin update for SonarQube",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/java/1151/",
          "author": null,
          "description": "We know that math is a science of precision. Can we say the same about GeoGebra, an interactive math learning software? Let's analyze the project source code using PVS-Studio!",
          "link": "https://pvs-studio.com/en/blog/posts/java/1151/",
          "publishedOn": "2024-08-08T21:00:00.000Z",
          "wordCount": null,
          "title": "Even great mathematicians make mistakes",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1150/",
          "author": null,
          "description": "Developing and playing games can be an incredibly engaging, addictive, and satisfying activity. But nothing spoils the gameplay experience like a tricky hidden bug. So, today we'll be looking at an...",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1150/",
          "publishedOn": "2024-08-06T21:00:00.000Z",
          "wordCount": null,
          "title": "How to find job for Rescue Rangers: analyzing Godot Engine",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/cpp/1149/",
          "author": null,
          "description": "Your attention is invited to the third part of an e-book on undefined behavior. This is not a textbook, as it's intended for those who are already familiar with C++ programming. It's a kind of C...",
          "link": "https://pvs-studio.com/en/blog/posts/cpp/1149/",
          "publishedOn": "2024-08-04T21:00:00.000Z",
          "wordCount": null,
          "title": "C++ programmer's guide to undefined behavior: part 3 of 11",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/csharp/1148/",
          "author": null,
          "description": "Welcome to our second news and event digest for the .NET world! The first digest resonated with you, so the PVS-Studio C# team has gathered the most awesome and handy insights for you again. Let's...",
          "link": "https://pvs-studio.com/en/blog/posts/csharp/1148/",
          "publishedOn": "2024-08-01T21:00:00.000Z",
          "wordCount": null,
          "title": ".NET Digest #2",
          "imageUrl": null
        },
        {
          "id": "https://pvs-studio.com/en/blog/posts/java/1147/",
          "author": null,
          "description": "Once again, we're checking the Apache product. This time we chose Solr, an open-source search server platform. Solr enables you quickly and efficiently search for information in databases and online...",
          "link": "https://pvs-studio.com/en/blog/posts/java/1147/",
          "publishedOn": "2024-07-30T21:00:00.000Z",
          "wordCount": null,
          "title": "Search query for bugs in Apache Solr",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Future",
      "feedUrl": "https://future.a16z.com/feed/",
      "siteUrl": "https://future.com/",
      "articles": []
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/feeds/posts/default",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": []
    },
    {
      "title": "Two Cents",
      "feedUrl": "https://hur.substack.com/feed",
      "siteUrl": "https://twocents.hur.xyz",
      "articles": []
    },
    {
      "title": "Interrupt",
      "feedUrl": "https://interrupt.memfault.com/feed.xml",
      "siteUrl": "https://interrupt.memfault.com/",
      "articles": [
        {
          "id": "https://interrupt.memfault.com/blog/diving-into-jtag-part-6",
          "author": null,
          "description": "The JTAG interface is an important tool for debugging and testing embedded\nsystems, providing low-level access to the internal workings of microcontrollers\nand other integrated circuits. However, this powerful interface also presents\nsignificant security threats. In the sixth and final part of this Diving into\nJTAG article series, we will focus on security issues related to JTAG and the\nDebug Port.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/diving-into-jtag-part-6",
          "publishedOn": "2024-08-14T00:00:00.000Z",
          "wordCount": null,
          "title": "Diving into JTAG — Security (Part 6)",
          "imageUrl": null
        },
        {
          "id": "https://interrupt.memfault.com/blog/july-2024-roundup",
          "author": null,
          "description": "Here are the articles, videos, and tools that we’ve been excited about this\nJuly.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/july-2024-roundup",
          "publishedOn": "2024-08-08T00:00:00.000Z",
          "wordCount": 920,
          "title": "What we've been reading in July (2024)",
          "imageUrl": "https://interrupt.memfault.com/img/interrupt-cover-1200px.png"
        },
        {
          "id": "https://interrupt.memfault.com/blog/github-actions-for-stm32cubeide",
          "author": null,
          "description": "In this article, we will explore how to use GitHub Actions to automate building\nSTM32CubeIDE projects. Eclipse-based IDEs like STM32CubeIDE are often used for\ndeveloping embedded systems but can be a little tricky to build in a headless\nenvironment.\nContinue reading…",
          "link": "https://interrupt.memfault.com/blog/github-actions-for-stm32cubeide",
          "publishedOn": "2024-08-01T00:00:00.000Z",
          "wordCount": null,
          "title": "GitHub Actions for STM32CubeIDE",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Jay Carlson",
      "feedUrl": "https://jaycarlson.net/feed",
      "siteUrl": "https://jaycarlson.net",
      "articles": []
    },
    {
      "title": "만화로 나누는 자유/오픈소스 소프트웨어 이야기",
      "feedUrl": "https://joone.net/feed/",
      "siteUrl": "https://joone.net",
      "articles": []
    },
    {
      "title": "Kimchi hill",
      "feedUrl": "https://kimchihill.com/feed/",
      "siteUrl": "https://kimchihill.com",
      "articles": []
    },
    {
      "title": "Kwang Yul Seo",
      "feedUrl": "https://kwangyulseo.com/feed/",
      "siteUrl": "https://kwangyulseo.com",
      "articles": []
    },
    {
      "title": "LimitedResults",
      "feedUrl": "https://limitedresults.com/feed/",
      "siteUrl": "https://limitedresults.com/",
      "articles": []
    },
    {
      "title": "LWN.net",
      "feedUrl": "https://lwn.net/headlines/rss",
      "siteUrl": "https://lwn.net",
      "articles": [
        {
          "id": "https://lwn.net/Articles/987414/",
          "author": "jzb",
          "description": "KDE developer Carl Schwan has announced\nthe release of Calligra Office\nversion 4.0. The most significant changes in this release include a \"major\noverhaul\" of the office suite's user interface, and a transition to Qt 6 and KDE Frameworks 6.",
          "link": "https://lwn.net/Articles/987414/",
          "publishedOn": "2024-08-27T17:16:28.000Z",
          "wordCount": null,
          "title": "Calligra Office 4.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987406/",
          "author": "jzb",
          "description": "Nominations are now\nopen for people interested in joining the Ubuntu\nCommunity Council, \"the highest governance body of the Ubuntu\nproject\". Any Ubuntu Member can\napply from now until Sunday, September 22 at 23:59 UTC.\nSee Merlijn Sebrechts's blog\npost, \"A year in the Ubuntu community council\", for an overview of\nwhat it's like to serve on the council.",
          "link": "https://lwn.net/Articles/987406/",
          "publishedOn": "2024-08-27T16:15:54.000Z",
          "wordCount": null,
          "title": "Call for nominations: Ubuntu Community Council",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/973231/",
          "author": "daroc",
          "description": "On August 13, the US National Institute of Standards and Technology (NIST)\n\npublished the final form of its new post-quantum cryptographic standards. One\nkey-exchange mechanism and two digital-signature schemes are now officially\nsanctioned by the institute. Adopting the new standards should be fairly\npainless for most developers, but the overhead added by the schemes could pose\nchallenges for some applications.",
          "link": "https://lwn.net/Articles/973231/",
          "publishedOn": "2024-08-27T13:56:44.000Z",
          "wordCount": null,
          "title": "[$] NIST finalizes post-quantum encryption standards",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987393/",
          "author": "corbet",
          "description": "Security updates have been issued by AlmaLinux (nodejs:20), Debian (python3.11), Fedora (dotnet8.0), Red Hat (bind, krb5, libreoffice, linux-firmware, orc, orc:0.4.28, and orc:0.4.31), SUSE (mariadb and openssl-3), and Ubuntu (linux-aws-5.4).",
          "link": "https://lwn.net/Articles/987393/",
          "publishedOn": "2024-08-27T12:53:01.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987320/",
          "author": "corbet",
          "description": "The developers of the Pidgin chat program\nhave announced that\na malicious plugin had been listed on its third-party plugins list for over\none month.  This plugin included a key logger and could capture\nscreenshots.\n\n\n\tIt went unnoticed at the time that the plugin was not providing any\n\tsource code and was only providing binaries for download. Going\n\tforward, we will be requiring that all plugins that we link to have\n\tan OSI Approved Open Source License and that some level of due\n\tdiligence has been done to verify that the plugin is safe for\n\tusers.",
          "link": "https://lwn.net/Articles/987320/",
          "publishedOn": "2024-08-26T20:45:04.000Z",
          "wordCount": null,
          "title": "A malicious Pidgin plugin",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987311/",
          "author": "jzb",
          "description": "The FreeBSD Foundation has announced that Germany's Sovereign Tech\nFund (STF) has agreed to invest €686,400 toward improvements in the\nFreeBSD project's infrastructure, security, regulatory compliance, and\ndeveloper experience:\nAugust\n9, 2024 summary report released by the U.S. Office of the\nNational Cyber Director (ONCD), consolidating feedback from the 2023\nrequest for information on key priorities for securing the open source\nsoftware ecosystem. By enhancing security controls and SBOM tooling,\nthe FreeBSD Foundation is helping to keep FreeBSD at the forefront of\nimproved vulnerability disclosure mechanisms and secure software\nfoundations.",
          "link": "https://lwn.net/Articles/987311/",
          "publishedOn": "2024-08-26T17:36:07.000Z",
          "wordCount": null,
          "title": "Sovereign Tech Fund (STF) to invest in FreeBSD infrastructure modernization",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986892/",
          "author": "corbet",
          "description": "The genksyms tool has long been buried deeply within the kernel's\nbuild system; it is one of the two C-code parsers shipped with the kernel\n(the other being the\nhorrifying kernel-doc script).  It is a key part of how the\nkernel's module-loading infrastructure works.  While genksyms has\nquietly done its job for decades, that period may soon be coming to an end.\nIt would seem that genksyms is not up to the task of handling Rust\ncode, so Sami Tolvanen is proposing\na new tool to handle this task going forward.",
          "link": "https://lwn.net/Articles/986892/",
          "publishedOn": "2024-08-26T17:19:46.000Z",
          "wordCount": null,
          "title": "[$] A new version of modversions",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987309/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (chromium, python-html-sanitizer, and trafficserver), Fedora (nginx, nginx-mod-fancyindex, nginx-mod-modsecurity, nginx-mod-naxsi, nginx-mod-vts, python-webob, python3-docs, python3.11, python3.12, python3.9, and zabbix), Red Hat (bind, bind and bind-dyndb-ldap, bind9.16, httpd, kernel, kernel-rt, and nodejs:20), SUSE (caddy, chromium, chromium, gn, rust-bindgen, cockpit, fetchmail, gdcm, gh, keybase-client, libhtp, libofx, nano, plasma5-workspace, python-nltk, python-notebook, xen, and znc), and Ubuntu (linux-azure, linux-azure-4.15, linux-azure-5.4, and linux-oracle-5.15).",
          "link": "https://lwn.net/Articles/987309/",
          "publishedOn": "2024-08-26T17:12:19.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/987164/",
          "author": "corbet",
          "description": "The 6.11-rc5 kernel prepatch is out for\ntesting.  \"Other than the timing, there's not a whole lot unusual\nhere. The diffstat looks fairly flat, which means 'mostly pretty small\nchanges'.\" Linus Torvalds added a\nnote that today marks the 33rd anniversary of the first Linux\nannouncement; \"A third of a century. And it *still* isn't ready\".",
          "link": "https://lwn.net/Articles/987164/",
          "publishedOn": "2024-08-25T15:35:29.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.11-rc5",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985739/",
          "author": "jake",
          "description": "On the second day of DebConf24\nin Busan, South Korea, Holger Levsen provided a history lesson on the\n\"first 11 years\" of the Reproducible Builds project.\nHe has been involved in the project for most of that time and has been a\nDebian user since the mid-1990s, contributor since 2001, and a Debian\nmember since 2007; \"I love Debian\".  Meanwhile, his aim is to make all free\nsoftware be reproducible, so that anyone can check that a binary program\ncomes from the source code it purports to.",
          "link": "https://lwn.net/Articles/985739/",
          "publishedOn": "2024-08-23T13:47:20.000Z",
          "wordCount": null,
          "title": "[$] The history, status, and plans for reproducible builds",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986998/",
          "author": "daroc",
          "description": "The \n\nForgejo project has announced that, starting from version 9.0, Forgejo will be released under the GPLv3 license (or a later version). Older versions of the software forge remain MIT-licensed.\n\n\n\nA copyleft license makes reusing other copyleft software easier. Recently, we discovered that \n\nsome of the dependencies we used were incompatible with the license Forgejo was distributed with, and they had to be removed for now. Choosing copyleft licenses enables us to reuse more work, and saves us precious time to focus on improving Forgejo itself.",
          "link": "https://lwn.net/Articles/986998/",
          "publishedOn": "2024-08-23T13:39:33.000Z",
          "wordCount": null,
          "title": "Forgejo changes license to GPLv3+",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986997/",
          "author": "daroc",
          "description": "Security updates have been issued by Fedora (community-mysql, iaito, and radare2), Oracle (python3.12-setuptools and tomcat), Red Hat (krb5 and podman), Slackware (ffmpeg), SUSE (apache2, expat, firefox, webkit2gtk3, and xen), and Ubuntu (imagemagick and libxstream-java).",
          "link": "https://lwn.net/Articles/986997/",
          "publishedOn": "2024-08-23T13:03:10.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986906/",
          "author": "corbet",
          "description": "Version\n24.8 of the LibreOffice office suite has been released.  Changes\ninclude the ability to filter identifying information from exported files,\neasier creation of cross reference, better control over hyphenation, a\nnumber of new spreadsheet functions, accessibility improvements, and more.",
          "link": "https://lwn.net/Articles/986906/",
          "publishedOn": "2024-08-22T18:51:48.000Z",
          "wordCount": null,
          "title": "LibreOffice 24.8 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985853/",
          "author": "daroc",
          "description": "On July 30, Al Viro sent\n\na patch set to the linux-fsdevel mailing list with a\ncomprehensive cover letter explaining his\nrecent work on ensuring that the kernel's internal representation of\nfile descriptors are used correctly in the kernel.\nFile descriptors are ubiquitous; many system calls\nneed to handle them. Viro's review\nidentified a few existing bugs, and may prevent more in the future. He also had\nsuggestions for ways to keep uses consistent throughout the kernel.",
          "link": "https://lwn.net/Articles/985853/",
          "publishedOn": "2024-08-22T15:19:56.000Z",
          "wordCount": null,
          "title": "[$] A review of file descriptor memory safety in the kernel",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986844/",
          "author": "corbet",
          "description": "Matthew Garrett describes\nthe role of the Secure Boot Advanced Targeting mechanism and how it\nplayed into the recent Windows upgrade problems.\n\n\n\tSo why is this suddenly relevant? SBAT was developed\n\tcollaboratively between the Linux community and Microsoft, and\n\tMicrosoft chose to push a Windows update that told systems not to\n\ttrust versions of grub with a security generation below a certain\n\tlevel. This was because those versions of grub had genuine security\n\tvulnerabilities that would allow an attacker to compromise the\n\tWindows secure boot chain, and we've seen real world examples of\n\tmalware wanting to do that.",
          "link": "https://lwn.net/Articles/986844/",
          "publishedOn": "2024-08-22T14:25:01.000Z",
          "wordCount": null,
          "title": "Garrett: What is an SBAT and why does everyone suddenly care",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986841/",
          "author": "jake",
          "description": "Security updates have been issued by AlmaLinux (.NET 8.0, bind, bind9.16, curl, edk2, firefox, gnome-shell, grafana, jose, krb5, libreoffice, mod_auth_openidc:2.3, orc, pcs, poppler, python-setuptools, python-urllib3, python3.11-setuptools, python3.12-setuptools, thunderbird, tomcat, and wget), Fedora (webkitgtk), SUSE (apache2, glib2, and roundcubemail), and Ubuntu (kernel, linux, linux-aws, linux-aws-5.15, linux-azure, linux-azure-5.15,\n linux-azure-fde, linux-azure-fde-5.15, linux-gcp, linux-gcp-5.15,\n linux-gke, linux-gkeop, linux-gkeop-5.15, linux-hwe-5.15, linux-ibm,\n linux-ibm-5.15, linux-intel-iotg, linux-intel-iotg-5.15, linux-kvm,\n linux-lowlatency, linux-lowlatency-hwe-5.15, linux-nvidia, linux-oracle,\n linux-raspi, linux, linux-aws, linux-azure, linux-bluefield, linux-gcp, linux-gcp-5.4,\n linux-gkeop, linux-hwe-5.4, linux-ibm, linux-ibm-5.4, linux-kvm,\n linux-oracle, linux-oracle-5.4, linux-raspi, linux-xilinx-zynqmp, linux, linux-aws, linux-azure, linux-gcp, linux-gke, linux-ibm,\n linux-lowlatency, linux-nvidia, linux-nvidia-6.8, linux-nvidia-lowlatency,\n linux-oem-6.8, linux-oracle, linux-raspi, linux, linux-aws, linux-kvm, linux-lts-xenial, linux, linux-gcp, linux-gcp-4.15, linux-hwe, linux-kvm, linux-aws, linux-aws-hwe, linux-bluefield, linux-hwe-5.15, linux-raspi-5.4, and qemu).",
          "link": "https://lwn.net/Articles/986841/",
          "publishedOn": "2024-08-22T14:07:33.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985783/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for August 22, 2024 is available.",
          "link": "https://lwn.net/Articles/985783/",
          "publishedOn": "2024-08-22T01:51:50.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for August 22, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986659/",
          "author": "jzb",
          "description": "Ars Technica covers\na recent update\nthat is causing problems for users with systems that dual-boot Windows\nand Linux.\n\"Note that Windows says this update won't apply to systems that\ndual-boot Windows and Linux,\" one frustrated person wrote. \"This\nobviously isn't true, and likely depends on your system configuration\nand the distribution being run. It appears to have made some linux efi\nshim bootloaders incompatible with microcrap efi bootloaders (that's\nwhy shifting from MS efi to 'other OS' in efi setup works). It appears\nthat Mint has a shim version that MS SBAT doesn't recognize.\"\nThe reports indicate that multiple distributions, including Debian,\nUbuntu, Linux Mint, Zorin OS, and Puppy Linux, are all\naffected. Microsoft has yet to acknowledge the error publicly, explain\nhow it wasn't detected during testing, or provide technical guidance\nto those affected. Company representatives didn't respond to an email\nseeking answers.",
          "link": "https://lwn.net/Articles/986659/",
          "publishedOn": "2024-08-21T18:03:27.000Z",
          "wordCount": null,
          "title": "\"Something has gone seriously wrong,\" dual-boot systems warn after Microsoft update (Ars Technica)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986655/",
          "author": "jzb",
          "description": "Gentoo developer Michał Górny has written a lengthy blog\npost that explains how Gentoo approaches releases:\n\n\nGentoo is something of a hybrid, as it combines the best of both\nworlds. It is a rolling release distribution with a single shared\nrepository that is available to all users. However, within this\nrepository we use a keywording system to provide a choice between\nstable and testing packages, to facilitate both production and\ndevelopment systems (with some extra flexibility), and versioned\nprofiles to tackle major lock-step upgrades.",
          "link": "https://lwn.net/Articles/986655/",
          "publishedOn": "2024-08-21T17:31:46.000Z",
          "wordCount": null,
          "title": "Górny: Gentoo: profiles and keywords rather than releases",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/974969/",
          "author": "jzb",
          "description": "Linux installers receive a disproportionate amount of attention\ncompared to the amount of time that most users spend with them. Ideally,\na user spends only a few minutes using the installer, versus years using\nthe distribution after it is installed. Yet, the installer sets the\nfirst impression, and if it fails to do its job, little else matters.\nInstallers also have to continually evolve to keep pace with new\nhardware, changes in distribution packaging (such as image-based Linux\ndistributions), and so forth. Along those lines, the SUSE team that maintains the\nvenerable YaST installer has\ndecided it's time to start (almost) fresh with a new Linux installer\nproject, called Agama,\nfor new projects. YaST is not going away as an administration tool,\nbut it is likely to be relieved of installer duties at some point.",
          "link": "https://lwn.net/Articles/974969/",
          "publishedOn": "2024-08-21T15:37:13.000Z",
          "wordCount": null,
          "title": "[$] Modernizing openSUSE installation with Agama",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986628/",
          "author": "jzb",
          "description": "Security updates have been issued by Debian (aom, cinder, dovecot, glance, and nova), Fedora (mysql8.0), Oracle (curl and libreoffice), SUSE (oniguruma, openssl-1_0_0, openssl1, and xen), and Ubuntu (cacti, curl, exfatprogs, firefox, and vim).",
          "link": "https://lwn.net/Articles/986628/",
          "publishedOn": "2024-08-21T13:20:30.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985041/",
          "author": "jake",
          "description": "At\nPyCon 2024 in Pittsburgh,\nPennsylvania, Anthony Shaw looked at the various kinds of parallelism\navailable to Python programs.  There have been two major developments on\nthe parallel-execution front over the last few years, with the effort to\nprovide subinterpreters, each with its own\nglobal interpreter lock (GIL), along with the work to remove the GIL entirely.  In the talk, he\nexplored the two approaches to try to give attendees a sense of how to make\nthe right choice for their applications.",
          "link": "https://lwn.net/Articles/985041/",
          "publishedOn": "2024-08-20T22:24:01.000Z",
          "wordCount": null,
          "title": "[$] Python subinterpreters and free-threading",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986528/",
          "author": "jzb",
          "description": "Version 0.3.0 of the uv\nPython package and project manager has been released. Introduced in\nFebruary, uv is written in Rust and aims to be \"Cargo for\nPython\".  Notable changes in this release include the addition of\ninterfaces for managing projects, installing\nPython, and running scripts,\nalong with adding new documentation. See the\naccompanying blog post for more information.",
          "link": "https://lwn.net/Articles/986528/",
          "publishedOn": "2024-08-20T21:31:09.000Z",
          "wordCount": null,
          "title": "uv 0.3.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986174/",
          "author": "corbet",
          "description": "One tactic often used by attackers set on compromising a system is heap spraying; in\nshort, the attacker fills as much of the heap as possible with crafted data\nin the hope of getting the target system to use that data in a bad way.  If\nheap spraying can be blocked, attackers will lose an important tool.  The\nkernel has some heap-spraying defenses now, including the dedicated bucket allocator merged for the\nupcoming 6.11 release, but its author, Kees Cook, thinks that more can be\ndone.",
          "link": "https://lwn.net/Articles/986174/",
          "publishedOn": "2024-08-20T13:29:07.000Z",
          "wordCount": null,
          "title": "[$] Per-call-site slab caches for heap-spraying protection",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986450/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (squid), Fedora (putty), Mageia (quictls), Oracle (bind, curl, python-setuptools, python3.11-setuptools, and python3.12-setuptools), Red Hat (kernel, kpatch-patch-4_18_0-305_120_1, kpatch-patch-4_18_0-372_87_1 and kpatch-patch-4_18_0-372_91_1, kpatch-patch-4_18_0-477_43_1, kpatch-patch-4_18_0-553, kpatch-patch-5_14_0-284_48_1 and kpatch-patch-5_14_0-284_52_1, kpatch-patch-5_14_0-427_13_1, and libreoffice), SUSE (cosign, dri3proto, presentproto, wayland-protocols, xwayland, freerdp, fwupdate, git, gnome-settings-daemon, hdf5, jasper, java-17-openjdk, java-1_8_0-ibm, java-1_8_0-openjdk, kernel, kernel-firmware, libaom, libqt5-qt3d, libqt5-qtquick3d, ntfs-3g_ntfsprogs, osc, python, python-aiohttp, python-azure-core, python-azure-storage-blob, python- azure-storage-queue, python-typing, python-typing_extensions, python-Jinja2, python-PyMySQL, python-requests, python-tqdm, python-WebOb, python3-sqlparse, python310, python311, qemu, sssd, thunderbird, tiff, unixODBC, uriparser, and wireshark), and Ubuntu (intel-microcode, linux-azure-5.4, and postgresql-12, postgresql-14, postgresql-16).",
          "link": "https://lwn.net/Articles/986450/",
          "publishedOn": "2024-08-20T13:22:37.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985210/",
          "author": "jzb",
          "description": "The FreeBSD Project is, for the second\ntime this year, engaging in a long-running discussion about the\npossibility of including Rust in its base\nsystem. The sequel to the first discussion included some work by\nAlan Somers to show what it might look like to use Rust code in the\nbase tree. Support for Rust code does not appear much closer to being\nincluded in FreeBSD's base system, but the conversation has been\nenlightening.",
          "link": "https://lwn.net/Articles/985210/",
          "publishedOn": "2024-08-19T15:12:03.000Z",
          "wordCount": null,
          "title": "[$] FreeBSD considers Rust in the base system",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986229/",
          "author": "jake",
          "description": "Today's crop of new stable kernels consists of seven new versions: 6.10.6, 6.6.47, 6.1.106, 5.15.165, 5.10.224, 5.4.282, and 4.19.320.  As usual, each contains important\nfixes throughout the kernel tree.",
          "link": "https://lwn.net/Articles/986229/",
          "publishedOn": "2024-08-19T14:43:44.000Z",
          "wordCount": null,
          "title": "Seven new stable kernels",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986225/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (python-asyncssh), Fedora (bind, bind-dyndb-ldap, httpd, and tor), SUSE (cosign, cpio, curl, expat, java-11-openjdk, ncurses, netty, netty-tcnative, opera, python-Django, python-Pillow, shadow, sudo, and wpa_supplicant), and Ubuntu (firefox).",
          "link": "https://lwn.net/Articles/986225/",
          "publishedOn": "2024-08-19T14:14:39.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986167/",
          "author": "corbet",
          "description": "The Rust code being added to the kernel is documented using the usual rustdoc\nconventions; that documentation is now available on kernel.org in\nformatted form.  There is also the linux-next version of\nthe documentation for Rust code that will land in the kernel soon.",
          "link": "https://lwn.net/Articles/986167/",
          "publishedOn": "2024-08-18T22:28:35.000Z",
          "wordCount": null,
          "title": "Formatted Rust kernel documentation available",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986163/",
          "author": "corbet",
          "description": "The fourth 6.11 kernel prepatch is out for\ntesting.  According to Linus:\n\n\n\tBut it all looks fairly normal. rc4 is bigger than either rc2 or\n\trc3 were, but not hugely so, and it's actually a normal pattern,\n\twhere it takes a while before people find some issues. So nothing\n\tfeels all that odd.",
          "link": "https://lwn.net/Articles/986163/",
          "publishedOn": "2024-08-18T22:23:07.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.11-rc4",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/986030/",
          "author": "jzb",
          "description": "The Gentoo Linux project has\nannounced\nthat it is dropping support for Itanium:\nIA-64 (Itanium)\nsupport in the Linux kernel\nand glibc,\nand subsequent discussions on our mailing list, as well as\na vote by the Gentoo Council, Gentoo will discontinue all ia64\nprofiles and keywords. The primary reason for this decision is the\ninability of the Gentoo IA-64 team to support this architecture\nwithout kernel support, glibc support, and a functional development\nbox (or even a well-established emulator). In addition, there have\nbeen only very few users interested in this type of hardware.",
          "link": "https://lwn.net/Articles/986030/",
          "publishedOn": "2024-08-16T16:46:26.000Z",
          "wordCount": null,
          "title": "Gentoo Linux drops IA-64 (Itanium) support",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985346/",
          "author": "daroc",
          "description": "Python has had\nformatted string literals\n(f-strings), a syntactic shorthand for building\nstrings, since 2015. Recently, Jim Baker, Guido van Rossum, and Paul Everitt have\nproposed\n\nPEP 750 (\"Tag Strings For Writing Domain-Specific Languages\") which would\ngeneralize and expand that mechanism to provide Python library writers with additional\nflexibility. Reactions to the proposed change were somewhat positive, although\nthere was a good deal of discussion of (and opposition to)\nthe PEP's inclusion of lazy evaluation of template parameters.",
          "link": "https://lwn.net/Articles/985346/",
          "publishedOn": "2024-08-16T15:52:18.000Z",
          "wordCount": null,
          "title": "[$] Custom string formatters in Python",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985980/",
          "author": "daroc",
          "description": "Security updates have been issued by Fedora (389-ds-base, dotnet8.0, python3.13, roundcubemail, thunderbird, and tor), Mageia (roundcubemail), Oracle (.NET 8.0, bind and bind-dyndb-ldap, bind9.16, container-tools:ol8, edk2, firefox, gnome-shell, grafana, httpd:2.4, jose, kernel, krb5, mod_auth_openidc:2.3, orc, poppler, python-urllib3, python3.11-setuptools, thunderbird, and wget), Red Hat (kernel), SUSE (apptainer, curl, kernel, kernel-firmware, libqt5-qtbase, python-aiosmtpd, and ucode-intel), and Ubuntu (bind9, gnome-shell, libreoffice, and orc).",
          "link": "https://lwn.net/Articles/985980/",
          "publishedOn": "2024-08-16T13:07:41.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984839/",
          "author": "corbet",
          "description": "The kernel's memory-management developers have been busy in recent times;\nit can be hard to keep up with all that has been happening in this core\narea.  In an attempt to catch up, here is a look at recent work\naffecting tiered-memory systems, underutilized huge pages, and duplicated\nfile data in the Enhanced Read-Only Filesystem (EROFS).",
          "link": "https://lwn.net/Articles/984839/",
          "publishedOn": "2024-08-15T14:14:01.000Z",
          "wordCount": null,
          "title": "[$] Memory-management: tiered memory, huge pages, and EROFS",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985845/",
          "author": "jake",
          "description": "Security updates have been issued by AlmaLinux (container-tools:rhel8), Debian (flatpak), Fedora (389-ds-base, dotnet8.0, and roundcubemail), Red Hat (bind9.16, firefox, python-setuptools, and thunderbird), Slackware (dovecot), SUSE (389-ds, curl, kernel, kernel-firmware, kubernetes1.25, openssl-1_1, openssl-3, python-Pillow, and zziplib), and Ubuntu (busybox, linux-azure, and ruby-rmagick).",
          "link": "https://lwn.net/Articles/985845/",
          "publishedOn": "2024-08-15T14:07:24.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984770/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for August 15, 2024 is available.",
          "link": "https://lwn.net/Articles/984770/",
          "publishedOn": "2024-08-15T01:05:36.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for August 15, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985669/",
          "author": "jake",
          "description": "Three new stable kernels have been released: 6.10.5, 6.6.46, and 6.1.105. As usual, they contain important\nfixes all over the kernel tree.",
          "link": "https://lwn.net/Articles/985669/",
          "publishedOn": "2024-08-14T14:24:50.000Z",
          "wordCount": null,
          "title": "Stable kernels 6.10.5, 6.6.46, and 6.1.105",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/982868/",
          "author": "daroc",
          "description": "Rust is intended to let programmers write safer code.\nBut compilers are\nnot omniscient, and writing Rust code that interfaces with hardware (or that\nworks with memory outside of Rust's lifetime paradigm) requires, at\nsome point, the programmer's assurance that some operations are permissible. Benno Lossin\n\nsuggested adding\nsome more documentation to\n\nthe Rust-for-Linux project clarifying the\nstandards for commenting uses of unsafe in kernel code. There's general\nagreement that such standards are necessary, but less agreement on exactly when\nit is appropriate to use unsafe.",
          "link": "https://lwn.net/Articles/982868/",
          "publishedOn": "2024-08-14T14:17:38.000Z",
          "wordCount": null,
          "title": "[$] Standards for use of unsafe Rust in the kernel",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985654/",
          "author": "jake",
          "description": "Security updates have been issued by AlmaLinux (389-ds-base), Debian (ffmpeg), Fedora (chromium), Red Hat (.NET 8.0, container-tools:rhel8, edk2, firefox, gnome-shell, grafana, jose, kernel, kernel-rt, krb5, open-vm-tools, orc, pcs, poppler, python-urllib3, and wget), SUSE (gtk2, gtk3, kernel, python-setuptools, python310-setuptools, python312-setuptools, python39-setuptools, and webkit2gtk3), and Ubuntu (dotnet8, libcroco, linux-azure, linux-lowlatency, linux-raspi, and linux-oracle).",
          "link": "https://lwn.net/Articles/985654/",
          "publishedOn": "2024-08-14T13:28:30.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984502/",
          "author": "jzb",
          "description": "Markdown editors are a dime a dozen. Cheaper than that, actually,\nsince many of them are open‑source software. Despite the sheer number of\noptions, finding an editor that has all of the features that one might want can\nbe tricky. For some users, Zettlr\nmight the right tool. It is a What You See is What You\nMean (WYSIWYM) editor that stores its work locally as plain Markdown\nfiles. The project is billed as a \"one-stop publication\nworkbench\", and is suitable for writing anything from blog posts to\nacademic papers, maintaining a personal journal, or keeping notes in a Zettlekasten. It\nis simple to get started with, but rewards deeper exploration and\ncustomization.",
          "link": "https://lwn.net/Articles/984502/",
          "publishedOn": "2024-08-13T17:22:38.000Z",
          "wordCount": null,
          "title": "[$] Zettlr: note-taking and publishing with Markdown",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984599/",
          "author": "daroc",
          "description": "The\n\nPostgreSQL project has\n\nreleased beta\nversions of PostgreSQL 17 containing several interesting security and usability\nimprovements, alongside the usual performance improvements and bug fixes. If the\nrelease proceeds according to the usual timeline, the full release of version 17\nis expected in September or October.\nThe most important changes are in what PostgreSQL does when a database\nsupervisor has their credentials revoked, and added\nsupport for incremental database backups.",
          "link": "https://lwn.net/Articles/984599/",
          "publishedOn": "2024-08-13T14:10:23.000Z",
          "wordCount": null,
          "title": "[$] Changes coming in PostgreSQL 17",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985484/",
          "author": "daroc",
          "description": "Lix, the fork of Nix that LWN covered in July, has made its second release since forking. This one includes substantial changes to the backend code, including removing a dependency on Bison, and getting a change to the Nix language back upstream.\n\n\n\n\nThe general theme of Lix 2.91 is to perform another wave of\nrefactorings and design improvements in preparation for our evolution\nplans.\n\n\n\nNevertheless, there are a few exciting user facing changes[.]",
          "link": "https://lwn.net/Articles/985484/",
          "publishedOn": "2024-08-13T14:09:40.000Z",
          "wordCount": null,
          "title": "Lix makes its second release",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985482/",
          "author": "corbet",
          "description": "Version 6.4 of the Incus container manager is out.\n\n\n\tThis release builds upon the recently added OCI support from Incus\n\t6.3, making it even easier to run application containers. It also\n\tadds a number of useful new features for clustered and larger\n\tenvironments with more control on the virtual CPU used when live\n\tmigrating VMs and finer grained resource constraints within\n\tprojects.\n\n\nSee this\nannouncement for details.",
          "link": "https://lwn.net/Articles/985482/",
          "publishedOn": "2024-08-13T13:38:36.000Z",
          "wordCount": null,
          "title": "Incus 6.4 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985481/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (kernel and roundcube), Fedora (microcode_ctl, pypy, python2.7, and python3.6), Oracle (389-ds-base, httpd, kernel, kernel-container, and linux-firmware), Red Hat (kernel-rt), SUSE (firefox, kubernetes1.23, libqt5-qtbase, openssl-1_1, python-gunicorn, python-Twisted, python-urllib3, and qt6-base), and Ubuntu (linux-aws-5.15, linux-gkeop-5.15, linux-ibm, linux-ibm-5.15, linux-raspi, linux-azure, linux-azure-5.15, linux-azure-fde, linux-azure-fde-5.15, linux-oem-6.8, linux-oracle-5.15, and qemu).",
          "link": "https://lwn.net/Articles/985481/",
          "publishedOn": "2024-08-13T13:28:10.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984638/",
          "author": "jzb",
          "description": "Linux hardware vendor System76 started promoting\nits work on a Rust-based, Wayland\ndesktop environment for its Pop!_OS\nUbuntu-derivative distribution almost two years\nago. On August 8, the company released an alpha version of the COSMIC desktop environment for\nusers to test out. While it has rough edges and missing features, it\nis stable enough to get a good feel for what the finished product has\nin store—and the initial results are promising.",
          "link": "https://lwn.net/Articles/984638/",
          "publishedOn": "2024-08-12T17:26:47.000Z",
          "wordCount": null,
          "title": "[$] COSMIC desktop makes its debut",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985350/",
          "author": "jzb",
          "description": "Version 4.0 of the Magit text-based\nGit user interface for Emacs has been released. Changes since the 3.3.0\nrelease include the addition of context menus, a makeover for the\nmenu-bar menu, new menu commands, and many other new features and bug\nfixes. See the release\nnotes for full details.",
          "link": "https://lwn.net/Articles/985350/",
          "publishedOn": "2024-08-12T16:57:00.000Z",
          "wordCount": null,
          "title": "Magit 4.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985296/",
          "author": "corbet",
          "description": "The Rust project has developed a\nset of goals for the latter half of 2024.\n\n\n\tRust\n\tfor Linux. The experimental support for Rust\n\tdevelopment in the Linux kernel is a watershed moment for Rust,\n\tdemonstrating to the world that Rust is indeed capable of targeting\n\tall manner of low-level systems applications. And yet today that\n\tsupport rests on a number of\n\tunstable features, blocking the effort from ever going beyond\n\texperimental status. For 2024H2 we will work to close the largest\n\tgaps that block support.\n\n\nOther goals include completing the 2024 Rust\nEdition and improving the language's async support.",
          "link": "https://lwn.net/Articles/985296/",
          "publishedOn": "2024-08-12T15:47:33.000Z",
          "wordCount": null,
          "title": "Rust Project goals for 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985336/",
          "author": "jake",
          "description": "Security updates have been issued by AlmaLinux (httpd:2.4), Fedora (chromium, firefox, frr, neatvnc, nss, python-setuptools, and python3.13), Gentoo (AFLplusplus, Bundler, dpkg, GnuPG, GPAC, libde265, matio, MuPDF, PHP, protobuf, protobuf-python, protobuf-c, rsyslog, Ruby on Rails, and runc), Red Hat (389-ds-base, container-tools:rhel8, and httpd:2.4), SUSE (bind and ca-certificates-mozilla), and Ubuntu (linux-azure).",
          "link": "https://lwn.net/Articles/985336/",
          "publishedOn": "2024-08-12T15:08:45.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985233/",
          "author": "corbet",
          "description": "Linus has released 6.11-rc3 right on\nschedule.  \"Nothing particularly strange or interesting going on, things\nlook normal\".",
          "link": "https://lwn.net/Articles/985233/",
          "publishedOn": "2024-08-11T22:33:26.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.11-rc3",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985198/",
          "author": "corbet",
          "description": "The\n6.10.4,\n6.6.45, and\n6.1.104\nstable kernel updates have been released; each contains another set of\nimportant updates as usual.",
          "link": "https://lwn.net/Articles/985198/",
          "publishedOn": "2024-08-11T14:19:26.000Z",
          "wordCount": null,
          "title": "Three weekend stable kernels",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984720/",
          "author": "jake",
          "description": "It is something of a DebConf tradition that members of the Debian Technical\nCommittee (TC) take the stage to talk about the work that the committee\ndoes—and more.  DebConf24 in\nBusan, South Korea was no exception, as TC chair Sean Whitton, who\nwill complete his term at the end of the year, and one\nof its newest members, Stefano Rivera, described the constitutional\nunderpinnings of the TC, how it tries to make decisions when it needs to,\nand the constant process of recruiting new members.  After that, they took\na few questions from the audience.  The session provided a nice overview of\nthe TC and its role in Debian, but it may well be of interest further afield.",
          "link": "https://lwn.net/Articles/984720/",
          "publishedOn": "2024-08-10T01:51:14.000Z",
          "wordCount": null,
          "title": "[$] Meeting the Debian Technical Committee",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/985043/",
          "author": "corbet",
          "description": "The Canonical Kernel Team has announced\na new policy regarding the version of the kernel that will ship with each\nUbuntu release; the result will generally be the shipping of newer\nreleases.\n\n\n\tTo provide users with the absolute latest in features and hardware\n\tsupport, Ubuntu will now ship the absolute latest available version\n\tof the upstream Linux kernel at the specified Ubuntu release freeze\n\tdate, even if upstream is still in Release Candidate (RC) status.\n\n\nThe post goes on to acknowledge that \"there are issues with this\napproach\"; there are a lot of policy details that will apply depending\non just how raw the shipped kernel is.",
          "link": "https://lwn.net/Articles/985043/",
          "publishedOn": "2024-08-09T19:47:44.000Z",
          "wordCount": null,
          "title": "A new kernel-version policy for Ubuntu",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984635/",
          "author": "corbet",
          "description": "Sometimes, the smallest changes create the longest discussions.  As a case\nin point, a proposal to make a one-line change in an informational text\nfile on systems running the Debian unstable distribution has blown up into\nan interminable and sometimes unfriendly debate.  At its core, though, this\ndiscussion comes down to a seemingly simple question: should a program be\nable to determine whether it is running on a Debian testing or unstable\nsystem?",
          "link": "https://lwn.net/Articles/984635/",
          "publishedOn": "2024-08-09T15:12:04.000Z",
          "wordCount": null,
          "title": "[$] Distinguishing Debian testing from unstable",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984984/",
          "author": "daroc",
          "description": "Researchers from Graz University of Technology have\npublished details of a new attack\non the Linux kernel called SLUBStick. The attack uses timing information to turn an ability to trigger use-after-free or double-free bugs into the ability to overwrite page tables, and thence into the ability to read and write arbitrary areas of memory. The good news is that this attack does require an existing bug to be usable; the bad news is that the kernel regularly sees bugs of this kind.\n\n\n\nWe assume that an unprivileged user has code execution. \nAdditionally, we consider the presence of a heap vulnerability\nin the Linux kernel. We assume that the Linux kernel \nincorporates all defense mechanisms available in version 6.4, the\nmost recent Linux kernel version when we started our work.\nThese mechanisms include features such as WˆX, KASLR,\nSMAP, and kCFI. We do not assume any microarchitectural \nvulnerabilities, e.g., transient execution, fault\ninjection, or hardware side channels.",
          "link": "https://lwn.net/Articles/984984/",
          "publishedOn": "2024-08-09T15:08:27.000Z",
          "wordCount": null,
          "title": "New attack against the SLUB allocator",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984966/",
          "author": "daroc",
          "description": "Security updates have been issued by AlmaLinux (httpd, kernel, kernel-rt, and libtiff), Debian (postgresql-13, postgresql-15, and thunderbird), Fedora (frr, thunderbird, vim, and xrdp), Gentoo (Librsvg, Nautilus, ncurses, Percona XtraBackup, QEMU, and re2c), Red Hat (httpd, kernel, kernel-rt, openssl, and python-setuptools), SUSE (bind, ffmpeg-4, kubernetes1.23, kubernetes1.24, python-Django, and python3-Twisted), and Ubuntu (linux, linux-aws, linux-aws-5.4, linux-gcp, linux-gcp-5.4, linux-gkeop, linux-hwe-5.4, linux-ibm, linux-ibm-5.4, linux-iot, linux-kvm, linux-raspi, linux-xilinx-zynqmp, linux, linux-aws, linux-gcp, linux-gcp-5.15, linux-gke, linux-gkeop, linux-intel-iotg, linux-intel-iotg-5.15, linux-kvm, linux-lowlatency, linux-lowlatency-hwe-5.15, linux-nvidia, linux, linux-aws, linux-gcp, linux-gke, linux-ibm, linux-nvidia, linux-nvidia-6.8, linux-oem-6.8, linux-nvidia-lowlatency, linux-oracle, linux-oracle, linux-oracle-5.4, and salt).",
          "link": "https://lwn.net/Articles/984966/",
          "publishedOn": "2024-08-09T13:23:06.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984838/",
          "author": "corbet",
          "description": "The Oligo Security blog discloses\na web-browser vulnerability that has been named \"0.0.0.0 day\".  In short,\nbrowsers will allow JavaScript code to open connections to the all-zeroes\nIPv4 address; the result is that any port that is open on the local host\ncan be accessed by a remote site.  \"When services use localhost, they\nassume a constrained environment. This assumption, which can (as in the\ncase of this vulnerability) be faulty, results in insecure server\nimplementations.\"",
          "link": "https://lwn.net/Articles/984838/",
          "publishedOn": "2024-08-08T17:15:20.000Z",
          "wordCount": null,
          "title": "0.0.0.0 Day: Exploiting Localhost APIs From the Browser (Oligo Security)",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984086/",
          "author": "daroc",
          "description": "Endless OS is a Linux distribution with a focus on improving access to\neducational tools by providing a simple-to-manage, full-featured desktop for\neducators and students — one that works offline, with minimal maintenance. The\ndistribution also aims to be suitable for older devices, in order to promote access to\ncomputers by ensuring those systems remain usable.\nIn pursuit of those goals, it makes some unusual technical\nchoices. But what makes the distribution really shine is its curated collection\nof software and educational resources.",
          "link": "https://lwn.net/Articles/984086/",
          "publishedOn": "2024-08-08T13:56:26.000Z",
          "wordCount": null,
          "title": "[$] Endless OS aimed at educational and offline environments",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984807/",
          "author": "jake",
          "description": "Security updates have been issued by AlmaLinux (freeradius and freeradius:3.0), Debian (chromium, odoo, and roundcube), Fedora (microcode_ctl, mingw-qt5-qtbase, mingw-qt6-qtbase, opentofu, orc, python-setuptools, and vim), Gentoo (Nokogiri), Oracle (kernel), Red Hat (go-toolset:rhel8, golang, kernel, krb5, libtiff, python-setuptools, and python39:3.9 and python39-devel:3.9), SUSE (python-Django), and Ubuntu (krb5).",
          "link": "https://lwn.net/Articles/984807/",
          "publishedOn": "2024-08-08T13:51:35.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984216/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for August 8, 2024 is available.",
          "link": "https://lwn.net/Articles/984216/",
          "publishedOn": "2024-08-08T01:37:30.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for August 8, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984733/",
          "author": "daroc",
          "description": "Mozilla has announced that Puppeteer, a browser automation and testing library, now has first-class support for Firefox using the\nWebDriver BiDi protocol. Puppeteer can be used to drive headless browser instances, and is commonly used for automated end-to-end web site tests.\n\n\n\nWhilst the features offered by Puppeteer won't be a surprise,\nbringing support to multiple browsers has been a significant\nundertaking. The Firefox support is not based on a Firefox-specific\nautomation protocol, but on WebDriver BiDi, a cross browser protocol\nthat's undergoing standardization at the W3C, and currently has\nimplementation in both Gecko and Chromium. This use of a\ncross-browser protocol should make it much easier to support many\ndifferent browsers going forward.",
          "link": "https://lwn.net/Articles/984733/",
          "publishedOn": "2024-08-07T19:20:19.000Z",
          "wordCount": null,
          "title": "Firefox support added to Puppeteer",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984313/",
          "author": "corbet",
          "description": "The desire for the ability to checkpoint a process — to record its state in\na form that can be restarted at a future time — on Linux is almost as old as\nLinux itself.  See, for example, this announcement of a checkpoint\nproject that appeared in LWN in 1998.  While working solutions exist, they\ncan be somewhat fragile and difficult to use; it is not surprising that\nsome people are interested in finding a better alternative.  A current\neffort goes by the name CRIB,\nfor Checkpoint/Restore in (naturally) BPF.  It is far from clear that CRIB\nwill replace the existing solutions, but it is an interesting look at a\ndifferent way of solving the problem.",
          "link": "https://lwn.net/Articles/984313/",
          "publishedOn": "2024-08-07T15:35:18.000Z",
          "wordCount": null,
          "title": "[$] CRIB: checkpoint/restore in BPF",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984556/",
          "author": "jake",
          "description": "There are lots of places in the kernel where an EINVAL can be\nreturned to user space, but it is often unclear what the actual underlying\nproblem is because the errno\nerror codes are too generic.  That is the problem that Miklos Szeredi\nwanted to discuss in a filesystem session that he led remotely at the 2024 Linux Storage,\nFilesystem, Memory Management, and BPF Summit.  He would like to help\nthose who are trying to debug problems trace where in the kernel a\nparticular error code is being generated.",
          "link": "https://lwn.net/Articles/984556/",
          "publishedOn": "2024-08-07T14:18:21.000Z",
          "wordCount": null,
          "title": "[$] Tracing the source of filesystem errors",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984702/",
          "author": "jzb",
          "description": "Security updates have been issued by Debian (firefox-esr, openjdk-17, and wpa), Gentoo (aiohttp, Bitcoin, Cairo, Go, json-c, Levenshtein, libXpm, nghttp2, PostgreSQL, and Redis), Red Hat (kernel, kernel-rt, python-setuptools, python-urllib3, python3.11-setuptools, and wget), Slackware (mozilla), SUSE (bind, curl, docker, ffmpeg, ffmpeg-4, kernel, kernel-firmware, libnbd, patch, shadow, and thunderbird), and Ubuntu (python-django and wpa).",
          "link": "https://lwn.net/Articles/984702/",
          "publishedOn": "2024-08-07T13:14:08.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/983870/",
          "author": "jake",
          "description": "CircuitPython is an open-source\nimplementation of the Python programming language for microcontroller\nboards.  The project, which is sponsored by Adafruit Industries, is designed with\nnew programmers in mind, but it also has many features that may be of\ninterest to more-experienced developers. The recent 9.1.0 release\nadds a few minor features, but it follows just a few months after CircuitPython 9.0.0,\nwhich brings some more significant changes, including improved graphics and\nUSB support.",
          "link": "https://lwn.net/Articles/983870/",
          "publishedOn": "2024-08-06T14:35:25.000Z",
          "wordCount": null,
          "title": "[$] CircuitPython: Python for microcontrollers, simplified",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984617/",
          "author": "corbet",
          "description": "Version\n129.0 of the Firefox browser has been released.  Changes include some\nimprovements to the reader mode, tab previews, and use of HTTPS by default.",
          "link": "https://lwn.net/Articles/984617/",
          "publishedOn": "2024-08-06T14:28:06.000Z",
          "wordCount": null,
          "title": "Firefox 129.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984598/",
          "author": "corbet",
          "description": "Security updates have been issued by Debian (libreoffice), Gentoo (containerd and firefox), Red Hat (httpd), SUSE (ca-certificates-mozilla, ksh, openssl-3-livepatches, podman, python-Twisted, and skopeo), and Ubuntu (imagemagick).",
          "link": "https://lwn.net/Articles/984598/",
          "publishedOn": "2024-08-06T13:30:16.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/983714/",
          "author": "jake",
          "description": "David Howells wanted to discuss changing the way filesystem code handles\nthe ability to interrupt or kill operations, in order to fix some\nlongstanding problems with network \n(and other) filesystems, in a session at\nthe 2024 Linux\nStorage, Filesystem, Memory Management, and BPF Summit.   As noted in\nhis session\nproposal, some filesystems may be expecting to not be interruptible,\nbut are calling code can take locks and mutexes that are interruptible (or\nkillable), which are effectively\nchanging the state of the task incorrectly.\nHe would like to find a solution for that problem.",
          "link": "https://lwn.net/Articles/983714/",
          "publishedOn": "2024-08-05T19:15:53.000Z",
          "wordCount": null,
          "title": "[$] Handling filesystem interruptibility",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984249/",
          "author": "jzb",
          "description": "The Business\nSource License (BUSL) is a source-available license that \"converts\"\nto an open-source license after a period of time. In theory, this\nmeans that a few years after a version of a product is released under\nthe BUSL, it becomes open source and is fair game for Linux\ndistributions to package along with regular open-source projects. In\npractice, the license throws a few curveballs that require special\nconsideration and caution, as the Fedora Project recently discussed.",
          "link": "https://lwn.net/Articles/984249/",
          "publishedOn": "2024-08-05T14:55:26.000Z",
          "wordCount": null,
          "title": "[$] The complexity of BUSL transformation",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984539/",
          "author": "corbet",
          "description": "Version 2.43 of the GNU Binutils package is out.  Changes include some\nimprovements to the assembler and the linker, better support for hardware\nevent counters in the Gprofng profiler, and more.",
          "link": "https://lwn.net/Articles/984539/",
          "publishedOn": "2024-08-05T14:29:09.000Z",
          "wordCount": null,
          "title": "GNU Binutils 2.43 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984552/",
          "author": "jake",
          "description": "Security updates have been issued by Debian (openjdk-11), Fedora (bind, bind-dyndb-ldap, chromium, ffmpeg, hostapd, trafficserver, and wpa_supplicant), and Ubuntu (curl and linux-oem-6.5).",
          "link": "https://lwn.net/Articles/984552/",
          "publishedOn": "2024-08-05T14:26:33.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984501/",
          "author": "corbet",
          "description": "Linus has released 6.11-rc2 for testing.\n\"Hopefully we've gotten rid of the bulk of the silly noise here in rc2,\nand not added too much new noise, so that we can get on with the process of\nfinding more meaningful issues.\"",
          "link": "https://lwn.net/Articles/984501/",
          "publishedOn": "2024-08-05T00:25:15.000Z",
          "wordCount": null,
          "title": "Kernel prepatch 6.11-rc2",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984448/",
          "author": "jzb",
          "description": "The 6.10.3, 6.6.44, and 6.1.103 stable kernel updates have all been released. As usual, they\ncontain important fixes throughout the tree. Users of those kernels\nshould upgrade.",
          "link": "https://lwn.net/Articles/984448/",
          "publishedOn": "2024-08-03T13:41:41.000Z",
          "wordCount": null,
          "title": "Three stable kernel updates for Saturday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/983843/",
          "author": "daroc",
          "description": "There is ongoing discussion about the ethics and effectiveness of\ntelemetry following some recent LWN articles that touched on\n\nThunderbird's use of opt-out\ntelemetry and planned metrics in Fedora. The\n\nInternet Security Research Group (ISRG), the nonprofit behind\n\nLet's Encrypt, has a potential solution to the problem of how to collect and\naggregate telemetry without violating users' privacy. The scheme is based on a\ndraft\nprotocol being standardized with the Internet Engineering Task Force (IETF),\nand has an\nopen-source implementation\navailable.",
          "link": "https://lwn.net/Articles/983843/",
          "publishedOn": "2024-08-02T13:13:37.000Z",
          "wordCount": null,
          "title": "[$] Divvi Up: privacy-respecting telemetry aggregation",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984370/",
          "author": "daroc",
          "description": "Security updates have been issued by Fedora (chromium), SUSE (docker and patch), and Ubuntu (bind9, gross, linux-azure, linux-azure-4.15, linux-lowlatency-hwe-6.5, and tomcat8, tomcat9).",
          "link": "https://lwn.net/Articles/984370/",
          "publishedOn": "2024-08-02T13:13:12.000Z",
          "wordCount": null,
          "title": "Security updates for Friday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984266/",
          "author": "jzb",
          "description": "The Sovereign Tech Fund (STF) has announced\na fellowship program to support \"the dedicated individuals who keep\nour digital infrastructure running\":\nAccording to the fellowship\npage the STF plans to fund five fellowships, beginning in the\nfourth quarter of this year, for a period of 12 months.",
          "link": "https://lwn.net/Articles/984266/",
          "publishedOn": "2024-08-01T15:31:48.000Z",
          "wordCount": null,
          "title": "Sovereign Tech Fund introduces fellowship pilot program",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/983965/",
          "author": "corbet",
          "description": "Like many projects written in C, the kernel makes extensive use of the C\npreprocessor; indeed, the kernel's use is rather more extensive than most.\nThe preprocessor famously has a number of sharp edges associated with it.\nOne might not normally think of increased compilation time as one of them,\nthough.  It turns out that some changes to a couple of conceptually simple\npreprocessor macros — min() and max() — led to some truly\npathological, but hidden, behavior where those macros were used.",
          "link": "https://lwn.net/Articles/983965/",
          "publishedOn": "2024-08-01T14:28:31.000Z",
          "wordCount": null,
          "title": "[$] Maximal min() and max()",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984213/",
          "author": "jzb",
          "description": "We have received the\nsad news that Dr. Mel Chua has passed away. Mel was probably best\nknown in the free-software community as a contributor to the Fedora\nProject in its early days. The Fedora Community blog honored\nMel recently after she had moved to hospice care with tributes\nfrom several Fedorans. Stephen Jacobs wrote:\nMel will be greatly missed.",
          "link": "https://lwn.net/Articles/984213/",
          "publishedOn": "2024-08-01T13:39:19.000Z",
          "wordCount": null,
          "title": "Mel Chua RIP",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984212/",
          "author": "jzb",
          "description": "Security updates have been issued by Debian (chromium), Fedora (kernel, obs-cef, and xen), Mageia (emacs), Oracle (freeradius, freeradius:3.0, and kernel), Red Hat (emacs, httpd, and kpatch-patch-4_18_0-305_120_1), Slackware (curl), SUSE (apache2, cockpit-wicked, glibc, gnutls, gvfs, less, nghttp2, opensc, python-idna, python-requests, qemu, rpm, tpm2-0-tss, tpm2.0-tools, and unbound), and Ubuntu (clickhouse, exim4, libcommons-collections3-java, linux, linux-aws, linux-kvm, linux-lts-xenial, mysql-8.0, openssl, php-cas, prometheus-alertmanager, and snapd).",
          "link": "https://lwn.net/Articles/984212/",
          "publishedOn": "2024-08-01T13:01:55.000Z",
          "wordCount": null,
          "title": "Security updates for Thursday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/983267/",
          "author": "corbet",
          "description": "The LWN.net Weekly Edition for August 1, 2024 is available.",
          "link": "https://lwn.net/Articles/983267/",
          "publishedOn": "2024-08-01T04:57:32.000Z",
          "wordCount": null,
          "title": "[$] LWN.net Weekly Edition for August 1, 2024",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984143/",
          "author": "corbet",
          "description": "Arnd Bergmann has posted a\ndetailed timeline for the deprecation of support for old Arm CPUs in\nboth the kernel and the compiler toolchain.  Anybody who is working with\nthat hardware will likely want to review this list and let the relevant\ndevelopers know if any of that support is still needed.",
          "link": "https://lwn.net/Articles/984143/",
          "publishedOn": "2024-07-31T20:15:43.000Z",
          "wordCount": null,
          "title": "A deprecation timeline for older Arm CPUs",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984117/",
          "author": "jzb",
          "description": "Version 2.0 of the Vanilla OS image-based Linux distribution has\nbeen released. Dubbed\n\"Orchid\", Vanilla OS is now based on Debian Sid (prior versions were Ubuntu-based),\nallows creation\nof customized Linux environments, support for running Android\napplications using Waydroid, and many other improvements.",
          "link": "https://lwn.net/Articles/984117/",
          "publishedOn": "2024-07-31T18:13:38.000Z",
          "wordCount": null,
          "title": "Vanilla OS 2 \"Orchid\" released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/983897/",
          "author": "jzb",
          "description": "A few years ago, PyGObject—the Python\npackage that provides bindings for GTK and GNOME applications—was not\nfaring particularly well. Several maintainers had left the project and its\ndevelopment was not keeping pace with changes in GTK. At this year's\nGUADEC, Dan Yeaw presented a talk\nabout the project's decline, improvements in the last year, and his\nexperience getting involved in an undermaintained project.",
          "link": "https://lwn.net/Articles/983897/",
          "publishedOn": "2024-07-31T17:39:43.000Z",
          "wordCount": null,
          "title": "[$] Showing up for Python in GNOME",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984116/",
          "author": "jzb",
          "description": "Version 8.0 of the Forgejo\nsoftware-development platform has been released. Notable\nchanges include the removal\nof non-free software found in the codebase, improved stability, and a\nreduction\nin \"seemingly random User Interface changes\":\nSee the release\nnotes for a full list of changes.",
          "link": "https://lwn.net/Articles/984116/",
          "publishedOn": "2024-07-31T15:58:08.000Z",
          "wordCount": null,
          "title": "Forgejo v8.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/983340/",
          "author": "daroc",
          "description": "A \nbootstrappable build is one that builds existing\nsoftware from scratch — for example, building GCC without relying on an existing\ncopy of GCC. In 2023, the Guix project\nannounced that the project had reduced the size\nof the binary bootstrap seed needed to build its operating system to just 357-bytes —\nnot counting the Linux kernel required to run the build process. Now, the\nlive-bootstrap project\nhas gone a step further and removed the need for an existing kernel at all.",
          "link": "https://lwn.net/Articles/983340/",
          "publishedOn": "2024-07-31T13:18:13.000Z",
          "wordCount": null,
          "title": "[$] Pulling Linux up by its bootstraps",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/984080/",
          "author": "jzb",
          "description": "Security updates have been issued by Fedora (xdg-desktop-portal-hyprland), Red Hat (freeradius, freeradius:3.0, git-lfs, httpd, kernel, openssh, and varnish:6), SUSE (cdi-apiserver-container, cdi-cloner-container, cdi- controller-container, cdi-importer-container, cdi-operator-container, cdi- uploadproxy-container, cdi-uploadserver-container, cont, git, gtk2, gtk3, kubevirt, virt-api-container, virt-controller-container, virt-exportproxy-container, virt-exportserver-container, virt-handler-container, virt-launcher-container, virt-libguestfs-t, orc, postgresql14, python-dnspython, python-urllib3, shadow, and xen), and Ubuntu (openjdk-17, openjdk-21, openjdk-8, openjdk-lts, and python3.10, python3.8).",
          "link": "https://lwn.net/Articles/984080/",
          "publishedOn": "2024-07-31T13:09:32.000Z",
          "wordCount": null,
          "title": "Security updates for Wednesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/983105/",
          "author": "jake",
          "description": "At the 2024 Linux\nStorage, Filesystem, Memory Management, and BPF Summit, John Groves led\na session on famfs, which is a filesystem he has developed that uses the\nkernel's direct-access (DAX)\nmechanism to access memory that is shareable between hosts.  The discussion\nwas aimed at whether a different approach should be taken and, in\nparticular, whether FUSE should be used instead of implementing as an\nin-kernel filesystem.  As noted in the thread about his\nproposal for an LSFMM+BPF session, and the mailing-list discussions on the first and second\nversion of his patch set, there is some skepticism that a new in-kernel\nfilesystem is warranted for the use case.",
          "link": "https://lwn.net/Articles/983105/",
          "publishedOn": "2024-07-30T21:28:16.000Z",
          "wordCount": null,
          "title": "[$] Famfs: a filesystem interface to shareable memory",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/983977/",
          "author": "jzb",
          "description": "Daniel Robbins, founder of the Gentoo Linux distribution and its\nspinoff Funtoo Linux, has\nannounced\nthat he has decided to end the Funtoo project:\nFuntoo\ncontainer, it will continue to be online through the end of August\nso you have time to find another hosting solution if you need one.",
          "link": "https://lwn.net/Articles/983977/",
          "publishedOn": "2024-07-30T17:10:27.000Z",
          "wordCount": null,
          "title": "Funtoo Linux is being discontinued",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/983203/",
          "author": "jzb",
          "description": "At GUADEC\nin Denver, Colorado on July 21, the GNOME Foundation held its annual\ngeneral meeting (AGM) to provide updates from the foundation's board and committees.\nTopics included work accomplished in the past year, challenges\nfacing the GNOME Foundation–including fundraising and finding a new\nexecutive director–and some insight into plans for the next year. And\nlast, but not least, the awarding of the Pants of Thanks.",
          "link": "https://lwn.net/Articles/983203/",
          "publishedOn": "2024-07-30T13:51:09.000Z",
          "wordCount": null,
          "title": "[$] Report from the annual general meeting at GUADEC",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/983935/",
          "author": "corbet",
          "description": "Security updates have been issued by Fedora (curl), Mageia (virtualbox), Oracle (squid), Red Hat (kernel), SUSE (apache2, bind, cdi-apiserver-container, cdi-cloner-container, cdi- controller-container, cdi-importer-container, cdi-operator-container, cdi- uploadproxy-container, cdi-uploadserver-container, devscripts, espeak-ng, freerdp, ghostscript, gnome-shell, gtk2, gtk3, java-11-openjdk, java-17-openjdk, kubevirt, libgit2, openssl-3, orc, p7zip, python-dnspython, and shadow), and Ubuntu (kernel, linux, linux-aws, linux-aws-hwe, linux-gcp, linux-gcp-4.15, linux-hwe, linux-kvm, linux-oracle, linux, linux-aws, linux-gcp, linux-gke, linux-ibm, linux-nvidia, linux-oem-6.8, linux-raspi, linux, linux-azure, linux-azure-5.4, linux-bluefield, linux-gcp, linux-gcp-5.4, linux-gkeop, linux-hwe-5.4, linux-ibm, linux-ibm-5.4, linux-iot, linux-kvm, linux-raspi, linux-xilinx-zynqmp, linux-aws, linux-aws-5.4, linux-aws-5.15, linux-ibm, linux-ibm-5.15, linux-raspi, linux-gcp-5.15, and linux-lowlatency).",
          "link": "https://lwn.net/Articles/983935/",
          "publishedOn": "2024-07-30T13:49:03.000Z",
          "wordCount": null,
          "title": "Security updates for Tuesday",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/983850/",
          "author": "corbet",
          "description": "Version 2.46.0 of the Git\nsource-code management system has been released.  This release seems to\nconsist of a long list of interface and performance improvements rather\nthan big new features; see the announcement for the details.",
          "link": "https://lwn.net/Articles/983850/",
          "publishedOn": "2024-07-29T17:20:39.000Z",
          "wordCount": null,
          "title": "Git 2.46.0 released",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/982605/",
          "author": "corbet",
          "description": "The release of 6.11-rc1\nmarked the end of the 6.11 merge window on July 28.  By that time,\n12,102 non-merge changesets had been pulled into the mainline repository;\nabout 8,000 of those came in after the\nfirst-half summary was written.  Quite a few significant changes were\nto be found in those changesets; there is also one big change that did not\nmake it.",
          "link": "https://lwn.net/Articles/982605/",
          "publishedOn": "2024-07-29T13:54:16.000Z",
          "wordCount": null,
          "title": "[$] The rest of the 6.11 merge window",
          "imageUrl": null
        },
        {
          "id": "https://lwn.net/Articles/983816/",
          "author": "daroc",
          "description": "Security updates have been issued by AlmaLinux (java-11-openjdk), Debian (bind9), Fedora (darkhttpd, mod_http2, and python-scrapy), Red Hat (python3.11, rhc-worker-script, and thunderbird), SUSE (assimp, gh, opera, python-Django, and python-nltk), and Ubuntu (edk2, linux, linux-aws, linux-gcp, linux-gke, linux-gkeop, linux-gkeop-5.15, linux-hwe-5.15, linux-intel-iotg, linux-intel-iotg-5.15, linux-kvm, linux-lowlatency, linux-lowlatency-hwe-5.15, linux-nvidia, linux-oracle, linux-azure, linux-azure-5.15, linux-azure-fde, linux-azure-fde-5.15, linux-nvidia-6.5, linux-oracle, linux-raspi, and lua5.4).",
          "link": "https://lwn.net/Articles/983816/",
          "publishedOn": "2024-07-29T13:14:16.000Z",
          "wordCount": null,
          "title": "Security updates for Monday",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "M0AGX / LB9MG",
      "feedUrl": "https://m0agx.eu/feeds/all.rss.xml",
      "siteUrl": "https://m0agx.eu/",
      "articles": [
        {
          "id": "tag:m0agx.eu,2024-08-19:/multiprocessing-pythons-best-kept-secret.html",
          "author": null,
          "description": "I use Python for most of my offline data processing needs.\nRecently I had to analyze a big set of data from an experiment.\nThe unit task was not that difficult, open a file, run a couple of\nalgorithms, and calculate several metrics from the signal.\nIt took around ten seconds. All done in Scipy and NumPy.\nThe \"only\" problem that I had thousands of files with\na total volume around 20 GB.\nIt should be trivial to parallelize - or so I thought.",
          "link": "https://m0agx.eu/multiprocessing-pythons-best-kept-secret.html",
          "publishedOn": "2024-08-19T00:00:00.000Z",
          "wordCount": null,
          "title": "Multiprocessing - Python's best kept secret",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Martin Fowler",
      "feedUrl": "https://martinfowler.com/feed.atom",
      "siteUrl": "https://martinfowler.com/feed.atom",
      "articles": [
        {
          "id": "https://martinfowler.com/articles/2024-strangler-fig-rewrite.html",
          "author": null,
          "description": "Two decades ago, I posted that I found that the strangler fig plant was an interesting metaphor for the gradual replacement of a legacy system. I didn’t refer to the metaphor since, but meanwhile it grew a life of its own. Other people increasingly referred to the strangler fig approach to modernization, and traffic to that post steadily increased: currently it gets about 5000 page views a month, one of the more popular pages on this site. So I decided I needed to update that page, and have rewritten it, focusing on the core activities we need to do to make a success of such a venture.\n(This summarizes more detailed writing from Ian Cartwright, Rob Horn, and James Lewis.)",
          "link": "https://martinfowler.com/articles/2024-strangler-fig-rewrite.html",
          "publishedOn": "2024-08-22T15:51:00.000Z",
          "wordCount": null,
          "title": "Rewriting Strangler Fig",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/exploring-gen-ai.html#memo-09",
          "author": null,
          "description": "Much of the attention to generative AI in software development is\n       about generating code. But it may have a more useful role in helping us\n       understand existing code. This is especially true for older codebases\n       that are getting hard to maintain (\"legacy\") or to improve onboarding in\n       teams that have a lot of fluctuation.\nBirgitta Böckeler demonstrates the possibilities here\n       by picking an issue from an open-source hospital management system and\n       exploring how AI could help her deal with it.\nmore…",
          "link": "https://martinfowler.com/articles/exploring-gen-ai.html#memo-09",
          "publishedOn": "2024-08-15T14:32:00.000Z",
          "wordCount": null,
          "title": "Onboarding to a \"legacy\" codebase with the help of AI",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/2024-eaa-catalog-refresh.html",
          "author": null,
          "description": "From time to time I take a look at my site analytics to see how much traffic various bits of this site get. When doing this I saw that I continue to get a lot of traffic to the Catalog of Patterns of Enterprise Application Architecture. I put this together not long after writing the book, and it’s rather minimal. Since it still gets traffic I felt it was time for some sprucing up. The content is the same, summaries of the patterns in the book. I’ve changed the main catalog page to include the pattern intents. I’ve also added deep links to the book on oreilly.com, so if you have a subscription to that, it will jump directly to that text. Hopefully these changes will make the catalog page a bit more useful.",
          "link": "https://martinfowler.com/articles/2024-eaa-catalog-refresh.html",
          "publishedOn": "2024-07-31T20:11:00.000Z",
          "wordCount": null,
          "title": "Refresh of the PoEAA catalog page",
          "imageUrl": null
        },
        {
          "id": "https://martinfowler.com/articles/2024-restrict-algorithm.html",
          "author": null,
          "description": "The steady increase in deployment of AI tools has led a lot of people concerned about how software makes decisions that affect our lives. In one example, its about “algorithmic” feeds in social media that promote posts that drive engagement. A more serious impact can come from business decisions, such as how much premium to charge in car insurance. This can extend to affecting legal decisions, such as suggesting sentencing guidelines to judges.\nFaced with these concerns, there is often a movement to restrict the use of algorithms, such as a recent activity in New York to restrict how social media networks generate feeds for children. Should we draw up more laws to fence in the rampaging algorithms?\nIn my view, the restricting the use of algorithms and AI here isn’t the right target. A regu…",
          "link": "https://martinfowler.com/articles/2024-restrict-algorithm.html",
          "publishedOn": "2024-07-30T15:57:00.000Z",
          "wordCount": null,
          "title": "Instead of restricting AI and algorithms, make them explainable",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "MCU on Eclipse",
      "feedUrl": "https://mcuoneclipse.com/feed/",
      "siteUrl": "https://mcuoneclipse.com",
      "articles": [
        {
          "id": "http://mcuoneclipse.com/?p=41143",
          "author": "Erich Styger",
          "description": "The SEGGER SystemView, a real-time recording and visualization tool for embedded systems, now supports plotting custom data and offers deeper insights into timing and application behavior. The new feature includes a data plot window, support for data sampling events, and an API update. With this addition, users can send and visualize arbitrary data with ease. Continue reading →",
          "link": "https://mcuoneclipse.com/2024/08/25/how-to-use-systemview-data-plot-feature-for-real-time-data-visualization/",
          "publishedOn": "2024-08-25T14:30:16.000Z",
          "wordCount": null,
          "title": "How to Use SystemView Data Plot Feature for Real-time Data Visualization",
          "imageUrl": null
        },
        {
          "id": "http://mcuoneclipse.com/?p=41100",
          "author": "Erich Styger",
          "description": "In an earlier article I explained how to generate GNU coverage information, for an embedded application written in C. In this article, I show the steps and configuration needed to use GNU gcov targeting an embedded application with C++. Outline … Continue reading →",
          "link": "https://mcuoneclipse.com/2024/08/17/tutorial-gnu-coverage-with-c-for-embedded-applications/",
          "publishedOn": "2024-08-17T13:39:38.000Z",
          "wordCount": null,
          "title": "Tutorial: GNU Coverage with C++ for Embedded Applications",
          "imageUrl": null
        },
        {
          "id": "http://mcuoneclipse.com/?p=40990",
          "author": "Erich Styger",
          "description": "The GNU Coverage (gcov) tool is a part of the GNU gcc suite and is commonly used in hosted environments like Linux or Windows. However, it can also be utilized in embedded systems without a debugger, semihosting, or file I/O. This article provides a detailed guide on setting up a freestanding environment to collect gcov data, improving performance and enabling flexible data collection. Continue reading →",
          "link": "https://mcuoneclipse.com/2024/08/01/how-to-use-gnu-coverage-gcov-in-a-freestanding-environment-for-embedded-systems/",
          "publishedOn": "2024-08-01T18:13:18.000Z",
          "wordCount": null,
          "title": "How to Use GNU Coverage (gcov) in a Freestanding Environment for Embedded Systems",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The ESP Journal - Medium",
      "feedUrl": "https://medium.com/feed/the-esp-journal",
      "siteUrl": "https://blog.espressif.com?source=rss----d5414d5dee73---4",
      "articles": [
        {
          "id": "https://medium.com/p/8c64ca156a81",
          "author": "Anant Raj Gupta",
          "description": "",
          "link": "https://blog.espressif.com/wireless-connectivity-solutions-for-esp32-p4-8c64ca156a81?source=rss----d5414d5dee73---4",
          "publishedOn": "2024-08-20T03:14:38.000Z",
          "wordCount": null,
          "title": "Wireless Connectivity Solutions for ESP32-P4",
          "imageUrl": null
        },
        {
          "id": "https://medium.com/p/5e8273db7d22",
          "author": "Piyush Shah",
          "description": "",
          "link": "https://blog.espressif.com/command-response-framework-in-esp-rainmaker-5e8273db7d22?source=rss----d5414d5dee73---4",
          "publishedOn": "2024-08-01T10:19:04.000Z",
          "wordCount": null,
          "title": "Command — Response Framework in ESP RainMaker",
          "imageUrl": null
        },
        {
          "id": "https://medium.com/p/d1a2e1161059",
          "author": "Piyush Shah",
          "description": "",
          "link": "https://blog.espressif.com/secure-boot-with-auto-signing-in-esp-rainmaker-ota-d1a2e1161059?source=rss----d5414d5dee73---4",
          "publishedOn": "2024-07-30T10:58:38.000Z",
          "wordCount": null,
          "title": "Secure boot with auto-signing in ESP RainMaker OTA",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "/* the devil is in the detail */",
      "feedUrl": "https://minjang.github.io/feed.xml",
      "siteUrl": "http://minjang.github.io/",
      "articles": []
    },
    {
      "title": "mingrammer's note",
      "feedUrl": "https://mingrammer.com/index.xml",
      "siteUrl": "https://mingrammer.com/",
      "articles": []
    },
    {
      "title": "Novel Bits",
      "feedUrl": "https://www.novelbits.io/feed",
      "siteUrl": "https://novelbits.io/",
      "articles": []
    },
    {
      "title": "null program",
      "feedUrl": "https://nullprogram.com/feed/",
      "siteUrl": "https://nullprogram.com",
      "articles": [
        {
          "id": "https://nullprogram.com/blog/2024/07/31/",
          "author": null,
          "description": "I recently came across a take-home C programming test which had more depth\nand complexity than I suspect the interviewer intended. While considering\nit, I also came up with a novel, or at least unconventional, solution. The\nproblem is to deep copy a linked list where each node references a random\nlist element in addition to usual linkage — similar to LeetCode problem\n138. This reference is one of identity rather than value, which has\nmurky consequences.\n\ntypedef struct node node;\nstruct node {\n    node *next;\n    node *ref;   // arbitrary node in the list, or null\n};\n\nnode *deepcopy(node *);\n\n\nIn the copy, nodes have individual lifetimes allocated using malloc\nwhich the caller is responsible for freeing. While thickheaded, this\nis conventional, and I cannot blame the test’s designer for st…",
          "link": "https://nullprogram.com/blog/2024/07/31/",
          "publishedOn": "2024-07-31T18:49:57.000Z",
          "wordCount": null,
          "title": "Deep list copy: More than meets the eye",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Almost Secure",
      "feedUrl": "https://palant.info/rss.xml",
      "siteUrl": "https://palant.info/",
      "articles": []
    },
    {
      "title": "Preshing on Programming",
      "feedUrl": "http://preshing.com/feed",
      "siteUrl": "https://preshing.com/feed",
      "articles": []
    },
    {
      "title": "research!rsc",
      "feedUrl": "https://research.swtch.com/feed.atom",
      "siteUrl": "http://research.swtch.com/feed.atom",
      "articles": []
    },
    {
      "title": "AEP코리아네트",
      "feedUrl": "https://rss.blog.naver.com/aepkoreanet.xml",
      "siteUrl": "https://blog.naver.com/aepkoreanet?fromRss=true&trackingCode=rss",
      "articles": []
    },
    {
      "title": "애자일 이야기",
      "feedUrl": "http://rss.egloos.com/blog/agile",
      "siteUrl": "http://agile.egloos.com",
      "articles": []
    },
    {
      "title": "The Shape of Code",
      "feedUrl": "https://shape-of-code.com/feed/",
      "siteUrl": "https://shape-of-code.com",
      "articles": [
        {
          "id": "https://shape-of-code.com/?p=9308",
          "author": "Derek Jones",
          "description": "Reliability research is a worthwhile investment for very large organizations that fund the development of many major mission-critical software systems, where reliability is essential. In the 1970s, the US Air Force’s Rome Air Development Center probably funded most of the evidence-based software research carried out in the previous century. In the 1980s, Rome fell, and […]",
          "link": "https://shape-of-code.com/2024/08/25/1970s-the-founding-decade-of-software-reliability-research/",
          "publishedOn": "2024-08-25T21:59:42.000Z",
          "wordCount": null,
          "title": "1970s: the founding decade of software reliability research",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=9296",
          "author": "Derek Jones",
          "description": "How do the people define software reliability? One answer can be found by analyzing defect report logs: one study found that 42.6% of fault reports were requests for an enhancement, changes to documentation, or a refactoring request; a study of NASA spaceflight software found that 63% of reports in the defect tracking system were change […]",
          "link": "https://shape-of-code.com/2024/08/18/the-units-of-measurement-for-software-reliability/",
          "publishedOn": "2024-08-18T22:01:02.000Z",
          "wordCount": null,
          "title": "The units of measurement for software reliability",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=9278",
          "author": "Derek Jones",
          "description": "It will soon be that time of year when university students are looking for an interesting idea for a project. On an irregular basis, I post some ideas for thesis projects (here and here); primarily for students studying computing. In a change of direction, this post suggests software related ideas for business student projects. Two […]",
          "link": "https://shape-of-code.com/2024/08/11/student-projects-for-2024-2025/",
          "publishedOn": "2024-08-11T21:13:28.000Z",
          "wordCount": null,
          "title": "Student projects for 2024/2025",
          "imageUrl": null
        },
        {
          "id": "https://shape-of-code.com/?p=9263",
          "author": "Derek Jones",
          "description": "The Stream benchmark is a measure of sustained memory bandwidth; the target systems are high performance computers. Sustained in the sense of distance running, rather than a short sprint (the term for this is peak memory bandwidth and occurs when the requested data is in cache), and bandwidth in the sense of bytes of memory […]",
          "link": "https://shape-of-code.com/2024/08/04/memory-bandwidth-1991-2009/",
          "publishedOn": "2024-08-04T22:05:46.000Z",
          "wordCount": null,
          "title": "Memory bandwidth: 1991-2009",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Stacey on IoT | Internet of Things news and analysis",
      "feedUrl": "https://staceyoniot.com/feed/",
      "siteUrl": "https://staceyoniot.com/",
      "articles": []
    },
    {
      "title": "Blog – Modern Embedded Software | Quantum Leaps",
      "feedUrl": "https://www.state-machine.com/category/blog/feed",
      "siteUrl": "https://www.state-machine.com",
      "articles": []
    },
    {
      "title": "IT의 중심에서",
      "feedUrl": "https://subokim.wordpress.com/feed/",
      "siteUrl": "https://subokim.wordpress.com",
      "articles": [
        {
          "id": "http://subokim.wordpress.com/?p=13437",
          "author": "subokim",
          "description": "자기 꿈이 있는 사람은 사람을 귀하게 여깁니다.누가 언제 어떻게 나를 도와줄지 모르기 때문입니다.이렇게 도와달라고 말을 합니다. 자기 꿈에 도취된 사람은 사람을 허투루 여깁니다.내 꿈을 위해 희생시킬 사람이 필요하거든요.이렇게 하라고 부추깁니다. 전자는 옆에 있는 사람이 자꾸 불어납니다.후자는 옆에 있는 사람이 자꾸 사라지죠. 전자는 자꾸 자기 실력을 기릅니다.일은 자기가 하는 거고, 다른 사람은 나를 도와줄 뿐이니까요. 후자는... Continue Reading →",
          "link": "https://subokim.wordpress.com/2024/08/07/why-value-developer/",
          "publishedOn": "2024-08-07T03:41:49.000Z",
          "wordCount": null,
          "title": "사람을 귀하게 여겨야 하는 이유",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "코드쓰는사람",
      "feedUrl": "https://taegon.kim/feed",
      "siteUrl": "https://taegon.kim",
      "articles": []
    },
    {
      "title": "The Pasture",
      "feedUrl": "https://thephd.dev/feed",
      "siteUrl": "https://thephd.dev/",
      "articles": [
        {
          "id": "https://thephd.dev/improving-_generic-in-c2y",
          "author": null,
          "description": "The first two meetings of C after C23 was finalized are over, and we have started working on C2y. We decided that this cycle we’re not going to do that “Bugfix” followed by “Release” stuff, because that proved to be a REALLY bad idea that killed a ton of momentum and active contributors during the C11 to C17 timeframe. So, this time, we’re hitting both bugfixes AND features so we can make sure we don’t lose valuable contributions and fixes by stalling for 5 to 6 years again. So, with that…",
          "link": "https://thephd.dev/improving-_generic-in-c2y",
          "publishedOn": "2024-08-01T00:00:00.000Z",
          "wordCount": null,
          "title": "Improving _Generic in C2y",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Vivonomicon's Blog",
      "feedUrl": "https://vivonomicon.com/feed/",
      "siteUrl": "https://vivonomicon.com",
      "articles": []
    },
    {
      "title": "zserge's blog",
      "feedUrl": "https://zserge.com/rss.xml",
      "siteUrl": "https://zserge.com/",
      "articles": []
    },
    {
      "title": "The Boston Globe",
      "feedUrl": "https://www.bostonglobe.com/rss/bigpicture",
      "siteUrl": "https://www.bostonglobe.com",
      "articles": []
    },
    {
      "title": "이바닥늬우스",
      "feedUrl": "https://ebadak.news/feed",
      "siteUrl": "https://ebadak.news",
      "articles": []
    },
    {
      "title": "economic view",
      "feedUrl": "http://feeds.feedburner.com/Economic_View",
      "siteUrl": "http://economicview.net",
      "articles": []
    },
    {
      "title": "슬로우뉴스.",
      "feedUrl": "https://feeds.feedburner.com/slownews",
      "siteUrl": "https://slownews.kr",
      "articles": [
        {
          "id": "https://slownews.kr/?p=115337",
          "author": "참여연대 의정감시센터",
          "description": "22대 국회가 개원했습니다. 유권자의 소중한 한 표, 한 표를 읍소하며 당선된 300명의 국회의원이 과연 유권자를 위해 제대로 일하는지 지켜보고 감시해야 할 때입니다. 이들이 어떤 일을 하는지, 어떤 일을 해야 하는데 안하는지에 따라 우리의 삶이 달라지니까요. 참여연대 의정감시센터는 칼럼을 통해 유권자의 시각에서 22대 국회와 정치를 비평합니다. 무엇보다 ‘중’요한 건 ‘꺾’이지 않는 ‘정’치개혁이니까요. 이번 칼럼의 필자는 서복경(참여연대 의정감시센터...\nThe post 통치 음모론 vs. 저항 음모론: 윤석열과 김민석 그리고 하나둘 사라지는 독도 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115337",
          "publishedOn": "2024-08-27T06:58:48.000Z",
          "wordCount": null,
          "title": "통치 음모론 vs. 저항 음모론: 윤석열과 김민석 그리고 하나둘 사라지는 독도",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115313",
          "author": "신현호",
          "description": "1. 연준의 승리 선언 제롬 파월 미국 연준 의장은 8월 23일 인플레이션에 대한 승리를 선언했다. 무대는 ‘잭슨 홀 미팅’(Jackson Hole Meeting)이라 불리는 와이오밍주 그랜드 테튼 국립공원 내 휴양지에서 개최된 연례 경제 심포지엄이었고, 관객은 연준과 각국 중앙은행의 주요 인사들, 취재차 달려온 기자들 그리고 생방송으로 지켜본 전 세계의 투자자들이었다. 파월의 이날 메시지는 요약하면 다음과 같았다. 이 메시지는...\nThe post 트럼프는 연준의장 파월을 해고할 수 있을까? appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115313",
          "publishedOn": "2024-08-27T03:09:57.000Z",
          "wordCount": null,
          "title": "트럼프는 연준의장 파월을 해고할 수 있을까?",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115269",
          "author": "이정환",
          "description": "이진숙 방통위, 맘대로 못 한다. 이진숙의 딜레마. 권태선의 투쟁. 쟁점과 현안. 한동훈의 제안, “내년 의대 정원 유예하자.” “채 상병 특검법 빨리 내라.” 윤석열 명예훼손 수사, 통신 조회 최소 3176명. 다르게 읽기. “1945년 광복 인정하나?” “멘트하지 않겠다.” “‘임시정부 수립=건국’은 억지다.” 더 깊게 읽기. 딥페이크 범죄 가벼운 처벌이 문제. 당첨만 되면 20억 원, 로또 만드는 분양가 상한제....\nThe post ‘셀카왕’ 한동훈의 ‘발 연기’에 진정성이 안 보이는 이유: 슬로우레터 8월27일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115269",
          "publishedOn": "2024-08-26T22:11:57.000Z",
          "wordCount": null,
          "title": "‘셀카왕’ 한동훈의 ‘발 연기’에 진정성이 안 보이는 이유: 슬로우레터 8월27일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114978",
          "author": "김훤주",
          "description": "[김훤주의 지역에서 본 세상] 베테랑 기자 김훤주가 세상 이야기를 따뜻하고 담백한 시선으로 전합니다. 8월 15일에 창녕박물관을 찾아갔었다. 전시 내용을 둘러보는데 적지 않게 당황스러웠다. 설렁설렁 훑어보았는데도 잘못되거나 적당하지 않은 표현이 여러 군데 있었다. 안내데스크에 말했더니 “휴일이라 학예사가 없고 자기는 해설사라 책임 있는 대답을 하기 어렵다”면서 “전달해 드릴 수는 있지만 이런 지적은 담당자에게 직접 해야 더 효과가...\nThe post “예산 없어요 내년에 고칠게요” 창녕박물관 엉터리 해설 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114978",
          "publishedOn": "2024-08-26T08:56:05.000Z",
          "wordCount": null,
          "title": "“예산 없어요 내년에 고칠게요” 창녕박물관 엉터리 해설",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115167",
          "author": "한상기",
          "description": "1. AI는 기술 부채를 해결하는 데 아주 효과적인 도구다 아마존 앤디 재시의 트윗, 8월 22일 개인적으로 AI에 대한 가장 많은 소식과 의견을 듣는 공간은 아직 과거 트위터였던 X.com이다. 8월 22일에 아마존의 사장인 앤디 재시가 올린 트윗을 보았다. 그는 아마존의 Q라는 소프트웨어 개발 어시스턴트를 이용해 아마존이 기술 부채를 어떻게 효과적으로 해결할 수 있었는지 알렸다. 기업에서 개발자들도...\nThe post AI 진화가 생물학적 지옥문을 열 수도 있다: 4가지 역량, 5가지 예방책 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115167",
          "publishedOn": "2024-08-26T07:48:34.000Z",
          "wordCount": null,
          "title": "AI 진화가 생물학적 지옥문을 열 수도 있다: 4가지 역량, 5가지 예방책",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115090",
          "author": "이정환",
          "description": "김건희 사건, 수사심의위로 간다. 이원석의 결단. “수사심의위 망설일 것 없다.” 쟁점과 현안. 정부+가계 부채 3000조 원 시대. 글로벌 피벗 임박했는데. 이스라엘-헤즈볼라 폭격. 더 깊게 읽기. 한은 압박하는 대통령실. 간호사 총파업. 피할 수 있었던 죽음 늘어난다. 추석 연휴 셧 다운 우려. 다르게 읽기. 샤이 트럼프 얼마나 될까. 선 벨트와 러스트 벨트. 해법과 대안. ‘세이 온 클라이밋’....\nThe post 검찰총장의 마지막 자존심, 수심위는 김건희를 건드릴 수 있을까: 슬로우레터 8월26일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115090",
          "publishedOn": "2024-08-25T22:19:33.000Z",
          "wordCount": null,
          "title": "검찰총장의 마지막 자존심, 수심위는 김건희를 건드릴 수 있을까: 슬로우레터 8월26일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=115049",
          "author": "이정환",
          "description": "기록적인 폭우, 물 폭탄과 침수, 고립, 피해… 장마철마다 반복되는 기사다. 어떻게 다른 방식으로 쓰고 다른 문제의식을 끌어낼 수 있을까. JIBS제주방송 기사 두 건이 눈길을 끈다. “유역 차원에서 배수를 시켜줘야 한다”는 박창열(제주연구원 연구위원)의 인터뷰와 함께 “분담형 치수 대책이 시급하다”고 지적했다. “정확한 홍수량조차 파악하지 못하고 있다”는 기사도 있었다. 10년 이상 데이터를 축적해야 분석이 가능한데 4개 관측소에서 유량과...\nThe post 지역 기반 솔루션 저널리즘 네트워크 모델을 만들자. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/115049",
          "publishedOn": "2024-08-25T12:52:55.000Z",
          "wordCount": null,
          "title": "지역 기반 솔루션 저널리즘 네트워크 모델을 만들자.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114983",
          "author": "민주언론시민연합",
          "description": "7월 27일, 일본 니가타현의 ‘사도광산’이 유네스코 세계문화유산으로 등재되었다. 2010년 일본 정부가 사도광산을 유네스코 세계 유산 추천 잠정 목록에 등재한 이후 14년 만의 일이다. 한국에서는 사도광산의 세계 유산 등재에 대한 비판적인 목소리가 끊이지 않고 있다. 사도광산이 일제 강점기 당시 조선인을 강제 동원해 가혹한 노동을 시켰던 아픈 역사의 현장이기 때문이다. 한국 정부는 등재 과정에서 역사적 사실이 충분히...\nThe post “조선인 강제노동 사실무근” 사도광산의 역사적 진실 부정하는 일본의 극우 언론 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114983",
          "publishedOn": "2024-08-23T08:35:34.000Z",
          "wordCount": null,
          "title": "“조선인 강제노동 사실무근” 사도광산의 역사적 진실 부정하는 일본의 극우 언론",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114963",
          "author": "참여연대 사법감시센터",
          "description": "비정규직 차별에 맞서 노동조합을 설립한 이후, 회사로부터 ‘문자 한 통’으로 해고됐던 아사히글라스 해고 노동자들이 출근길에 나섰습니다. 이에 이르기까지 9년의 시간과 대법원의 세 판결이 있었습니다. 직접고용을 구하는 민사, 부당노동행위가 쟁점인 행정, 파견법 위반이 문제 된 형사의 세 판결입니다. 대법원은 아사히글라스 하청업체 해고 노동자의 근로자 지위를 인정하고, 사측의 파견법 위반 인정했지만, 사측의 부당노동행위에 대해선 인정하지 않았습니다. 각각의...\nThe post ‘문자 한 통 해고’ 아사히글라스 9년 투쟁… 얼마나 더 싸워야 하는가 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114963",
          "publishedOn": "2024-08-23T07:29:46.000Z",
          "wordCount": null,
          "title": "‘문자 한 통 해고’ 아사히글라스 9년 투쟁… 얼마나 더 싸워야 하는가",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114859",
          "author": "이정환",
          "description": "최장기 금리 동결. 쟁점과 현안. 윤석열의 불만, “선제 대응 아쉽다.” 집값에 달렸다. 윤석열의 뒤끝, 보수판 광복회 만든다. 디올 백 무혐의, 수사심의위 거쳐라. 더 깊게 읽기. 이자 장사로 30조 원 이익. “누구 때문인데.” 윤석열이 술을 안 먹는다고? “저 사람이 우리 아빠야.” 다르게 읽기. “최저임금 다 줄 필요 있나.” 한동훈의 차별화. 저출산 대책, 세금 더 낼 수...\nThe post 윤석열이 요즘 술을 자제하고 있다는 놀라운 사실: 8월23일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114859",
          "publishedOn": "2024-08-22T22:13:15.000Z",
          "wordCount": null,
          "title": "윤석열이 요즘 술을 자제하고 있다는 놀라운 사실: 8월23일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114838",
          "author": "이정환",
          "description": "국민권익위원회에서 만든 카드뉴스가 화제다. 언뜻 보면 ‘가짜뉴스’로 오해할 정도로 믿기 어려운 내용이다. 가뜩이나 김건희(대통령 부인)를 닮은 것 같은 캐릭터까지 있는데 놀랍게도 이 카드뉴스는 진짜였다. 국민권익위가 만들어서 홈페이지에 올려놓은 카드뉴스다. ‘가짜뉴스’가 아니었다. 이 카드뉴스가 말하지 않는 것. 직무 관련성이 없으니 괜찮다고? 최재영과 윤석열이 직무 관련성이 없는 건 맞나? 대통령 부인에게 300만 원 상당의 엿을 선물한다면? 핵심은...\nThe post “직무 관련 없으면 선물 가능”, ‘괴짤’의 실체는? appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114838",
          "publishedOn": "2024-08-22T13:36:31.000Z",
          "wordCount": null,
          "title": "“직무 관련 없으면 선물 가능”, ‘괴짤’의 실체는?",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114783",
          "author": "홍윤희",
          "description": "팀 월즈 미네소타주지사가 카멀라 해리스 부통령의 러닝메이트로 발표된 지 몇 시간 만에 펜실베이니아주 필라델피아에서 14,000명이 운집한 미 민주당 첫 정∙부통령 후보 공동 유세를 본 몇 가지 느낌을 공유한다. 대학 부전공(커뮤니케이션)과 20년 회사 경력(홍보)에 의거한 지극히 개인적 평가이며 반박 시 반박하는 분이 맞는 걸로. 😉 월즈 주지사. 민주당 역대 대선후보 중 케네디 이후 연설(stump speech) 가장...\nThe post 민주당 부통령 후보 월즈의 일곱 가지 연설 전략: 역대 최고(🐐) 인정! appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114783",
          "publishedOn": "2024-08-22T02:20:41.000Z",
          "wordCount": null,
          "title": "민주당 부통령 후보 월즈의 일곱 가지 연설 전략: 역대 최고(🐐) 인정!",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114744",
          "author": "이정환",
          "description": "김건희 디올 백 무혐의. 윤석열 검사라면 어땠을까. 총장 패싱? 이원석의 시간이 됐다. 쟁점과 현안. 한동훈-이재명 회담 생중계가 변수. 윤석열 정부 경제가 빠진 세 가지 함정. 세수 56조 원 펑크, 순방비는 예비비로. 민주당 방통위원 2명 추천한다. “이게 나라냐”, 중앙일보 논설위원의 한숨. 더 깊게 읽기. 이재명표 감세 법안. 뜬금없이 문재인 사위 털기. 재일동포 학교 교토국제고, 고시엔 결승...\nThe post “이게 나라냐”, 디올 백은 무혐의, 경제는 엉망, 보수 언론도 ‘부글부글’:슬로우레터 8월22일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114744",
          "publishedOn": "2024-08-21T22:18:14.000Z",
          "wordCount": null,
          "title": "“이게 나라냐”, 디올 백은 무혐의, 경제는 엉망, 보수 언론도 ‘부글부글’:슬로우레터 8월22일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114701",
          "author": "민주언론시민연합",
          "description": "2022년 8월 서울엔 시간당 최대 141.5㎜의 기록적인 폭우가 쏟아졌다. 극한호우 기준인 시간당 72㎜의 두 배가량으로 신림동과 상도동 반지하 주택에서는 다수의 사망자가 발생했다. 문제는 역대급 폭우가 더 새로운 일이 아니라는 것이다. 기후위기로 ‘더 자주, 더 세게’ 폭우가 발생할 가능성이 높아지고 있다. 앞으로 50년 이내 시간당 200㎜의 비가 내릴 수 있다니, 이제 폭우는 여름철 일상이 되었다. 변화된...\nThe post 빗물에 세금을? 도쿄∙베를린에서 ‘힌트’ 얻는 극한호우 대책 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114701",
          "publishedOn": "2024-08-21T09:12:29.000Z",
          "wordCount": null,
          "title": "빗물에 세금을? 도쿄∙베를린에서 ‘힌트’ 얻는 극한호우 대책",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114654",
          "author": "이정환",
          "description": "“용산에서 심각하게 보고 있다고, 머리가 하얘지는 느낌이었다.” 채 상병 사건 경찰판? 여기도 김건희의 그림자. 쟁점과 현안. 가계부채 1896조 원, 골든타임 놓쳤나. 윤석열 거부권 행사한 전세사기법 여야 합의로 통과. 추석이 두렵다. 의대생 1년 유급, 감당할 수 있나. 더 깊게 읽기. 이재명 앞의 세 가지 태풍. ‘임대 문의’ 늘어나는 이유. “나는 내 일을 사랑했지만 미국을 더 사랑했다.”...\nThe post 마약 외압 사건에 김건희 개입 의혹이 나오는 이유: 슬로우레터 8월21일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114654",
          "publishedOn": "2024-08-20T22:33:45.000Z",
          "wordCount": null,
          "title": "마약 외압 사건에 김건희 개입 의혹이 나오는 이유: 슬로우레터 8월21일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114607",
          "author": "신현호",
          "description": "1. 해리스의 약진 여론조사에 따라 조금씩 다르게 나오지만 해리스가 지지율에서 트럼프를 약간 앞서고 있을 뿐 아니라 차이를 벌리고 있다는 점은 공통적이다. 아직 결과를 알 수는 없으나 불과 45일 전 바이든이 TV 토론에서 참패한 이래 민주당의 승리 가능성이 곤두박칠쳤던 것을 고려하면 상전벽해라고 할 수 있을 정도이다. 자신의 돈을 걸고 대통령 당선 결과를 맞추는 정치 예측 플랫폼에서도...\nThe post 가격통제, 해리스의 승부수 또는 해프닝 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114607",
          "publishedOn": "2024-08-20T04:01:21.000Z",
          "wordCount": null,
          "title": "가격통제, 해리스의 승부수 또는 해프닝",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114594",
          "author": "김훤주",
          "description": "[김훤주의 지역에서 본 세상] 베테랑 기자 김훤주가 세상 이야기를 따뜻하고 담백한 시선으로 전합니다. 며칠 전 삿갓배미를 보았다. 옛날에는 흔했지만 요즘은 귀해진 삿갓배미를 보니 기분이 좋았다. 삿갓은 삿갓처럼 조그맣다는 말이고 배미는 한 배미 두 배미 세 배미 하며 논을 헤아리는 단위다. 삿갓배미의 유래는 이렇다. 옛날 농부가 논에서 김을 매다가 세어 봤더니 한 배미가 모자랐다. 아무리 찾아도...\nThe post 삿갓배미, 가난의 간절함이 만든 아름다운 다랑논 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114594",
          "publishedOn": "2024-08-20T02:58:58.000Z",
          "wordCount": null,
          "title": "삿갓배미, 가난의 간절함이 만든 아름다운 다랑논",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114550",
          "author": "이정환",
          "description": "쟁점과 현안. 네이버 항의 방문한 국민의힘. 한동훈-이재명 만난다. 더 깊게 읽기. 긱 이코노미 시대. 자영업자도 계속 줄고 있다. 쌀값 폭락, 풍년이 반갑지 않다. 다르게 읽기. “오염수 괴담 1년도 못 갔다.” 투자자 상위 1%가 401조 원 주식 보유. 지나치게 좋은 건 좋지 않을 수도 있다. 해법과 대안. 골든아워 도착률, 서울은 94%, 충북은 41%. 보호출산제 한 달...\nThe post 광복절 ‘나비부인’ 사고, 실수도 우연도 아닐 수 있다: 슬로우레터 8월20일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114550",
          "publishedOn": "2024-08-19T22:11:25.000Z",
          "wordCount": null,
          "title": "광복절 ‘나비부인’ 사고, 실수도 우연도 아닐 수 있다: 슬로우레터 8월20일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114521",
          "author": "한상기",
          "description": "1. 당신의 논문이 AI 학습용으로 사용될 가능성이 높아졌다 네이처, 8월 14일 지금 생성형 AI의 큰 과제는 품질이 높은 학습용 데이터 확보다. 그래서 오픈AI를 필두로 빅 테크 기업은 고품질 데이터를 갖고 있는 기업이나 조직과 협의를 통해 경쟁적인 데이터 라이센스 계약을 하고 있다. 들리는 얘기로는 2022년 말에 이미 인터넷의 거의 모든 데이터를 학습용으로 사용했으며 더 이상의 의미...\nThe post AI 학습용 데이터가 말라가고 있다 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114521",
          "publishedOn": "2024-08-19T06:42:53.000Z",
          "wordCount": null,
          "title": "AI 학습용 데이터가 말라가고 있다",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114450",
          "author": "이정환",
          "description": "‘중일마’ 파문. 쟁점과 현안. 이재명 연임 성공. 정봉주 탈락. “배타적 행태 배격하자”, 문재인 축사에 야유. 더 깊게 읽기. 채 상병 특검법 새로운 변수. 25만 원도, 노란봉투법도 거부권. “그냥 쉰다”는 청년 5.4%. 개딸 닮아가는 한동훈 강성 팬덤. “회의록은 없습니다.” “대통령 주위에 이상한 역사의식 부추기는 이들.” 다르게 읽기. 5억 상속은 0원, 5억 소득은 1억 원. 총주주수익률을 아십니까....\nThe post “중요한 건 일본의 마음”? 어느 나라 정부인가: 슬로우레터 8월19일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114450",
          "publishedOn": "2024-08-18T22:10:25.000Z",
          "wordCount": null,
          "title": "“중요한 건 일본의 마음”? 어느 나라 정부인가: 슬로우레터 8월19일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114422",
          "author": "이정환",
          "description": "[슬로우리포트] 바이오로직스 과징금 처분은 취소, 제일모직 분식회계는 인정… 이재용 편법 승계 항소심 뒤집힐 수도 있다. 분식회계 의혹 승소? 이게 왜 중요한가. 이재용의 복잡한 사연. 이재용의 세 가지 꼼수. 4조8085억 원, 바이오로직스의 마법. 세 가지 범죄 의혹. 2015년 9월15일 무슨 일이 있었나. 결국 이재용 지분 늘려주기 프로젝트였다. TMI지만 결정적인 변수. 두 가지 충돌하는 재판 결과. 이것이...\nThe post 삼바 승소? 이재용이 떨고 있는 이유. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114422",
          "publishedOn": "2024-08-18T07:04:31.000Z",
          "wordCount": null,
          "title": "삼바 승소? 이재용이 떨고 있는 이유.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114370",
          "author": "최명진",
          "description": "필자는 음식 공부한 것에 비해 미식 경험이 풍부한 편은 아니다. 미식과는 전혀 동떨어진 가정환경에서 자랐고 남들은 어려서 한 두 번쯤 충분히 먹어봤을 법한 요리도 성인이 되어서야 경우 경험해 본 것들이 대부분이다. 물 건너 음식을 공부한 덕에 자연스럽게 세계에서 손꼽힌다는 레스토랑도 가볼 기회도 있었지만 ‘에체바리’(바스크의 전설적인 차콜 레스토랑)를 제외하고는 대단하게 큰 인상을 받은 기억도 잘 없다....\nThe post 요리는 어디에서 시작되는가: 여름 복숭아를 곁들인 가스파초 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114370",
          "publishedOn": "2024-08-16T02:39:59.000Z",
          "wordCount": null,
          "title": "요리는 어디에서 시작되는가: 여름 복숭아를 곁들인 가스파초",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114363",
          "author": "민주언론시민연합",
          "description": "자신이 얼마나 무지한가를 모르면서 신념을 가진 상태가 가장 위험하다고 했던가. 근대 이후 대부분 전쟁은 지도자의 무지와 오판에서 시작되었다. 광복회장의 일갈, 윤석열 정부의 ‘친일’ 외교 최근 윤석열 정부의 극우 행보가 위험한 지경에 이르렀다. 광복회를 비롯한 독립운동가 단체들이 불참한 광복절 기념식을 누가 상상이나 했을까. 이종찬 광복회장은 “반역자들이 일본 우익과 내통하여 2차 세계대전 이전 일본과 같이 간다는 위기감을 느낀다”고...\nThe post 한국 정부의 무지와 일본 정부의 이중성이 만날 때? 사도광산 문화유산 등재 축하하므니다! appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114363",
          "publishedOn": "2024-08-16T01:43:18.000Z",
          "wordCount": null,
          "title": "한국 정부의 무지와 일본 정부의 이중성이 만날 때? 사도광산 문화유산 등재 축하하므니다!",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114323",
          "author": "이정환",
          "description": "예견된 파국, 윤석열은 아무것도 하지 않았다. “자유가 북한으로 확장하는 통일.” 통일 독트린, 공허했다. ‘검은 세력들’은 누굴까. 쟁점과 현안. 광복절에 기미가요 논란. 김건희 디올 백은 무혐의로 가나. 변호사법 위반 적용도 가능하다. 더 깊게 읽기. 기관장 39%가 문재인 정부 인사, 27%는 사실상 공석. 검찰의 수사 포퓰리즘. 다르게 읽기. 건국절 논란은 이제 그만. “내 딸 삼성전자 주식에 금투세...\nThe post 분열과 퇴행, 적의로 가득찬 최악의 광복절 경축사: 슬로우레터 8월16일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114323",
          "publishedOn": "2024-08-15T22:38:07.000Z",
          "wordCount": null,
          "title": "분열과 퇴행, 적의로 가득찬 최악의 광복절 경축사: 슬로우레터 8월16일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114277",
          "author": "이정환",
          "description": "“나라가 있는데도 억울하다.” 광복절 반쪽 경축식. 뭐라고 변명하나. “김건희가 살인자” vs. “책임은 민주당에.” 외교를 뭐로 보고. 쟁점과 현안. 기시다 연임 포기. 관리재정수지 적자 103조 원. 대통령실‧관저 공사 의혹, 무엇을 감추나. 더 깊게 읽기. 공범과 방조범. 김건희는 공동정범이 아니라 방조범? 다르게 읽기. 34도 폭염에 에어컨 설치하다 사망. 출생 신고하고 왔더니 폭격으로 가족 몰살. 금투세 공포는 과장됐다....\nThe post 김건희는 공동정범 아니라 방조범? 빠져나가기 어렵게 됐다: 슬로우레터 8월15일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114277",
          "publishedOn": "2024-08-14T22:35:00.000Z",
          "wordCount": null,
          "title": "김건희는 공동정범 아니라 방조범? 빠져나가기 어렵게 됐다: 슬로우레터 8월15일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114192",
          "author": "이정환",
          "description": "이복현(금융감독원 원장)이 화가 났다. 기자들을 만난 자리에서 “지배주주의 이익을 우선하는 기업 경영 사례가 반복적으로 발생하고 있다”고 지적했다. 두산그룹을 콕 찍어 한 말이다. “만에 하나 조금이나마 부족한 부분이 있다면 횟수 제한을 두지 않고 지속적으로 정정 요구를 하겠다는 게 감독원 입장이며 당국 내에서도 어느 정도 합의가 있는 상황”이라고 했다. 이복현이 과연 두산을 건드릴 수 있을까. 한국 사회의...\nThe post 오래된 편법과 합법적 약탈, 두산밥캣 합병은 성공할까. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114192",
          "publishedOn": "2024-08-14T03:47:48.000Z",
          "wordCount": null,
          "title": "오래된 편법과 합법적 약탈, 두산밥캣 합병은 성공할까.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114150",
          "author": "이정환",
          "description": "검사 윤석열의 적폐 청산, 대통령 윤석열이 사면. “공감하기 어렵지만 언급하지 않겠다.” 쟁점과 현안. “차별금지법 도입하면 에이즈 확산.” 김형석에 점수 몰아줬다. 상속세 개편되면 김건희도 4억 원 이익. 더 깊게 읽기. 쓴소리 듣는 걸 좋아하는 사람은 없다. “정상이 아니다.” 실세는 김태효, 권력 암투 있었나. 충암파가 국방파 밀어냈다. 우크라이나의 반격, 당황한 푸틴. 다르게 읽기. 안세영의 이유 있는 불만....\nThe post “정상이 아니다”, 조선일보도 못 참는 윤석열 인사 참사: 슬로우레터 8월14일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114150",
          "publishedOn": "2024-08-13T22:15:35.000Z",
          "wordCount": null,
          "title": "“정상이 아니다”, 조선일보도 못 참는 윤석열 인사 참사: 슬로우레터 8월14일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114128",
          "author": "김훤주",
          "description": "1. 이광진이라는 사람 500년 전에 이광진(1513~1566년)이라는 사람이 있었다. 역사적으로 유명한 인물은 아니지만 어릴 적 공부할 때는 똑똑하다는 소리를 들었고 나이가 들어 벼슬에 나가서는 유능하고 강직하다는 세평을 얻었다. <명종실록>과 그의 행장·묘지명 등을 보면 1548년 예문관 검열로 벼슬살이를 시작해 수재들에게 주어졌던 승문원과 교서관의 여러 관직을 맡았다. 학문이 높은 성균관에서도 일했고 맑고 깨끗한 사간원·사헌부·홍문관의 벼슬도 두루 맡았다. 호조·공조·예조·병조에서는...\nThe post 작비와 금시: 이진숙을 생각함 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114128",
          "publishedOn": "2024-08-13T04:16:53.000Z",
          "wordCount": null,
          "title": "작비와 금시: 이진숙을 생각함",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114093",
          "author": "이정환",
          "description": "사상 초유 광복절 경축식 취소. 우리가 모두 합의한 세 가지 역사 원칙. “친일 논란? 학문적 논의가 필요하다.” 뉴라이트가 장악한 윤석열 정부. 쟁점과 현안. 채 상병 외압 의혹 김용현을 국방부 장관으로. 결국 방송 4법 거부권 행사. 더 깊게 읽기. “안이한 건가. 대범한 건가.” “행정은 내가 더 잘한다.” “남 좋은 일만 시킬 수도 있다.” 다르게 읽기. 전기차...\nThe post 윤석열이 텔레그램을 보냈다, “기도 좀 해주세요”: 슬로우레터 8월13일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114093",
          "publishedOn": "2024-08-12T22:18:12.000Z",
          "wordCount": 6253,
          "title": "윤석열이 텔레그램을 보냈다, “기도 좀 해주세요”: 슬로우레터 8월13일.",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/08/Sp1P047mGbVE65894a97b0c2a1.36319113-1000x666.jpg"
        },
        {
          "id": "https://slownews.kr/?p=114064",
          "author": "참여연대 의정감시센터",
          "description": "22대 국회가 개원했습니다. 유권자의 소중한 한 표, 한 표를 읍소하며 당선된 300명의 국회의원이 과연 유권자를 위해 제대로 일하는지 지켜보고 감시해야 할 때입니다. 이들이 어떤 일을 하는지, 어떤 일을 해야 하는데 안 하는지에 따라 우리의 삶이 달라지니까요. 참여연대 의정감시센터는 칼럼을 통해 유권자의 시각에서 22대 국회와 정치를 비평합니다. 무엇보다 ‘중’요한 건 ‘꺾’이지 않는 ‘정’치개혁이니까요. 이번 칼럼의 필자는...\nThe post 지방선거제도 개혁, 2년도 부족하다 당장 시작하자 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114064",
          "publishedOn": "2024-08-12T08:48:29.000Z",
          "wordCount": null,
          "title": "지방선거제도 개혁, 2년도 부족하다 당장 시작하자",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=114016",
          "author": "신현호",
          "description": "사토시 나카모토라는 익명의 사용자가 2008년 [비트코인: 피어 투 피어 전자 현금 시스템]이라는 글을 온라인 게시판에 포스팅하고 이듬해 첫 발굴이 시작된 뒤에도 비트코인은 한동안 첨단 기술에 능통한 소수의 괴짜나 관심을 두는 기이한 대상으로 취급되었다.  하지만 가격이 급등하면서 수많은 사람이 비트코인과 다양한 암호 자산을 투자 대상의 하나로 인식하게 됐다. 시가총액(8월9일 기준) 상위 기업들과 비교하면 비트코인은 1.2조 달러로...\nThe post “비트코인을 다시 위대하게”, 미국 대선 흔드는 크립토 정치 경제학. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/114016",
          "publishedOn": "2024-08-12T04:07:27.000Z",
          "wordCount": null,
          "title": "“비트코인을 다시 위대하게”, 미국 대선 흔드는 크립토 정치 경제학.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113973",
          "author": "한상기",
          "description": "연재를 시작하며. 얼마 전에 슬로우뉴스 이정환 대표를 만나 얘기하던 중 과거 슬로우뉴스에 ‘테크 뉴스 브리핑’을 썼던 기억이 나서 AI 뉴스와 칼럼 중 우리가 관심 있게 보면 좋겠다는 것을 선정해 위클리로 알려주는 코너를 만들어 보자고 했다. 먼저 제목을 정하려고 하다가 앤스로픽의 클로드와 상의했다. 클로드가 몇 개를 제안했고 ‘AI in a Week’와 ‘AI Weekly Digest’를 비교하다 클로드가...\nThe post 뱀 기름 장수에게 속지 않는 방법: AI가 당신을 더 똑똑하게 해주진 않는다는 불편한 진실. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113973",
          "publishedOn": "2024-08-12T03:00:37.000Z",
          "wordCount": null,
          "title": "뱀 기름 장수에게 속지 않는 방법: AI가 당신을 더 똑똑하게 해주진 않는다는 불편한 진실.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113957",
          "author": "이정환",
          "description": "“송구하고 힘들다.” 유철환‧정승윤 물러나야 한다. 쟁점과 현안. 김경수 복권? 윤석열과 한동훈의 다른 셈법. “김건희 조사, 법과 원칙 따랐을 것.” 광복회, 광복절 기념식 불참 선언. 더 깊게 읽기. 전기차 포비아 원인은 정보 비대칭. 유럽에서는 배터리 여권제. 완충차 출입금지? 경합주도 해리스가 앞서나. 학교 기도실에 폭격. 다르게 읽기. ‘독재의 평범성’. 수사기관이 국민 10% 개인정보 수집. 해법과 대안. 맥주병...\nThe post 김경수 복권? 윤석열과 한동훈, 둘 중 하나는 지는 싸움: 슬로우레터 8월12일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113957",
          "publishedOn": "2024-08-11T22:07:28.000Z",
          "wordCount": null,
          "title": "김경수 복권? 윤석열과 한동훈, 둘 중 하나는 지는 싸움: 슬로우레터 8월12일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113908",
          "author": "정혜승",
          "description": "하버드 정치학과 교수인 저자들은 두 번 충격받았다. 처음 트럼프 당선에 당황해 절치부심 쓴 책이 [어떻게 민주주의는 무너지는가] (How Democracies Die, 2018). 트럼프 덕분에 세계적 베스트셀러를 내놓은 저자들은 4년 뒤 트럼프 지지자들의 국회의사당 습격 사건에 다시 경악했다. 당시 현직 대통령 트럼프는 물론, 공화당의 주류까지 바이든이 이긴 선거 결과에 불복했다. 저자들은 민주주의에, 특히 미국 민주주의에 구멍이 있다는...\nThe post 극단적 소수의 폭정, 어디서부터 무엇을 해야할까 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113908",
          "publishedOn": "2024-08-09T15:04:20.000Z",
          "wordCount": null,
          "title": "극단적 소수의 폭정, 어디서부터 무엇을 해야할까",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113894",
          "author": "최명진",
          "description": "봄의 재료를 이야기하면 누구나 봄나물을 떠올릴 것이다. 혹독한 겨울을 인고해 봄의 생동감과 생명력을 표현하는데 봄나물만큼 좋은 재료가 또 있을까? 오늘의 주인공은 그 중에서도 ‘봄나물의 왕’ 이라고 불리는 두릅이다. 인터넷에 두릅을 치면 여지없이 건강에 관한 정보가 쏟아져 나온다. 사포닌 성분으로 혈당을 낮추고 당뇨병을 예방하고 신경안정의 효과도 있다고 한다. 혹시 내일부터 두릅을 아침마다 한 뿌리씩이라도 씹어야 하나...\nThe post 화장하되 표정까지 가려선 안 된다: 두릅 에그베네딕트 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113894",
          "publishedOn": "2024-08-09T05:18:23.000Z",
          "wordCount": null,
          "title": "화장하되 표정까지 가려선 안 된다: 두릅 에그베네딕트",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113486",
          "author": "민노씨",
          "description": "인트로: 이미지와 프레임 이제는 미국인의 절반 이상이 게이 결혼을 지지한다. 19개 주에서는 게이 결혼이 합법이다. 그러나 나머지 31개 주에서는 아직 갈 길이 멀다. 게이 결혼은 성경에 위배된다, 결혼의 정의 자체를 위협한다, 아이들을 동성애로 유인할 것이다, 게이 결혼은 섹스가 전부다 등의 보수적 프레임은 바뀌지 않았다. 최근의 보수주의자들은 ‘섹스’라는 단어와 ‘호모’라는 비어가 들어간 ‘호모 섹슈얼(homosexual)’이라는 말을 반복해서...\nThe post 이미지와 프레임: ‘위어드’는 어떻게 2024 미 대선 판도를 흔들고 있나 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113486",
          "publishedOn": "2024-08-08T22:23:18.000Z",
          "wordCount": null,
          "title": "이미지와 프레임: ‘위어드’는 어떻게 2024 미 대선 판도를 흔들고 있나",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113843",
          "author": "이정환",
          "description": "외교부가 국민들을 속였다. 광복절에 KBS 이승만 미화 다큐멘터리. 쟁점과 현안. 김건희 명품 백 조사했던 권익위 국장 자살. 한동훈의 첫 작품은 취약계층 전기요금 1만5000원. “민주당 제안 받아들여라.” 더 깊게 읽기. 그린벨트 풀어 부동산 잡는다고? 윤석열은 검찰을 이길 수 있을까. 2명 방통위는 뭘 해도 위법. 미국 실업수당 청구 줄었다. 다르게 읽기. “보수도 포퓰리즘을 해야 한다.” 김대중의 79석과...\nThe post 김건희 디올 백 조사했던 권익위 국장 의문의 죽음: 슬로우레터 8월9일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113843",
          "publishedOn": "2024-08-08T22:02:30.000Z",
          "wordCount": null,
          "title": "김건희 디올 백 조사했던 권익위 국장 의문의 죽음: 슬로우레터 8월9일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113733",
          "author": "이정환",
          "description": "“얼마나 잘하나 보자.” 윤석열의 꿀 휴가. 쟁점과 현안. “다시는 사과하지 않겠다.” “친일을 넘어 숭일.” 통신 조회도 영장 받아야 한다. 다르게 읽기. 한국 주식 시장은 왜 찔끔 올랐을까. 일본은 “당분간 금리 인상 없다.” 세 번째 채 상병 특검법 발의. 더 깊게 읽기. 월즈와 밴스, 중간이 없다. “걔들 좀 이상하지 않아요?” 해리스-트럼프 초접전 양상. 해법과 대안. 가입...\nThe post “한동훈은 바보 아니면 사기꾼, 자기 돈이어도 그랬을까”: 슬로우레터 8월8일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113733",
          "publishedOn": "2024-08-07T22:12:03.000Z",
          "wordCount": 6537,
          "title": "“한동훈은 바보 아니면 사기꾼, 자기 돈이어도 그랬을까”: 슬로우레터 8월8일.",
          "imageUrl": "https://slownews.kr/wp-content/uploads/2024/08/11_CJK_9907.jpg"
        },
        {
          "id": "https://slownews.kr/?p=113610",
          "author": "이정환",
          "description": "“강제 동원 명시” 요구했다가 거절당했다. 외교를 포기하고 외교를 했다는 거짓말. 코스피 하루 만에 반등. 알고리즘 매매가 변동성 키웠다. 쟁점과 현안. 원전 3기만큼 전력 수요 늘었다. 독립기념관장도 뉴라이트. 더 깊게 읽기. 영향력 1위면서 불신하는 언론사 1위는? 한국판 셔먼법 가능할까. 해리스 러닝메이트는 팀 월즈. 다르게 읽기. 1억 전기차에 왜 중국 배터리 넣었을까. 전기차는 주차장 출입 금지? 자살이...\nThe post 사도광산 외교 참사, 알고도 속고 국민들도 속였다: 슬로우레터 8월7일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113610",
          "publishedOn": "2024-08-06T22:19:01.000Z",
          "wordCount": null,
          "title": "사도광산 외교 참사, 알고도 속고 국민들도 속였다: 슬로우레터 8월7일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113579",
          "author": "민주언론시민연합",
          "description": "더불어민주당을 비롯한 야6당이 8월 1일 이진숙 방송통신위원장 탄핵소추안을 발의했습니다. 같은 날 더불어민주당은 민생회복지원금 지급법, 이른바 ‘전국민 25만원 지원법’을 본회의에 상정했습니다. 국민의힘은 즉각 무제한토론(필리버스터)을 신청했습니다. 더불어민주당의 토론종결 요청에 따라 24시간이 지나는 8월 2일 오후 3시경 필리버스터가 끝나면 해당 법안이 통과될 것으로 보입니다. 더불어민주당은 전국민 25만원 지원법 처리 후 노동조합 및 노동관계조정법 일부개정안(노란봉투법) 상정을 예정하고 있는데요. 국민의힘은...\nThe post “국회가 탄핵감”? 채널A의 물타기와 정치 혐오가  탄핵감 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113579",
          "publishedOn": "2024-08-06T08:09:01.000Z",
          "wordCount": null,
          "title": "“국회가 탄핵감”? 채널A의 물타기와 정치 혐오가  탄핵감",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113545",
          "author": "이정환",
          "description": "유시민(전 노무현재단 이사장)은 “뉴스를 안 본다”고 했다. 왜 안 보냐고 하니 “너무 괴로워서”라고 말했다. “종이신문 안 본 지는 여러 해 된 것 같고요. 포털 뉴스 검색을 안 한 지도 꽤 오래된 것 같아요.” 며칠 전 손석희(전 JTBC 사장)가 진행하고 유시민과 김희원(한국일보 뉴스스탠다드실장)이 패널로 참여한 토크쇼가 화제였다. 두 사람의 대화도 흥미로웠지만 몇 가지 중요한 질문이 남았다....\nThe post 사람들이 ‘손석희의 질문들’을 보고 화를 냈던 이유. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113545",
          "publishedOn": "2024-08-06T07:24:42.000Z",
          "wordCount": null,
          "title": "사람들이 ‘손석희의 질문들’을 보고 화를 냈던 이유.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113493",
          "author": "이정환",
          "description": "완전히 다른 세상이 됐다. 나쁜 뉴스가 나쁜 뉴스였다. 더 깊게 읽기. 미국 고용 지표 어떻길래. 샴의 법칙, 이번에도 맞을까. 예측이 의미 없는 상황. 중앙은행의 판단 착오. 수습할 수 있을까. 윤석열은 휴가 중. 쟁점과 현안. “통신기록 조회? 미친 사람들 아니냐.” “구글은 독점 기업이다.” 다르게 읽기. 더 강력해진 노란봉투법 국회 통과. “대표팀 계속하기 어렵다”는 수상 소감. “감옥이...\nThe post 금융 시장 패닉, “국가적 위기 상황에 윤석열은 휴가 중”: 슬로우레터 8월6일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113493",
          "publishedOn": "2024-08-05T22:21:57.000Z",
          "wordCount": null,
          "title": "금융 시장 패닉, “국가적 위기 상황에 윤석열은 휴가 중”: 슬로우레터 8월6일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=112918",
          "author": "민노씨",
          "description": "함께 읽으면 좋음! 세 가지 징후 두 을의 서로 다른 입장은 ‘최저임금 1만 원 시대’의 의미를 돌아보는 첫 질문으로 적당한 것 같다. 2025 최저임금은 징후적이다. 세 가지 징후가 있다. 그리고 그 징후가 가리키는 ‘질병’은 현 최저임금 시스템의 종말이다. 1. 물가상승률에도 못 미치는 상승률 첫 번째, 2025년 적용 최저임금을 놓고 보면, 결정액과 인상률(1만30원, 1.7%)이 물가상승률(2.6% 전망치)보다...\nThe post 빈사에 빠진 최저임금: 세 가지 징후 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/112918",
          "publishedOn": "2024-08-05T08:48:41.000Z",
          "wordCount": null,
          "title": "빈사에 빠진 최저임금: 세 가지 징후",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113406",
          "author": "신현호",
          "description": "조 바이든 현 대통령과 도널드 트럼프 전 대통령의 리턴 매치로 치러질 거라고 예상됐던 올해 미국 대선에 이변이 속출하고 있다. 그때마다 미국 언론은 수많은 분석과 예측 기사를 쏟아내는데, 특이한 항목 중 하나가 예측 시장에 나타난 당선 가능성 변화이다. 오늘은 도대체 정치 예측 시장은 무엇이고, 그 평가는 얼마나 정확하고 중요한 것인가 살펴본다. 예측 시장 반응 아래 차트는...\nThe post 돈이 말한다? 도박사들이 선거 결과를 예측할 수 있을까. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113406",
          "publishedOn": "2024-08-05T01:32:15.000Z",
          "wordCount": null,
          "title": "돈이 말한다? 도박사들이 선거 결과를 예측할 수 있을까.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113363",
          "author": "이정환",
          "description": "기자들 통화 내역 탈탈 털었다. ‘구대명’ 안 된다, 호남의 선택. 쟁점과 현안. 오늘은 노란봉투법 간다. 엘리엇 소송 취소 소송도 패소. 이진숙 이틀 만에 업무 정지. 식물 방통위, 이대로 가나. 더 깊게 읽기. 한동훈이 만나 달라고 해서 만난 것. “헛소리는 그만.” 이스라엘은 전쟁을 끝낼 생각이 없다. 다르게 읽기. 불붙은 전기차, 불 끄는 방법. 전기차 화재, 배상은...\nThe post 엘리엇 취소 소송도 패소, 한동훈 고집에 이자 부담만 늘었다: 슬로우레터 8월5일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113363",
          "publishedOn": "2024-08-04T22:17:50.000Z",
          "wordCount": null,
          "title": "엘리엇 취소 소송도 패소, 한동훈 고집에 이자 부담만 늘었다: 슬로우레터 8월5일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113333",
          "author": "최명진",
          "description": "여러분은 스페인 하면 어떤 음식이 떠오르는지 궁금하다. 빠에야? 감바스? 유명한 요리들이긴 하지만 사실 이들은 스페인을 아우를 수 있는 대표성을 가진 요리는 아니다. 무슨 말이냐? 이들은 특정 지역의 토속 요리에 가깝다. “한국음식은 뭐가 유명한가요?”라고 물으면 “돼지국밥이 유명합니다.”라고 대답하는 느낌과 비슷하달까. 돼지국밥은 모두가 아는 음식이긴 하지만 주로 부산 및 경남권에서만 만날 수 있는 지역색 강한 음식이다. 한국을...\nThe post 스페인의 진짜 대표선수: 토르티야 데 파타타 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113333",
          "publishedOn": "2024-08-02T05:28:02.000Z",
          "wordCount": null,
          "title": "스페인의 진짜 대표선수: 토르티야 데 파타타",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113321",
          "author": "민주언론시민연합",
          "description": "윤석열 대통령은 7월 31일 이진숙 방송통신위원장 임명을 강행했습니다. 국회 인사청문회 과정에서 부적절한 법인카드 유용과 극우·편향적 발언, 노조탄압, 사회적 참사 공감능력 결여 등 공직자 후보로서 부적격한 사유가 차고 넘쳤음에도 윤 대통령은 보고서 채택이 불발된 후보자를 방송통신위원장으로 임명했는데요. 이진숙 방송통신위원장은 대통령실 임명발표가 나기도 전에 통상적인 임명장 수여식과 현충원 참배도 생략한 채 정부과천청사로 출근했습니다. 이후 같은 날 임명된...\nThe post 이진숙 ‘2인 체제’ 방송 장악 속도전, 엄호 나선 조선∙경제지 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113321",
          "publishedOn": "2024-08-02T01:38:56.000Z",
          "wordCount": null,
          "title": "이진숙 ‘2인 체제’ 방송 장악 속도전, 엄호 나선 조선∙경제지",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113290",
          "author": "이정환",
          "description": "이진숙의 3일 방통위. 쟁점과 현안. 25만 원 민생 지원금법도 필리버스터 돌입. “분열 막기 위해 그만둔다.” 세금을 안 걷나, 못 걷나, 예측을 잘못했나. 더 깊게 읽기. ‘킹 달러’의 퇴장, 9월 금리 인하 가능성. 한국도 10월 인하? 가계 빚이 변수다. 환율 착시 효과. 미국 금리는 트럼프가 변수. ‘슈퍼 엔저’가 끝났나. 이란 보복 공격 카운트 다운. 다르게 읽기....\nThe post 동아일보의 경고, “윤석열, 가장 무능한 대통령으로 남을 수도”: 슬로우레터 8월2일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113290",
          "publishedOn": "2024-08-01T22:19:32.000Z",
          "wordCount": null,
          "title": "동아일보의 경고, “윤석열, 가장 무능한 대통령으로 남을 수도”: 슬로우레터 8월2일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113206",
          "author": "이정환",
          "description": "이스마일 하니야 암살. 김문수가 돌아왔다. 취임 첫날 이진숙이 한 일. 탄핵과 사퇴 무한 반복. 이동관이 돌아온다고? 쟁점과 현안. 한동훈의 ‘마이웨이.’ 정점식을 갈아치우려 하는 이유. 윤석열-한동훈 미팅 뒷이야기. 더 깊게 읽기. 한동훈은 퇴로가 없다. 민주당이 한동훈 제안을 받는다면? “한동훈 나오면 이재명이 된다.” 다르게 읽기. 티메프가 드러낸 그림자 금융. 스타벅스 선불 충전금 3000억 원. 3일 정산, 네이버는...\nThe post “한동훈 나오면 이재명이 된다”는 말이 나오는 이유: 슬로우레터 8월1일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113206",
          "publishedOn": "2024-07-31T22:10:53.000Z",
          "wordCount": null,
          "title": "“한동훈 나오면 이재명이 된다”는 말이 나오는 이유: 슬로우레터 8월1일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113137",
          "author": "이정환",
          "description": "디올 백 알고도 신고 안 했다. 김건희 벙커? 제2부속실로 생색내기. 쟁점과 현안. 800억 원밖에 없다. 공정위는 몰랐다. 얼마가 부족한지도 몰랐다. 더 깊게 읽기. 5박6일 필리버스터 종료, 방송4법 국회 통과. 이진숙 프로젝트 속도전. 필리버스터+거부권+재의결 부결 3종 세트. “용산이 괘씸하게 보고 있다.” 다르게 읽기. 도청‧미행 당할 거 몰랐나. 댐 만들어 기후 대응한다고? 골칫덩어리 영주댐 잊었나. 해법과 대안....\nThe post “용산이 괘씸하게 보고 있다”, 마약 수사 외압 사건 또 터진다: 슬로우레터 7월31일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113137",
          "publishedOn": "2024-07-30T22:27:51.000Z",
          "wordCount": null,
          "title": "“용산이 괘씸하게 보고 있다”, 마약 수사 외압 사건 또 터진다: 슬로우레터 7월31일.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113098",
          "author": "이정환",
          "description": "[슬로우리포트] 한상진이 “차라리 김우룡이 그립다”고 말하는 이유. 이진숙(방송통신위원회 위원장 후보)의 청문회를 지켜보면서 많은 사람들이 불쾌한 기시감을 느끼고 있다. 이동관(전 방통위원장)이 가고 김홍일(전 방통위원장)이 가니 이진숙이 왔다. 지금까지 그랬듯이 청문보고서가 채택되거나 말거나 윤석열(대통령)은 이진숙을 임명할 거고, 이진숙이 가면 비슷한 누군가가 올 가능성이 크다. 이명박 정부 3년차인 2010년의 일이다. ‘방통대군’이라고 불렸던 최시중(당시 방통위원장)이 방통위를 장악하고 있었다. 최시중은...\nThe post 조인트 까면서 좌파 대청소, 뭐가 달라졌나. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113098",
          "publishedOn": "2024-07-30T07:37:24.000Z",
          "wordCount": null,
          "title": "조인트 까면서 좌파 대청소, 뭐가 달라졌나.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113075",
          "author": "이정환",
          "description": "“…약간만 도와주시면은 다시 정상화시키고, 해결하고, 반드시 피해복구를 완전히 할 수 있다는 확신을 갖고 있습니다.” 구영배(큐텐그룹 대표), 국회정무위원회 티몬·위메프 미정산 사태 현안질의, 2024.07.30. 티몬과 위메프를 합쳐서 티메프, 인터파크까지 합쳐서 티메파크라고 부른다. 정부가 어제 긴급 자금 5600억 원을 투입하기로 했다. 사재를 털어 보상한다는 말이 나오더니 갑자기 법정 관리를 신청해서 피해자들이 분노하고 있는 상황이다. 이번 사건을 어떻게 보나....\nThe post 티메프 사태, 핵심은 금융과 비금융의 분리다. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113075",
          "publishedOn": "2024-07-30T05:53:23.000Z",
          "wordCount": null,
          "title": "티메프 사태, 핵심은 금융과 비금융의 분리다.",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=113053",
          "author": "박성호",
          "description": "1. 잘못된 프레임 지난주 이진숙 방통위원장 후보자 인사청문회 사흘 중 첫날과 이튿날 참고인으로 다녀왔습니다. 다들 보셨겠지만 첫날은 이진숙 검증이 아닌 MBC 청문회처럼 흘러갔죠. 전 MBC사장인 국민의힘 김장겸 의원이 후임 사장인 최승호 선배를 불러세워놓고 추궁하는 장면은 아찔했습니다. 김장겸 전 사장에 관해서는 서울고등법원이 ‘방송의 공정성·공익성 훼손, 보도 신뢰도 및 사회적 영향력 하락, 부당노동행위, 조직관리 및 운영 능력...\nThe post 이진숙 청문회의 네 가지 문제: 2012년 MBC 총파업 해직기자의 출석 후기 appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/113053",
          "publishedOn": "2024-07-30T05:02:25.000Z",
          "wordCount": null,
          "title": "이진숙 청문회의 네 가지 문제: 2012년 MBC 총파업 해직기자의 출석 후기",
          "imageUrl": null
        },
        {
          "id": "https://slownews.kr/?p=112999",
          "author": "이정환",
          "description": "정치 진공상태. 쟁점과 현안. 한동훈, 왜 말이 달라졌나. 결국 제2부속실 만든다. “김민석 표가 왜 이렇게 안 나오나.” 더 깊게 읽기. 빅5 병원, 전공의 지원 0명. 이진숙 청문보고서 불발. 피해 금액 1조 원? ‘티메프’ 회생신청. 민간 기업의 실패를 왜 정부가 지원하나. 구영배의 야망. 다르게 읽기. 티메파크 사태, 공정위는 뭐했나. 트럼프의 밴스 리스크. 해법과 대안. 인구가 늘었다....\nThe post 티메파크 사태, 경쟁의 룰을 다시 짜야 한다: 슬로우레터 7월30일. appeared first on 슬로우뉴스..",
          "link": "https://slownews.kr/112999",
          "publishedOn": "2024-07-29T22:19:03.000Z",
          "wordCount": null,
          "title": "티메파크 사태, 경쟁의 룰을 다시 짜야 한다: 슬로우레터 7월30일.",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "꿈꾸는섬",
      "feedUrl": "https://happist.com/feed",
      "siteUrl": "https://happist.com",
      "articles": [
        {
          "id": "https://happist.com/?p=595828",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595828/2%eb%b6%84%ea%b8%b0-%ec%97%94%eb%b9%84%eb%94%94%ec%95%84-%ec%8b%a4%ec%a0%81-%ec%a0%84%eb%a7%9d-%ea%b8%b0%eb%8c%80%eb%b3%b4%eb%8b%a4-%ec%a2%8b%ec%9d%84-%ea%b2%83",
          "publishedOn": "2024-08-22T14:31:43.000Z",
          "wordCount": null,
          "title": "2분기 엔비디아 실적 전망, 기대보다 좋을 것",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595822",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595822/8-9-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-08-09T00:41:12.000Z",
          "wordCount": null,
          "title": "8/9, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595820",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595820/2%eb%b6%84%ea%b8%b0-%ec%95%84%eb%a7%88%ec%a1%b4-%ec%8b%a4%ec%a0%81-%ed%8f%89%ea%b0%80",
          "publishedOn": "2024-08-04T00:00:56.000Z",
          "wordCount": null,
          "title": "2분기 아마존 실적을 읽는 월가의 시선",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595812",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595812/8-1-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-08-01T02:16:42.000Z",
          "wordCount": null,
          "title": "8/1, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595796",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595796/%eb%b0%80%ec%96%91-%ed%91%9c%ec%b6%a9%ec%82%ac-%eb%b0%b0%eb%a1%b1%eb%82%98%eb%ac%b4",
          "publishedOn": "2024-07-31T14:53:15.000Z",
          "wordCount": null,
          "title": "배롱나무 명소, 물놀이 계곡을 즐기기 좋은 밀양 표충사 베롱나무",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595782",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595782/%ea%b0%95%eb%a6%89%ec%97%ac%ed%96%89-%ed%99%9c%eb%9e%98%ec%a0%95%ea%b3%bc-%eb%91%98%eb%a0%88%ea%b8%b8%ec%9d%b4-%ec%95%84%eb%a6%84%eb%8b%a4%ec%9b%9f%eb%8d%98-%ea%b0%95%eb%a6%89-%ec%84%a0%ea%b5%90",
          "publishedOn": "2024-07-31T06:18:25.000Z",
          "wordCount": null,
          "title": "강릉여행, 활래정과 둘레길이 아름다웟던 강릉 선교장 방문기",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595784",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595784/7-31-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-07-31T06:04:13.000Z",
          "wordCount": null,
          "title": "7/31, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595747",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595747/8%ec%9b%94-%ec%97%ac%ed%96%89-%eb%b0%b0%eb%a1%b1%eb%82%98%eb%ac%b4-%eb%aa%85%ec%86%8c-%ec%b6%94%ec%b2%9c",
          "publishedOn": "2024-07-30T08:12:58.000Z",
          "wordCount": null,
          "title": "8월 여행 추천, 아름다운 배롱나무 명소 추천",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595740",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595740/%ec%a7%80%eb%a6%ac%ec%82%b0-%ec%a0%95%ec%83%81%ec%84%9d-%ec%97%ad%ec%82%ac",
          "publishedOn": "2024-07-30T06:13:47.000Z",
          "wordCount": null,
          "title": "지리산 정상석 역사와 소회",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595736",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595736/%ec%a0%84%ea%b8%b0%ec%b0%a8-%ec%b6%a9%ec%a0%84%ec%9a%94%ea%b8%88-%ec%9d%b8%ec%83%81",
          "publishedOn": "2024-07-30T06:05:36.000Z",
          "wordCount": null,
          "title": "전기차 충전요금 인상 대응안",
          "imageUrl": null
        },
        {
          "id": "https://happist.com/?p=595724",
          "author": "happist",
          "description": "",
          "link": "https://happist.com/595724/7-30-%ec%9b%94%ea%b0%80%ec%9d%98-%ed%88%ac%ec%9e%90%ec%9d%98%ea%b2%ac",
          "publishedOn": "2024-07-30T02:57:12.000Z",
          "wordCount": null,
          "title": "7/30, 월가의 투자의견 및 주가 전망 보고서",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "NewsPeppermint",
      "feedUrl": "https://newspeppermint.com/feed/",
      "siteUrl": "https://newspeppermint.com",
      "articles": [
        {
          "id": "https://newspeppermint.com/?p=79898",
          "author": "NewsPeppermint",
          "description": "민주당 전당대회의 스포트라이트를 가장 많이 받은 건 대통령 후보 카말라 해리스였지만, 해리스가 빛나도록 받쳐주는 역할을 기꺼이, 묵묵히 수행하던 이들의 전통적이지 않은 남성성도 주목을 받았습니다. 본인도 미식축구 NFL 스타지만, 팝스타인 여자친구 테일러 스위프트를 진심으로 응원하며 공개적인 장소에서 ‘남자답지 못하게’ 울기도 하는 트래비스 켈시, 가족을 위해 헌신하고 이웃을 돕기 좋아하는 해리스의 러닝메이트 팀 월즈까지 민주당 전당대회를 통해 주목받은 새로운 남성상을 짚어봤습니다. 전문 번역: 남성성 뽐낼 필요 없는 ‘진짜 사나이’의 등장? 이것은 “한 발짝 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/27/npsp_madamepresident/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_madamepresident",
          "publishedOn": "2024-08-27T13:15:26.000Z",
          "wordCount": null,
          "title": "미국 최초의 여성 대통령이 탄생한다면, 이런 ‘최초들’도 함께 겪게 될 것",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79621",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 7월 5일 스프에 쓴 글입니다. 지구상에서 가장 막강한 권력을 지닌 사람을 꼽으라면, 많은 사람이 미국 대통령을 몇 손가락 안에 꼽을 겁니다. 세계에서 가장 강력한 나라 미국의 군대를 움직일 수 있는 통수권자이자 정부를 이끄는 정치지도자인 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/25/npsp_imperialpresidency/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_imperialpresidency",
          "publishedOn": "2024-08-25T22:59:38.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] “마녀사냥에 복수” 다짐하는 그, 정말로 ‘제왕적 대통령’ 될까",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79603",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 7월 2일 스프에 쓴 글입니다. *** 글을 시차 발행하는 오늘(8월 22일) 밤 카말라 해리스는 민주당 전당대회 마지막날 대통령 후보 지명을 수락할 예정입니다. 불과 두 달도 채 되지 않는 시점에는 상상도 하기 어려웠던 일이 현실로 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/22/npsp_openconvention/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_openconvention",
          "publishedOn": "2024-08-23T01:30:42.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 만약 바이든이 후보 사퇴한다면? 이렇게 진행될 겁니다",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79864",
          "author": "NewsPeppermint",
          "description": "민주당 전당대회를 앞둔 지난 금요일, 카말라 해리스 부통령은 자신의 경제 공약을 발표했습니다. 바이든 행정부에서 치솟은 물가를 안정시키고 서민과 중산층에게 도움이 되는 정책을 위해 해리스가 꺼낸 카드는 치솟는 집값을 안정화시키겠다는 일련의 정책이었습니다. 뉴욕타임스 칼럼니스트 피터 코이가 수요와 공급이라는 경제학의 기본 원리를 바탕으로 해리스의 경제 공약을 분석했습니다. 해설에서는 이번 선거의 향방을 가를 경합주의 경제 상황을 함께 진단해 봤습니다. 전문 번역: “해리스의 경제 공약, 완벽하지는 않지만 트럼프보다는 낫다” 해설: ‘주머니 사정’이 선거 승패 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/22/npsp_economicplanharristrump/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_economicplanharristrump",
          "publishedOn": "2024-08-23T00:15:09.000Z",
          "wordCount": null,
          "title": "‘주머니 사정’이 선거 승패 가른다면 누가 더 유리할까?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79588",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 6월 28일 스프에 쓴 글입니다. *** 파리 올림픽에서 실제로 XY 염색체를 지닌 복싱 선수 이마네 칼리프(알제리)와 린위팅(대만)의 여성 종목 출전이 논란을 낳기도 했습니다. 이에 관해 언론에도 많은 기사가 소개됐습니다. 연합뉴스: IOC, XY염색체 여자 복싱선수 논란에 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/21/npsp_sextestingolympics/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_sextestingolympics",
          "publishedOn": "2024-08-21T22:59:40.000Z",
          "wordCount": 2478,
          "title": "[뉴페@스프] “그렇게만 할 거면… 올림픽 왜 하니?” 배제와 포용, 답은 정해져 있다",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=79845",
          "author": "NewsPeppermint",
          "description": "이번 미국 대선의 중요한 이슈 가운데 하나가 이민 문제입니다. 얼핏 보기엔 이민 문제에 있어서 주로 공세를 펴는 쪽은 트럼프와 공화당이고, 반대로 민주당은 정책을 방어하는 경우가 많아 보입니다. 그러나 자세히 뜯어 보면, 이민 문제가 지금처럼 심각해진 데는 공화당과 민주당, 진보와 보수 할 것 없이 현실에 한참 뒤처진 이민 제도를 방치한 정치권 전반의 책임이 큽니다. 실제로 미국에 합법적으로 정착하기 위해 비자를 받거나 영주권을 얻는 일은 굉장히 어렵습니다. 전문 번역: 미국에 ‘합법 이민’이 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/20/npsp_usimmigrationelection/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_usimmigrationelection",
          "publishedOn": "2024-08-20T20:00:08.000Z",
          "wordCount": null,
          "title": "“이민자들이 몰려온다”는데… 문제 못 풀게 발목 잡은 건 누구였나",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79580",
          "author": "eyesopen1",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 6월 25일 스프에 쓴 글입니다. 흡연자든 흡연자가 아니든 담뱃갑에 흉측한 사진과 함께 충격적인 경고 문구가 등장했던 때를 기억할 겁니다. 2015년 통과된 새로운 국민건강증진법에 따라 담뱃갑에 흡연의 위험성을 경고하는 그림이 삽입된 것은 2016년 말이었습니다. 그전까지는 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/18/npsp_socialmediasurgeongeneral/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_socialmediasurgeongeneral",
          "publishedOn": "2024-08-18T22:59:40.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 흡연 이상으로 해로운 소셜미디어? “지금은 비상상황”… 여기에 공감하나요?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79558",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 6월 21일 스프에 쓴 글입니다. 한국 사회의 저출생 문제를 진단할 때마다 원인으로 지목되는 것 중 하나가 점점 더 심해지는 젠더 갈등입니다. 지난번에 소개한 닉 크리스토프의 칼럼에도 한국 사회의 저출산 대책의 발목을 잡는 근본적인 문제 중 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/16/npsp_dadbrain/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_dadbrain",
          "publishedOn": "2024-08-16T22:59:53.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] “밖에서 편하게 사회생활하니까 애 키우는 게 고된 줄 모른다” 맞는 말일까?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79829",
          "author": "NewsPeppermint",
          "description": "미국 법무부가 구글을 상대로 한 반독점 소송에서 승소했습니다. 연방법원 아밋 메타 판사는 검색 시장에서 구글이 불법으로 독점적인 지위를 유지해왔다고 판결했습니다. 법원은 다음달 심리를 거쳐 검색 시장에서 구글의 독점을 해소하고 경쟁을 복원하는 시정 명령을 내립니다. 이번 판결의 의미와 앞으로의 전망에 관해 컬럼비아대학교 팀 우 교수의 칼럼을 번역하고, 해설을 덧붙였습니다. 전문 번역: ‘구글 쪼개기’ 초강수 나올까… ‘검색 공룡’ 어떻게 해야 하나 해설: ‘구글 소송’ 승리한 미국 정부… 구글, 어떻게 할 것인가",
          "link": "https://newspeppermint.com/2024/08/16/npsp_googleantitrust/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_googleantitrust",
          "publishedOn": "2024-08-16T12:15:50.000Z",
          "wordCount": null,
          "title": "‘구글 소송’ 승리한 미국 정부… 구글, 어떻게 할 것인가",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79531",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 6월 18일 스프에 쓴 글입니다. 시간은 금이라는 격언이 있습니다. 누구나 이 말을 알지만, 그렇다고 모두가 시간을 금쪽같이 아껴 쓰지는 못합니다. 시간을 효과적으로 쓴다고 반드시 성공하는 건 아니지만, 성공한 사람 가운데는 시간을 소중히 아껴 쓰는 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/13/npsp_muskpaypackage/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_muskpaypackage",
          "publishedOn": "2024-08-13T22:59:57.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 일론 머스크의 관심 값이 64조 원… 인류의 희망을 거는 대가, 맞나요?",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79812",
          "author": "NewsPeppermint",
          "description": "바이든 대통령이 재선 출마를 포기하며 해리스 부통령을 지지한다고 선언한 뒤 새롭게 정해진 매치업에서 해리스가 트럼프 전 대통령을 조금씩 따라잡더니, 지지율에서 역전했다는 여론조사 결과가 나오기 시작하고 있습니다. 이에 관해 공화당 여론조사 전문가가 쓴 칼럼을 분석하고, 최근 새로 발표된 뉴욕타임스와 시에나대학의 여론조사 결과를 분석한 기사를 정리했습니다. 전문번역: 트럼프 캠프는 ‘이 여론조사 결과’를 싫어합니다 해설: “여론조사 믿기 어렵다”는 반응까지… 8월을 해리스의 시간이라 하는 이유",
          "link": "https://newspeppermint.com/2024/08/13/npsp_harristrump/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_harristrump",
          "publishedOn": "2024-08-13T19:30:09.000Z",
          "wordCount": 1389,
          "title": "“여론조사 믿기 어렵다”는 반응까지… 8월을 해리스의 시간이라 하는 이유",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=79516",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 6월 14일 스프에 쓴 글입니다. 대한민국 모든 시·도의 고령 인구 비중이 7%를 넘어서면서 본격적인 고령화 사회에 진입했다는 뉴스가 나온 게 어느덧 13년 전의 일입니다. 이후 한국 사회의 인구 구조가 어떻게 바뀌었는지는 모두 아실 겁니다. 통계를 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/06/npsp_aging/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_aging",
          "publishedOn": "2024-08-06T22:59:31.000Z",
          "wordCount": 2438,
          "title": "[뉴페@스프] ‘인구소멸’ 한국을 위해 할 수 있는 일",
          "imageUrl": "https://newspeppermint.com/wp-content/uploads/fb_header_img.png"
        },
        {
          "id": "https://newspeppermint.com/?p=79790",
          "author": "NewsPeppermint",
          "description": "기후변화는 더는 먼 미래의 일도, 남의 이야기도 아닙니다. 기후변화의 영향을 받는 수많은 분야 가운데 우리가 눈 떠 있는 동안 하루도 빼놓지 않고 하는 행위, 바로 먹는 것에 관한 식문화도 생각해볼 거리가 많은 주제입니다. 뉴욕타임스가 “불타는 지구에서 우리는 무엇을 어떻게 먹어야 하는가”라는 주제에 관해 칼럼을 연재하기 시작했습니다. 그 가운데 호주 출신 문화 비평가 애런 팀스가 이른바 “지속가능한 파인다이닝”에 관해 글을 썼습니다. 이 글을 번역하고, 요식업계가 탄소 발자국 대신 물 사용 발자국을 따져 볼 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/05/npsp_finedining/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_finedining",
          "publishedOn": "2024-08-06T00:20:47.000Z",
          "wordCount": null,
          "title": "예약이 ‘하늘의 별 따기’인 식당들, 이런 것까지 할 수 있을까",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79498",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 6월 10일 스프에 쓴 글입니다. 일찌감치 산업화를 달성한 서구의 많은 나라와 소위 선진국에서 사람들이 아이를 낳지 않아 인구가 정체되는 건 새로운 현상이 아닙니다. 미국의 사정도 다르지 않습니다. 미국 질병통제예방센터는 지난 4월 2023년 출산 통계를 발표하며, → 더 보기",
          "link": "https://newspeppermint.com/2024/08/02/npsp_birthrategendernorm/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_birthrategendernorm",
          "publishedOn": "2024-08-02T22:59:35.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] 미국이 자칫하면 ‘한국 꼴’ 될 수 있다고? 달갑지 않은 최신 ‘K-트렌드’",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79766",
          "author": "NewsPeppermint",
          "description": "바이든 대통령이 재선에 도전하지 않기로 하면서 카멀라 해리스 부통령 지지를 선언했고, 해리스는 바이든 캠페인을 이어받아 빠르게 민주당 내 지지를 규합하고 트럼프 전 대통령과의 일전을 준비하고 있습니다. 해리스의 등판 이후 부진을 면치 못하던 민주당은 빠르게 지지율을 회복했습니다. 바이든을 상대하는 한 선거에서 대승을 거둘 수도 있다고 본 공화당 일각의 기대는 물거품이 됐습니다. 참패가 예상되던 선거를 다시 박빙, 접전으로 돌려놓긴 했지만, 해리스는 과연 트럼프를 넘어설 수 있을까요? 이에 대해 책 “정의란 무엇인가”로 한국에는 특히 잘 → 더 보기",
          "link": "https://newspeppermint.com/2024/08/01/npsp_harrisvtrump/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_harrisvtrump",
          "publishedOn": "2024-08-02T01:00:09.000Z",
          "wordCount": null,
          "title": "지금 민주당과 해리스의 최우선 과제?… “두 마리 토끼 쫓는 셈”",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79483",
          "author": "ingppoo",
          "description": "* 뉴스페퍼민트는 SBS의 콘텐츠 플랫폼 스브스프리미엄(스프)에 뉴욕타임스 칼럼을 한 편씩 선정해 번역하고, 글에 관한 해설을 쓰고 있습니다. 그 가운데 저희가 쓴 해설을 스프와 시차를 두고 소개합니다. 스브스프리미엄에서는 뉴스페퍼민트의 해설과 함께 칼럼 번역도 읽어보실 수 있습니다. **오늘 소개하는 글은 6월 5일 스프에 쓴 글입니다. 불로초를 찾으려 했던 진시황의 이야기는 다들 잘 아실 겁니다. 굳이 진시황이 아니라도 인류 역사에 이름을 남긴 권력자 가운데는 다시 젊어지려고 애쓴 사람이 많습니다. 그게 어렵다면 늙지 않는 비결을 찾아 → 더 보기",
          "link": "https://newspeppermint.com/2024/07/30/npsp_buylongerlife/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_buylongerlife",
          "publishedOn": "2024-07-30T22:59:07.000Z",
          "wordCount": null,
          "title": "[뉴페@스프] ‘억만장자들만의 세상’, 이제는 대놓고 펼쳐진다",
          "imageUrl": null
        },
        {
          "id": "https://newspeppermint.com/?p=79736",
          "author": "NewsPeppermint",
          "description": "인공지능 기술이 얼마나 발전했는지 절감할 수 있는 분야 중 하나가 번역과 통역일 겁니다. 스마트폰의 번역기 앱을 이용하면 현지어를 한마디도 못 하는 곳에 가서도 여행하는 데 필요한 대화를 어느 정도 할 수 있을 정도입니다. 그러나 번역기가 많은 걸 해주는 세상에서도 번역기가 해줄 수 없는 것이 여전히 있기 때문에 외국어를 배울 이유와 의미는 충분히 많습니다. 비행기 조종사이자 작가인 마크 바노에네커의 칼럼을 번역하고, 해설을 덧붙였습니다. 전문 번역: 번역기가 다 번역해주는데… 외국어 공부는 이제 → 더 보기",
          "link": "https://newspeppermint.com/2024/07/29/npsp_foreignlanguage/?utm_source=rss&utm_medium=rss&utm_campaign=npsp_foreignlanguage",
          "publishedOn": "2024-07-30T03:10:01.000Z",
          "wordCount": null,
          "title": "‘영어 울렁증’ 사라지는데도 외국어 공부는 왜 해야 하냐 묻는다면",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "WALLFLOWER",
      "feedUrl": "http://rss.egloos.com/blog/wallflower",
      "siteUrl": "http://wallflower.egloos.com",
      "articles": []
    },
    {
      "title": "내 마음의 풍경",
      "feedUrl": "https://rss.blog.naver.com/sellars.xml",
      "siteUrl": "https://blog.naver.com/sellars?fromRss=true&trackingCode=rss",
      "articles": [
        {
          "id": "https://blog.naver.com/sellars/223548745573",
          "author": "sellars",
          "description": "1. 나는 철학이란 철학적 논증을 비판적으로 검토하는 작업이라고 생각한다. 따라서 제시된 논증이 타당성이 있는지, 건전성이 있는지 비판적으로 검토하는 것이 철학이다. 그런데 우리는 어떤 명제에 대해서 결정적으로 완벽한 정당화를 할 수 없다. 가령 나는 칸트가 주장하는 인간을 목적으로 대우하라는 정언명법을 옳은 것으로 받아들이지만, 그것이 어찌 옳은지 철학적으로 정당화할 수 없다. 그럼에도 불구하고 나는 칸트의 정언명법을 받아들인다. 그것이 바로 내 실존적 선택이다. 이런 의미에서 철학은 논증을 정당화하고 그 부당성을 따지는 지성적 작업이지만, 동시에 그것은 마치 예술 작품이 보여주는 세계를 받아들이는 것처럼 실.......",
          "link": "https://blog.naver.com/sellars/223548745573?fromRss=true&trackingCode=rss",
          "publishedOn": "2024-08-15T04:14:11.000Z",
          "wordCount": 101,
          "title": "내 철학적 목소리(2020)-1",
          "imageUrl": null
        },
        {
          "id": "https://blog.naver.com/sellars/223543049809",
          "author": "sellars",
          "description": "오랜기간.. 많은 시간을 보낸 학교.. 그 많은 시간들이 때로는 힘들고 지치고 많은 고민들로 채워졌을거라 생각하면 우리에겐 가슴아픈 장소로 남았다. 외로웠을 그시간들.. 그 허기진 마음을 술로 다 채우지 않았을까.. \"홀로 황량한 모래바람이 부는 사막을 걷는 기분이였다\"라고..했던... 그 길 끝에 그의 나무가 있다..... 언제쯤 편히 이곳을 찾을수 있을까...",
          "link": "https://blog.naver.com/sellars/223543049809?fromRss=true&trackingCode=rss",
          "publishedOn": "2024-08-10T03:53:25.000Z",
          "wordCount": 101,
          "title": "학교에...",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The ZipCPU by Gisselquist Technology",
      "feedUrl": "https://zipcpu.com/feed",
      "siteUrl": "https://zipcpu.com/",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}